Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/architecture.po
Languages: fr_fr, ja_jp, pt_br, zh_cn

source: <emphasis>HAR deployment:</emphasis> Usually you deploy the Hibernate JMX service using a JBoss service deployment descriptor (in an EAR and/or SAR file), it supports all the usual configuration options of a Hibernate <literal>SessionFactory</literal>. However, you still have to name all your mapping files in the deployment descriptor. If you decide to use the optional HAR deployment, JBoss will automatically detect all mapping files in your HAR file.
fr_fr: <emphasis>Déploiement HAR :</emphasis> Habituellement vous déployez le service JMX Hibernate en utilisant le descripteur de déploiement de JBoss (dans un fichier EAR et/ou un SAR), il supporte toutes les options de configuration usuelles d'une <literal>SessionFactory</literal> Hibernate. Cependant, vous devez toujours nommer tous vos fichiers de mapping dans le descripteur de déploiement. Si vous décidez d'utiliser le déploiement optionnel sous forme de HAR, JBoss détectera automatiquement tous vos fichiers de mapping dans votre fichier HAR.
ja_jp: <emphasis>HAR デプロイ:</emphasis> 通常、(EAR または SAR ファイルにある）JBoss サービス デプロイメントディスクリプタを使って、Hibernate JMX サービスをデプロイします。 それは、Hibernateの <literal>SessionFactory</literal> の全ての一般的な設定オプションを サポートします。しかし依然としてデプロイメントディスクリプタのなかにすべてのマッピングファイルの 名前を挙げる必要があります。 もし、オプションのHARデプロイメントを使うことを決めたなら、 JBossは自動的にHARファイルのなかの全てのマッピングファイルを検出します。
pt_br: <emphasis>HAR deployment:</emphasis>: Normalmente você faz o deploy de um serviço JMX do Hibernate usando um serviço descritor de deploy do JBoss (em um EAR e/ou arquivo SAR), que suporta todas as configurações usuais de uma <literal>SessionFactory</literal> do Hibernate. Entretanto, você ainda precisa nomear todos os seus arquivos de mapeamento no descritor de deploração. Se você decidir usar o deploy opcional HAR, o JBoss irá automaticamente detectar todos os seus arquivos de mapeamento no seu arquivo HAR.
zh_cn: <emphasis>HAR 部署:</emphasis> 通常情况下，你会使用JBoss的服务部署描述符（在EAR或/和SAR文件中）来部署Hibernate JMX服务。 这种部署方式支持所有常见的Hibernate <literal>SessionFactory</literal>的配置选项。 不过，你仍需在部署描述符中，列出你所有的映射文件的名字。如果你使用HAR部署方式, JBoss 会自动探测出你的HAR文件中所有的映射文件。

source: Consult the JBoss AS user guide for more information about these options.
fr_fr: Consultez le guide d'utilisation de JBoss AS pour plus d'informations sur ces options.
ja_jp: これらのオプションについての詳細な情報は、JBossアプリケーションサーバユーザガイドを 参考にしてください。
pt_br: Consulte o manual do usuário do JBoss AS, para obter maiores informações sobre essas opções.
zh_cn: 这些选项更多的描述，请参考JBoss 应用程序用户指南。

source: Another feature available as a JMX service are runtime Hibernate statistics. See <xref linkend="configuration-optional-statistics"/>.
fr_fr: Les statistiques pendant l'exécution d'Hibernate (au runtime) sont une autre fonctionnalité disponible en tant que service JMX. Voyez pour cela <xref linkend="configuration-optional-statistics"/>.
ja_jp: JMXサービスとして利用可能な他の機能に、Hibernate実行時統計情報があります。 <xref linkend="configuration-optional-statistics"/> を見てください。
pt_br: Another feature available as a JMX service are runtime Hibernate statistics. See <xref linkend="configuration-optional-statistics"/>. Outra opção disponível como um serviço JMX são as estatísticas de execução do Hibernate. Veja a <xref linkend="configuration-optional-statistics"/>.
zh_cn: 将Hibernate以部署为JMX服务的另一个好处，是可以查看Hibernate的运行时统计信息。参看 <xref linkend="configuration-optional-statistics"/>.

source: JCA Support
fr_fr: Support JCA
ja_jp: JCA サポート
pt_br: Suporte JCA
zh_cn: 对JCA的支持

source: Hibernate may also be configured as a JCA connector. Please see the website for more details. Please note that Hibernate JCA support is still considered experimental.
fr_fr: Hibernate peut aussi être configuré en tant que connecteur JCA. Référez-vous au site web pour de plus amples détails. Il est important de noter que le support JCA d'Hibernate est encore considéré comme expérimental.
ja_jp: Hibernate は JCA コネクタとしても設定できます。詳細については、Webサイトを見てください。 Hibernate JCA サポートは、今のところ実験段階として考えられていることに注意してください。
pt_br: Hibernate may also be configured as a JCA connector. Please see the website for more details. Please note that Hibernate JCA support is still considered experimental. O Hibernate pode também ser configurado como um conector JCA. Por favor, visite o website para maiores detalhes. Entretanto, note que o suporte JCA do Hibernate ainda é considerado experimental.
zh_cn: Hibernate也可以被配置为一个JCA连接器（JCA connector）。更多信息请参看网站。 请注意，Hibernate对JCA的支持，仍处于实验性阶段。

source: Contextual Sessions
fr_fr: Sessions Contextuelles
ja_jp: コンテキスト上のセッション
pt_br: Sessões contextuais
zh_cn: 上下文相关的（Contextual）Session

source: Most applications using Hibernate need some form of "contextual" sessions, where a given session is in effect throughout the scope of a given context. However, across applications the definition of what constitutes a context is typically different; and different contexts define different scopes to the notion of current. Applications using Hibernate prior to version 3.0 tended to utilize either home-grown <literal>ThreadLocal</literal>-based contextual sessions, helper classes such as <literal>HibernateUtil</literal>, or utilized third-party frameworks (such as Spring or Pico) which provided proxy/interception-based contextual sessions.
fr_fr: Certaines applications utilisant Hibernate ont besoin d'une sorte de session "contextuelle", où une session est liée à la portée d'un contexte particulier. Cependant, les applications ne définissent pas toutes la notion de contexte de la même manière, et différents contextes définissent différentes portées à la notion de "courant". Les applications à base d'Hibernate, versions précédentes à la 3.0 utilisaient généralement un principe maison de sessions contextuelles basées sur le <literal>ThreadLocal</literal>, ainsi que sur des classes utilitaires comme <literal>HibernateUtil</literal>, ou utilisaient des framework tiers (comme Spring ou Pico) qui fournissaient des sessions contextuelles basées sur l'utilisation de proxy/interception.
ja_jp: Hibernate を使ったアプリケーションは、ほとんど、なんらかの形で"コンテキスト上の"セッションが必要になります。 「コンテキスト上のセッション」は、特定のコンテキストのスコープのなかで有効なセッションのことです。 しかし、通常アプリケーションごとにコンテキストを構成するものの定義は異なります。 しかも、異なる複数のコンテキストは、現時点に対して異なるスコープを定義します。 バージョン3.0より前の Hibernate では、自作の <literal>ThreadLocal</literal> ベースの「コンテキスト上のセッション」を 利用するか、 <literal>HibernateUtil</literal> のようなヘルパークラスを利用するか、 proxy/interception ベースの「コンテキスト上のセッション」を提供する （Spring や Pico のような）サードパーティのフレームワークを利用するかのいずれかでした。
pt_br: Muitas aplicações que usam o Hibernate necessita de algum tipo de sessão "contextual", onde uma sessão dada é na verdade um escopo de um contexto. Entretanto, através de aplicações a definição sobre um contexto é geralmente diferente; e contextos diferentes definem escopos diferentes. Aplicações usando versões anteriores ao Hibernate 3.0 tendem a utilizar tanto sessões contextuais baseadas em <literal>ThreadLocal</literal>, classes utilitárias como <literal>HibernateUtil</literal>, ou utilizar frameworks de terceiros(como Spring ou Pico) que provê sessões contextuais baseadas em proxy.
zh_cn: 使用Hibernate的大多数应用程序需要某种形式的“上下文相关的” session，特定的session在整个特定的上下文范围内始终有效。然而，对不同类型的应用程序而言，要为什么是组成这种“上下文”下一个定义通常是困难的；不同的上下文对“当前”这个概念定义了不同的范围。在3.0版本之前，使用Hibernate的程序要么采用自行编写的基于<literal>ThreadLocal</literal>的上下文session，要么采用<literal>HibernateUtil</literal>这样的辅助类，要么采用第三方框架（比如Spring或Pico)，它们提供了基于代理(proxy)或者基于拦截器(interception)的上下文相关session。

source: Starting with version 3.0.1, Hibernate added the <literal>SessionFactory.getCurrentSession()</literal> method. Initially, this assumed usage of <literal>JTA</literal> transactions, where the <literal>JTA</literal> transaction defined both the scope and context of a current session. The Hibernate team maintains that, given the maturity of the numerous stand-alone <literal>JTA TransactionManager</literal> implementations out there, most (if not all) applications should be using <literal>JTA</literal> transaction management whether or not they are deployed into a <literal>J2EE</literal> container. Based on that, the <literal>JTA</literal>-based contextual sessions is all you should ever need to use.
fr_fr: A partir de la version 3.0.1, Hibernate a ajouté la méthode <literal>SessionFactory.getCurrentSession()</literal>. Initialement, cela demandait l'usage de transactions <literal>JTA</literal>, où la transaction <literal>JTA</literal> définissait la portée et le contexte de la session courante. L'équipe Hibernate pense que, étant donnée la maturité des implémentations de <literal>JTA TransactionManager</literal> , la plupart (sinon toutes) des applications devraient utiliser la gestion des transactions par <literal>JTA</literal> qu'elles soient ou non déployées dans un conteneur <literal>J2EE</literal>. Par conséquent, vous devriez toujours contextualiser vos sessions, si vous en avez besoin, via la méthode basée sur JTA.
ja_jp: バージョン 3.0.1 から、Hibernate には <literal>SessionFactory.getCurrentSession()</literal> が 加わりました。 これは、 <literal>JTA</literal> トランザクションの使用を前提にしています。 <literal>JTA</literal> トランザクションは、現在のセッションのスコープとコンテキストの両方を定義します。 Hibernate チームは、次のことを主張します。 巨大なスタンドアロンの <literal>JTA TransactionManager</literal> 実装が成熟したら、 <literal>J2EE</literal> コンテナ上にデプロイされるかどうかにかかわらず、 ほとんどの（すべてとは言わないが）アプリケーションが、 <literal>JTA</literal> トランザクション管理を使用すべきであると。 この考えに基づくと、 <literal>JTA</literal> ベースの「コンテキスト上のセッション」を 使うしかないでしょう。
pt_br: A partir da versão 3.0.1, o Hibernate adicionou o método <literal>SessionFactory.getCurrentSession()</literal>. Inicialmente, este assume o uso de transações <literal>JTA</literal>, onde a transação <literal>JTA</literal> define tanto o escopo quanto o contexto de uma sessão atual. O time do Hibernate mantém este recurso, desenvolvendo as diversas implementações do <literal>JTA TransactionManager</literal>, a maioria (se não todos) aplicativos deveria utilizar o gerenciador de transações <literal>JTA</literal> sendo ou não instalados dentro de um container <literal>J2EE</literal>. Baseado neste recurso, você deveria sempre utilizar sessões contextuais baseadas em <literal>JTA</literal>.
zh_cn: 从3.0.1版本开始，Hibernate增加了<literal>SessionFactory.getCurrentSession()</literal>方法。一开始，它假定了采用<literal>JTA</literal>事务，<literal>JTA</literal>事务定义了当前session的范围和上下文(scope and context)。Hibernate开发团队坚信，因为有好几个独立的<literal>JTA TransactionManager</literal>实现稳定可用，不论是否被部署到一个<literal>J2EE</literal>容器中，大多数(假若不是所有的）应用程序都应该采用<literal>JTA</literal>事务管理。基于这一点，采用<literal>JTA</literal>的上下文相关session可以满足你一切需要。

source: However, as of version 3.1, the processing behind <literal>SessionFactory.getCurrentSession()</literal> is now pluggable. To that end, a new extension interface (<literal>org.hibernate.context.CurrentSessionContext</literal>) and a new configuration parameter (<literal>hibernate.current_session_context_class</literal>) have been added to allow pluggability of the scope and context of defining current sessions.
fr_fr: Cependant, depuis la version 3.1, la logique derrière <literal>SessionFactory.getCurrentSession()</literal> est désormais branchable. A cette fin, une nouvelle interface d'extension (<literal>org.hibernate.context.CurrentSessionContext</literal>) et un nouveau paramètre de configuration (<literal>hibernate.current_session_context_class</literal>) ont été ajoutés pour permettre de configurer d'autres moyens de définir la portée et le contexte des sessions courantes.
ja_jp: しかし、バージョン 3.1 からは、 <literal>SessionFactory.getCurrentSession()</literal> の後の処理が、 プラガブルになりました。 これを受けて、現在のセッションを定義するスコープとコンテキストのプラガビリティを可能にするために、 新しい拡張インタフェース ( <literal>org.hibernate.context.CurrentSessionContext</literal> ) と 新しい構成パラメータ ( <literal>hibernate.current_session_context_class</literal> ) が追加されました。
pt_br: Entretanto, na versão 3.1, o processo por trás do método <literal>SessionFactory.getCurrentSession()</literal> é agora plugavel. Com isso, uma nova interface (<literal>org.hibernate.context.CurrentSessionContext</literal>) e um novo parâmetro de configuração (<literal>hibernate.current_session_context_class</literal>) foram adicionados para possibilitar a compatibilidade do contexto e do escopo na definição de sessões correntes.
zh_cn: 更好的是，从3.1开始，<literal>SessionFactory.getCurrentSession()</literal>的后台实现是可拔插的。因此，我们引入了新的扩展接口(<literal>org.hibernate.context.CurrentSessionContext</literal>)和新的配置参数(<literal>hibernate.current_session_context_class</literal>)，以便对什么是“当前session”的范围和上下文(scope and context)的定义进行拔插。

source: See the Javadocs for the <literal>org.hibernate.context.CurrentSessionContext</literal> interface for a detailed discussion of its contract. It defines a single method, <literal>currentSession()</literal>, by which the implementation is responsible for tracking the current contextual session. Out-of-the-box, Hibernate comes with three implementations of this interface.
fr_fr: Allez voir les Javadocs de l'interface <literal>org.hibernate.context.CurrentSessionContext</literal> pour une description détaillée de son contrat. Elle définit une seule méthode, <literal>currentSession()</literal>, depuis laquelle l'implémentation est responsable de traquer la session courante du contexte. Hibernate fournit deux implémentation de cette interface.
ja_jp: <literal>org.hibernate.context.CurrentSessionContext</literal> インタフェースの規約についての 詳細な内容は Javadoc を参照してください。 それには、 <literal>currentSession()</literal> という1つのメソッドが定義されており、 その実装は、現在の「コンテキスト上のセッション」を追跡することに責任を持ちます。 そのまま使えるように、Hibernateはこのインタフェースの実装を2つ提供しています。
pt_br: De uma olhada em Javadocs sobre a interface <literal>org.hibernate.context.CurrentSessionContext</literal> para uma discussão detalhada. Ela define um método único, <literal>currentSession()</literal>, com o qual a implementação é responsável por rastrear a sessão contextual corrente. Por fora do "encapsulamento", o Hibernate possui duas implementações dessa interface.
zh_cn: 请参阅<literal>org.hibernate.context.CurrentSessionContext</literal>接口的Javadoc,那里有关于它的契约的详细讨论。它定义了单一的方法，<literal>currentSession()</literal>，特定的实现用它来负责跟踪当前的上下文session。Hibernate内置了此接口的三种实现。

source: <literal>org.hibernate.context.JTASessionContext</literal> - current sessions are tracked and scoped by a <literal>JTA</literal> transaction. The processing here is exactly the same as in the older JTA-only approach. See the Javadocs for details.
fr_fr: <literal>org.hibernate.context.JTASessionContext</literal> - les sessions courantes sont associées à une transaction <literal>JTA</literal>. La logique est la même que l'ancienne approche basée sur JTA. Voir les javadocs pour les détails.
ja_jp: <literal>org.hibernate.context.JTASessionContext</literal> - <literal>JTA</literal> トランザクションによって、現在のセッションが追跡され、 スコープを決められます。この処理は、古いJTAだけのアプローチとまったく同じです。 詳細はJavadocを参照してください。
pt_br: <literal>org.hibernate.context.JTASessionContext</literal> - As sessões correntes são rastreadas e recebem um escopo por uma transação <literal>JTA</literal>. O processamento aqui é exatamente igual ao antigo processo JTA. Consulte em Javadocs para maiores detalhes.
zh_cn: <literal>org.hibernate.context.JTASessionContext</literal> - 当前session根据<literal>JTA</literal>来跟踪和界定。这和以前的仅支持JTA的方法是完全一样的。详情请参阅Javadoc。

source: <literal>org.hibernate.context.ThreadLocalSessionContext</literal> - current sessions are tracked by thread of execution. Again, see the Javadocs for details.
fr_fr: <literal>org.hibernate.context.ThreadLocalSessionContext</literal> - les sessions courantes sont associées au thread d'exécution. Voir les javadocs pour les détails.
ja_jp: <literal>org.hibernate.context.ThreadLocalSessionContext</literal> - スレッドの実行によって、現在のセッションが追跡されます。 詳細はJavadocを参照してください。
pt_br: <literal>org.hibernate.context.ThreadLocalSessionContext</literal> - As sessões correntes são rastreadas por uma thread de execução. Novamente, consulte em Javadocs para maiores detalhes.
zh_cn: <literal>org.hibernate.context.ThreadLocalSessionContext</literal> - 当前session通过当前执行的线程来跟踪和界定。详情也请参阅Javadoc。

source: <literal>org.hibernate.context.ManagedSessionContext</literal> - current sessions are tracked by thread of execution. However, you are responsible to bind and unbind a <literal>Session</literal> instance with static methods on this class, it does never open, flush, or close a <literal>Session</literal>.
ja_jp: <literal>org.hibernate.context.ManagedSessionContext</literal> - スレッドの実行によって、現在のセッションが追跡されます。 しかし、このクラスのstaticメソッドで <literal>Session</literal> インスタンスを バインド/アンバインドする責任はあなたにあります。 これは決して <literal>Session</literal> をオープン、フラッシュ、クローズしません。
zh_cn: <literal>org.hibernate.context.ManagedSessionContext</literal> - 当前session通过当前执行的线程来跟踪和界定。但是，你需要负责使用这个类的静态方法将<literal>Session</literal>实例绑定、或者取消绑定，它并不会打开(open)、flush或者关闭(close)任何<literal>Session</literal>。

source: The <literal>hibernate.current_session_context_class</literal> configuration parameter defines which <literal>org.hibernate.context.CurrentSessionContext</literal> implementation should be used. Note that for backwards compatibility, if this config param is not set but a <literal>org.hibernate.transaction.TransactionManagerLookup</literal> is configured, Hibernate will use the <literal>org.hibernate.context.JTASessionContext</literal>. Typically, the value of this parameter would just name the implementation class to use; for the three out-of-the-box implementations, however, there are three corresponding short names, "jta", "thread", and "managed".
fr_fr: Le paramètre de configuration <literal>hibernate.current_session_context_class</literal> définit quelle implémentation de <literal>org.hibernate.context.CurrentSessionContext</literal> doit être utilisée. Notez que pour assurer la compatibilité avec les versions précédentes, si ce paramètre n'est pas défini mais qu'un <literal>org.hibernate.transaction.TransactionManagerLookup</literal> est configuré, Hibernate utilisera le <literal>org.hibernate.context.JTASessionContext</literal>. La valeur de ce paramètre devrait juste nommer la classe d'implémentation à utiliser, pour les deux implémentations fournies, il y a cependant deux alias correspondant: "jta" et "thread".
ja_jp: <literal>hibernate.current_session_context_class</literal> 設定パラメータは、 <literal>org.hibernate.context.CurrentSessionContext</literal> のどの実装を使うかを指定します。 下位互換性のため、このパラメータが設定されず <literal>org.hibernate.transaction.TransactionManagerLookup</literal> が設定されていた場合、 Hibernateは <literal>org.hibernate.context.JTASessionContext</literal> を使うことに注意してください。 通常このパラメータの値には、3つの実装の中から使用する実装クラスの名前を直接指定します。 しかし、"jta", "thread", "managed"というそれぞれの省略名も用意されています。
pt_br: O parâmetro de configuração <literal>hibernate.current_session_context_class</literal> define que a implementação <literal>org.hibernate.context.CurrentSessionContext</literal> deve ser usada. Note que para compatibilidade anterior, se este parâmetro de configuração não é determinado mas um <literal>org.hibernate.transaction.TransactionManagerLookup</literal> é configurado, Hibernate usará o <literal>org.hibernate.context.JTASessionContext</literal>. Tipicamente, o valor deste parâmetro nomearia apenas a classe de implementação para usar; para as duas implementações out-of-the-box, entretanto, há três pequenos nomes correspondentes, "jta", "thread", and "managed".
zh_cn: <literal>hibernate.current_session_context_class</literal>配置参数定义了应该采用哪个<literal>org.hibernate.context.CurrentSessionContext</literal>实现。注意，为了向下兼容，如果未配置此参数，但是存在<literal>org.hibernate.transaction.TransactionManagerLookup</literal>的配置，Hibernate会采用<literal>org.hibernate.context.JTASessionContext</literal>。一般而言，此参数的值指明了要使用的实现类的全名，但那三种内置的实现可以使用简写，即"jta"、"thread"和"managed"。

source: The instance was once associated with a persistence context, but that context was closed, or the instance was serialized to another process. It has a persistent identity and, perhaps, a corrsponding row in the database. For detached instances, Hibernate makes no guarantees about the relationship between persistent identity and Java identity.
ja_jp: この状態のインスタンスは、かつて永続コンテキストに関連づけられたが、 そのコンテキストがクローズされたか、あるいは、 他のプロセスにそのインスタンスがシリアライズされたかです。 このインスタンスは、永続IDを持ち、たいていはデータベースに 対応する行を持っているでしょう。分離インスタンスに対しては、 永続IDとJavaのIDとの関連は、Hibernateが保証しません。
pt_br: A instância foi associada com um contexto persistente, porém este contexto foi fechado, ou a instância foi serializada por outro processo. Possui uma identidade persistente, e, talvez, correspondenta a um registro no banco de dados. Para instâncias desatachadas, o Hibernate não garante o relacionamento entre identidade persistente e identidade Java.

source: The first two implementations provide a "one session - one database transaction" programming model, also known and used as <emphasis>session-per-request</emphasis>. The beginning and end of a Hibernate session is defined by the duration of a database transaction. If you use programatic transaction demarcation in plain JSE without JTA, you are adviced to use the Hibernate <literal>Transaction</literal> API to hide the underlying transaction system from your code. If you use JTA, use the JTA interfaces to demarcate transactions. If you execute in an EJB container that supports CMT, transaction boundaries are defined declaratively and you don't need any transaction or session demarcation operations in your code. Refer to <xref linkend="transactions"/> for more information and code examples.
ja_jp: 始めの2つの実装は、"1セッション - 1データベーストランザクション" プログラミングモデルを提供します。 これは <emphasis>リクエストごとのセッション（session-per-request）</emphasis> としても知られており、使われています。 Hibernate セッションの開始と終了は、データベーストランザクションの期間で決まります。 JTAを使わない普通のJSEで、プログラム上のトランザクション境界設定を行うなら、 コードから基礎のトランザクションシステムを隠蔽するために、 Hibernate <literal>Transaction</literal> APIを使うとよいでしょう。 JTAを使うなら、トランザクションの境界設定には、JTAインターフェイスを使ってください。 CMTをサポートするEJBコンテナで実行するつもりなら、トランザクション境界は宣言的に定義できるため、 コード上でトランザクションやセッションの境界を設定する必要はありません。 さらに詳細な情報やコードの例は、 <xref linkend="transactions"/> を参照してください。
pt_br: As duas primeiras implementações usam o modelo de programação "uma sessão – uma transação do banco de dados", também conhecida e usado como <emphasis>sessão por requisição</emphasis>. O começo e o fim de uma sessão Hibernate é definida pela duração da transação do banco de dados. Se você usa demarcação programática de transação (por exemplo. em J2SE puro ou com JTA /UserTransaction/BMT), você é recomendado a usar a API Hibernate <literal>Transaction</literal> para esconder a base do sistema de transação do seu código. Se você executa em um container EJB que suporta CMT, os limites das transações são definidas declarativamente e você não necessita de qualquer transação ou operação de demarcação de sessão no seu código. Consulte o <xref linkend="transactions"/> para mais informações exemplos de código.
