Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/architecture.po
Languages: fr_fr, ja_jp, pt_br, zh_cn

source: Architecture
ja_jp: アーキテクチャ
pt_br: Arquitetura
zh_cn: 体系结构(Architecture)

source: Overview
fr_fr: Généralités
ja_jp: 概観
pt_br: Visão Geral
zh_cn: 概况(Overview)

source: A (very) high-level view of the Hibernate architecture:
fr_fr: Voici une vue (très) haut niveau de l'architecture d'Hibernate :
ja_jp: Hibernateアーキテクチャの（非常に）高いレベルからのビュー：
pt_br: Uma visão bem ampla da arquitetura do Hibernate:
zh_cn: 一个非常简要的Hibernate体系结构的概要图：

source: This diagram shows Hibernate using the database and configuration data to provide persistence services (and persistent objects) to the application.
fr_fr: Ce diagramme montre Hibernate utilisant une base de données et des données de configuration pour fournir un service de persistance (et des objets persistants) à l'application.
ja_jp: この図はHibernateが、アプリケーションに対して永続化サービス （と永続オブジェクト）を提供するために、データベースと設定データを使うことを 示しています。
pt_br: Esse diagrama mostra o Hibernate usando o banco de dados e a configuração de dados para prover persistência de serviços (e persistência de objetos) para o aplicativo.
zh_cn: 从这个图可以看出，Hibernate使用数据库和配置信息来为应用程序提供持久化服务（以及持久的对象）。

source: We would like to show a more detailed view of the runtime architecture. Unfortunately, Hibernate is flexible and supports several approaches. We will show the two extremes. The "lite" architecture has the application provide its own JDBC connections and manage its own transactions. This approach uses a minimal subset of Hibernate's APIs:
fr_fr: Nous aimerions décrire une vue plus détaillée de l'architecture. Malheureusement, Hibernate est flexible et supporte différentes approches. Nous allons en montrer les deux extrêmes. L'architecture légère laisse l'application fournir ses propres connexions JDBC et gérer ses propres transactions. Cette approche utilise le minimum des APIs Hibernate :
ja_jp: ここで実行時アーキテクチャのより詳細なビューをお見せしましょう。 あいにく、Hibernateは柔軟であり、いろいろなアプローチをサポートしています。 ここでは、2つの極端な例をお見せします。 「軽い」アーキテクチャでは、アプリケーションが自前のJDBCコネクションを用意し、 アプリケーション自身がトランザクションを管理します。 この方法は、Hibernate APIの最小限のサブセットを使います：
pt_br: Nós gostaríamos de mostrar uma visão mais detalhada da arquitetura em execução. Infelizmente, o Hibernate é muito flexível e suporta várias aproximações. Nós iremos mostrar os dois extremos. Na arquitetura mais simples o aplicativo fornece suas próprias conexões JDBC e gerencia suas transações. Esta abordagem usa o mínimo de subconjuntos das APIs do Hibernate:
zh_cn: 我们来更详细地看一下Hibernate运行时体系结构。由于Hibernate非常灵活，且支持多种应用方案， 所以我们这只描述一下两种极端的情况。“轻型”的体系结构方案，要求应用程序提供自己的JDBC 连接并管理自己的事务。这种方案使用了Hibernate API的最小子集：

source: The "full cream" architecture abstracts the application away from the underlying JDBC/JTA APIs and lets Hibernate take care of the details.
fr_fr: L'architecture la plus complète abstrait l'application des APIs JDBC/JTA sous-jacentes et laisse Hibernate s'occuper des détails.
ja_jp: 「重い」アーキテクチャは、アプリケーションから、その下に位置するJDBCやJTAのAPIを 取り払って抽象化し、その詳細の面倒をHibernateに見させます。
pt_br: A arquitetura "completa" abstrai a aplicação de ter de lidar diretamente com JDBC/JTA e APIs e deixa o Hibernate tomar conta dos detalhes.
zh_cn: “全面解决”的体系结构方案，将应用层从底层的JDBC/JTA API中抽象出来，而让Hibernate来处理这些细节。

source: A threadsafe (immutable) cache of compiled mappings for a single database. A factory for <literal>Session</literal> and a client of <literal>ConnectionProvider</literal>. Might hold an optional (second-level) cache of data that is reusable between transactions, at a process- or cluster-level.
fr_fr: Un cache threadsafe (immuable) des mappings vers une (et une seule) base de données. Une factory (fabrique) de <literal>Session</literal> et un client de <literal>ConnectionProvider</literal>. Peut contenir un cache optionnel de données (de second niveau) qui est réutilisable entre les différentes transactions que cela soit au sein du même processus (JVLM) ou par plusieurs nœuds d'un cluster.
ja_jp: 1つのデータベースに対するコンパイルされたマッピングの スレッドセーフな（更新不能の）キャッシュ。 <literal>Session</literal> のファクトリであり、 <literal>ConnectionProvider</literal> のクライアント。 オプションとして、プロセスまたはクラスタレベルにおいて、 トランザクション間で再利用可能なデータの（二次）キャッシュを持ちます。
pt_br: Um cache threadsafe (imutáveis) composto de identidades compiladas para um único banco de dados. Uma fabrica para <literal>Session</literal> e um cliente de <literal>ConnectionProvider</literal>. Pode conter um cachê opcional de dados (segundo nível) reutilizáveis entre transações, no nível de processo- ou cluster.
zh_cn: 针对单个数据库映射关系经过编译后的内存镜像，是线程安全的（不可变）。 它是生成<literal>Session</literal>的工厂，本身要用到<literal>ConnectionProvider</literal>。 该对象可以在进程或集群的级别上，为那些事务之间可以重用的数据提供可选的二级缓存。

source: A single-threaded, short-lived object representing a conversation between the application and the persistent store. Wraps a JDBC connection. Factory for <literal>Transaction</literal>. Holds a mandatory (first-level) cache of persistent objects, used when navigating the object graph or looking up objects by identifier.
fr_fr: Un objet mono-threadé, à durée de vie courte, qui représente une conversation entre l'application et l'entrepôt de persistance. Encapsule une connexion JDBC. Factory (fabrique) des objets <literal>Transaction</literal>. Contient un cache (de premier niveau) des objets persistants, ce cache est obligatoire. Il est utilisé lors de la navigation dans le graphe d'objets ou lors de la récupération d'objets par leur identifiant.
ja_jp: アプリケーションと永続ストアとの対話を表す、 シングルスレッドで短命のオブジェクト。 JDBCコネクションをラップします。 <literal>Transaction</literal> のファクトリです。 永続オブジェクトの必須の（一次）キャッシュを保持します。 このキャッシュはオブジェクトグラフをナビゲーションする時や、 識別子でオブジェクトを検索する時に使われます。
pt_br: Objeto single-threaded, de vida curta, representando uma conversação entre o aplicativo e o armazenamento persistente. Cria uma camada sobre uma conexão JDBC. É uma fabrica de <literal>Transaction</literal>. Possui um cachê obrigatório (primeiro nível) de objetos persistentes, usado para navegação no gráficos de objetos e pesquisa de objetos pelo identificador.
zh_cn: 表示应用程序与持久储存层之间交互操作的一个单线程对象，此对象生存期很短。 其隐藏了JDBC连接，也是<literal>Transaction</literal>的工厂。 其会持有一个针对持久化对象的必选（第一级）缓存，在遍历对象图或者根据持久化标识查找对象时会用到。

source: Persistent objects and collections
fr_fr: Objets et Collections persistants
ja_jp: Persistent objects と Collections
pt_br: Objetos persistentes e coleções
zh_cn: 持久的对象及其集合

source: Short-lived, single threaded objects containing persistent state and business function. These might be ordinary JavaBeans/POJOs, the only special thing about them is that they are currently associated with (exactly one) <literal>Session</literal>. As soon as the <literal>Session</literal> is closed, they will be detached and free to use in any application layer (e.g. directly as data transfer objects to and from presentation).
fr_fr: Objets mono-threadés à vie courte contenant l'état de persistance et la fonction métier. Ceux-ci sont en général les objets de type JavaBean (ou POJOs) ; la seule particularité est qu'ils sont associés avec une (et une seule) <literal>Session</literal>. Dès que la <literal>Session</literal> est fermée, ils seront détachés et libres d'être utilisés par n'importe laquelle des couches de l'application (ie. de et vers la présentation en tant que Data Transfer Objects - DTO : objet de transfert de données).
ja_jp: 永続化状態とビジネスメソッドを持つ、短命でシングルスレッドのオブジェクト。 これは通常のJavaBeans/POJOのこともありますが、特徴的なことは、 その時点での（ただ1つの） <literal>Session</literal> と関連していることです。 <literal>Session</literal> がクローズされるとすぐに、 それらは切り離されて他のアプリケーション層から自由に使うことができます。 （例えばデータ・トランスファ・オブジェクトとして、 プレゼンテーション層から、またはプレゼンテーション層へ直接使用できます。）
pt_br: Objetos, de vida curta, single threaded contendo estado persistente e função de negócios. Esses podem ser JavaBeans/POJOs, onde única coisa especial sobre eles é que são associados a (exatamente uma) <literal>Session</literal>. Quando a <literal>Session</literal> é fechada, eles são separados e liberados para serem usados dentro de qualquer camada da aplicacao (Ex. diretamente como data transfer objects de e para a camada de apresentação)
zh_cn: 带有持久化状态的、具有业务功能的单线程对象，此对象生存期很短。 这些对象可能是普通的JavaBeans/POJO，唯一特殊的是他们正与（仅仅一个）<literal>Session</literal>相关联。 一旦这个<literal>Session</literal>被关闭，这些对象就会脱离持久化状态，这样就可被应用程序的任何层自由使用。 （例如，用作跟表示层打交道的数据传输对象。）

source: Transient and detached objects and collections
fr_fr: Objets et collections transients
ja_jp: Transient と detached な objects と Collections
pt_br: Objetos e coleções desatachados e transientes
zh_cn: 瞬态(transient)和脱管(detached)的对象及其集合

source: Instances of persistent classes that are not currently associated with a <literal>Session</literal>. They may have been instantiated by the application and not (yet) persisted or they may have been instantiated by a closed <literal>Session</literal>.
fr_fr: Instances de classes persistantes qui ne sont actuellement pas associées à une <literal>Session</literal>. Elles ont pu être instanciées par l'application et ne pas avoir (encore) été persistées ou elle ont pu être instanciées par une <literal>Session</literal> fermée.
ja_jp: 現時点では <literal>Session</literal> と関連していない、 永続クラスのインスタンス。 すでにアプリケーション側でインスタンス化されていて、まだ永続化されていないか、 クローズされた <literal>Session</literal> でインスタンス化されたかのどちらかです。
pt_br: Instâncias de classes persistentes que ainda não estão associadas a uma <literal>Session</literal>. Eles podem ter sido instanciados pela aplicação e não persistido (ainda) ou eles foram instanciados por uma <literal>Session</literal> que foi encerrada.
zh_cn: 那些目前没有与session关联的持久化类实例。 他们可能是在被应用程序实例化后，尚未进行持久化的对象。 也可能是因为实例化他们的<literal>Session</literal>已经被关闭而脱离持久化的对象。

source: Transaction (<literal>org.hibernate.Transaction</literal>)
zh_cn: 事务Transaction (<literal>org.hibernate.Transaction</literal>)

source: (Optional) A single-threaded, short-lived object used by the application to specify atomic units of work. Abstracts application from underlying JDBC, JTA or CORBA transaction. A <literal>Session</literal> might span several <literal>Transaction</literal>s in some cases. However, transaction demarcation, either using the underlying API or <literal>Transaction</literal>, is never optional!
fr_fr: (Optionnel) Un objet mono-threadé à vie courte utilisé par l'application pour définir une unité de travail atomique. Abstrait l'application des transactions sous-jacentes qu'elles soient JDBC, JTA ou CORBA. Une <literal>Session</literal> peut fournir plusieurs <literal>Transaction</literal>s dans certains cas. Toutefois, la délimitation des transactions, via l'API d'Hibernate ou par la <literal>Transaction</literal> sous-jacente, n'est jamais optionnelle!
ja_jp: (オプション)原子性を持つ作業単位(Unit of Work)を指定するために、アプリケーションが使用する、 シングルスレッドで短命なオブジェクト。 下に位置するJDBC、JTA、CORBAトランザクションからアプリケーションを抽象化します。 <literal>Session</literal> は、時には いくつかの <literal>Transaction</literal> をまたがるかもしれません。 しかし、下の層のAPIを使うにせよ、 <literal>Transaction</literal> を使うにせよ、 トランザクション境界を設定することは、決してオプションではありません！。
pt_br: (Opcional) Objeto de vida curta, single threaded, usado pela aplicação para especificar unidades atômicas de trabalho. Abstrai o aplicativo de lidar diretamente com transações JDBC, JTA ou CORBA. Uma <literal>Session</literal> pode, em alguns casos, iniciar várias <literal>Transaction</literal>s. Entretanto, a demarcação da transação, mesmo utilizando API ou Transaction subjacentes, nunca é opcional!
zh_cn: （可选的）应用程序用来指定原子操作单元范围的对象，它是单线程的，生命周期很短。 它通过抽象将应用从底层具体的JDBC、JTA以及CORBA事务隔离开。 某些情况下，一个<literal>Session</literal>之内可能包含多个<literal>Transaction</literal>对象。 尽管是否使用该对象是可选的，但无论是使用底层的API还是使用<literal>Transaction</literal>对象，事务边界的开启与关闭是必不可少的。

source: (Optional) A factory for (and pool of) JDBC connections. Abstracts application from underlying <literal>Datasource</literal> or <literal>DriverManager</literal>. Not exposed to application, but can be extended/implemented by the developer.
fr_fr: (Optionnel) Une fabrique de (pool de) connexions JDBC. Abstrait l'application de la <literal>Datasource</literal> ou du <literal>DriverManager</literal> sous-jacent. Non exposé à l'application, mais peut être étendu/implémenté par le développeur.
ja_jp: (オプション)JDBCコネクション（とそのプール）のファクトリ。 下の層に位置する <literal>Datasource</literal> や <literal>DriverManager</literal> からアプリケーションを抽象化します。 アプリケーションには公開されませんが、開発者が継承または実装することは可能です。
pt_br: (Opcional) Uma fábrica de (e combinações de) conexões JDBC. Abstrai a aplicação de lidar diretamente com <literal>Datasource</literal> ou <literal>DriverManager</literal>. Não exposto para a aplicação, mas pode ser implementado ou estendido pelo programador.
zh_cn: （可选的）生成JDBC连接的工厂（同时也起到连接池的作用）。 它通过抽象将应用从底层的<literal>Datasource</literal>或<literal>DriverManager</literal>隔离开。 仅供开发者扩展/实现用，并不暴露给应用程序使用。

source: (Optional) A factory for <literal>Transaction</literal> instances. Not exposed to the application, but can be extended/implemented by the developer.
fr_fr: (Optionnel) Une fabrique d'instances de <literal>Transaction</literal>. Non exposé à l'application, mais peut être étendu/implémenté par le développeur.
ja_jp: (オプション) <literal>Transaction</literal> インスタンスのファクトリ。 アプリケーションには公開されませんが、開発者が継承または実装することは可能です。
pt_br: (Opcional) Uma fábrica para instâncias de <literal>Transaction</literal>. Não exposta a aplicação, mas pode ser extendida/implementada pelo programador.
zh_cn: （可选的）生成<literal>Transaction</literal>对象实例的工厂。 仅供开发者扩展/实现用，并不暴露给应用程序使用。

source: Extension Interfaces
fr_fr: Interfaces d'extension
zh_cn: 扩展接口

source: Hibernate offers many optional extension interfaces you can implement to customize the behavior of your persistence layer. See the API documentation for details.
fr_fr: Hibernate fournit de nombreuses interfaces d'extensions optionnelles que vous pouvez implémenter pour personnaliser le comportement de votre couche de persistance. Reportez vous à la documentation de l'API pour plus de détails.
ja_jp: Hibernateは、永続層の振る舞いをカスタマイズするために、 多くのオプション拡張インタフェースを用意しています。 詳細はAPIドキュメントを参照してください。
pt_br: O Hibernate oferece várias opções de interfaces estendidas que você pode implementar para customizar sua camada persistente. Veja a documentação da API para maiores detalhes.
zh_cn: Hibernate提供了很多可选的扩展接口，你可以通过实现它们来定制你的持久层的行为。 具体请参考API文档。

source: Given a "lite" architecture, the application bypasses the <literal>Transaction</literal>/<literal>TransactionFactory</literal> and/or <literal>ConnectionProvider</literal> APIs to talk to JTA or JDBC directly.
fr_fr: Dans une architecture légère, l'application n'aura pas à utiliser les APIs <literal>Transaction</literal>/<literal>TransactionFactory</literal> et/ou n'utilisera pas les APIs <literal>ConnectionProvider</literal> pour utiliser JTA ou JDBC.
ja_jp: 「軽い」アーキテクチャでは、アプリケーションは直接JTAやJDBCと対話するために、 <literal>Transaction</literal> や <literal>TransactionFactory</literal> や <literal>ConnectionProvider</literal> をバイパスします。
pt_br: Dada uma arquitetura simples, o aplicativo passa pelas APIs <literal>Transaction</literal>/<literal>TransactionFactory</literal> e/ou <literal>ConnectionProvider</literal> para se comunicar diretamente com a transação JTA ou JDBC.
zh_cn: 在特定“轻型”的体系结构中，应用程序可能绕过 <literal>Transaction</literal>/<literal>TransactionFactory</literal> 以及 <literal>ConnectionProvider</literal> 等API直接跟JTA或JDBC打交道。

source: Instance states
fr_fr: Etats des instances
ja_jp: インスタンスの状態
pt_br: Estados de instância
zh_cn: 实例状态

source: An instance of a persistent classes may be in one of three different states, which are defined with respect to a <emphasis>persistence context</emphasis>. The Hibernate <literal>Session</literal> object is the persistence context:
fr_fr: Une instance d'une classe persistante peut être dans l'un des trois états suivants, définis par rapport à un <emphasis>contexte de persistance</emphasis>. L'objet <literal>Session</literal> d'hibernate correspond à ce concept de contexte de persistance :
ja_jp: 永続クラスのインスタンスは、次の３つの異なる状態のどれかになります。 それは、 <emphasis>永続コンテキスト</emphasis> によって決まります。 Hibernateの <literal>Session</literal> オブジェクトが、永続コンテキストになります。
pt_br: Uma instância de classes persistentes pode estar em um dos três diferentes estados, que são definidos respeitando um <emphasis>contexto persistente</emphasis>. O objeto <literal>Session</literal> do Hibernate é o contexto persistente:
zh_cn: 一个持久化类的实例可能处于三种不同状态中的某一种。 这三种状态的定义则与所谓的<emphasis>持久化上下文(persistence context)</emphasis>有关。 Hibernate的<literal>Session</literal>对象就是这个所谓的持久化上下文：

source: transient
fr_fr: passager (transient)
pt_br: transiente
zh_cn: 瞬态（transient）

source: The instance is not, and has never been associated with any persistence context. It has no persistent identity (primary key value).
fr_fr: L'instance n'est pas et n'a jamais été associée à un contexte de persistance. Elle ne possède pas d'identité persistante (valeur de clé primaire)
ja_jp: この状態のインスタンスは、現在もそして過去においても、 永続コンテキストに関連づいていません。また、永続ID（主キーの値）を 持っていません。
pt_br: A instância não é, e nunca foi associada com nenhum contexto persistente. Não possui uma identidade persistente (valor de chave primária).
zh_cn: 该实例从未与任何持久化上下文关联过。它没有持久化标识（相当于主键值）。

source: persistent
fr_fr: persistant
pt_br: persistente
zh_cn: 持久化(persistent)

source: The instance is currently associated with a persistence context. It has a persistent identity (primary key value) and, perhaps, a corresponding row in the database. For a particular persistence context, Hibernate <emphasis>guarantees</emphasis> that persistent identity is equivalent to Java identity (in-memory location of the object).
fr_fr: L'instance est associée au contexte de persistance. Elle possède une identité persistante (valeur de clé primaire) et, peut-être, un enregistrement correspondant dans la base. Pour un contexte de persistance particulier, Hibernate <emphasis>garantit</emphasis> que l'identité persistante est équivalente à l'identité Java (emplacement mémoire de l'objet)
ja_jp: この状態のインスタンスは、その時点で永続コンテキストに関連づいています。 また、永続ID（主キーの値）を持ち、 たいていはデータベースに対応する行を持っているでしょう。 個々の永続コンテキストのなかでは、永続IDが JavaのID（オブジェクトのメモリ上の位置）と同じであることを Hibernateが <emphasis>保証</emphasis> します。
pt_br: A instância está atualmente associada a um contexto persistente. Possui uma identidade persistente (valor de chave primária) e, talvez, correspondente a um registro no banco de dados. Para um contexto persistente em particular, o Hibernate <emphasis>guarantees</emphasis> que a identidade persistente é equivalente a identidade Java (na localização em memória do objeto).
zh_cn: 实例目前与某个持久化上下文有关联。 它拥有持久化标识（相当于主键值），并且可能在数据库中有一个对应的行。 对于某一个特定的持久化上下文，Hibernate<emphasis>保证</emphasis>持久化标识与Java标识（其值代表对象在内存中的位置）等价。

source: detached
fr_fr: détaché
pt_br: desatachado
zh_cn: 脱管(detached)

source: JMX Integration
fr_fr: Intégration JMX
ja_jp: JMXとの統合
pt_br: Integração JMX
zh_cn: JMX整合

source: JMX is the J2EE standard for management of Java components. Hibernate may be managed via a JMX standard service. We provide an MBean implementation in the distribution, <literal>org.hibernate.jmx.HibernateService</literal>.
fr_fr: JMX est le standard J2EE de gestion des composants Java. Hibernate peut être géré via un service JMX standard. Nous fournissons une implémentation d'un MBean dans la distribution : <literal>org.hibernate.jmx.HibernateService</literal>.
ja_jp: JMXはJavaコンポーネント管理のJ2EE標準です。 JMX標準サービスを通して、Hibernateは管理されます。 ディストリビューションの中に <literal>org.hibernate.jmx.HibernateService</literal> という MBean実装を用意しています。
pt_br: JMX é padrão J2EE para manipulação de componentes Java. O Hibernate pode ser manipulado por um serviço JMX padrão. Nós fornecemos uma implementação do MBean na distribuição, <literal>org.hibernate.jmx.HibernateService</literal>.
zh_cn: JMX是管理Java组件(Java components)的J2EE标准。 Hibernate 可以通过一个JMX标准服务来管理。 在这个发行版本中，我们提供了一个MBean接口的实现,即 <literal>org.hibernate.jmx.HibernateService</literal>。

source: For an example how to deploy Hibernate as a JMX service on the JBoss Application Server, please see the JBoss User Guide. On JBoss AS, you also get these benefits if you deploy using JMX:
fr_fr: Pour avoir un exemple sur la manière de déployer Hibernate en tant que service JMX dans le serveur d'application JBoss Application Server, référez vous au guide utilisateur JBoss (JBoss User Guide). Si vous déployez Hibernate via JMX sur JBoss AS, vous aurez également les bénéfices suivants :
ja_jp: JBoss アプリケーションサーバー上にHibernateをJMXサービスとしてデプロイする方法の例としては、 JBoss ユーザガイドを参照してください。 JBoss アプリケーションサーバーにおいて、 JMXを使ってデプロイすると、次のメリットが得られます。
pt_br: Para um exemplo de como instalar o Hibernate como um serviço JMX em um servidor de aplicativo JBoss, por favor, consulte o manual do usuário do JBoss. No JBoss As, você poderá ver os benefícios de de se fazer o deploy usando JMX:
zh_cn: 想要看如何在JBoss应用服务器上将Hibernate部署为一个JMX服务的例子，您可以参考JBoss用户指南。 我们现在说一下在Jboss应用服务器上，使用JMX来部署Hibernate的好处：

source: <emphasis>Session Management:</emphasis> The Hibernate <literal>Session</literal>'s life cycle can be automatically bound to the scope of a JTA transaction. This means you no longer have to manually open and close the <literal>Session</literal>, this becomes the job of a JBoss EJB interceptor. You also don't have to worry about transaction demarcation in your code anymore (unless you'd like to write a portable persistence layer of course, use the optional Hibernate <literal>Transaction</literal> API for this). You call the <literal>HibernateContext</literal> to access a <literal>Session</literal>.
fr_fr: <emphasis>Gestion de la session :</emphasis> Le cycle de vie de la <literal>Session</literal> Hibernate peut être automatiquement limitée à la portée d'une transaction JTA. Cela signifie que vous n'avez plus besoin d'ouvrir et de fermer la <literal>Session</literal> manuellement, cela devient le travail de l'intercepteur EJB de JBoss. Vous n'avez pas non plus à vous occuper des démarcations des transactions dans votre code (sauf si vous voulez écrire une couche de persistance qui soit portable, dans ce cas vous pouvez utiliser l'API optionnelle <literal>Transaction</literal> d'Hibernate). Vous appelez l'<literal>HibernateContext</literal> pour accéder à la <literal>Session</literal>.
ja_jp: <emphasis>セッション管理:</emphasis> Hibernateの <literal>Session</literal> のライフサイクルは、 自動的にJTAトランザクションのスコープに結びつけられます。これは、もはや手動で <literal>Session</literal> をオープンしたり、クローズしたりする必要がないことを意味します。 これは、JBoss EJB インターセプタの仕事になります。 また、コードのどこでトランザクション境界を設定するかについて、 もはや悩む必要がありません（もちろん移植可能な永続層を書かかなくていいのならば、 オプションのHibernateの <literal>Transaction</literal> を使用してください。） <literal>Session</literal> にアクセスするためには、 <literal>HibernateContext</literal> を コールしてください。
pt_br: <emphasis>Session Management:</emphasis> O ciclo de vida de uma <literal>Session</literal> do Hibernate pode ser automaticamente conectada a um escopo de transação JTA. Isso significa que você não precisará mais abrir e fechar manualmente uma <literal>Session</literal>, isso se torna trabalho para um interceptor EJB do JBoss . Você também não precisa se preocupar, nunca mais, com demarcação de transação em seu código (a não ser que você prefira escrever uma camada persistente portável, para isso, use a API opcional do Hibernate <literal>Transaction</literal>). Você deve chamar <literal>HibernateContext</literal> para acessar uma <literal>Session</literal>.
zh_cn: <emphasis>Session管理：</emphasis> Hibernate的<literal>Session</literal>对象的生命周期可以 自动跟一个JTA事务边界绑定。这意味着你无需手工开关<literal>Session</literal>了, 这项 工作会由JBoss EJB 拦截器来完成。你再也不用担心你的代码中的事务边界了(除非你想利用Hibernate提供可选 的<literal>Transaction</literal> API来自己写一个便于移植的的持久层)。 你通过调用<literal>HibernateContext</literal>来访问<literal>Session</literal>。
