Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: ja_jp, pt_br

source: If you use a certain <literal>UserType</literal> very often, it may be useful to define a shorter name for it. You can do this using the <literal>&lt;typedef&gt;</literal> element. Typedefs assign a name to a custom type, and may also contain a list of default parameter values if the type is parameterized.
ja_jp: 特定の <literal>UserType</literal> を頻繁に使用するならば、短い名前を定義すると便利になるでしょう。 <literal>&lt;typedef&gt;</literal> 要素を使ってこのようなことが行えます。 Typedefsはカスタム型に名前を割り当てます。 その型がパラメータを持つならば、 パラメータのデフォルト値のリストを含むこともできます。
pt_br: Se você usar freqüentemente um determinado <literal>UserType</literal>, pode ser útil definir um nome mais curto para ele. Você pode fazer isto usando o elemento <literal>&lt;typedef&gt;</literal>. Typedefs atribui um nome a um tipo personalizado, e pode também conter uma lista de valores default de parâmetro se o tipo for parametrizado.

source: It is also possible to override the parameters supplied in a typedef on a case-by-case basis by using type parameters on the property mapping.
ja_jp: プロパティのマッピングで型パラメータを使うことで、 typedefで提供されたパラメータをその都度オーバーライドすることが可能です。

source: Even though Hibernate's rich range of built-in types and support for components means you will very rarely <emphasis>need</emphasis> to use a custom type, it is nevertheless considered good form to use custom types for (non-entity) classes that occur frequently in your application. For example, a <literal>MonetaryAmount</literal> class is a good candidate for a <literal>CompositeUserType</literal>, even though it could easily be mapped as a component. One motivation for this is abstraction. With a custom type, your mapping documents would be future-proofed against possible changes in your way of representing monetary values.
ja_jp: Hibernateの幅広い組み込み型とコンポーネントに対するサポートは、 カスタム型をめったに <emphasis>使わない</emphasis> ということを意味します。 それでもなお、アプリケーションで頻出する(エンティティではない)クラスに対するカスタム型の使用は、 よいやり方であるとみなされます。 例えば <literal>MonetaryAmount</literal> クラスはコンポーネントとして簡単にマッピングできますが、 <literal>CompositeUserType</literal> の良い候補です。 カスタム型を使用する動機の1つは抽象化です。 カスタム型を使うことで、通貨をどのように表現しようとも マッピングドキュメントは起こりうる変化に対応できます。

source: Mapping a class more than once
ja_jp: １つのクラスに１つ以上のマッピング

source: It is possible to provide more than one mapping for a particular persistent class. In this case you must specify an <emphasis>entity name</emphasis> do disambiguate between instances of the two mapped entities. (By default, the entity name is the same as the class name.) Hibernate lets you specify the entity name when working with persistent objects, when writing queries, or when mapping associations to the named entity.
ja_jp: ある永続クラスに、一つ以上のマッピングを提供することが出来ます。 この場合、マッピングする２つのエンティティのインスタンスを明確にするために、 <emphasis>エンティティ名</emphasis> を指定しなければなりません (デフォルトではエンティティ名はクラス名と同じです。)。 永続オブジェクトを扱うとき、クエリを書き込むとき、 指定されたエンティティへの関連をマッピングするときには、 Hibernateではエンティティ名を指定しなければなりません。

source: Notice how associations are now specified using <literal>entity-name</literal> instead of <literal>class</literal>.
ja_jp: 関連が<literal>class</literal> の代わりに <literal>entity-name</literal> を使って、 どのように指定されるのかに注目してください。

source: SQL quoted identifiers
ja_jp: バッククォートで囲んだ SQL 識別子

source: You may force Hibernate to quote an identifier in the generated SQL by enclosing the table or column name in backticks in the mapping document. Hibernate will use the correct quotation style for the SQL <literal>Dialect</literal> (usually double quotes, but brackets for SQL Server and backticks for MySQL).
ja_jp: マッピングドキュメントでテーブルやカラムの名前をバッククォートで囲むことで、 Hibernateで生成されたSQL中の識別子を引用させることができます。 HibernateはSQLの <literal>Dialect</literal> に対応する、正しい引用スタイルを使います （普通はダブルクォートですが、SQL Serverではかぎ括弧、MySQLではバッククォートです）。

source: Metadata alternatives
ja_jp: メタデータの代替手段

source: XML isn't for everyone, and so there are some alternative ways to define O/R mapping metadata in Hibernate.
ja_jp: XMLの記述以外に、 HibernateではO/Rマッピングのメタデータを定義する代替方法があります。

source: Using XDoclet markup
ja_jp: XDoclet マークアップの使用

source: Many Hibernate users prefer to embed mapping information directly in sourcecode using XDoclet <literal>@hibernate.tags</literal>. We will not cover this approach in this document, since strictly it is considered part of XDoclet. However, we include the following example of the <literal>Cat</literal> class with XDoclet mappings.
ja_jp: 多くのHibernateユーザはXDocletの <literal>@hibernate.tags</literal> を使って、 ソースコード内に直接マッピング情報を埋め込むことを好みます。 これは厳密に言えばXDocletの分野なので、本ドキュメントではこの方法を対象とはしません。 しかしXDocletを使った以下の <literal>Cat</literal> マッピングの例を示します。

source: See the Hibernate web site for more examples of XDoclet and Hibernate.
ja_jp: Hibernateのウェブサイトには、XDocletとHibernateに関するサンプルが多数あります。

source: Using JDK 5.0 Annotations
ja_jp: JDK 5.0 アノテーションの使用

source: JDK 5.0 introduced XDoclet-style annotations at the language level, type-safe and checked at compile time. This mechnism is more powerful than XDoclet annotations and better supported by tools and IDEs. IntelliJ IDEA, for example, supports auto-completion and syntax highlighting of JDK 5.0 annotations. The new revision of the EJB specification (JSR-220) uses JDK 5.0 annotations as the primary metadata mechanism for entity beans. Hibernate3 implements the <literal>EntityManager</literal> of JSR-220 (the persistence API), support for mapping metadata is available via the <emphasis>Hibernate Annotations</emphasis> package, as a separate download. Both EJB3 (JSR-220) and Hibernate3 metadata is supported.
ja_jp: JDK5.0ではタイプセーフかつコンパイル時にチェックできる、 言語レベルのXDocletスタイルのアノテーションを導入しました。 このメカニズムはXDocletのアノテーションよりも強力で、ツールやIDEも多くがサポートしています。 例えばIntelliJ IDEAは、JDK5.0にアノテーションの自動補完と構文の強調表示をサポートしています。 EJB仕様 (JSR-220)の新しいバージョンでは、エンティティビーンに対する主要なメタデータメカニズムとして JDK5.0のアノテーションを使用しています。 Hibernate3ではJSR-220 (永続化API)の <literal>EntityManager</literal> を実装し、 メタデータマッピングに対するサポートは、 別ダウンロードの <emphasis>Hibernate Annotations</emphasis> パッケージにより利用可能です。 これはEJB3(JSR-220)とHibernate3のメタデータをどちらもサポートしています。

source: This is an example of a POJO class annotated as an EJB entity bean:
ja_jp: 以下はEJBのエンティティビーンとして注釈されたPOJOクラスの例です。

source: Note that support for JDK 5.0 Annotations (and JSR-220) is still work in progress and not completed. Please refer to the Hibernate Annotations module for more details.
ja_jp: JDK5.0のアノテーション(とJSR-220)のサポートは進行中の作業であり、完全ではないことに注意してください。 さらに詳しい情報はHibernateのアノテーション・モジュールを参照してください。

source: Generated Properties
ja_jp: 生成プロパティ

source: Generated properties are properties which have their values generated by the database. Typically, Hibernate applications needed to <literal>refresh</literal> objects which contain any properties for which the database was generating values. Marking properties as generated, however, lets the application delegate this responsibility to Hibernate. Essentially, whenever Hibernate issues an SQL INSERT or UPDATE for an entity which has defined generated properties, it immediately issues a select afterwards to retrieve the generated values.
ja_jp: 生成プロパティとは、データベースによって生成された値を持つプロパティです。 通常、Hibernateアプリケーションは、データベースが値を生成したプロパティを含むオブジェクトを <literal>リフレッシュ</literal> する必要がありました。 しかし、プロパティが生成されたということをマークすることで、 アプリケーションはリフレッシュの責任をHibernateに委譲します。 基本的に、生成プロパティを持つと定義したエンティティに対して HibernateがINSERTやUPDATEのSQLを発行した後すぐに、 生成された値を読み込むための SELECT SQL が発行されます。

source: Properties marked as generated must additionally be non-insertable and non-updateable. Only <link linkend="mapping-declaration-version">versions</link>, <link linkend="mapping-declaration-timestamp">timestamps</link>, and <link linkend="mapping-declaration-property">simple properties</link> can be marked as generated.
ja_jp: 生成プロパティは、挿入不可能かつ更新不可能でなければなりません。 <xref linkend="mapping-declaration-version">versions</xref> 、 <xref linkend="mapping-declaration-timestamp">timestamps</xref> 、 <xref linkend="mapping-declaration-property">simple properties</xref> だけが生成されたとマークできます。
pt_br: Properties marked as generated must additionally be non-insertable and non-updateable. Only <xref linkend="mapping-declaration-version">versions</xref>, <xref linkend="mapping-declaration-timestamp">timestamps</xref>, and <xref linkend="mapping-declaration-property">simple properties</xref> can be marked as generated.

source: <literal>never</literal> (the default) - means that the given property value is not generated within the database.
ja_jp: <literal>never</literal> (デフォルト) - 与えられたプロパティの値は、 データベースから生成されないことを意味します。

source: <literal>insert</literal> - states that the given property value is generated on insert, but is not regenerated on subsequent updates. Things like created-date would fall into this category. Note that even thought <link linkend="mapping-declaration-version">version</link> and <link linkend="mapping-declaration-timestamp">timestamp</link> properties can be marked as generated, this option is not available there...
ja_jp: <literal>insert</literal> - 与えられたプロパティの値は挿入時に生成されるが、 続いて起こる更新時には生成されないこと示します。 作成された日付などは、このカテゴリに分類されます。 <xref linkend="mapping-declaration-version">version</xref> や <xref linkend="mapping-declaration-timestamp">timestamp</xref> の プロパティは生成されたとマークできますが、このオプションは利用できないことに注意してください。
pt_br: <literal>insert</literal> - states that the given property value is generated on insert, but is not regenerated on subsequent updates. Things like created-date would fall into this category. Note that even thought <xref linkend="mapping-declaration-version">version</xref> and <xref linkend="mapping-declaration-timestamp">timestamp</xref> properties can be marked as generated, this option is not available there...

source: <literal>always</literal> - states that the property value is generated both on insert and on update.
ja_jp: <literal>always</literal> - 挿入時も更新時もプロパティの値が生成されることを示します。

source: Auxiliary Database Objects
ja_jp: 補助的なデータベース・オブジェクト

source: Allows CREATE and DROP of arbitrary database objects, in conjunction with Hibernate's schema evolution tools, to provide the ability to fully define a user schema within the Hibernate mapping files. Although designed specifically for creating and dropping things like triggers or stored procedures, really any SQL command that can be run via a <literal>java.sql.Statement.execute()</literal> method is valid here (ALTERs, INSERTS, etc). There are essentially two modes for defining auxiliary database objects...
ja_jp: Hibernateのスキーマ・エボリューションツールと連動することで、 任意のデータベース・オブジェクト（トリガーやストアドプロシージャなど）のCREATEとDROPにより、 Hibernateのマッピングファイル内のユーザ・スキーマをすべて定義することが出来ます。 主にトリガやストアドプロシージャのようなデータベース・オブジェクトを生成や削除することを意図していますが、 実際には <literal>java.sql.Statement.execute()</literal> メソッドによって実行できる 任意のSQLコマンド（ALTER、INSERTなど）が実行できます。 補助的なデータベース・オブジェクトを定義するための、2つの基本的な方法があります。

source: The first mode is to explicitly list the CREATE and DROP commands out in the mapping file:
ja_jp: 1つ目の方法は、CREATEとDROPコマンドをマッピングファイルの外に、明示的に記載することです。

source: The second mode is to supply a custom class which knows how to construct the CREATE and DROP commands. This custom class must implement the <literal>org.hibernate.mapping.AuxiliaryDatabaseObject</literal> interface.
ja_jp: 2つ目の方法は、CREATEとDROPコマンドの組み立て方を知っているカスタムクラスを提供することです。 このカスタムクラスは <literal>org.hibernate.mapping.AuxiliaryDatabaseObject</literal> インタフェースを 実装しなければなりません。

source: Additionally, these database objects can be optionally scoped such that they only apply when certain dialects are used.
ja_jp: さらに、あるデータベース方言が使用される時にだけ適用するといったように、 データベース・オブジェクトが使われるケースを限定できます。

source: <literal>entity-name</literal> (optional): The entity name of the associated class.
pt_br: <literal>entity-name</literal> (opcional): O nome da entidade da classe associada.

source: one-to-one
pt_br: one-to-one (um-pra-um)

source: component, dynamic-component
pt_br: componente, componente dinâmico

source: <literal>insert</literal>: Do the mapped columns appear in SQL <literal>INSERT</literal>s?
pt_br: <literal>insert</literal>: As colunas mapeadas aparecem nos SQL de <literal>INSERT</literal>s?

source: <literal>update</literal>: Do the mapped columns appear in SQL <literal>UPDATE</literal>s?
pt_br: <literal>update</literal>: As colunas mapeadas aparecem nos SQL de <literal>UPDATE</literal>s?

source: properties
pt_br: propriedades

source: subclass
pt_br: subclass (subclasse)
