Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: ja_jp, pt_br

source: <literal>cascade</literal> (optional- defaults to <literal>none</literal>): the cascade style.
ja_jp: <literal>cascade</literal>（オプション - デフォルトは <literal>none</literal> ）： カスケードのスタイル。
pt_br: <literal>cascade</literal> (opcional – valor default <literal>none</literal>): o estilo do cascade.

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this property do or do not require acquisition of the optimistic lock. In other words, define if a version increment should occur if this property is dirty.
ja_jp: <literal>optimistic-lock</literal> (オプション - デフォルトは <literal>true</literal> ): このプロパティの更新に楽観ロックの取得を要求するかどうかを指定します。 言い換えれば、このプロパティがダーティであるときにバージョンを増やすべきかを定義します。
pt_br: <literal>optimistic-lock</literal> (opcional - valor default<literal>true</literal>): Especifica que as atualizações para esta propriedade requerem ou não aquisição da trava otimista. Em outras palavras, define se uma versão de incremento deve ocorrer se esta propriedade está modificada.

source: Hibernate Types
ja_jp: Hibernateの型
pt_br: Tipos do Hibernate

source: Entities and values
ja_jp: エンティティと値
pt_br: Entidades e valores

source: To understand the behaviour of various Java language-level objects with respect to the persistence service, we need to classify them into two groups:
ja_jp: 永続サービスに関わる様々なJava言語レベルのオブジェクトの振る舞いを理解するためには、 オブジェクトを2つのグループに分ける必要があります：
pt_br: Para entender o comportamento de vários objetos em nível de linguagem de Java a respeito do serviço de persistência, nós precisamos classificá-los em dois grupos.

source: An <emphasis>entity</emphasis> exists independently of any other objects holding references to the entity. Contrast this with the usual Java model where an unreferenced object is garbage collected. Entities must be explicitly saved and deleted (except that saves and deletions may be <emphasis>cascaded</emphasis> from a parent entity to its children). This is different from the ODMG model of object persistence by reachablity - and corresponds more closely to how application objects are usually used in large systems. Entities support circular and shared references. They may also be versioned.
ja_jp: <emphasis> エンティティ</emphasis> はエンティティへの参照を保持する、 他のすべてのオブジェクトから独立して存在します。 参照されないオブジェクトがガベージコレクトされてしまう性質を持つ通常のJavaモデルと、 これを比べてみてください。 （親エンティティから子へ、セーブと削除が <emphasis>カスケード</emphasis> されうることを除いて） エンティティは明示的にセーブまたは削除されなければなりません。 これは到達可能性によるオブジェクト永続化のODMGモデルとは異なっています。 大規模なシステムでアプリケーションオブジェクトが普通どのように使われるかにより密接に対応します。 エンティティは循環と参照の共有をサポートします。 またそれらはバージョン付けすることもできます。
pt_br: Uma <emphasis>entidade </emphasis> existe independentemente de qualquer outro objeto guardando referências para a entidade. Em contraste com o modelo usual de Java que um objeto não referenciado é coletado pelo garbage collector. Entidades devem ser explicitamente salvas ou deletada (exceto em operações de salvamento ou deleção que possam ser executada em <emphasis>cascata</emphasis> de uma entidade pai para seus filhos). Isto é diferente do modelo ODMG de persistência do objeto por acessibilidade – e corresponde quase a como objetos de aplicações são geralmente usados em grandes sistemas. Entidades suportam referências circulares e comuns. Eles podem ser versionadas.

source: An entity's persistent state consists of references to other entities and instances of <emphasis>value</emphasis> types. Values are primitives, collections (not what's inside a collection), components and certain immutable objects. Unlike entities, values (in particular collections and components) <emphasis>are</emphasis> persisted and deleted by reachability. Since value objects (and primitives) are persisted and deleted along with their containing entity they may not be independently versioned. Values have no independent identity, so they cannot be shared by two entities or collections.
ja_jp: エンティティの永続状態は他のエンティティや <emphasis>値</emphasis> 型の インスタンスへの参照から構成されます。 値はプリミティブ、コレクション(コレクションの内部ではなく)、 コンポーネント、不変オブジェクトです。 エンティティとは違い、値は（特にコレクションとコンポーネントにおいて）、 到達可能性による永続化や削除が <emphasis>行われます</emphasis> 。 値オブジェクト（とプリミティブ）は、包含するエンティティと一緒に永続化や削除が行われるので、 それらを独立にバージョン付けすることはできません。 値には独立したアイデンティティがないので、 複数のエンティティやコレクションがこれを共有することはできません。
pt_br: Uma entidade em estado persistente consiste de referências para outras entidades e instâncias de tipos de <emphasis>valor</emphasis>. Valores são primitivos, coleções (não o que tem dentro de uma coleção), componentes e certos objetos imutáveis. Entidades distintas, valores (em coleções e componentes particulares) <emphasis>são </emphasis> persistidos e apagados por acessibilidade. Visto que objetos value (e primitivos) são persistidos e apagados junto com as entidades que os contém e não podem ser versionados independentemente. Valores têm identidade não independente, assim eles não podem ser comuns para duas entidades ou coleções.

source: Up until now, we've been using the term "persistent class" to refer to entities. We will continue to do that. Strictly speaking, however, not all user-defined classes with persistent state are entities. A <emphasis>component</emphasis> is a user defined class with value semantics. A Java property of type <literal>java.lang.String</literal> also has value semantics. Given this definition, we can say that all types (classes) provided by the JDK have value type semantics in Java, while user-defined types may be mapped with entity or value type semantics. This decision is up to the application developer. A good hint for an entity class in a domain model are shared references to a single instance of that class, while composition or aggregation usually translates to a value type.
ja_jp: これまで「永続クラス」という言葉をエンティティの意味で使ってきました。 これからもそうしていきます。 厳密に言うと、永続状態を持つユーザ定義のクラスのすべてが エンティティというわけではありません。 <emphasis>コンポーネント</emphasis> は値のセマンティクスを持つユーザ定義クラスです。 <literal>java.lang.String</literal> 型のプロパティもまた値のセマンティクスを持ちます。 定義するなら、JDKで提供されているすべてのJavaの型(クラス)が値のセマンティクスを持つといえます。 一方ユーザ定義型は、エンティティや値型のセマンティクスとともにマッピングできます。 この決定はアプリケーション開発者次第です。 そのクラスの１つのインスタンスへの共有参照は、 ドメインモデル内のエンティティクラスに対する良いヒントになります。 一方合成集約や集約は、通常値型へ変換されます。
pt_br: Até agora, nós estivemos usando o termo "classe persistente" para referir a entidades. Nós iremos continuar a fazer isto. Falando a rigor, porém, nem todas as classes definidas pelo usuário com estados persistentes são entidades. Um <emphasis>componente</emphasis> é uma classe de usuário definida com valores semânticos. Uma propriedade de Java de tipo <literal>java.lang.String</literal> também tem um valor semêntico. Dada esta definição, nós podemos dizer que todos os tipos (classes) fornecida pelo JDK tem tipo de valor semântico em Java, enquanto que tipos definidos pelo usuário pode ser mapeados com entidade ou valor de tipo semântico. Esta decisão pertence ao desenvolvedor da aplicação. Uma boa dica para uma classe entidade em um modelo de domínio são referências comuns para uma instância simples daquela classe, enquanto a composição ou agregação geralmente se traduz para um valor de tipo.

source: We'll revisit both concepts throughout the documentation.
ja_jp: 本ドキュメントを通して、何度もこの概念を取り上げます。
pt_br: Nós iremos rever ambos os conceitos durante toda a documentação.

source: The challenge is to map the Java type system (and the developers' definition of entities and value types) to the SQL/database type system. The bridge between both systems is provided by Hibernate: for entities we use <literal>&lt;class&gt;</literal>, <literal>&lt;subclass&gt;</literal> and so on. For value types we use <literal>&lt;property&gt;</literal>, <literal>&lt;component&gt;</literal>, etc, usually with a <literal>type</literal> attribute. The value of this attribute is the name of a Hibernate <emphasis>mapping type</emphasis>. Hibernate provides many mappings (for standard JDK value types) out of the box. You can write your own mapping types and implement your custom conversion strategies as well, as you'll see later.
ja_jp: Java型のシステム(もしくは開発者が定義したエンティティと値型)を SQL/データベース型のシステムにマッピングすることは難しいです。 Hibernateは２つのシステムの架け橋を提供します。 エンティティに対しては <literal>&lt;class&gt;</literal> や <literal>&lt;subclass&gt;</literal> などを使用します。 値型に対しては <literal>&lt;property&gt;</literal> や <literal>&lt;component&gt;</literal> などを、通常 <literal>type</literal> とともに使います。 この属性の値はHibernateの <emphasis>マッピング型</emphasis> の名前です。 Hibernateは(標準JDKの値型に対して)多くの自由なマッピングを提供します。 後で見るように、自身のマッピング型を記述し、同様にカスタムの変換戦略を実装することができます。
pt_br: O desafio pe mapear o sistema de tipo de Java (e a definição do desenvolvedor de entidades e tipos de valor) para o sistema de tipo SQL/banco de dados. A ponte entre ambos os sistemas é fornecido pelo Hibernate: para entidades que usam <literal>&lt;class&gt;</literal>, <literal>&lt;subclass&gt;</literal> e assim por diante. Para tipos de valores nós usamos <literal>&lt;property&gt;</literal>, <literal>&lt;component&gt;</literal>, etc, geralmente com um atributo <literal>type</literal>. O valor deste atributo é o nome de um <emphasis>tipo de mapeamento</emphasis> do Hibernate. O Hibernate fornece muitos mapeamentos (para tipos de valores do JDK padrão) ut of the box. Você pode escrever os seus próprios tipos de mapeamentos e implementar sua estratégia de conversão adaptada, como você verá adiante.

source: All built-in Hibernate types except collections support null semantics.
ja_jp: コレクションを除く組み込みのHibernateの型はすべて、nullセマンティクスをサポートします。
pt_br: Todos os tipos internos do hibernate exceto coleções suportam semânticas nulas.

source: Basic value types
ja_jp: 基本的な型
pt_br: Valores de tipos básicos

source: Type mappings from Java primitives or wrapper classes to appropriate (vendor-specific) SQL column types. <literal>boolean, yes_no</literal> and <literal>true_false</literal> are all alternative encodings for a Java <literal>boolean</literal> or <literal>java.lang.Boolean</literal>.
ja_jp: Javaのプリミティブやラッパークラスから適切な（ベンダー固有の） SQLカラム型への型マッピング。 <literal>boolean, yes_no</literal> と <literal>true_false</literal> は、 すべてJavaの <literal>boolean</literal> または <literal>java.lang.Boolean</literal> の代替エンコードです。
pt_br: Tipos de mapeamentos de classes primitivas ou wrapper Java especificos (vendor-specific) para tipos de coluna SQL. Boolean, <literal>boolean, yes_no</literal> são todas codificações alternativas para um <literal>boolean</literal> ou <literal>java.lang.Boolean</literal> do Java.

source: A type mapping from <literal>java.lang.String</literal> to <literal>VARCHAR</literal> (or Oracle <literal>VARCHAR2</literal>).
ja_jp: <literal>java.lang.String</literal> から <literal>VARCHAR</literal> （またはOracleの <literal>VARCHAR2</literal> ）への型マッピング。
pt_br: Um tipo de mapeamento de <literal>java.lang.String</literal> para <literal>VARCHAR</literal> (ou <literal>VARCHAR2</literal> no Oracle).

source: Type mappings from <literal>java.util.Date</literal> and its subclasses to SQL types <literal>DATE</literal>, <literal>TIME</literal> and <literal>TIMESTAMP</literal> (or equivalent).
ja_jp: <literal>java.util.Date</literal> とそのサブクラスからSQL型の <literal>DATE</literal>, <literal>TIME</literal> , <literal>TIMESTAMP</literal> （またはそれらと等価なもの） への型マッピング。
pt_br: Tipos de mapeamento de <literal>java.util.Date</literal> e suas subclasses para os tipos SQL <literal>DATE</literal>, <literal>TIME</literal> e <literal>TIMESTAMP</literal> (ou equivalente).

source: Type mappings from <literal>java.util.Calendar</literal> to SQL types <literal>TIMESTAMP</literal> and <literal>DATE</literal> (or equivalent).
ja_jp: <literal>java.util.Calendar</literal> からSQL型 の「 <literal>TIMESTAMP</literal> , <literal>DATE</literal> (またはそれらと等価なもの）への型マッピング。
pt_br: Tipo de mapeamento de <literal>java.util.Calendar</literal> para os tipos SQL <literal>TIMESTAMP</literal> e <literal>DATE</literal> (ou equivalente).

source: Type mappings from <literal>java.math.BigDecimal</literal> and <literal>java.math.BigInteger</literal> to <literal>NUMERIC</literal> (or Oracle <literal>NUMBER</literal>).
ja_jp: <literal>java.math.BigDecimal</literal> と <literal>java.math.BigInteger</literal> から <literal>NUMERIC</literal>（またはOracleの <literal>NUMBER</literal> ）への型マッピング。
pt_br: Tipo de mapeamento de <literal>java.math.BigDecimal</literal> and <literal>java.math.BigInteger</literal> para <literal>NUMERIC</literal> (ou <literal>NUMBER</literal> no Oracle).

source: Type mappings from <literal>java.util.Locale</literal>, <literal>java.util.TimeZone</literal> and <literal>java.util.Currency</literal> to <literal>VARCHAR</literal> (or Oracle <literal>VARCHAR2</literal>). Instances of <literal>Locale</literal> and <literal>Currency</literal> are mapped to their ISO codes. Instances of <literal>TimeZone</literal> are mapped to their <literal>ID</literal>.
ja_jp: <literal>java.util.Locale</literal> , <literal>java.util.TimeZone</literal> , <literal>java.util.Currency</literal> から <literal>VARCHAR</literal> （またはOracleの <literal>VARCHAR2</literal> ）への型マッピング。 <literal>Locale</literal> と <literal>Currency</literal> のインスタンスは、 それらのISOコードにマッピングされます。 <literal>TimeZone</literal> のインスタンスは、 それらの <literal>ID</literal> にマッピングされます。
pt_br: Tipos de mapeamentos de <literal>java.util.Locale</literal>, <literal>java.util.TimeZone</literal> e <literal>java.util.Currency</literal> para <literal>VARCHAR</literal> (ou <literal>VARCHAR2</literal> no Oracle). Instâncias de f <literal>Locale</literal> e <literal>Currency</literal> são mapeados para seus códigos ISO. Instâncias de <literal>TimeZone</literal> são mapeados para seu <literal>ID</literal>.

source: A type mapping from <literal>java.lang.Class</literal> to <literal>VARCHAR</literal> (or Oracle <literal>VARCHAR2</literal>). A <literal>Class</literal> is mapped to its fully qualified name.
ja_jp: <literal>java.lang.Class</literal> から <literal>VARCHAR</literal> （またはOracleの <literal>VARCHAR2</literal> ）への型マッピング。 <literal>Class</literal> はその完全修飾された名前にマッピングされます。
pt_br: um tipo de mapeamento de <literal>java.lang.Class</literal> para <literal>VARCHAR</literal> (ou <literal>VARCHAR2</literal> no Oracle). Uma <literal>Class</literal> é mapeada pelo seu nome qualificado (completo).

source: Maps byte arrays to an appropriate SQL binary type.
ja_jp: バイト配列は、適切なSQLのバイナリ型にマッピングされます。
pt_br: Mapeia arrays de bytes para um tipo binário de SQL apropriado.

source: Maps long Java strings to a SQL <literal>CLOB</literal> or <literal>TEXT</literal> type.
ja_jp: 長いJava文字列は、SQLの <literal>CLOB</literal> または <literal>TEXT</literal> 型にマッピングされます。
pt_br: Maps long Java strings to a SQL <literal>CLOB</literal> or <literal>TEXT</literal> type. Mapeia strings longas de Java para um tipo SQL <literal>CLOB</literal> ou <literal>TEXT</literal>.

source: Maps serializable Java types to an appropriate SQL binary type. You may also indicate the Hibernate type <literal>serializable</literal> with the name of a serializable Java class or interface that does not default to a basic type.
ja_jp: シリアライズ可能なJava型は、適切なSQLのバイナリ型にマッピングされます。 デフォルトで基本型ではないシリアライズ可能なJavaクラスや インターフェイスの名前を指定することで、 Hibernateの型を <literal>serializable</literal> とすることもできます。
pt_br: Mapeia tipos Java serializáveis para um tipo binário SQL apropriado. Você pode também indicar o tipo <literal>serializable</literal> do Hibernate com o nome da classe ou interface Java serializável que não é padrão para um tipo básico.

source: Type mappings for the JDBC classes <literal>java.sql.Clob</literal> and <literal>java.sql.Blob</literal>. These types may be inconvenient for some applications, since the blob or clob object may not be reused outside of a transaction. (Furthermore, driver support is patchy and inconsistent.)
ja_jp: JDBCクラス <literal>java.sql.Clob</literal> と <literal>java.sql.Blob</literal> に対する型マッピング。 blobやclobオブジェクトはトランザクションの外では再利用できないため、 アプリケーションによっては不便かもしれません。 （さらにはドライバサポートが一貫していません。）
pt_br: Tipos de mapeamentos para as classes JDBC <literal>java.sql.Clob</literal> and <literal>java.sql.Blob</literal>. Estes tipos podem ser inconveniente para algumas aplicações, visto que o objeto blob ou clob pode não ser reusado fora de uma transação. (Além disso, o suporte de driver é imcompleto e inconsistente.)

source: Type mappings for what are usually considered mutable Java types, where Hibernate makes certain optimizations appropriate only for immutable Java types, and the application treats the object as immutable. For example, you should not call <literal>Date.setTime()</literal> for an instance mapped as <literal>imm_timestamp</literal>. To change the value of the property, and have that change made persistent, the application must assign a new (nonidentical) object to the property.
ja_jp: ほとんどの場合に可変であるJavaの型に対する型マッピング。 Hibernateは不変なJavaの型に対しては最適化を行い、 アプリケーションはそれを不変オブジェクトとして扱います。 例えば <literal>imm_timestamp</literal> としてマップしたインスタンスに対して、 <literal>Date.setTime()</literal> を呼び出してはなりません。 プロパティの値を変更しその変更を永続化するためには、 アプリケーションはプロパティに対して新しい(同一でない)オブジェクトを割り当てなければなりません。
pt_br: Mapeando tipos para o que geralmente são consideradas tipos mutáveis de Java, onde o Hibernate faz determinadas otimizações apropriadas somente para tipos imutáveis de Java, e a aplicação trata o objeto como imutável. Por exemplo, você não deve chamar <literal>Date.setTime()</literal> para uma instância mapeada como <literal>imm_timestamp</literal>. Para mudar o valor da propriedade, e ter a mudança feita persistente, a aplicação deve atribuir um novo objeto (nonidentical) à propriedade.

source: Unique identifiers of entities and collections may be of any basic type except <literal>binary</literal>, <literal>blob</literal> and <literal>clob</literal>. (Composite identifiers are also allowed, see below.)
ja_jp: エンティティとコレクションのユニークな識別子は、<literal>binary</literal> , <literal>blob</literal> , <literal>clob</literal> を除く、どんな基本型でも構いません。 （複合識別子でも構いません。以下を見てください。）
pt_br: Identificadores únicos das entidades e coleções podem ser de qualquer tipo básico exceto <literal>binary</literal>, <literal>blob</literal> ou <literal>clob</literal>. (Identificadores compostos também são permitidos, veja abaixo.)

source: The basic value types have corresponding <literal>Type</literal> constants defined on <literal>org.hibernate.Hibernate</literal>. For example, <literal>Hibernate.STRING</literal> represents the <literal>string</literal> type.
ja_jp: 基本的な値型には、<literal>org.hibernate.Hibernate</literal> で定義された <literal>Type</literal> 定数がそれぞれあります。 例えば、<literal>Hibernate.STRING</literal> は <literal>string</literal> 型を表現しています。
pt_br: Os tipos de valores básicos têm suas constantes <literal>Type</literal> correspondentes definidas em <literal>org.hibernate.Hibernate</literal>. Por exemplo, <literal>Hibernate.STRING</literal> representa o tipo <literal>string</literal>.

source: Custom value types
ja_jp: カスタム型
pt_br: Tipos de valores personalizados

source: It is relatively easy for developers to create their own value types. For example, you might want to persist properties of type <literal>java.lang.BigInteger</literal> to <literal>VARCHAR</literal> columns. Hibernate does not provide a built-in type for this. But custom types are not limited to mapping a property (or collection element) to a single table column. So, for example, you might have a Java property <literal>getName()</literal>/<literal>setName()</literal> of type <literal>java.lang.String</literal> that is persisted to the columns <literal>FIRST_NAME</literal>, <literal>INITIAL</literal>, <literal>SURNAME</literal>.
ja_jp: 開発者が独自の値型を作成することは、比較的簡単です。 例えば、<literal>java.lang.BigInteger</literal> 型のプロパティを <literal>VARCHAR</literal> カラムに永続化したいかもしれません。 Hibernateはこのための組み込み型を用意していません。 しかしカスタム型は、プロパティ（またはコレクションの要素）を1つのテーブルカラムに マッピングするのに制限はありません。 そのため例えば、<literal>java.lang.String</literal> 型の <literal>getName()</literal> / <literal>setName()</literal> Javaプロパティを <literal>FIRST_NAME</literal> , <literal>INITIAL</literal>, <literal>SURNAME</literal> カラムに永続化できます。
pt_br: É relativamente fácil para desenvolvedores criar seus próprios tipos de valor. Por exemplo, você pode querer persistir propriedades do tipo <literal>java.lang.BigInteger</literal> para colunas <literal>VARCHAR</literal>. O Hibernate não fornece um tipo correspondente para isso. Mas os tipos adaptados não são limitados a mapeamento de uma propriedade (ou elemento de coleção) a uma única coluna da tabela. Assim, por exemplo, você pôde ter uma propriedade Java <literal>getName()</literal>/<literal>setName()</literal> do tipo <literal>java.lang.String</literal> que é persistido para colunas <literal>FIRST_NAME</literal>, <literal>INITIAL</literal>, <literal>SURNAME</literal>.

source: To implement a custom type, implement either <literal>org.hibernate.UserType</literal> or <literal>org.hibernate.CompositeUserType</literal> and declare properties using the fully qualified classname of the type. Check out <literal>org.hibernate.test.DoubleStringType</literal> to see the kind of things that are possible.
ja_jp: カスタム型を実装するには、<literal>org.hibernate.UserType</literal> または <literal>org.hibernate.CompositeUserType</literal> を実装し、 型の完全修飾された名前を使ってプロパティを定義します。 どのような種類のものが可能かを調べるには、 <literal>org.hibernate.test.DoubleStringType</literal> を確認してください。
pt_br: Para implementar um tipo personalizado, implemente <literal>org.hibernate.UserType</literal> or <literal>org.hibernate.CompositeUserType</literal> e declare propriedades usando o nome qualificado da classe do tipo. Veja <literal>org.hibernate.test.DoubleStringType</literal> para ver o tipo das coisas que são possíveis.

source: Notice the use of <literal>&lt;column&gt;</literal> tags to map a property to multiple columns.
ja_jp: <literal>&lt;column&gt;</literal> タグで、 プロパティを複数のカラムへマッピングできることに注目してください。
pt_br: Observe o uso da tag <literal>&lt;column&gt;</literal> para mapear uma propriedade para colunas múltiplas.

source: The <literal>CompositeUserType</literal>, <literal>EnhancedUserType</literal>, <literal>UserCollectionType</literal>, and <literal>UserVersionType</literal> interfaces provide support for more specialized uses.
ja_jp: <literal>CompositeUserType</literal> , <literal>EnhancedUserType</literal> , <literal>UserCollectionType</literal> , <literal>UserVersionType</literal> インターフェイスは、より特殊な使用法に対してのサポートを提供します。
pt_br: As interfaces <literal>CompositeUserType</literal>, <literal>EnhancedUserType</literal>, <literal>UserCollectionType</literal>, e <literal>UserVersionType</literal> fornecem suporte para usos mais especializados.

source: You may even supply parameters to a <literal>UserType</literal> in the mapping file. To do this, your <literal>UserType</literal> must implement the <literal>org.hibernate.usertype.ParameterizedType</literal> interface. To supply parameters to your custom type, you can use the <literal>&lt;type&gt;</literal> element in your mapping files.
ja_jp: マッピングファイル内で <literal>UserType</literal> へパラメータを提供できます。 このためには、<literal>UserType</literal> は <literal>org.hibernate.usertype.ParameterizedType</literal> を実装しなくてはなりません。 カスタム型パラメータを提供するために、 マッピングファイル内で <literal>&lt;type&gt;</literal> 要素を使用できます。
pt_br: Você pode mesmo fornecer parâmetros a um <literal>UserType</literal> no arquivo de mapeamento. Para isto, seu <literal>UserType</literal> deve implementar a interface <literal>org.hibernate.usertype.ParameterizedType</literal>. Para fornecer parâmetros a seu tipo personalizado, você pode usar o elemento <literal>&lt;type&gt;</literal> em seus arquivos de mapeamento.

source: The <literal>UserType</literal> can now retrieve the value for the parameter named <literal>default</literal> from the <literal>Properties</literal> object passed to it.
ja_jp: <literal>UserType</literal> は、 引数として渡された <literal>Properties</literal> オブジェクトから、 <literal>default</literal> で指定したパラメータに対する値を検索することができます。
pt_br: O <literal>UserType</literal> pode agora recuperar o valor para o parâmetro chamado <literal>default</literal> da <literal>Propriedade</literal> do passado a ele.
