Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: ja_jp, pt_br

source: <literal>insert</literal> (optional - defaults to <literal>true</literal>): Specifies whether the version column should be included in SQL insert statements. May be set to <literal>false</literal> if and only if the database column is defined with a default value of <literal>0</literal>.
ja_jp: <literal>insert</literal> (オプション - デフォルトは <literal>true</literal> ): SQLのinsert文にバージョン・カラムを含めるべきかどうかを指定します。 もしデータベース・カラムのデフォルト値が <literal>0</literal> と定義されるときには、 <literal>false</literal> に設定すると良いでしょう。
pt_br: <literal>insert</literal> (opcional - valor default para <literal>true</literal>): Especifica se a coluna de versão deve ser incluída no comando SQL de insert. Pode ser configurado como <literal>false</literal> se a coluna do banco de dados está definida com um valor default de <literal>0</literal>.

source: Version numbers may be of Hibernate type <literal>long</literal>, <literal>integer</literal>, <literal>short</literal>, <literal>timestamp</literal> or <literal>calendar</literal>.
ja_jp: バージョン番号は Hibernateの <literal>long</literal> , <literal>integer</literal> , <literal>short</literal> , <literal>timestamp</literal> , <literal>calendar</literal> 型のいずれかです。
pt_br: Números de versão podem ser dos tipos Hibernate <literal>long</literal>, <literal>integer</literal>, <literal>short</literal>, <literal>timestamp</literal> ou <literal>calendar</literal>.

source: A version or timestamp property should never be null for a detached instance, so Hibernate will detect any instance with a null version or timestamp as transient, no matter what other <literal>unsaved-value</literal> strategies are specified. <emphasis>Declaring a nullable version or timestamp property is an easy way to avoid any problems with transitive reattachment in Hibernate, especially useful for people using assigned identifiers or composite keys!</emphasis>
ja_jp: バージョンやタイムスタンプのプロパティは、分離されたインスタンスに対してnullであってはなりません。 そのためどのような <literal>unsaved-value</literal> 戦略が指定されても、 Hibernateはnullのバージョンやタイムスタンプを持ったすべてのインスタンスを、 一時的なものであると判断します。 <emphasis> nullを許容するバージョンやタイムスタンプのプロパティを定義することは、 過渡的に一時オブジェクトとすることを防ぐ簡単な方法です。 特に識別子の割り当てや複合キーを使用しているときには特に有用です。</emphasis>
pt_br: A versão de uma propriedade timestamp nunca deve ser nula para uma instancia desconectada, assim o Hibernate irá identificar qualquer instância com uma versão nula ou timestamp como transiente, não importando qual estratégia para foi especificada para <literal>unsaved-value</literal>. <emphasis>Declarando uma versão nula ou a propriedade timestamp é um caminho fácil para tratar problemas com reconexões transitivas no Hibernate, especialmente úteis para pessoas utilizando identificadores assinaldados ou chaves compostas!</emphasis>

source: timestamp (optional)
ja_jp: timestamp（オプション）

source: The optional <literal>&lt;timestamp&gt;</literal> element indicates that the table contains timestamped data. This is intended as an alternative to versioning. Timestamps are by nature a less safe implementation of optimistic locking. However, sometimes the application might use the timestamps in other ways.
ja_jp: オプションの <literal>&lt;timestamp&gt;</literal> 要素は、 テーブルがタイムスタンプデータを含むことを示します。 これはバージョン付けの代わりの方法として用意されています。 タイムスタンプはもともと楽観的ロックにおける安全性の低い実装です。 しかしアプリケーションは異なる用途で使うこともあるかもしれません。
pt_br: O elemento opcional <literal>&lt;timestamp&gt;</literal> indica que uma tabela contém dados timestamped. Isso tem por objetivo dar uma alternativa para versionamento. Timestamps são por natureza uma implementação menos segura do locking otimista. Entretanto, algumas vezes a aplicação pode usar timestamps em outros caminhos.

source: <literal>column</literal> (optional - defaults to the property name): The name of a column holding the timestamp.
ja_jp: <literal>column</literal>（オプション - デフォルトはプロパティ名）： タイムスタンプを保持するカラムの名前。
pt_br: <literal>column</literal> (opcional - valor default para a propriedade name): O nome da coluna que mantem o timestamp.

source: <literal>name</literal>: The name of a JavaBeans style property of Java type <literal>Date</literal> or <literal>Timestamp</literal> of the persistent class.
ja_jp: <literal>name</literal> ： 永続クラスであるJava の <literal>Date</literal>型 または <literal>Timestamp</literal> 型 の、JavaBeansスタイルプロパティの名前。
pt_br: <literal>name</literal>: O nome da propriedade no estilo JavaBeans do tipo <literal>Date</literal> ou <literal>Timestamp</literal> da classe persistente Java.

source: <literal>unsaved-value</literal> (optional - defaults to <literal>null</literal>): A version property value that indicates that an instance is newly instantiated (unsaved), distinguishing it from detached instances that were saved or loaded in a previous session. (<literal>undefined</literal> specifies that the identifier property value should be used.)
ja_jp: <literal>unsaved-value</literal> （オプション - デフォルトは <literal>null</literal> ）： インスタンスが新しくインスタンス化された （セーブされていない）ことを示すバージョンプロパティの値。 以前のSessionでセーブまたはロードされた一時的なインスタンスと 区別するために使われます。 （ <literal>undefined</literal> と指定すると、 識別子プロパティの値が使われます。）
pt_br: <literal>unsaved-value</literal> (opcional - valor default <literal>null</literal>): Uma propriedade para a versão de que indica que uma instância é uma nova instanciada (unsaved), distinguindo-a de instancias desconectadas que foram salvas ou carregadas em sessões previas. (<literal>undefined</literal> especifica que um valor de propriedade de identificação deve ser utilizado)

source: <literal>source</literal> (optional - defaults to <literal>vm</literal>): From where should Hibernate retrieve the timestamp value? From the database, or from the current JVM? Database-based timestamps incur an overhead because Hibernate must hit the database in order to determine the "next value", but will be safer for use in clustered environments. Note also, that not all <literal>Dialect</literal>s are known to support retrieving of the database's current timestamp, while others might be unsafe for usage in locking due to lack of precision (Oracle 8 for example).
ja_jp: <literal>source</literal> (オプション - デフォルトは <literal>vm</literal> ): Hibernateはどこからタイムスタンプの値を取得するべきでしょうか？ データベースからでしょうか、現在のJVMからでしょうか？ データベースによるタイムスタンプは、Hibernateが"次の値"を決定するために データベースをヒットしなければならないため、オーバヘッドを招きます。 しかしクラスタ環境ではJVMから取得するより安全です。 データベースの現在のタイムスタンプの取得をサポートする すべての <literal>データベース方言</literal> が知られているわけではないことに 注意してください。また一方で、精密さを欠くために、 ロックで使用するには安全でないものもあります(例えばOracle 8)。
pt_br: <literal>source</literal> (opcional - valor default para <literal>vm</literal>): De onde o Hibernate deve recuperar o valor timestamp? Do banco de dados ou da JVM corrente? Timestamps baseados em banco de dados levam a um overhead porque o Hibernate precisa acessar o banco de dados para determinar o "próximo valor", mas é mais seguro para uso em ambientes de "cluster". Observe também, que nem todos <literal>Dialect</literal>s suportam a recuperação do timestamp corrente do banco de dados, enquando outros podem não ser seguros para utilização em bloqueios pela falta de precisão (Oracle 8 por exemplo)

source: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this timestamp property value is actually generated by the database. See the discussion of <link linkend="mapping-generated">generated properties</link>.
ja_jp: <literal>generated</literal> (オプション - デフォルトは <literal>never</literal> ): このタイムスタンプ・プロパティの値が、データベースによって生成されることを指定します。 <xref linkend="mapping-generated">生成プロパティ</xref> を参照してください。
pt_br: <literal>generated</literal> (opcional - valor default <literal>never</literal>): Especifica que o valor da propriedade timestamp é gerado pelo banco de dados. Veja a discussão <xref linkend="mapping-generated">generated properties</xref>.

source: Note that <literal>&lt;timestamp&gt;</literal> is equivalent to <literal>&lt;version type="timestamp"&gt;</literal>. And <literal>&lt;timestamp source="db"&gt;</literal> is equivalent to <literal>&lt;version type="dbtimestamp"&gt;</literal>
ja_jp: <literal>&lt;timestamp&gt;</literal> は <literal>&lt;version type="timestamp"&gt;</literal> と等価であることに注意してください。 <literal>&lt;timestamp source="db"&gt;</literal> は <literal>&lt;version type="dbtimestamp"&gt;</literal> と等価であることに注意してください。
pt_br: Observe que <literal>&lt;timestamp&gt;</literal> é equivalente a <literal>&lt;version type="timestamp"&gt;</literal>. E <literal>&lt;timestamp source="db"&gt;</literal> é equivalente a <literal>&lt;version type="dbtimestamp"&gt;</literal>.

source: The <literal>&lt;property&gt;</literal> element declares a persistent, JavaBean style property of the class.
ja_jp: <literal>&lt;property&gt;</literal> 要素は、クラスの永続的なJavaBeanスタイルのプロパティを定義します。
pt_br: O elemento <literal>&lt;property&gt;</literal> declara uma propriedade persistente de uma classe, no estilo JavaBean.

source: <literal>name</literal>: the name of the property, with an initial lowercase letter.
ja_jp: <literal>name</literal>：小文字で始まるプロパティ名。
pt_br: <literal>name</literal>: o nome da propriedade, iniciando com letra minúscula.

source: <literal>column</literal> (optional - defaults to the property name): the name of the mapped database table column. This may also be specified by nested <literal>&lt;column&gt;</literal> element(s).
ja_jp: <literal>column</literal>（オプション - デフォルトはプロパティ名）： マッピングされたデータベーステーブルのカラムの名前。 ネストした <literal>&lt;column&gt;</literal> 要素でも指定できます。
pt_br: <literal>column</literal> (opcional - default para a propriedade name): o nome da coluna mapeada do banco de dados, Isto pode também ser especificado pelo(s) elemento(s) <literal>&lt;column&gt;</literal> aninhados.

source: <literal>type</literal> (optional): a name that indicates the Hibernate type.
ja_jp: <literal>type</literal>（オプション）：Hibernateの型を示す名前。
pt_br: <literal>type</literal> (opcional): um nome que indica o tipo Hibernate.

source: <literal>update, insert</literal> (optional - defaults to <literal>true</literal>) : specifies that the mapped columns should be included in SQL <literal>UPDATE</literal> and/or <literal>INSERT</literal> statements. Setting both to <literal>false</literal> allows a pure "derived" property whose value is initialized from some other property that maps to the same colum(s) or by a trigger or other application.
ja_jp: <literal>update, insert</literal> （オプション - デフォルトは <literal>true</literal> ）： マッピングされたカラムがSQLの <literal>UPDATE</literal> や <literal>INSERT</literal> に含まれることを指定します。 両方とも <literal>false</literal> に設定すると、 同じカラムにマッピングされた他のプロパティやトリガや 他のアプリケーションによって初期化された純粋な「導出」プロパティが可能になります。
pt_br: <literal>update, insert</literal> (opcional - valor default <literal>true</literal>): especifica que as colunas mapeadas devem ser incluidas nas instruções SQL de <literal>UPDATE</literal> e/ou <literal>INSERT</literal> . Setar ambas para to <literal>false</literal> permite uma propridade "derivada" pura cujo valor é inicializado de outra propriedade que mapeie a mesma coluna(s) ou por uma trigger ou outra aplicação.

source: <literal>formula</literal> (optional): an SQL expression that defines the value for a <emphasis>computed</emphasis> property. Computed properties do not have a column mapping of their own.
ja_jp: <literal>formula</literal>（オプション）： <emphasis>計算</emphasis> プロパティのための値を定義するSQL式。 計算されたプロパティは自身のカラムへのマッピングがありません。
pt_br: <literal>formula</literal> (opcional): uma expressão SQL que definie o valor para uma propriedade <emphasis>calculada</emphasis>. Propriedades calculadas nao tem uma coluna de mapeamento para elas.

source: <literal>lazy</literal> (optional - defaults to <literal>false</literal>): Specifies that this property should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation).
ja_jp: <literal>lazy</literal> (optional - デフォルトは <literal>false</literal> ): インスタンス変数に最初にアクセスしたときに、プロパティを遅延して取得するよう指定します。 (バイトコード実装を作成する時間が必要になります)。
pt_br: <literal>lazy</literal> (opcional - valor default para <literal>false</literal>): Especifica que esta propriedade deve ser trazida de forma "lazy" quando a instancia da variável é acessada pela primeira vez (requer instrumentação bytecode em tempo de criação).

source: <literal>unique</literal> (optional): Enable the DDL generation of a unique constraint for the columns. Also, allow this to be the target of a <literal>property-ref</literal>.
ja_jp: <literal>unique</literal> (オプション):カラムにユニーク制約をつけるDDLの生成を可能にします。 また、<literal>property-ref</literal> のターゲットとすることもできます。
pt_br: <literal>unique</literal> (opcional): Habilita a geração de DDL de uma unica constraint para as colunas. Assim, permite que isto seja o alvo de uma <literal>property-ref</literal>.

source: <literal>not-null</literal> (optional): Enable the DDL generation of a nullability constraint for the columns.
ja_jp: <literal>not-null</literal> (オプション):カラムにnull値を許可するDDLの生成を可能にします。
pt_br: <literal>not-null</literal> (opcional): Habilita a geração de DDL de uma constraint de nulidade para as colunas.

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this property do or do not require acquisition of the optimistic lock. In other words, determines if a version increment should occur when this property is dirty.
ja_jp: <literal>optimistic-lock</literal> (オプション - デフォルトは <literal>true</literal> ): このプロパティの更新に楽観ロックの取得を要求するかどうかを指定します。 言い換えれば、このプロパティがダーティであるときにバージョンを増やすべきかを決定します。
pt_br: <literal>optimistic-lock</literal> (opcional - valor default <literal>true</literal>): Especifica se mudanças para esta propriedade requerem ou não bloqueio otimista. Em outras palavras, determina se um incremento de versão deve ocorrer quando esta propriedade está suja.

source: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this property value is actually generated by the database. See the discussion of <link linkend="mapping-generated">generated properties</link>.
ja_jp: <literal>generated</literal> (オプション - デフォルトは <literal>never</literal> ): プロパティの値が、データベースによって生成されたことを指定します。 <xref linkend="mapping-generated">生成プロパティ</xref> を参照してください。
pt_br: <literal>generated</literal> (opcional - valor default <literal>never</literal>): Especifica que o valor da propriedade é na verdade gerado pelo banco de dados. Veja a discussão da seção <xref linkend="mapping-generated">generated properties</xref>.

source: <emphasis>typename</emphasis> could be:
ja_jp: <emphasis>typename</emphasis> には以下の値が可能です：
pt_br: <emphasis>typename</emphasis> pode ser:

source: The name of a Hibernate basic type (eg. <literal>integer, string, character, date, timestamp, float, binary, serializable, object, blob</literal>).
ja_jp: Hibernateの基本型の名前（例 <literal>integer, string, character, date, timestamp, float, binary, serializable, object, blob</literal> ）。
pt_br: The name of a Hibernate basic type (eg. <literal>integer, string, character, date, timestamp, float, binary, serializable, object, blob</literal>). O nome do tipo basico do Hibernate (ex., <literal>integer, string, character, date, timestamp, float, binary, serializable, object, blob</literal>).

source: The name of a Java class with a default basic type (eg. <literal>int, float, char, java.lang.String, java.util.Date, java.lang.Integer, java.sql.Clob</literal>).
ja_jp: デフォルトの基本型のJavaクラス名 （例 <literal>int, float, char, java.lang.String, java.util.Date, java.lang.Integer, java.sql.Clob</literal> ）。
pt_br: O nome da classe Java com um tipo básico default (ex. <literal>int, float, char, java.lang.String, java.util.Date, java.lang.Integer, java.sql.Clob</literal>).

source: The name of a serializable Java class.
ja_jp: シリアライズ可能なJavaクラスの名前。
pt_br: O nome da classe Java serializable

source: The class name of a custom type (eg. <literal>com.illflow.type.MyCustomType</literal>).
ja_jp: カスタム型のクラス名（例 <literal>com.illflow.type.MyCustomType</literal> ）。
pt_br: O nome da classe de um tipo customizado (ex. <literal>com.illflow.type.MyCustomType</literal>).

source: If you do not specify a type, Hibernate will use reflection upon the named property to take a guess at the correct Hibernate type. Hibernate will try to interpret the name of the return class of the property getter using rules 2, 3, 4 in that order. However, this is not always enough. In certain cases you will still need the <literal>type</literal> attribute. (For example, to distinguish between <literal>Hibernate.DATE</literal> and <literal>Hibernate.TIMESTAMP</literal>, or to specify a custom type.)
ja_jp: 型を指定しなければ、Hibernateは正しいHibernateの型を推測するために、 指定されたプロパティに対してリフレクションを使います。 Hibernateはルール2, 3, 4をその順序に使い、 getterプロパティの返り値のクラスの名前を解釈しようとします。 しかしこれで常に十分であるとは限りません。 場合によっては、<literal>type</literal> 属性が必要な場合があります。 （例えば <literal>Hibernate.DATE</literal> と <literal>Hibernate.TIMESTAMP</literal> を区別するため、 またはカスタム型を指定するためなどです。）
pt_br: Se você não especificar um tipo, o Hibernate ira utilizar reflexão sobre a propriedade nomeada para ter uma idéia do tipo Hibernate correto. O Hibernate ira tentar interpretar o nome da classe retornada, usando as regras 2, 3 e 4 nesta ordem. Entretanto, isto não é sempre suficiente Em certos casos, você ainda irá necessitar do atributo <literal>type</literal>. (Por exemplo, para distinguir entre <literal>Hibernate.DATE</literal> ou <literal>Hibernate.TIMESTAMP</literal>, ou para espcificar uma tipo ciustomizado.)

source: The <literal>access</literal> attribute lets you control how Hibernate will access the property at runtime. By default, Hibernate will call the property get/set pair. If you specify <literal>access="field"</literal>, Hibernate will bypass the get/set pair and access the field directly, using reflection. You may specify your own strategy for property access by naming a class that implements the interface <literal>org.hibernate.property.PropertyAccessor</literal>.
ja_jp: <literal>access</literal> 属性で、 実行時にHibernateがどのようにプロパティにアクセスするかを制御できます。 デフォルトではHibernateはプロパティのget/setのペアをコールします。 <literal>access="field"</literal> と指定すれば、 Hibernateはリフレクションを使いget/setのペアを介さずに、直接フィールドにアクセスします。 インターフェイス <literal>org.hibernate.property.PropertyAccessor</literal> を 実装するクラスを指定することで、プロパティへのアクセスに独自の戦略を指定することができます。
pt_br: O atributo <literal>access</literal> permite voce controlar como o Hibernate irá acessar a propriedade em tempo de execução. Por default, o Hibernate irá chamar os métodos get/set da propriedades. Se voce especificar <literal>access="field"</literal>, o Hibernate ira bipassar os metodos get/set, acessnado o campo diretamente, usando reflexão. Voc epode especificar sua própria estratégia para acesso da propriedade criando uma classe que implemente a interface <literal>org.hibernate.property.PropertyAccessor</literal>.

source: An especially powerful feature are derived properties. These properties are by definition read-only, the property value is computed at load time. You declare the computation as a SQL expression, this translates to a <literal>SELECT</literal> clause subquery in the SQL query that loads an instance:
ja_jp: 特に強力な特徴は生成プロパティです。 これらのプロパティは当然読み取り専用であり、プロパティの値はロード時に計算されます。 計算をSQL式として宣言すると、このプロパティは インスタンスをロードするSQLクエリの <literal>SELECT</literal> 句のサブクエリに変換されます。
pt_br: Um recurso especialmente poderoso é o de propriedades derivadas. Estas propriedades são por definição read-only, e o valor da propriedade é calculado em tempo de execução. Você declara este calculo como uma expressão SQL, que traduz para clausula <literal>SELECT</literal> de uma subquery daquery SQL que carrega a instancia:

source: Note that you can reference the entities own table by not declaring an alias on a particular column (<literal>customerId</literal> in the given example). Also note that you can use the nested <literal>&lt;formula&gt;</literal> mapping element if you don't like to use the attribute.
ja_jp: 特定のカラム(例では <literal>customerId</literal> がそれにあたります)のエイリアスを宣言することなく、 エンティティ自身のテーブルを参照できることに注意してください。 もし属性を使用したくなければ、 ネストした <literal>&lt;formula&gt;</literal> マッピング要素を使えることにも注意してください。
pt_br: Observe que você pode referenciar as entidades da própria tabela, através da não declaração de um alias para uma coluna particular ( <literal>customerId</literal> no exemplo dado). Observe tambem que voce pode usar o mapeamento de elemento aninhado <literal>&lt;formula&gt;</literal>, se você não gostar de usar o atributo.

source: An ordinary association to another persistent class is declared using a <literal>many-to-one</literal> element. The relational model is a many-to-one association: a foreign key in one table is referencing the primary key column(s) of the target table.
ja_jp: 他の永続クラスへの通常の関連は <literal>many-to-one</literal> 要素を使って定義します。 リレーショナルモデルは多対一関連です。 つまりあるテーブルの外部キーは、ターゲットとなるテーブルの主キーカラムを参照しています。
pt_br: Uma associação ordinária para outra classe persistente é declarada usando o elemento <literal>many-to-one</literal>. O modelo relacional é uma associação many-to-one: a uma chave estrangeira de uma tabela referenciando a chave primaria da tabela destino.

source: <literal>name</literal>: The name of the property.
ja_jp: <literal>name</literal>：プロパティ名。
pt_br: <literal>name</literal>: O nome da propriedade.

source: <literal>cascade</literal> (optional): Specifies which operations should be cascaded from the parent object to the associated object.
ja_jp: <literal>cascade</literal>（オプション）： どの操作を、親オブジェクトから関連オブジェクトへとカスケードさせるかを指定します。
pt_br: <literal>cascade</literal> (opcional): Especifica quais operações dever ser em cascata do objeto pai para o objeto associado.

source: <literal>update, insert</literal> (optional - defaults to <literal>true</literal>) specifies that the mapped columns should be included in SQL <literal>UPDATE</literal> and/or <literal>INSERT</literal> statements. Setting both to <literal>false</literal> allows a pure "derived" association whose value is initialized from some other property that maps to the same colum(s) or by a trigger or other application.
ja_jp: <literal>update, insert</literal>（オプション - デフォルトは <literal>true</literal> ）： マッピングされたカラムがSQLの <literal>UPDATE</literal> または <literal>INSERT</literal> 文に含まれることを指定します。 両方とも <literal>false</literal> に設定すると、 その値が同じカラムにマッピングされた他のプロパティやトリガや 他のアプリケーションによって初期化された純粋な「導出」プロパティが可能になります。
pt_br: <literal>update, insert</literal> (opcional - valor default <literal>true</literal>): especifica que as colunas mapeadas dever ser incluidas em instruções SQL de <literal>UPDATE</literal> e/ou <literal>INSERT</literal>. Setando ambas para <literal>false</literal> você permite uma associação "derivada" pura cujos valores são inicializados de algumas outras propriedades que mapeiam a mesma coluna ou por uma trigger ou outra aplicação.

source: <literal>property-ref</literal>: (optional) The name of a property of the associated class that is joined to this foreign key. If not specified, the primary key of the associated class is used.
ja_jp: <literal>property-ref</literal>（オプション）： この外部キーに結合された関連クラスのプロパティ名。 何も指定しなければ、関連クラスの主キーが使われます。
pt_br: <literal>property-ref</literal>: (opcional) O nome da propriedade da classe associada que faz a junção desta foreign key. Se não especificada, a chave primaria da classe associada será utilizada.

source: <literal>unique</literal> (optional): Enable the DDL generation of a unique constraint for the foreign-key column. Also, allow this to be the target of a <literal>property-ref</literal>. This makes the association multiplicity effectively one to one.
ja_jp: <literal>unique</literal>（オプション）： 外部キーカラムに対してユニーク制約をつけたDDLの生成を可能にします。 また、<literal>property-ref</literal> のターゲットにすることもできます。 これにより関連の多重度を効果的に一対一にします。
pt_br: <literal>unique</literal> (opcional): Habilita a geração DDL de uma constraint unique para a coluna foreign-key. Alem disso, permite ser o alvo de uma <literal>property-ref</literal>. Isso torna a associação multipla efetivamente um para um.
