Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: ja_jp, pt_br

source: Basic O/R Mapping
ja_jp: 基本的なO/Rマッピング
pt_br: Mapeamento O/R Bassico

source: Mapping declaration
ja_jp: マッピング定義
pt_br: Declaração de mapeamento

source: Object/relational mappings are usually defined in an XML document. The mapping document is designed to be readable and hand-editable. The mapping language is Java-centric, meaning that mappings are constructed around persistent class declarations, not table declarations.
ja_jp: オブジェクト/リレーショナルマッピングは通常XMLドキュメントで定義します。 マッピングドキュメントは、読みやすく手作業で編集しやすいようにデザインされています。 マッピング言語はJava中心、つまりテーブル定義ではなく永続クラスの定義に基づいて構築されています。

source: Note that, even though many Hibernate users choose to write the XML by hand, a number of tools exist to generate the mapping document, including XDoclet, Middlegen and AndroMDA.
ja_jp: 多くのHibernateユーザはXMLマッピングの記述を手作業で行いますが、 XDoclet, Middlegen, AndroMDAというようなマッピングドキュメントを生成するツールが いくつか存在します。

source: Lets kick off with an example mapping:
ja_jp: サンプルのマッピングから始めましょう：

source: We will now discuss the content of the mapping document. We will only describe the document elements and attributes that are used by Hibernate at runtime. The mapping document also contains some extra optional attributes and elements that affect the database schemas exported by the schema export tool. (For example the <literal> not-null</literal> attribute.)
ja_jp: マッピングドキュメントの内容を説明します。。 ただし、ここではHibernateが実行時に使うドキュメント要素と属性についてのみ説明します。 マッピングドキュメントは、いくつかのオプション属性と要素を含んでいます（例えば <literal>not-null</literal> 属性）。 それらはスキーマエクスポートツールが出力するデータベーススキーマに影響を与えるものです。
pt_br: Discutir agora o conteúdo deste documento de mapeamento. Iremos apenas descrever os elementos do documento e atributos que são utilizados pelo Hibernate em tempo de execução. O documento de mapeamento também contém alguns atributos adicionais e opcionais além de elementos que afetam os esquemas de banco de dados exportados pela ferramenta de exportação de esquemas. (Por exemplo, o atributo <literal>not-null</literal>).

source: All XML mappings should declare the doctype shown. The actual DTD may be found at the URL above, in the directory <literal>hibernate-x.x.x/src/org/hibernate </literal> or in <literal>hibernate3.jar</literal>. Hibernate will always look for the DTD in its classpath first. If you experience lookups of the DTD using an Internet connection, check your DTD declaration against the contents of your claspath.
ja_jp: XMLマッピングでは、お見せしたようなドキュメント型を必ず定義すべきです。 実際のDTDは、上記のURLの <literal>hibernate-x.x.x/src/org/hibernate</literal> ディレクトリ、 または <literal>hibernate.jar</literal> 内にあります。 Hibernateは常に、そのクラスパス内でDTDを探し始めます。 インターネットにあるDTDファイルを探そうとしたなら、 クラスパスの内容を見て、DTD宣言を確認してください。
pt_br: Todos os mapeamentos de XML devem declarar o doctype exibido. O DTD atual pode ser encontrado na URL abaixo, no diretório <literal>hibernate-x.x.x/src/org/ hibernate </literal> ou no <literal>hibernate3.jar</literal>. O Hibernate sempre irá procurar pelo DTD inicialmente no seu classpath. Se você tentar localizar o DTD usando uma conexão de internet, compare a declaração do seu DTD com o conteúdo do seu classpath

source: EntityResolver
ja_jp: エンティティ・リゾルバ

source: As mentioned previously, Hibernate will first attempt to resolve DTDs in its classpath. The manner in which it does this is by registering a custom <literal>org.xml.sax.EntityResolver</literal> implementation with the SAXReader it uses to read in the xml files. This custom <literal>EntityResolver</literal> recognizes two different systemId namespaces.
ja_jp: 前述したように、Hibernateはまずクラスパス内でDTDを解決しようとします。 <literal>org.xml.sax.EntityResolver</literal> のカスタム実装を XMLファイルを読み込むためのSAXReaderに登録することによって、DTDを解決します。 このカスタムの <literal>EntityResolver</literal> は2つの異なるシステムID名前空間を認識します。

source: a <literal>hibernate namespace</literal> is recognized whenever the resolver encounteres a systemId starting with <literal>http://hibernate.sourceforge.net/</literal>; the resolver attempts to resolve these entities via the classlaoder which loaded the Hibernate classes.
ja_jp: <literal>Hibernate名前空間</literal> は、リゾルバが <literal>http://hibernate.sourceforge.net/</literal> で始まるシステムIDに到達したときに、 認識されます。 そしてリゾルバは、Hibernateのクラスをロードしたクラスローダを用いて、 これらのエンティティを解決しようとします。

source: a <literal>user namespace</literal> is recognized whenever the resolver encounteres a systemId using a <literal>classpath://</literal> URL protocol; the resolver will attempt to resolve these entities via (1) the current thread context classloader and (2) the classloader which loaded the Hibernate classes.
ja_jp: <literal>ユーザ名前空間</literal> は、リゾルバが URLプロトコルの <literal>classpath://</literal> を使ったシステムIDに到達したときに、 認識されます。そしてリゾルバは、(1)カレントスレッドのコンテキストクラスローダー、 または(2)Hibernateのクラスをロードしたクラスローダを使って、 これらのエンティティを解決しようとします。

source: An example of utilizing user namespacing:
ja_jp: 下記は、ユーザ名前空間を使った例です：

source: Where <literal>types.xml</literal> is a resource in the <literal>your.domain</literal> package and contains a custom <link linkend="mapping-types-custom">typedef</link>.
ja_jp: ここで <literal>types.xml</literal> は <literal>your.domain</literal> パッケージ内のリソースであり、 カスタム <xref linkend="mapping-types-custom">typedef</xref> を含むます。
pt_br: Where <literal>types.xml</literal> is a resource in the <literal>your.domain</literal> package and contains a custom <xref linkend="mapping-types-custom">typedef</xref>.

source: This element has several optional attributes. The <literal>schema</literal> and <literal>catalog</literal> attributes specify that tables referred to in this mapping belong to the named schema and/or catalog. If specified, tablenames will be qualified by the given schema and catalog names. If missing, tablenames will be unqualified. The <literal>default-cascade</literal> attribute specifies what cascade style should be assumed for properties and collections which do not specify a <literal>cascade</literal> attribute. The <literal>auto-import</literal> attribute lets us use unqualified class names in the query language, by default.
ja_jp: この要素にはいくつかオプション属性があります。<literal>schema</literal> 属性と <literal>catalog</literal> 属性は、 このマッピングが参照するテーブルが、この属性によって指定されたスキーマと(または)カタログに属することを指定します。 この属性が指定されると、テーブル名は与えられたスキーマ名とカタログ名で修飾されます。これらの属性が指定されていなければ、 テーブル名は修飾されません。<literal>default-cascade</literal> 属性は、 <literal>cascade</literal> 属性を指定していないプロパティやコレクションに、 どのカスケードスタイルを割り当てるかを指定します。 <literal>auto-import</literal> 属性は、 クエリ言語内で修飾されていないクラス名を、デフォルトで使えるようにします。
pt_br: Este elemento tem diversos atributos opcionais. Os atributos <literal>schema</literal> e <literal>catalog</literal> especificam que tabelas referenciadas neste mapeamento pertencem ao esquema e/ou ao catalogo nomeado. Se especificados, os nomes das tabelas irão ser qualificados no schema ou catalog dado. Se não, os nomes das tabelas não serão qualificados. O atributo <literal>default-cascade </literal> especifica qual estilo de cascata será assumido pelas propriedades e coleções que não especificarm um atributo <literal>cascade</literal>. O atributo <literal>auto-import</literal> nos deixa utilizar nomes de classes não qualificados na linguagem de consulta, por default.

source: <literal>schema</literal> (optional): The name of a database schema.
ja_jp: <literal>schema</literal>（オプション）：データベーススキーマの名前。
pt_br: <literal>schema</literal> (opcional): O nome do esquema do banco de dados.

source: <literal>catalog</literal> (optional): The name of a database catalog.
ja_jp: <literal>catalog</literal> （オプション）：データベースカタログの名前。
pt_br: <literal>catalog</literal> (opcional): O nome do catálogo do banco de dados.

source: <literal>default-cascade</literal> (optional - defaults to <literal>none</literal>): A default cascade style.
ja_jp: <literal>default-cascade</literal> （オプション - デフォルトは <literal>none</literal>）： デフォルトのカスケードスタイル。
pt_br: <literal>default-cascade</literal> (opcional – default é <literal>nenhum </literal>): Um estilo cascata default.

source: <literal>default-access</literal> (optional - defaults to <literal>property</literal>): The strategy Hibernate should use for accessing all properties. Can be a custom implementation of <literal>PropertyAccessor</literal>.
ja_jp: <literal>default-access</literal> (オプション - デフォルトは <literal>property</literal> ）： Hibernateがプロパティにアクセスする際に採るべき戦略。 <literal>PropertyAccessor</literal> を実装することでカスタマイズ可能。
pt_br: <literal>default-access</literal> (opcional – default é <literal>property</literal>): A estratégia que o Hibernate deve utilizar para acessar todas as propridades. Pode ser uma implementação própria de <literal>PropertyAccessor</literal>.

source: <literal>default-lazy</literal> (optional - defaults to <literal>true</literal>): The default value for unspecifed <literal>lazy</literal> attributes of class and collection mappings.
ja_jp: <literal>default-lazy</literal> (オプション - デフォルトは <literal>true</literal> )： <literal>lazy</literal> 属性が指定されていないクラスやコレクションマッピングに対するデフォルト値。
pt_br: <literal>default-lazy</literal> (opcional - default é <literal>true</literal>): O valor default para atributos <literal>lazy</literal> da classe e dos mapeamentos de coleções.

source: <literal>auto-import</literal> (optional - defaults to <literal>true</literal>): Specifies whether we can use unqualified class names (of classes in this mapping) in the query language.
ja_jp: <literal>auto-import</literal> （オプション - デフォルトは <literal>true</literal>）： クエリ言語内で、（このマッピング内のクラスの）修飾されていないクラス名を使えるかどうかを指定します。
pt_br: <literal>auto-import</literal> ((opcional - default é <literal>true</literal>): Especifica se nós podemos usar nomes de classess não qualificados (das classes deste mapeamento) na linguagem de consulta.

source: <literal>package</literal> (optional): Specifies a package prefix to assume for unqualified class names in the mapping document.
ja_jp: <literal>package</literal> (オプション): マッピングドキュメント内で修飾されていないクラス名に対して割り当てる、 パッケージの接頭辞(prefix)を指定します。
pt_br: <literal>package</literal> (opcional): Especifica um prefixo da package para assumir para nomes de classes não qualificadas no documento de mapeamento.

source: If you have two persistent classes with the same (unqualified) name, you should set <literal>auto-import="false"</literal>. Hibernate will throw an exception if you attempt to assign two classes to the same "imported" name.
ja_jp: （修飾されていない）同じ名前の永続クラスが2つあるなら、 <literal>auto-import="false"</literal> を設定すべきです。 2つのクラスに”インポートされた”同じ名前を割り当てようとすると、Hibernateは例外を投げます。
pt_br: Se voce tem duas classes persistentes com o mesmo nome (não qualificadas), você deve setar <literal>auto-import="false"</literal>. O Hibernate irá gerar uma exceção se você tentar setar duas classes para o mesmo nome "importado".

source: Note that the <literal>hibernate-mapping</literal> element allows you to nest several persistent <literal>&lt;class&gt;</literal> mappings, as shown above. It is however good practice (and expected by some tools) to map only a single persistent class (or a single class hierarchy) in one mapping file and name it after the persistent superclass, e.g. <literal>Cat.hbm.xml</literal>, <literal>Dog.hbm.xml</literal>, or if using inheritance, <literal>Animal.hbm.xml</literal>.
ja_jp: <literal>hibernate-mapping</literal> 要素は、最初の例で示したようにいくつかの永続 <literal>&lt;class&gt;</literal> マッピングをネストできます。 しかし、１つのマッピングファイルではただひとつの永続クラス(またはひとつのクラス階層)にマッピングするようにし、 さらに永続スーパークラスの後で指定するべきでしょう(いくつかのツールはこのようなマッピングファイルを想定しています)。 例えば次のようになります。： <literal>Cat.hbm.xml</literal> , <literal>Dog.hbm.xml</literal> , または継承を使うなら <literal>Animal.hbm.xml</literal> 。
pt_br: Observe que o elemento <literal>hibernate-mapping</literal> permite a você aninhar diversos mapeamentos de <literal>&lt;class&gt;</literal> persistentes, como mostrado abaixo. Entretanto, é uma boa prática (e esperado por algumas ferramentas)o mapeamento de apenas uma classe persistente simples (ou uma hierarquia de classes simples) em um arquivo de mapeamento e nomea-la após a superclasse persistente, por exemplo: <literal>Cat.hbm.xml</literal>, <literal>Dog.hbm.xml</literal>, ou se estiver usando herança, <literal>Animal.hbm.xml</literal>.

source: You may declare a persistent class using the <literal>class</literal> element:
ja_jp: <literal>class</literal> 要素を使って、永続クラスを宣言できます。
pt_br: Você pode declarar uma classe persistente utilizando o elemento <literal>class</literal>:

source: <literal>name</literal> (optional): The fully qualified Java class name of the persistent class (or interface). If this attribute is missing, it is assumed that the mapping is for a non-POJO entity.
ja_jp: <literal>name</literal> (オプション)：永続クラス（またはインターフェイス）の完全修飾Javaクラス名。 もしこの属性を指定しなければ、POJOではないエンティティに対するマッピングとして扱われます。
pt_br: <literal>name</literal> (opcional): O nome da classe Java inteiramente qualificado da classe persistente (ou interface); Se o atributo é ausente, assume-se que o mapeamento é para intidades não-POJO.

source: <literal>table</literal> (optional - defaults to the unqualified class name): The name of its database table.
ja_jp: <literal>table</literal> (オプション - デフォルトは修飾されていないクラス名)：データベーステーブルの名前
pt_br: <literal>table</literal> (opcional – default para nomes de classes não qualificadas) O nome da sua tabela do banco de dados.

source: <literal>discriminator-value</literal> (optional - defaults to the class name): A value that distiguishes individual subclasses, used for polymorphic behaviour. Acceptable values include <literal>null</literal> and <literal>not null</literal>.
ja_jp: <literal>discriminator-value</literal> (オプション - デフォルトはクラス名)： ポリモーフィックな振る舞いに使われる個々のサブクラスを識別するための値。 値は <literal>null</literal> か <literal>not null</literal> のいずれかを取ります。
pt_br: <literal>discriminator-value</literal> (opcional – default para o nome da classe): Um valor que distingue subclasses individuais, usadas para o comportamento polimorfico. Valores aceitos incluem <literal>null</literal> e <literal>not null</literal>

source: <literal>mutable</literal> (optional, defaults to <literal>true</literal>): Specifies that instances of the class are (not) mutable.
ja_jp: <literal>mutable</literal> (オプション、 デフォルトは <literal>true</literal> )： そのクラスのインスタンスが更新可能（または不可能）であることを指定します。
pt_br: <literal>mutable</literal> (opcional - valor default <literal>true</literal>): Especifica que instancias da classe são (ou não) mutáveis

source: <literal>proxy</literal> (optional): Specifies an interface to use for lazy initializing proxies. You may specify the name of the class itself.
ja_jp: <literal>proxy</literal> （オプション）：遅延初期化プロキシに使うインターフェイスを指定します。 永続化するクラス名そのものを指定することも可能です。
pt_br: <literal>proxy</literal> (opcional): Especifica um interface para ser utilizada pelos proxies de inicialização tardia. Você pode especificar o nome da própria classe.

source: <literal>dynamic-update</literal> (optional, defaults to <literal>false</literal>): Specifies that <literal>UPDATE</literal> SQL should be generated at runtime and contain only those columns whose values have changed.
ja_jp: <literal>dynamic-update</literal> （オプション、 デフォルトは <literal>false</literal> ）： 値が変更されたカラムだけを含むSQLの <literal>UPDATE</literal> 文を、実行時に生成することを指定します。
pt_br: <literal>dynamic-update</literal> (opcional, valor default <literal>false</literal>): Especifica que o SQL de <literal>UPDATE</literal> deve ser gerado em tempo de execução e conter apenas aquelas colunas cujos valores foram alterados.

source: <literal>dynamic-insert</literal> (optional, defaults to <literal>false</literal>): Specifies that <literal>INSERT</literal> SQL should be generated at runtime and contain only the columns whose values are not null.
ja_jp: <literal>dynamic-insert</literal> （オプション, デフォルトは <literal>false</literal> ）： 値がnullではないカラムだけを含むSQLの <literal>INSERT</literal> 文を、実行時に生成することを指定します。
pt_br: <literal>dynamic-insert</literal> (opcional, valor default <literal>false</literal>): Especifica que o SQL de <literal>INSERT</literal> deve ser gerado em tempo de execução e conter apenas aquelas colunas cujos valores não estão nulos.

source: <literal>select-before-update</literal> (optional, defaults to <literal>false</literal>): Specifies that Hibernate should <emphasis>never</emphasis> perform an SQL <literal>UPDATE</literal> unless it is certain that an object is actually modified. In certain cases (actually, only when a transient object has been associated with a new session using <literal>update()</literal>), this means that Hibernate will perform an extra SQL <literal>SELECT</literal> to determine if an <literal>UPDATE</literal> is actually required.
ja_jp: <literal>select-before-update</literal> (オプション, デフォルトは <literal>false</literal>): オブジェクトが変更されたのが確実でないならば、HibernateがSQLの <literal>UPDATE</literal> を <emphasis>決して実行しない</emphasis> ことを指定します。 ある特定の場合(実際的には、一時オブジェクトが <literal>update()</literal> を使い、 新しいセッションと関連付けられた時だけ)、<literal>UPDATE</literal> が実際に必要かどうかを決定するために、 Hibernateが余分なSQLの <literal>SELECT</literal> 文を実行することを意味します。
pt_br: <literal>select-before-update</literal> (opcional, valor default <literal>false</literal>): Especifica que o Hibernate <emphasis>never</emphasis> deve executar um SQL de <literal>UPDATE</literal> a não ser que com certeza um objeto está atualmente modificado. Em certos casos (atualmente, apenas quando um objeto transiente foi associado com uma nova sessão utilizando <literal>update()</literal>), isto significa que o Hibernate ira executar uma instrução SQL de <literal>SELECT</literal> adicional para determinar se um <literal>UPDATE</literal> é necessário nesse momento.

source: <literal>polymorphism</literal> (optional, defaults to <literal>implicit</literal>): Determines whether implicit or explicit query polymorphism is used.
ja_jp: (optional, デフォルトでは <literal>implicit</literal> ): implicit（暗黙）かexplicit（明示）の、 どちらのクエリポリモーフィズムを使うか決定します。
pt_br: <literal>polymorphism</literal> (opcional, default para <literal>implicit</literal>): Determina se deve ser utilizado a query polimorfica implicita ou explicitamente.

source: <literal>where</literal> (optional) specify an arbitrary SQL <literal>WHERE</literal> condition to be used when retrieving objects of this class
ja_jp: <literal>where</literal> （オプション）： このクラスのオブジェクトを検索するときに使用する、任意のSQLの <literal>WHERE</literal> 条件を指定します。
pt_br: <literal>where</literal> (opicional) especifica um comando SQL <literal>WHERE</literal> arbitrário para ser usado quando da recuperação de objetos desta classe.

source: <literal>persister</literal> (optional): Specifies a custom <literal>ClassPersister</literal>.
ja_jp: <literal>persister</literal> （オプション）：カスタム <literal>ClassPersister</literal> を指定します。
pt_br: <literal>persister</literal> (opcional): Espeicifca uma <literal>ClassPersister</literal> customizada.

source: <literal>batch-size</literal> (optional, defaults to <literal>1</literal>) specify a "batch size" for fetching instances of this class by identifier.
ja_jp: <literal>batch-size</literal> （オプション, デフォルトは <literal>1</literal> ）： 識別子でこのクラスのインスタンスを復元するときの「バッチサイズ」を指定します。
pt_br: <literal>batch-size</literal> (opcional, valor default <literal>1</literal>) especifica um "tamanho de lote" para a recuperação de instancias desta classe pelo identificador.

source: <literal>optimistic-lock</literal> (optional, defaults to <literal>version</literal>): Determines the optimistic locking strategy.
ja_jp: <literal>optimistic-lock</literal> （オプション,デフォルトは <literal>version</literal> ）： 楽観ロック戦略を決定します。
pt_br: <literal>optimistic-lock</literal> (octional, valor default <literal>version</literal>): Determina a estratégia de bloqueio.

source: <literal>lazy</literal> (optional): Lazy fetching may be completely disabled by setting <literal>lazy="false"</literal>.
ja_jp: <literal>lazy</literal> （オプション）： <literal>lazy="false"</literal> と設定することで、 遅延フェッチができなくなります。
pt_br: <literal>lazy</literal> (opcional): A recuperação tardia pode ser completamente desabilitada, setando <literal>lazy="false"</literal>.

source: <literal>entity-name</literal> (optional, defaults to the class name): Hibernate3 allows a class to be mapped multiple times (to different tables, potentially), and allows entity mappings that are represented by Maps or XML at the Java level. In these cases, you should provide an explicit arbitrary name for the entity. See <xref linkend="persistent-classes-dynamicmodels"/> and <xref linkend="xml"/> for more information.
ja_jp: <literal>entity-name</literal> （オプション、デフォルトはクラス名）： Hibernate3ではクラスが複数回マッピングでき（場合によっては違うテーブルに対しても）、 JavaレベルでMapやXMLで表現されるエンティティマッピングが可能です。 これらの場合、エンティティに対して任意の名前を、明示的に付けなくてはなりません。 詳しくは <xref linkend="persistent-classes-dynamicmodels"/> と <xref linkend="xml"/> を参照してください。
pt_br: <literal>entity-name</literal> (opcional, default para o nome da classe): O Hibernate3 permite uma classe ser mapeada multiplas vezes, (potencialmente,para diferentes tabelas), e permite mapeamentos de entidades que são representadas por Maps ou XML no nível Java. Nestes casos, você deve especificar um nome arbitrário explicitamente para a entidade. Veja <xref linkend="persistent-classes-dynamicmodels"/> e <xref linkend="xml"/> para maiores informações.

source: <literal>check</literal> (optional): A SQL expression used to generate a multi-row <emphasis>check</emphasis> constraint for automatic schema generation.
ja_jp: <literal>check</literal> （オプション）：自動的にスキーマを生成するために、 複数行の <emphasis>check</emphasis> 制約を生成するSQL式。
pt_br: <literal>check</literal> (opcional): Uma expressão SQL utilizada para gerar uma constraint de <emphasis>verificação</emphasis> de múltiplas linhas para a geração automática do esquema.

source: <literal>rowid</literal> (optional): Hibernate can use so called ROWIDs on databases which support. E.g. on Oracle, Hibernate can use the <literal>rowid</literal> extra column for fast updates if you set this option to <literal>rowid</literal>. A ROWID is an implementation detail and represents the physical location of a stored tuple.
ja_jp: <literal>rowid</literal> （オプション）：Hibernateは、それをサポートしているデータベースでROWIDと 呼ばれるものを使うことができます。 例えばOracleを使っているとき、このオプションに <literal>rowid</literal> を設定すれば、 Hiberanteはupdateを高速化するために <literal>rowid</literal> という特別なカラムを使うことができます。 ROWIDは詳細な実装であり、保存されたタプルの物理的な位置を表しています。
pt_br: <literal>rowid</literal> (opcional): O Hibernate poder usar as assim chamadas ROWIDs em bancos de dados que a suportam. Por exemplo, no Oracle, o Hibernate pode utilizar a coluna extra rowid para atualizações mais rápidas se você configurar esta opção para <literal>rowid</literal>. Um ROWID é uma implementação que representa de maneira detalhada a localização física de uma determinada tupla armazenado.

source: <literal>subselect</literal> (optional): Maps an immutable and read-only entity to a database subselect. Useful if you want to have a view instead of a base table, but don't. See below for more information.
ja_jp: <literal>subselect</literal> （オプション）：不変かつ読み取り専用であるエンティティを データベースの副問合せ（subselect）にマッピングします。 もし元のテーブルの代わりにビューを持ちたければ有用ですが、 そうでないのなら有用ではありません。より詳しい情報は下記を参照してください。
pt_br: <literal>subselect</literal> (optional): Maps an immutable and read-only entity to a database subselect. Useful if you want to have a view instead of a base table, but don't. See below for more information. <literal>subselect</literal> (opcional): Mapeia uma entidade imutavel e somente de leitura para um subconjunto do banco de dados. Útil se você quiser ter uma view em vez de uma tabela. Veja abaixo para mais informações.

source: <literal>abstract</literal> (optional): Used to mark abstract superclasses in <literal>&lt;union-subclass&gt;</literal> hierarchies.
ja_jp: <literal>abstract</literal> （オプション）： <literal>&lt;union-subclass&gt;</literal> 階層内の抽象スーパークラスにマークするために使います。
pt_br: <literal>abstract</literal> (opcional): Utilizada para marcar superclasses abstratas em hierarquias <literal>&lt;union-subclass&gt;</literal>.
