Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: ja_jp, pt_br

source: <literal>not-null</literal> (optional): Enable the DDL generation of a nullability constraint for the foreign key columns.
ja_jp: <literal>not-null</literal> (オプション):外部キーカラムに対して、 null値を許可するDDLの生成を可能にします
pt_br: <literal>not-null</literal> (opcional): Habilita a geração DDL de uma constraint de nulidade para as foreign keys.

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this property do or do not require acquisition of the optimistic lock. In other words, dertermines if a version increment should occur when this property is dirty.
ja_jp: <literal>optimistic-lock</literal> (オプション - デフォルトは <literal>true</literal> ): このプロパティの更新に楽観的ロックの取得を要求するかどうかを指定します。 言い換えれば、このプロパティがダーティであるときにバージョンを増やすべきかを決定します。
pt_br: <literal>optimistic-lock</literal> (opcional - valor default <literal>true</literal>): Especifica se mudanças desta propriedade requerem ou não travamento otimista. Em outras palavras, determina se um incremento de versão deve ocorrer quando esta propriedade está suja.

source: <literal>lazy</literal> (optional - defaults to <literal>proxy</literal>): By default, single point associations are proxied. <literal>lazy="no-proxy"</literal> specifies that the property should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation). <literal>lazy="false"</literal> specifies that the association will always be eagerly fetched.
ja_jp: <literal>lazy</literal> (オプション - デフォルトは <literal>proxy</literal> ): デフォルトでは、多重度１の関連がプロキシとなります。 <literal>lazy="no-proxy"</literal> は、インスタンス変数に最初にアクセスしたときに、 プロパティを遅延フェッチするよう指定します (ビルド時にバイトコード実装が必要になります)。 <literal>lazy="false"</literal> は関連を常に即時にフェッチするよう指定します。
pt_br: <literal>lazy</literal>(opcional – valor default <literal>proxy</literal>): Por default, associações de ponto unico são envoltas em um proxie. <literal>lazy="no-proxy"</literal> especifica que a propriedade deve ser trazida de forma tardia quando a instancia da variável é acessada pela primeira vez (requer instrumentação bytecode em tempo de criação) <literal>lazy="false"</literal> especifica que a associação será sempre recuperada fortemente.

source: <literal>not-found</literal> (optional - defaults to <literal>exception</literal>): Specifies how foreign keys that reference missing rows will be handled: <literal>ignore</literal> will treat a missing row as a null association.
ja_jp: <literal>not-found</literal> (オプション - デフォルトは <literal>exception</literal> ): 欠落した行を参照する外部キーをどのように扱うかを指定します。 <literal>ignore</literal> は欠落した行をnull関連として扱います。
pt_br: <literal>not-found</literal> (opcional - valor default <literal>exception</literal>): Especifica como as foreign keys que referenciam linhas ausentes serão tratadas: <literal>ignore</literal> irá tratar a linha ausente como ama associaççao de null

source: <literal>formula</literal> (optional): an SQL expression that defines the value for a <emphasis>computed</emphasis> foreign key.
ja_jp: <literal>formula</literal> (オプション): <emphasis> 計算された</emphasis> 外部キーに対して値を定義するSQL式
pt_br: <literal>formula</literal> (optional): Uma expressão SQL que define um valor para um foreign key <emphasis>computed</emphasis>.

source: Setting a value of the <literal>cascade</literal> attribute to any meaningful value other than <literal>none</literal> will propagate certain operations to the associated object. The meaningful values are the names of Hibernate's basic operations, <literal>persist, merge, delete, save-update, evict, replicate, lock, refresh</literal>, as well as the special values <literal>delete-orphan</literal> and <literal>all</literal> and comma-separated combinations of operation names, for example, <literal>cascade="persist,merge,evict"</literal> or <literal>cascade="all,delete-orphan"</literal>. See <xref linkend="objectstate-transitive"/> for a full explanation. Note that single valued associations (many-to-one and one-to-one associations) do not support orphan delete.
ja_jp: <literal>cascade</literal> 属性に <literal>none</literal> 以外の意味のある値をを設定すると、 関連オブジェクトへある操作が伝播することになります。 意味のある値とはHibernateの基本操作の名前のことで、 <literal>delete-orphan</literal> と <literal>all</literal> 、操作名をカンマで区切った組み合わせ （例えば <literal>cascade="persist,merge,evict"</literal> や <literal>cascade="all,delete-orphan"</literal>）、 またそれだけでなく <literal>persist, merge, delete, save-update, evict, replicate, lock, refresh</literal> のことを指します。 詳しい説明は <xref linkend="objectstate-transitive"/> を見てください。 値が一つの関連(many-to-oneとone-to-one関連)は、 単独での削除（orphan delete)をサポートしていないことに注意してください。
pt_br: Setar o valor do atributo <literal>cascade</literal> para qualquer valor significativo diferente de <literal>none</literal> irá propagar certas operações ao objeto associado. Os valores significativos são os nomes das operações básicas do Hibernate, <literal>persist, merge, delete, save-update, evict, replicate, lock, refresh</literal>, assim como os valores especiais <literal>delete-orphan</literal> e <literal>all</literal> e combinações de nomes de operações separadas por vírgula, como por exemplo, <literal>cascade="persist,merge,evict"</literal> ou <literal>cascade="all,delete-orphan"</literal>. Veja a seção <xref linkend="objectstate-transitive"/> para uma explicação completa. Note que associações valoradas simples (associações muitos-pra-um, e um-pra-um) não suportam orphan delete.

source: A typical <literal>many-to-one</literal> declaration looks as simple as this:
ja_jp: 典型的な <literal>many-to-one</literal> 宣言は次のようにシンプルです。：
pt_br: Uma típica declaração <literal>muitos-pra-um</literal> se parece com esta:

source: The <literal>property-ref</literal> attribute should only be used for mapping legacy data where a foreign key refers to a unique key of the associated table other than the primary key. This is an ugly relational model. For example, suppose the <literal>Product</literal> class had a unique serial number, that is not the primary key. (The <literal>unique</literal> attribute controls Hibernate's DDL generation with the SchemaExport tool.)
ja_jp: <literal>property-ref</literal> 属性は、外部キーが関連付けられたテーブルの、主キーでない ユニークキーを参照しているレガシーデータをマップするためにだけ使うべきです。 これは醜いリレーショナルモデルです。 例えば <literal>Product</literal> クラスが、 主キーでないユニークなシリアルナンバーを持っていると仮定してみてください。 （ <literal>unique</literal> 属性はSchemaExportツールを使ったHibernateのDDL生成を制御します。）
pt_br: O atributo <literal>property-ref</literal> deve apenas ser usado para mapear dados legados onde uma chave estrangeira se referencia a uma chave exclusiva da tabela associada que não seja à chave primária. Este é um modelo relacional desagradável. Por exemplo, suponha que a classe <literal>Product</literal> tenha um número seqüencial exclusivo, que não é a chave primária. (O atributo <literal>unique</literal> controla a geração de DDL do Hibernate com a ferramenta SchemaExport.)

source: Then the mapping for <literal>OrderItem</literal> might use:
ja_jp: 以下のように <literal>OrderItem</literal> に対してマッピングを使えます：
pt_br: Então o mapeamento para <literal>OrderItem</literal> poderia usar:

source: This is certainly not encouraged, however.
ja_jp: しかし、これは決して推奨できません。
pt_br: Porém, isto obviamente não é indicado, nunca.

source: If the referenced unique key comprises multiple properties of the associated entity, you should map the referenced properties inside a named <literal>&lt;properties&gt;</literal> element.
ja_jp: 参照したユニークキーが、関連するエンティティの多数のプロパティから構成される場合、 指定した <literal>&lt;properties&gt;</literal> 要素内で、参照するプロパティをマッピングするべきです。
pt_br: Se a chave exclusiva referenciada engloba múltiplas propriedades da entidade associada, você deve mapear as propriedades referenciadas dentro de um elemento chamado <literal>&lt;properties&gt;</literal>

source: If the referenced unique key is the property of a component, you may specify a property path:
ja_jp: もし参照したユニークキーがコンポーネントのプロパティである場合は、プロパティのパスを指定できます。
pt_br: Se a chave exclusiva referenciada é a propriedade de um componente, você pode especificar um caminho para a propriedade.

source: A one-to-one association to another persistent class is declared using a <literal>one-to-one</literal> element.
ja_jp: 他の永続クラスへの一対一関連は、<literal>one-to-one</literal> 要素で定義します。
pt_br: Uma associação um-pra-um para outra classe persistente é declarada usando um elemento <literal>one-to-one </literal>.

source: <literal>cascade</literal> (optional) specifies which operations should be cascaded from the parent object to the associated object.
ja_jp: <literal>cascade</literal>（オプション）： 親オブジェクトから関連オブジェクトへ、どの操作をカスケードするかを指定します。
pt_br: <literal>cascade</literal> (opcional): Especifica qual operação deve ser cascateada do objeto pai para o objeto associado.

source: <literal>constrained</literal> (optional) specifies that a foreign key constraint on the primary key of the mapped table references the table of the associated class. This option affects the order in which <literal>save()</literal> and <literal>delete()</literal> are cascaded, and determines whether the association may be proxied (it is also used by the schema export tool).
ja_jp: <literal>constrained</literal>（オプション）： マッピングされたテーブルの主キーに対する外部キー制約が、 関連クラスのテーブルを参照することを指定します。 このオプションは <literal>save()</literal> と <literal>delete()</literal> がカスケードされる順序に影響し、 そして関連がプロキシされるかどうかにも影響します （そしてスキーマエクスポートツールにも使われます）。
pt_br: <literal>constrained</literal> (opcional): Especifica que uma chave estrangeira constraint na chave primária da tabela mapeada referencia a tabela da classe associada, Esta opção afeta a ordem em queh <literal>save()</literal> e <literal>delete()</literal> são cascateadas, e determina se a associação pode ser substituída (isto também é usado pela ferramenta schema export).

source: <literal>property-ref</literal>: (optional) The name of a property of the associated class that is joined to the primary key of this class. If not specified, the primary key of the associated class is used.
ja_jp: <literal>property-ref</literal>（オプション）： このクラスの主キーに結合された関連クラスのプロパティ名。 指定されなければ、関連クラスの主キーが使われます。
pt_br: <literal>property-ref</literal>(opcional): O nome da propriedade da classe associada que é ligada a chave primária desta classe. Se não for especificada, a chave primária da classe associada é utilizada.

source: <literal>formula</literal> (optional): Almost all one to one associations map to the primary key of the owning entity. In the rare case that this is not the case, you may specify a some other column, columns or expression to join on using an SQL formula. (See <literal>org.hibernate.test.onetooneformula</literal> for an example.)
ja_jp: <literal>formula</literal> (オプション): ほとんどすべての一対一関連はオーナーのエンティティの主キーへとマッピングされます。 これ以外の稀な場合は、 他のカラムや、複数のカラム、SQL構文を使った結合するための式を指定できます。 （例は <literal>org.hibernate.test.onetooneformula</literal> を参照してください。）
pt_br: <literal>formula</literal> (opcional): Quase todas associações um-pra-um mapeiam para a chave primária da entidade dona. No caso raro, que não é o caso, você pode especificar uma outra coluna, colunas ou expressões para juntar utilizando uma formula SQL. (Veja <literal>org.hibernate.test.onetooneformula</literal> para exemplo).

source: <literal>lazy</literal> (optional - defaults to <literal>proxy</literal>): By default, single point associations are proxied. <literal>lazy="no-proxy"</literal> specifies that the property should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation). <literal>lazy="false"</literal> specifies that the association will always be eagerly fetched. <emphasis>Note that if <literal>constrained="false"</literal>, proxying is impossible and Hibernate will eager fetch the association!</emphasis>
ja_jp: <literal>lazy</literal> (オプション - デフォルトは <literal>proxy</literal> ): デフォルトでは、多重度１の関連がプロキシとなります。 <literal>lazy="no-proxy"</literal> は、インスタンス変数に最初にアクセスしたときに、 プロパティを遅延フェッチするよう指定します (ビルド時にバイトコード実装が必要になります)。 <literal>lazy="false"</literal> は関連を常に即時にフェッチするよう指定します。 <emphasis>もし <literal>constrained="false"</literal> ならば、 プロキシは使用不可能となり、関連を即時にフェッチすることに注意してください！</emphasis>
pt_br: <literal>lazy</literal> (opcional – valor default <literal>proxy</literal>): Por default, associações single point são proxied. <literal>lazy="no-proxy"</literal> especifica que a propriedade deve ser fetched lazily quando o atributo é acessado pela primeira vez (requer build-time bytecode instrumentation). <literal>lazy="false"</literal> especifica que a associação vai sempre ser avidamente fetched. <emphasis>Note que se <literal>constrained="false"</literal>, proxing é impossível e o Hibernate vai ávido fetch a associação!</emphasis>

source: There are two varieties of one-to-one association:
ja_jp: 一対一関連には2種類あります：
pt_br: Existem duas variedades de associações um-pra-um:

source: primary key associations
ja_jp: 主キー関連
pt_br: associações de chave primária

source: unique foreign key associations
ja_jp: ユニーク外部キー関連
pt_br: associações de chave estrangeira exclusiva

source: Primary key associations don't need an extra table column; if two rows are related by the association then the two table rows share the same primary key value. So if you want two objects to be related by a primary key association, you must make sure that they are assigned the same identifier value!
ja_jp: 主キー関連には、特別なテーブルカラムは必要ありません。 もし2つの行が関連により関係していれば、2つのテーブルは同じ主キーの値を共有します。 そのため2つのオブジェクトを主キー関連によって関連付けたいのであれば、 確実に同じ識別子の値を代入しなければなりません。
pt_br: Associações de chave primária não necessitam de uma coluna extra de tabela; se duas linhas são relacionadas pela associação então as duas linhas da tabela dividem a mesmo valor da chave primária. Assim, se você quer que dois objetos sejam relacionados por uma associação de chave primária, você deve ter certeza que eles são assinados com o mesmo valor identificador!

source: For a primary key association, add the following mappings to <literal>Employee</literal> and <literal>Person</literal>, respectively.
ja_jp: 主キー関連を行うためには、以下のマッピングを <literal>Employee</literal> と <literal>Person</literal> のそれぞれに追加してください。
pt_br: Para uma associação de chave primária, adicione os seguintes mapeamentos em <literal>Employee</literal> e <literal>Person</literal>, respectivamente.

source: Now we must ensure that the primary keys of related rows in the PERSON and EMPLOYEE tables are equal. We use a special Hibernate identifier generation strategy called <literal>foreign</literal>:
ja_jp: ここで、PERSONとEMPLOYEEテーブルの関係する行の主キーが同じであることを確実にしなければいけません。 ここでは、<literal>foreign</literal> という特殊なHibernate識別子生成戦略を使います：
pt_br: Agora nós devemos assegurar que as chaves primárias de linhas relacionadas nas tabelas PERSON e EMPLOYEE são iguais. Nós usamos uma estratégia especial de geração de identificador do Hibernate chamada <literal>foreign</literal>:

source: A newly saved instance of <literal>Person</literal> is then assigned the same primary key value as the <literal>Employee</literal> instance refered with the <literal>employee</literal> property of that <literal>Person</literal>.
ja_jp: <literal>Employee</literal> インスタンスが、<literal>Person</literal> の <literal>employee</literal> プロパティで参照されるように、 新しくセーブされた <literal>Person</literal> のインスタンスには同じ主キーの値が代入されます。 新しくセーブする <literal>Person</literal> インスタンスは、 その <literal>Person</literal> の <literal>employee</literal> プロパティが参照する <literal>Employee</literal> インスタンスとして同じ主キーが割り当てられます。
pt_br: Uma nova instância de <literal>Person</literal> salva recentemente é então assinada com o mesmo valor da chave primária da instância de <literal>employee</literal> referenciada com a propriedade <literal>employee</literal> daquela <literal>Person</literal>.

source: Alternatively, a foreign key with a unique constraint, from <literal>Employee</literal> to <literal>Person</literal>, may be expressed as:
ja_jp: もう1つの方法として、<literal>Employee</literal> から <literal>Person</literal> への ユニーク制約を使った外部キー関連は以下のように表現されます：
pt_br: Alternativamente, uma chave estrangeira com uma unique constraint, de <literal>Employee</literal> para <literal>Person</literal>, pode ser expressa como:

source: And this association may be made bidirectional by adding the following to the <literal>Person</literal> mapping:
ja_jp: そしてこの関連は、 以下の記述を <literal>Person</literal> のマッピングに追加することで双方向にすることができます：
pt_br: E esta associação pode ser feita de forma bi-direcional adicionando o seguinte no mapeamento de <literal>Person</literal>:

source: Even though we recommend the use of surrogate keys as primary keys, you should still try to identify natural keys for all entities. A natural key is a property or combination of properties that is unique and non-null. If it is also immutable, even better. Map the properties of the natural key inside the <literal>&lt;natural-id&gt;</literal> element. Hibernate will generate the necessary unique key and nullability constraints, and your mapping will be more self-documenting.
ja_jp: 主キーとして代理キーの使用を推奨しますが、 すべてのエンティティに対して自然キーを識別するようにすべきです。 自然キーはユニークかつ非nullな一つのプロパティ、またはプロパティの連結です。 不変であればさらに良いです。 <literal>&lt;natural-id&gt;</literal> 要素内で自然キーのプロパティをマッピングします。 Hibernateは必然的にユニークかつnull値を許可する制約を生成し、 こうしてマッピングはより自己記述的になります。
pt_br: Embora nós recomendemos o uso de surrogate keys como chaves primárias, você deve ainda identificar chaves naturais para todas as entidades. Uma chave natural é uma propriedade ou combinação de propriedades que é exclusiva e não nula. Se não pude ser modificada, melhor ainda. Mapeie as propriedades da chave natural dentro do elemento <literal>&lt;natural-id&gt;</literal>. O Hibernate irá gerar a chave exclusiva necessária e as constraints de nullability , e seu mapeamento será apropriadamente auto documentado.

source: We strongly recommend that you implement <literal>equals()</literal> and <literal>hashCode()</literal> to compare the natural key properties of the entity.
ja_jp: エンティティの自然キープロパティの比較には、 <literal>equals()</literal> と <literal>hashCode()</literal> の実装を強くお勧めします。
pt_br: Nós recomendamos com enfase que você implemente <literal>equals()</literal> e <literal>hashCode()</literal> para comparar as propriedades da chave natural da entidade.

source: This mapping is not intended for use with entities with natural primary keys.
ja_jp: このマッピングは自然主キーを使ったエンティティでの使用を意図していません。
pt_br: Este mapeamento não tem o objetivo de uso com entidades com natural chaves primárias.

source: <literal>mutable</literal> (optional, defaults to <literal>false</literal>): By default, natural identifier properties as assumed to be immutable (constant).
ja_jp: <literal>mutable</literal> (オプション, デフォルトは <literal>false</literal> ): デフォルトでは、自然識別子プロパティは不変(定数)と想定されています。
pt_br: <literal>mutable</literal> mutable (opcional, valor default<literal>false</literal>): Por default, propriedades naturais identificadoras são consideradas imutáveis (constante).

source: The <literal>&lt;component&gt;</literal> element maps properties of a child object to columns of the table of a parent class. Components may, in turn, declare their own properties, components or collections. See "Components" below.
ja_jp: <literal>&lt;component&gt;</literal> 要素は、 子オブジェクトのプロパティを親クラスのテーブルのカラムへマッピングします。 コンポーネントは自分のプロパティ、コンポーネント、コレクションの順に定義できます。 以下の「コンポーネント」を見てください。
pt_br: O elemento<literal>&lt;component&gt;</literal> mapeia propriedades de um objeto filho para colunas da tabela de uma classe pai. Componentes podem, um após o outro, declarar suas próprias propriedades, componentes ou coleções. Veja "Components" abaixo.

source: <literal>class</literal> (optional - defaults to the property type determined by reflection): The name of the component (child) class.
ja_jp: <literal>class</literal> （オプション - デフォルトはリフレクションにより決定されるプロパティの型）： コンポーネント（子）クラスの名前。
pt_br: <literal>class</literal> (opcional – valor default para o tipo de propriedade determinada por reflection): O nome da classe (filha) do componente.

source: <literal>lazy</literal> (optional - defaults to <literal>false</literal>): Specifies that this component should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation).
ja_jp: <literal>lazy</literal> (optional - デフォルトは <literal>false</literal> ): インスタンス変数に最初にアクセスしたときに、 コンポーネントを遅延してフェッチするよう指定します。 (バイトコード実装を作成する時間が必要になります)
pt_br: <literal>lazy</literal> (opcional - valor default <literal>false</literal>): Especifica que este componente deve ser fetched lazily quando o atributo for acessado pela primeira vez (requer build-time bytecode instrumentation).

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this component do or do not require acquisition of the optimistic lock. In other words, determines if a version increment should occur when this property is dirty.
ja_jp: <literal>optimistic-lock</literal> (オプション - デフォルトは <literal>true</literal> ): このプロパティの更新に、楽観ロックの取得を要求するかどうかを指定します。 言い換えれば、このプロパティがダーティであるときにバージョンを増やすべきかを決定します。
pt_br: <literal>optimistic-lock</literal> (opcional – valor default <literal>true</literal>): Especifica que atualizações para este componente requerem ou não aquisição de um lock otimista. Em outras palavras, determina se uma versão de incremento deve ocorrer quando esta propriedade estiver modificada.

source: <literal>unique</literal> (optional - defaults to <literal>false</literal>): Specifies that a unique constraint exists upon all mapped columns of the component.
ja_jp: <literal>unique</literal> (オプション - デフォルトは <literal>false</literal> ): コンポーネントのすべてのマッピングするカラムに、ユニーク制約が存在するかを指定します。

source: The child <literal>&lt;property&gt;</literal> tags map properties of the child class to table columns.
ja_jp: 子の <literal>&lt;property&gt;</literal> タグで、 子のクラスのプロパティをテーブルカラムにマッピングします。
pt_br: A tag filha <literal>&lt;property&gt;</literal> acrescenta a propriedade de mapeamento da classe filha para colunas de uma tabela.

source: The <literal>&lt;component&gt;</literal> element allows a <literal>&lt;parent&gt;</literal> subelement that maps a property of the component class as a reference back to the containing entity.
ja_jp: <literal>&lt;component&gt;</literal> 要素は、親エンティティへ戻る参照として、 コンポーネントのクラスのプロパティをマッピングする <literal>&lt;parent&gt;</literal> サブ要素を許可します。
pt_br: O elemento <literal>&lt;component&gt;</literal> permite um sub-elemento <literal>&lt;parent&gt;</literal> mapeie uma propriedade da classe do componente como uma referencia de volta para a entidade que o contém.

source: The <literal>&lt;dynamic-component&gt;</literal> element allows a <literal>Map</literal> to be mapped as a component, where the property names refer to keys of the map, see <xref linkend="components-dynamic"/>.
ja_jp: <literal>&lt;dynamic-component&gt;</literal> 要素は、 <literal>Map</literal> がコンポーネントとしてマッピングされることを可能にします。 プロパティ名はmapのキーを参照します。<xref linkend="components-dynamic"/> を参照してください。
pt_br: O elemento <literal>&lt;dynamic-component&gt;</literal> permite que um <literal>Map</literal> possa ser mapeado como um componente onde os nomes das propriedades referem-se para as chaves no mapa, veja <xref linkend="components-dynamic"/>.

source: The <literal>&lt;properties&gt;</literal> element allows the definition of a named, logical grouping of properties of a class. The most important use of the construct is that it allows a combination of properties to be the target of a <literal>property-ref</literal>. It is also a convenient way to define a multi-column unique constraint.
ja_jp: <literal>&lt;properties&gt;</literal> 要素はクラスのプロパティの指定された、 論理的なグルーピングを可能にします。 この構造の最も重要な使用方法は、 <literal>property-ref</literal> のターゲットになるプロパティの結合を許可することです。 それはまた、複数カラムのユニーク制約を定義する簡単な方法でもあります。
pt_br: O elemento <literal>&lt;properties&gt;</literal> permite a definição de um grupo com nome, lógico de propriedades de uma classe. O uso mais importante do construtor é que este permite uma combinação de propriedades para ser o objetivo de uma <literal>property-ref</literal>. É também um modo conveninente para definir uma unique constraint de múltiplas colunas.
