Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: ja_jp, pt_br

source: Unfortunately, you can't use <literal>hilo</literal> when supplying your own <literal>Connection</literal> to Hibernate. When Hibernate is using an application server datasource to obtain connections enlisted with JTA, you must properly configure the <literal>hibernate.transaction.manager_lookup_class</literal>.
ja_jp: 残念ながらHibernateへの独自の <literal>Connection</literal> を提供するときには、<literal>hilo</literal> を使えません。 HibernateがJTAでリストされている接続を取得するためにアプリケーションサーバーのデータソースを使用しているときには、 <literal>hibernate.transaction.manager_lookup_class</literal> を適切に設定しなければなりません。
pt_br: Infelizemente, voce não pode utilizar <literal>hilo</literal> quando estiver fornecendo sia propria <literal>Connection</literal> para o Hibernate. Quando o Hibernate está usando um datasource do servidor de aplicações para obter conexões suportadas com JTA, você precisa configurar adequadamente o <literal>hibernate.transaction.manager_lookup_class</literal>.

source: UUID algorithm
ja_jp: UUID アルゴリズム

source: The UUID contains: IP address, startup time of the JVM (accurate to a quarter second), system time and a counter value (unique within the JVM). It's not possible to obtain a MAC address or memory address from Java code, so this is the best we can do without using JNI.
ja_jp: UUIDには以下のものが含まれます： IPアドレス、JVMのスタートアップタイム（4分の1秒の正確さ）、 システム時間、（JVMに対してユニークな）カウンタ値。 JavaコードからMACアドレスやメモリアドレスを取得することはできないので、 JNIが使えないときの最良の方法です。
pt_br: O UUID contem: o endereço IP, hora de inicio da JVM (com precisão de um quarto de segundo), a hora do sistema e um valor contador (unico dentro da JVM). Não é possivel obter o endereço MAC ou um endereço de memória do código Java, assim este é o melhor que pode ser feito sem utilizar JNI.

source: Identity columns and sequences
ja_jp: 識別子カラムとシーケンス
pt_br: Colunas de identidade e sequencias

source: For databases which support identity columns (DB2, MySQL, Sybase, MS SQL), you may use <literal>identity</literal> key generation. For databases that support sequences (DB2, Oracle, PostgreSQL, Interbase, McKoi, SAP DB) you may use <literal>sequence</literal> style key generation. Both these strategies require two SQL queries to insert a new object.
ja_jp: 識別子カラムをサポートしているデータベース（DB2, MySQL, Sybase, MS SQL）では、 <literal>identity</literal> キー生成を使えます。 シーケンスをサポートするデータベース（DB2, Oracle, PostgreSQL, Interbase, McKoi, SAP DB）では、 <literal>sequence</literal> スタイルのキー生成を使えます。 どちらの戦略も、新しいオブジェクトを挿入するために、SQLクエリを2つ必要とします。
pt_br: Para bancos de dados que suportam colunas de identidade (DB2, MySQL, Sybase, MS SQL), você pode utilizar uma geração de chave <literal>identity</literal>. Para bancos de dados que suportam sequencias (DB2, Oracle, PostgreSQL, Interbase, McKoi, SAP DB) voce pode utilizar a geração de chaves no estilo <literal>sequence</literal>. As duas estratégias requerem duas consultas SQL para inserir um novo objeto.

source: For cross-platform development, the <literal>native</literal> strategy will choose from the <literal>identity</literal>, <literal>sequence</literal> and <literal>hilo</literal> strategies, dependant upon the capabilities of the underlying database.
ja_jp: クロスプラットフォームの開発では、<literal>native</literal> 戦略は <literal>identity</literal> , <literal>sequence</literal> , <literal>hilo</literal> 戦略の中から1つを選択しますが、 これは使用しているデータベースの能力に依存します。
pt_br: Para desenvolvimento multi-plataforma, a estratégia <literal>native</literal> irá escolher entre as estratégias i <literal>identity</literal>, <literal>sequence</literal> e <literal>hilo</literal>, dependendo das capacidades do banco de dados utilizado.

source: Assigned identifiers
ja_jp: 識別子の割り当て
pt_br: Identificadores especificados

source: If you want the application to assign identifiers (as opposed to having Hibernate generate them), you may use the <literal>assigned</literal> generator. This special generator will use the identifier value already assigned to the object's identifier property. This generator is used when the primary key is a natural key instead of a surrogate key. This is the default behavior if you do no specify a <literal>&lt;generator&gt;</literal> element.
ja_jp: アプリケーションに識別子を割り当てさせたいのであれば(Hibernateが生成するものではなく）、 <literal>assigned</literal> ジェネレータを使うことができます。 この特別なジェネレータは、すでにオブジェクトの識別子プロパティに代入された値を 識別子に使います。このジェネレータは主キーが代理キーの代わりに自然キーである場合に使用します。 <literal>&lt;generator&gt;</literal> 要素を指定しない場合のデフォルトの動作になります。
pt_br: Se você quer que a aplicação especifique os identificadores (em vez do Hibernate gerá-los) você deve utilizar o gerador <literal>assigned</literal>. Este gerador especial irá utilizar o valor do identificador especificado para a propriedade de identificação do objeto. Este gerador é usado quando a chave primaria é a chave natural em vez de uma surrogate key. Este é o comportamento padrão se você não especificar um elemento <literal>&lt;generator&gt;</literal>.

source: Choosing the <literal>assigned</literal> generator makes Hibernate use <literal>unsaved-value="undefined"</literal>, forcing Hibernate to go to the database to determine if an instance is transient or detached, unless there is a version or timestamp property, or you define <literal>Interceptor.isUnsaved()</literal>.
ja_jp: <literal>assigned</literal> ジェネレータを選択すると、 Hibernateは <literal>unsaved-value="undefined"</literal> を使用します。 そして、バージョンやタイムスタンプのプロパティがない場合や <literal>Interceptor.isUnsaved()</literal> を定義しなかった場合には、インスタンスが一時的(transient)なものであるのか、 またはセッションから分離(detached)したものかどうかを決めるために、データベースを調べます。
pt_br: Escolher o gerador <literal>assigned</literal> faz com que o Hibernate utilize <literal>unsaved-value="undefined"</literal>, forçando o Hibernate ir até o banco de dados para determinar se uma instância está transiente ou desasociada, a menos que haja uma versão ou uma propriedade timestamp, ou você pode definir <literal>Interceptor.isUnsaved()</literal>.

source: Primary keys assigned by triggers
ja_jp: トリガにより割り当てられた主キー
pt_br: Chaves primárias geradas por triggers

source: For legacy schemas only (Hibernate does not generate DDL with triggers).
ja_jp: レガシースキーマのためにのみ指定します(Hibernateはトリガを使ってDDLを生成しません)。
pt_br: Apenas para sistemas legados (o Hibernate nao gera DDL com triggers).

source: In the above example, there is a unique valued property named <literal>socialSecurityNumber</literal> defined by the class, as a natural key, and a surrogate key named <literal>person_id</literal> whose value is generated by a trigger.
ja_jp: 上の例の中で、クラスで自然キーとして定義された <literal>socialSecurityNumber</literal> という名前のユニークな値のプロパティと、 値がトリガにより生成される <literal>person_id</literal> という名前の代理キーがあります。
pt_br: No exemplo acima, há uma única propriedade com valor nomeada <literal>socialSecurityNumber</literal> definida pela classe, uma chave natural, e uma surrogate key nomeada <literal>person_id</literal> cujo valor é gerado pro uma trigger.

source: For a table with a composite key, you may map multiple properties of the class as identifier properties. The <literal>&lt;composite-id&gt;</literal> element accepts <literal>&lt;key-property&gt;</literal> property mappings and <literal>&lt;key-many-to-one&gt;</literal> mappings as child elements.
ja_jp: 複合キーのあるテーブルに対し、 識別子プロパティとしてクラスの複数のプロパティをマッピングすることができます。 <literal>&lt;composite-id&gt;</literal> 要素は、子要素として <literal>&lt;key-property&gt;</literal> プロパティマッピングと <literal>&lt;key-many-to-one&gt;</literal> マッピングを受け入れます。
pt_br: Para tabelas com uma chave composta, você pode mapear múltiplas propriedades da classe como propriedades de identificação. O elemento <literal>&lt;composite-id&gt;</literal> aceita o mapeamento da propriedade <literal>&lt;key-property&gt;</literal> e mapeamentos <literal>&lt;key-many-to-one&gt;</literal>como elements filhos.

source: Your persistent class <emphasis>must</emphasis> override <literal>equals()</literal> and <literal>hashCode()</literal> to implement composite identifier equality. It must also implements <literal>Serializable</literal>.
ja_jp: 複合識別子の等価性を実装するためには、永続クラスが <literal>equals()</literal> と <literal>hashCode()</literal> をオーバーライド <emphasis>しなければなりません</emphasis> 。 また <literal>Serializable</literal> も実装しなければいけません。
pt_br: Sua classe persistente <emphasis>precisa</emphasis> sobre escrever <literal>equals()</literal> e <literal>hashCode()</literal> para implementar identificadores compostos igualmente. E precisa também implementar <literal>Serializable</literal>.

source: Unfortunately, this approach to composite identifiers means that a persistent object is its own identifier. There is no convenient "handle" other than the object itself. You must instantiate an instance of the persistent class itself and populate its identifier properties before you can <literal>load()</literal> the persistent state associated with a composite key. We call this approach an <emphasis>embedded</emphasis> composite identifier, and discourage it for serious applications.
ja_jp: 残念ながら複合識別子のためのこの方法は、 永続オブジェクトが自身の識別子であることを意味しています。 オブジェクト自身を識別子とする以上の便利な「扱い方」はありません。 複合キーに関連した永続状態を <literal>load()</literal> 出来るようになる前に、 永続クラス自身をインスタンス化し、識別子プロパティを設定しなければなりません。 <emphasis> 組み込みの</emphasis> 複合識別子と呼ばれるこのアプローチは、 本格的なアプリケーションには向いていません。
pt_br: Infelizmente, esta solução para um identificador composto significa que um objeto persistente é seu próprio identificador. Não há outro "handle" que o próprio objeto. Você mesmo precisa instanciar uma instância de outra classe persistente e preencher suas propriedades de identificação antes que você possa dar um <literal>load()</literal> para o estado persistente associado com uma chave composta. Nos chamamos esta solução de identificador composto <emphasis>embedded</emphasis> e não aconselhamos para aplicações sérias.

source: A second approach is what we call a <emphasis>mapped</emphasis> composite identifier, where the identifier properties named inside the <literal>&lt;composite-id&gt;</literal> element are duplicated on both the persistent class and a separate identifier class.
ja_jp: 2つ目の方法は <emphasis> マップされた</emphasis> 複合識別子と呼ばれるもので、 <literal>&lt;composite-id&gt;</literal>エレメント内で指定した識別プロパティが 永続クラスと分離した識別子クラスの両方に重複して存在します。
pt_br: Uma segunda solução é o que podemos chamar de identificador composto <emphasis>mapped</emphasis> quando a propriedades de identificação nomeadas dentro do elemento <literal>&lt;composite-id&gt;</literal> estão duplicadas tando na classe persistente como em uma classe de identificação separada.

source: In this example, both the composite identifier class, <literal>MedicareId</literal>, and the entity class itself have properties named <literal>medicareNumber</literal> and <literal>dependent</literal>. The identifier class must override <literal>equals()</literal> and <literal>hashCode()</literal> and implement. <literal>Serializable</literal>. The disadvantage of this approach is quite obvious&mdash;code duplication.
ja_jp: この例では、複合識別子クラス（ <literal>MedicareId</literal> ）とエンティティクラス自身の両方が、 <literal>medicareNumber</literal> と <literal>dependent</literal> という名前のプロパティを持ちます。 識別子クラスは、<literal>equals()</literal> と <literal>hashCode()</literal> をオーバライドし、 <literal>Serializable</literal> を実装しなくてはなりません。 この方法には、明らかにコードが重複するという不都合があります。
pt_br: No exemplo, ambas as classes de identificação compostas, <literal>MedicareId</literal>, e a própria classe entidade tem propriedades nomeadas <literal>medicareNumber</literal> e <literal>dependent</literal>. A classe identificadora precisa sobrepor <literal>equals()</literal> e <literal>hashCode()</literal> e implementar <literal>Serializable</literal>. A desvantagem desta solução é obvia – duplicação de código.

source: The following attributes are used to specify a mapped composite identifier:
ja_jp: 次の属性はマッピングした複合識別子を指定するために使用します。
pt_br: Os seguintes atributos ão utilizados para especificar o mapeamento de um identificador composto:

source: <literal>mapped</literal> (optional, defaults to <literal>false</literal>): indicates that a mapped composite identifier is used, and that the contained property mappings refer to both the entity class and the composite identifier class.
ja_jp: <literal>mapped</literal> (オプション、デフォルトは <literal>false</literal> ): マッピングした複合識別子が使用されることと、包含されたプロパティのマッピングが、 エンティティクラスと複合識別子クラスの両方を参照することを示します。
pt_br: <literal>mapped</literal> mapped (opcional, valor default <literal>false </literal>): indica que um identificar composto mapeado é usado, e que as propriedades de mapeamento contidas refere-se tanto a classe entidade e a classe de identificação composta.

source: <literal>class</literal> (optional, but required for a mapped composite identifier): The class used as a composite identifier.
ja_jp: <literal>class</literal> (オプション,ただしマッピングした複合識別子には必須): 複合識別子として使用するクラス。
pt_br: <literal>class</literal> (opcional, mas requerida para um identificar composto mapeado): A classe usada como um identificador composto.

source: We will describe a third, even more convenient approach where the composite identifier is implemented as a component class in <xref linkend="components-compositeid"/>. The attributes described below apply only to this alternative approach:
ja_jp: 3つ目のさらに便利な方法は、複合識別子を<xref linkend="components-compositeid"/>内の コンポーネントクラスとして実装することです。 下で記述している属性は、この代替方法にのみ適用されます。
pt_br: Nós iremos descrever uma terceira e as vezes mais conveniente solução, onde o identificador composto é implementado como uma classe componente na <xref linkend="components-compositeid"/>. Os atributos descritos abaixo aplicam-se apenas para esta solução:

source: <literal>name</literal> (optional, required for this approach): A property of component type that holds the composite identifier (see chapter 9).
ja_jp: <literal>name</literal> (オプション, このアプローチでは必須): 複合識別子を保持するコンポーネントタイプのプロパティ(9章を参照してください).
pt_br: <literal>name</literal> (opcional, requerida para esta solução): Uma propriedade do tipo componente que armazena o identificador composto (veja capítulo 9)

source: <literal>class</literal> (optional - defaults to the property type determined by reflection): The component class used as a composite identifier (see next section).
ja_jp: <literal>class</literal> （オプション - デフォルトはリフレクションにより決定されるプロパティの型）： 複合識別子として使われるコンポーネントのクラス（次の節を見てください）。
pt_br: <literal>class</literal> (opcional - valor default para o tipo de propriedade determiando por reflexão) : A classe componente utilizada como um identificador composto (veja a próxima sessão).

source: This third approach, an <emphasis>identifier component</emphasis> is the one we recommend for almost all applications.
ja_jp: この3つ目の方法は <emphasis> 識別子コンポーネント</emphasis> と呼び、 ほとんどすべてのアプリケーションに対して推奨する方法です。
pt_br: Esta terceira solução, um <emphasis>componente de identificação</emphasis>, é o que nós recomendamos para a maioria das aplicações.

source: The <literal>&lt;discriminator&gt;</literal> element is required for polymorphic persistence using the table-per-class-hierarchy mapping strategy and declares a discriminator column of the table. The discriminator column contains marker values that tell the persistence layer what subclass to instantiate for a particular row. A restricted set of types may be used: <literal>string</literal>, <literal>character</literal>, <literal>integer</literal>, <literal>byte</literal>, <literal>short</literal>, <literal>boolean</literal>, <literal>yes_no</literal>, <literal>true_false</literal>.
ja_jp: <literal>&lt;discriminator&gt;</literal> 要素は、 table-per-class-hierarchyマッピング戦略を使うポリモーフィックな永続化に必要であり、 テーブルの識別カラムを定義します。 識別カラムは、ある行に対して永続層がどのサブクラスをインスタンス化するかを 伝えるマーカー値を含んでいます。 以下のような型に制限されます： <literal>string</literal> , <literal>character</literal> , <literal>integer</literal>, <literal>byte</literal> , <literal>short</literal> , <literal>boolean</literal> , <literal>yes_no</literal> , <literal>true_false</literal>.
pt_br: O elemento <literal>&lt;discriminator&gt;</literal> é necessário para persistência polimórfica utilizando a estratégia de mapeamento table-per-class-hierarchy e declara uma coluna discriminadora da tabela. A coluna discriminadora contem valores de marcação que dizem a camada de persistência qual subclasse instanciar para uma linha particular. Um restrito conjunto de tipos que podem ser utilizados: <literal>string</literal>, <literal>character</literal>, <literal>integer</literal>, <literal>byte</literal>, <literal>short</literal>, <literal>boolean</literal>, <literal>yes_no</literal>, <literal>true_false</literal>.

source: <literal>column</literal> (optional - defaults to <literal>class</literal>) the name of the discriminator column.
ja_jp: <literal>column</literal>（オプション - デフォルトは <literal>class</literal> ）： 識別カラムの名前。
pt_br: <literal>column</literal> (opcional - valor default <literal>class</literal>) o nome da coluna discriminadora

source: <literal>type</literal> (optional - defaults to <literal>string</literal>) a name that indicates the Hibernate type
ja_jp: <literal>type</literal> （オプション - デフォルトは <literal>string</literal> ）：Hibernateの型を示す名前。
pt_br: <literal>type</literal> (opcional - valor default <literal>string</literal>) o nome que indica o tipo Hibernate

source: <literal>force</literal> (optional - defaults to <literal>false</literal>) "force" Hibernate to specify allowed discriminator values even when retrieving all instances of the root class.
ja_jp: <literal>force</literal> （オプション - デフォルトは <literal>false</literal> ）： ルートクラスのすべてのインスタンスを検索する場合であっても、 Hibernateが使用できる識別カラムの指定を「強制」します。
pt_br: <literal>force</literal> (opcional - valor default <literal>false</literal>) "força" o Hibernate a especificar valores discriminadores permitidos mesmo quando recuperando todas as instancias da classe root.

source: <literal>insert</literal> (optional - defaults to <literal>true</literal>) set this to <literal>false</literal> if your discriminator column is also part of a mapped composite identifier. (Tells Hibernate to not include the column in SQL <literal>INSERT</literal>s.)
ja_jp: <literal>insert</literal> （オプション - デフォルトは <literal>true</literal> ）： もし識別カラムがマッピングする複合識別子の一部ならば、<literal>false</literal> と設定してください。 (HibernateにSQLの <literal>INSERT</literal> には含まれないことを知らせる)
pt_br: <literal>insert</literal> (opcional - valor default para <literal>true</literal>) sete isto para <literal>false</literal> se sua coluna discriminadora é também parte do identificador composto mapeado. (Diz ao Hibernate para não incluir a coluna em comandos SQL <literal>INSERT</literal>s).

source: <literal>formula</literal> (optional) an arbitrary SQL expression that is executed when a type has to be evaluated. Allows content-based discrimination.
ja_jp: <literal>formula</literal> (オプション)型が評価されるときに実行される任意のSQL式。 コンテンツベースの識別を可能にします。
pt_br: <literal>formula</literal> (opcional) uma expressão SQL arbitraria que é e xecutada quando um tipo tem que ser avaliado. Permite discriminação baseada em conteúdo.

source: Actual values of the discriminator column are specified by the <literal>discriminator-value</literal> attribute of the <literal>&lt;class&gt;</literal> and <literal>&lt;subclass&gt;</literal> elements.
ja_jp: 識別カラムの実際の値は、 <literal>&lt;class&gt;</literal> と <literal>&lt;subclass&gt;</literal> 要素の <literal>discriminator-value</literal> 属性で指定されます。
pt_br: Valores atuais de uma coluna discriminada são especificados pelo atributo <literal>discriminator-value</literal> da <literal>&lt;class&gt;</literal> e elementos da <literal>&lt;subclass&gt;</literal>.

source: The <literal>force</literal> attribute is (only) useful if the table contains rows with "extra" discriminator values that are not mapped to a persistent class. This will not usually be the case.
ja_jp: 永続クラスへマッピングされない｢余分な」識別値を持つ行が テーブルにあれば、（そのときに限り）<literal>force</literal> 属性は有効です。 ただし、普通はそういうことはありません。
pt_br: O atributo <literal>force</literal> é util (apenas) em tabelas contendo linhas com valores discriminadores "extras" que não estão mapeados para uma classe persistente. Este não é geralmente o caso.

source: Using the <literal>formula</literal> attribute you can declare an arbitrary SQL expression that will be used to evaluate the type of a row:
ja_jp: <literal>formula</literal> 属性を使うと、行の型を評価するために任意のSQL式を宣言できます。
pt_br: Usando o atributo <literal>formula</literal> voce pode declarar uma expressão SQL arbitrária que sera utilizada para avaliar o tipo de uma linha :

source: version (optional)
ja_jp: version（オプション）

source: The <literal>&lt;version&gt;</literal> element is optional and indicates that the table contains versioned data. This is particularly useful if you plan to use <emphasis>long transactions</emphasis> (see below).
ja_jp: <literal>&lt;version&gt;</literal> 要素はオプションであり、 テーブルがバージョンデータを含むことを示します。 これは <emphasis>ロングトランザクション</emphasis> を使うつもりなら、特に役立ちます（以下を見てください）。
pt_br: O elemento <literal>&lt;version&gt;</literal> é opcional e indica que a tabela possui dados versionados. Isto é particularmente útil se você planeja utilizar <emphasis>transações longas</emphasis> (veja abaixo):

source: <literal>column</literal> (optional - defaults to the property name): The name of the column holding the version number.
ja_jp: <literal>column</literal>（オプション - デフォルトはプロパティ名）: バージョン番号を保持するカラムの名前。
pt_br: <literal>column</literal> (opcional - default a a propriedade name): O nome da coluna mantendo o numero da versão

source: <literal>name</literal>: The name of a property of the persistent class.
ja_jp: <literal>name</literal> ：永続クラスのプロパティの名前。
pt_br: <literal>name</literal>: O nome da propriedade da classe persistente.

source: <literal>type</literal> (optional - defaults to <literal>integer</literal>): The type of the version number.
ja_jp: <literal>type</literal> （オプション - デフォルトは <literal>integer</literal> ）：バージョン番号の型。
pt_br: <literal>type</literal> (opcional - valor default para <literal>integer</literal>): O tipo do numero da versão

source: <literal>unsaved-value</literal> (optional - defaults to <literal>undefined</literal>): A version property value that indicates that an instance is newly instantiated (unsaved), distinguishing it from detached instances that were saved or loaded in a previous session. (<literal>undefined</literal> specifies that the identifier property value should be used.)
ja_jp: <literal>unsaved-value</literal> （オプション - デフォルトは <literal>undefined</literal> ）： インスタンスが新しくインスタンス化されたことを示す （セーブされていないことを示す）バージョンプロパティの値。 以前のSessionでセーブまたはロードされた一時的なインスタンスと区別するために 使います。 （ <literal>undefined</literal> は識別子プロパティの値が使われることを指定します。）
pt_br: <literal>unsaved-value</literal> (opcional – valor default para <literal>undefined </literal>): Um valor para a propriedade versão que indica que uma instancia é uma nova instanciada (unsaved), distinguindo de instancias desconectadas que foram salvas ou carregadas em sessões anteriores. ((<literal>undefined</literal> especifica que o valor da propriedade de identificação deve ser utilizado).

source: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this version property value is actually generated by the database. See the discussion of <link linkend="mapping-generated">generated properties</link>.
ja_jp: <literal>generated</literal> (オプション - デフォルトは <literal>never</literal> ): このバージョンのプロパティの値が、データベースによって生成されたことを指定します。 <xref linkend="mapping-generated">生成プロパティ</xref> の議論を見てください。
pt_br: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this version property value is actually generated by the database. See the discussion of <xref linkend="mapping-generated">generated properties</xref>. <literal>generated</literal> (opcional - valor default <literal>never</literal>): Especifica que valor para a propriedade versão é na verdade gerado pelo banco de dados. Veja a discussão da Seção <xref linkend="mapping-generated">generated properties</xref>.
