Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: ja_jp, pt_br

source: It is perfectly acceptable for the named persistent class to be an interface. You would then declare implementing classes of that interface using the <literal>&lt;subclass&gt;</literal> element. You may persist any <emphasis>static</emphasis> inner class. You should specify the class name using the standard form ie. <literal>eg.Foo$Bar</literal>.
ja_jp: 永続クラスの名前にインターフェイスを指定してもまったく問題ありません。 そのときは <literal>&lt;subclass&gt;</literal> 要素を使って、 そのインターフェイスを実装するクラスを定義してください。 <emphasis>static</emphasis> な内部クラスでも永続化できます。 そのときは標準形式、例えば <literal>eg.Foo$Bar</literal> を使ってクラス名を指定してください。
pt_br: É perfeitamente aceitável para uma classe persitente nomeada ser uma interface. Você deverá então declarar as classes implementadas desta interface utilizando o elemento <literal>&lt;subclass&gt;</literal>. Você pode persistir qualquer classe de aninhada <emphasis>estatica</emphasis>. Você deverá especificar o nome da classe usando a forma padrão, por exemplo: <literal>eg.Foo$Bar</literal>.

source: Immutable classes, <literal>mutable="false"</literal>, may not be updated or deleted by the application. This allows Hibernate to make some minor performance optimizations.
ja_jp: <literal>mutable="false"</literal> 指定をした不変クラスは、 アプリケーションによる更新や削除が出来ないことがあります。 これにより、Hibernateがパフォーマンスを少し改善します。
pt_br: Classes imutáveis, <literal>mutable="false"</literal>, não podem ser modificadas ou excluídas pela aplicação. Isso permite ao Hibernate fazer alguns aperfeiçoamentos de performance.

source: The optional <literal>proxy</literal> attribute enables lazy initialization of persistent instances of the class. Hibernate will initially return CGLIB proxies which implement the named interface. The actual persistent object will be loaded when a method of the proxy is invoked. See "Initializing collections and proxies" below.
ja_jp: オプションの <literal>proxy</literal> 属性により、クラスの永続インスタンスの遅延初期化が可能になります。 Hibernateは最初に、指定したインターフェイスを実装したCGLIBプロキシを返します。 実際の永続オブジェクトはプロキシのメソッドを呼び出すときにロードします。 以下の「遅延初期化のためのプロキシ」を参照してください。
pt_br: O atributo opcional <literal>proxy</literal> habilita a inicialização tardia das instâncias persistentes da classe. O Hibernate irá retornar CGLIB proxies como implementado na interface nomeada. O objeto persistente atual será carregado quando um método do proxy for invocado. Veja "Inicializando coleções e proxies" abaixo.

source: <emphasis>Implicit</emphasis> polymorphism means that instances of the class will be returned by a query that names any superclass or implemented interface or the class and that instances of any subclass of the class will be returned by a query that names the class itself. <emphasis>Explicit</emphasis> polymorphism means that class instances will be returned only by queries that explicitly name that class and that queries that name the class will return only instances of subclasses mapped inside this <literal>&lt;class&gt;</literal> declaration as a <literal>&lt;subclass&gt;</literal> or <literal>&lt;joined-subclass&gt;</literal>. For most purposes the default, <literal>polymorphism="implicit"</literal>, is appropriate. Explicit polymorphism is useful when two different classes are mapped to the same table (this allows a "lightweight" class that contains a subset of the table columns).
ja_jp: <emphasis>暗黙的</emphasis> ポリモーフィズムとは、次の二つを意味しています。 一つはクラスのインスタンスが、スーパークラスや実装したインターフェイス、またそのクラスを指定するクエリによって返されることで、 もう一つはそのクラスのサブクラスのインスタンスが、そのクラス自身を指定したクエリによって返されることです。 また、<emphasis>明示的</emphasis> ポリモーフィズムとは、次の二つを意味しています。 一つはクラスのインスタンスが、そのクラスを明示的に指定したクエリによってのみ返されることで、 もう一つはクラスを指定したクエリが、<literal>&lt;class&gt;</literal> 要素の中で <literal>&lt;subclass&gt;</literal> や <literal>&lt;joined-subclass&gt;</literal> とマッピングされているサブクラスのインスタンスだけを返すことです。 ほとんどの用途ではデフォルトの <literal>polymorphism="implicit"</literal> が適切です。 明示的なポリモーフィズムは、2つの違ったクラスが同じテーブルにマッピングされているときに有用です （これによってテーブルカラムのサブセットを含む、「軽量な」クラスが可能になります）。
pt_br: Polimorfismo <emphasis>implícito</emphasis> significa que instâncias de uma classe serão retornada por uma query que dá nome a qualquer superclasse ou interface implementada, ou a classe e as instancias de qualquer subclasse da classe será retornada por umq query que nomeia a classe por si. Polimorfismo <emphasis>explícito</emphasis> significa que instancias da classe serão retornadas apenas por queries que explicitamente nomeiam a classe e que queries que nomeiam as classes irão retornar apenas instancias de subclasses mapeadas dentro da declaração <literal>&lt;class&gt;</literal> como uma <literal>&lt;subclass&gt;</literal> ou <literal>&lt;joined-subclass&gt;</literal>. Para a maioria dos casos, o valor default <literal>polymorphism="implicit"</literal>, é apropriado. Polimorfismo explicito é útil quando duas classes distintas estão mapeadas para a mesma tabela (isso permite um classe "peso leve" que contem um subconjunto de colunas da tabela).

source: The <literal>persister</literal> attribute lets you customize the persistence strategy used for the class. You may, for example, specify your own subclass of <literal>org.hibernate.persister.EntityPersister</literal> or you might even provide a completely new implementation of the interface <literal>org.hibernate.persister.ClassPersister</literal> that implements persistence via, for example, stored procedure calls, serialization to flat files or LDAP. See <literal>org.hibernate.test.CustomPersister</literal> for a simple example (of "persistence" to a <literal>Hashtable</literal>).
ja_jp: <literal>persister</literal> 属性を指定することで、クラスの永続化戦略をカスタマイズできます。 例えば <literal>org.hibernate.persister.EntityPersister</literal> 自身のサブクラスを指定したり、 また例えばストアドプロシージャコール、フラットファイルへシリアライズ、 LDAPなどを通した永続性を実装する <literal>org.hibernate.persister.ClassPersister</literal> インターフェイスの完全に新しい実装を提供できます。簡単な例として <literal>org.hibernate.test.CustomPersister</literal> を見てください（これは <literal>Hashtable</literal> の「永続化」です）。
pt_br: O atributo <literal>persister</literal> deixa você customizar a estratégia de persistência utilizada para a classe. Você pode, por exemplo, especificar sua prórpia subclasse do <literal>org.hibernate.persister.EntityPersister</literal> ou você pode criar uma implementação completamente nova da interface <literal>org.hibernate.persister.ClassPersister</literal> que implementa a persistência através de, por exemplo, chamadas a stored procedeures, serialização de arquivos flat ou LDAP. Veja <literal>org.hibernate.test.CustomPersister</literal> para um exemplo simples (de "persistencia" para uma <literal>Hashtable</literal>).

source: Note that the <literal>dynamic-update</literal> and <literal>dynamic-insert</literal> settings are not inherited by subclasses and so may also be specified on the <literal>&lt;subclass&gt;</literal> or <literal>&lt;joined-subclass&gt;</literal> elements. These settings may increase performance in some cases, but might actually decrease performance in others. Use judiciously.
ja_jp: <literal>dynamic-update</literal> と <literal>dynamic-insert</literal> の設定はサブクラスに継承されません。 そのため <literal>&lt;subclass&gt;</literal> や <literal>&lt;joined-subclass&gt;</literal> 要素を指定することも出来ます。 これらの設定はパフォーマンスを向上させる事もありますが、落とすこともありますので、慎重に使用してください。
pt_br: Observe que as configurações <literal>dynamic-update</literal> e <literal>dynamic-insert</literal> não sao herdadas pelas subclasses e assim podem tambem ser especificadas em elementos <literal>&lt;subclass&gt;</literal> or <literal>&lt;joined-subclass&gt;</literal>. Estas configurações podem incrementar a performance em alguns casos, mas pode realmente diminuir a performance em outras. Use-as de forma bastante criteriosa.

source: Use of <literal>select-before-update</literal> will usually decrease performance. It is very useful to prevent a database update trigger being called unnecessarily if you reattach a graph of detached instances to a <literal>Session</literal>.
ja_jp: <literal>select-before-update</literal> の使用は通常パフォーマンスを落とします。 もし <literal>Session</literal> へ分離インスタンスのグラフを再追加するなら、 データベース更新のトリガを不必要に呼び出すのを避けるという点で、非常に有用です。
pt_br: O uso de <literal>select-before-update</literal> geralmente irá diminuir a performance. Ela é muito útil para prevenir que uma trigger de atualização no banco de dados seja ativada desnecessariamente, se você reconectar um nó de uma instancia desconectada em uma <literal>Session</literal>.

source: If you enable <literal>dynamic-update</literal>, you will have a choice of optimistic locking strategies:
ja_jp: <literal>dynamic-update</literal> を有効にすれば、楽観ロック戦略を選ぶことになります。
pt_br: Se você ativar <literal>dynamic-update</literal>, você terá de escolher a estratégia de bloqueio otimista:

source: <literal>version</literal> check the version/timestamp columns
ja_jp: <literal>version</literal> バージョン/タイムスタンプカラムをチェックします
pt_br: <literal>version</literal> verifica a versão e a hora das colunas

source: <literal>all</literal> check all columns
ja_jp: <literal>all</literal> すべてのカラムをチェックします。
pt_br: <literal>all</literal> cverifica todas as colunas

source: <literal>dirty</literal> check the changed columns, allowing some concurrent updates
ja_jp: <literal>dirty</literal> 変更したカラムをチェックし、同時更新できるようにします。
pt_br: <literal>dirty</literal> verifica as colunas modificadas, permitindo alguns updates concorrentes

source: <literal>none</literal> do not use optimistic locking
ja_jp: <literal>none</literal> 楽観ロックを使用しません
pt_br: <literal>none</literal> não utiliza o bloqueio otimista

source: We <emphasis>very</emphasis> strongly recommend that you use version/timestamp columns for optimistic locking with Hibernate. This is the optimal strategy with respect to performance and is the only strategy that correctly handles modifications made to detached instances (ie. when <literal>Session.merge()</literal> is used).
ja_jp: Hibernateで楽観的ロック戦略を使うなら、バージョン/タイムスタンプカラムを使うことを <emphasis> 非常に</emphasis> 強くお勧めします。 楽観的ロックはパフォーマンスの観点からも最適であり、さらに分離インスタンスへの修正 （つまり <literal>Session.marge()</literal> が使われるとき） を正確に扱うことのできる唯一の戦略でもあります。
pt_br: Nós <emphasis>recomendamos</emphasis> com muita enfase que você utilize a versão e a hora das colunas para o bloqueio otimista com o Hibernate. Esta é a melhor estratégia com respeito a performance e é a única estratégia que trata corretamente as modificações efetuadas em instancias desconectadas (por exemplo, quando <literal>Session.merge()</literal> é utilizado).

source: There is no difference between a view and a base table for a Hibernate mapping, as expected this is transparent at the database level (note that some DBMS don't support views properly, especially with updates). Sometimes you want to use a view, but can't create one in the database (ie. with a legacy schema). In this case, you can map an immutable and read-only entity to a given SQL subselect expression:
ja_jp: Hibernateのマッピングにとってビューと普通のテーブルの間に違いはなく、 データベースレベルでは透過的です （ただしビューを完全にはサポートしていないDBMSもあります。 特に、更新のあるビューに対してはそうです）。 ビューを使いたくても、データベースで作成できないことがあります （例えば、レガシースキーマの場合）。 この場合には、不変かつ読み取り専用のエンティティに与えられたSQLの副問合せ文をマップできます。
pt_br: Não ha diferença entre uma view e uma tabela para o mapeamento do Hibernate, e como esperado isto é transparente no nível do banco de dados (observe que alguns bancos de dados não suportam views apropriadamente, especialmente com updates). Algumas vezes, você quer utilizar uma view, ma snão pode cria-la no banco de dados (por exemplo, com um esquema legado). Neste caso, você pode mapear uma entidade imutável e de somente leitura, para uma dada expressão SQL, que representa um subselect:

source: Declare the tables to synchronize this entity with, ensuring that auto-flush happens correctly, and that queries against the derived entity do not return stale data. The <literal>&lt;subselect&gt;</literal> is available as both as an attribute and a nested mapping element.
ja_jp: テーブルをこのエンティティと同期するように定義してください。 オートフラッシュが確実に起こるように、また導出エンティティに対するクエリが古いデータを 返さないようにするためです。 <literal>&lt;subselect&gt;</literal> は属性とネストしたマッピング属性のどちらでも利用できます。
pt_br: Declare as tabelas para sincronizar com esta entidade, garantindo que o auto-flush ocorra corretamente, e que as queries para esta entidade derivada não retornem dados desatualizados. O <literal>&lt;subselect&gt;</literal> está disponível tanto como um atributo como um elemento mapeado nested.

source: Mapped classes <emphasis>must</emphasis> declare the primary key column of the database table. Most classes will also have a JavaBeans-style property holding the unique identifier of an instance. The <literal>&lt;id&gt;</literal> element defines the mapping from that property to the primary key column.
ja_jp: マップされたクラスはデータベーステーブルの主キーカラムを定義 <emphasis>しなければなりません</emphasis> 。 ほとんどのクラスにはインスタンスのユニークな識別子を保持するJavaBeansスタイルのプロパティもあります。 <literal>&lt;id&gt;</literal> 要素は、そのプロパティから主キーカラムへのマッピングを定義します。
pt_br: Classes mapeadas <emphasis>precisam</emphasis> declarar a coluna de chave primaria da tabela do banco de dados. Muitas classes irão tambem ter uma propriedade ao estilo Java-Beans declarando o identificador unico de uma instancia. O elemento <literal>&lt;id&gt;</literal> define o mapeamento desta propriedade para a chave primária.

source: <literal>name</literal> (optional): The name of the identifier property.
ja_jp: <literal>name</literal>（オプション）：識別子プロパティの名前。
pt_br: <literal>name</literal> (opcional): O nome do identificador.

source: <literal>type</literal> (optional): A name that indicates the Hibernate type.
ja_jp: <literal>type</literal>（オプション）：Hibernateの型を示す名前。
pt_br: <literal>type</literal> (opcional): Um nome que indica o tipo no Hibernate.

source: <literal>column</literal> (optional - defaults to the property name): The name of the primary key column.
ja_jp: <literal>column</literal>（オプション - デフォルトはプロパティ名）： 主キーカラムの名前。
pt_br: <literal>column</literal> (opcional – default para o a propridade name): O nome coluna chave primaria.

source: <literal>unsaved-value</literal> (optional - defaults to a "sensible" value): An identifier property value that indicates that an instance is newly instantiated (unsaved), distinguishing it from detached instances that were saved or loaded in a previous session.
ja_jp: <literal>unsaved-value</literal>（オプション - デフォルトの値はsensible）： インスタンスが新しくインスタンス化された （セーブされていない）ことを示す、識別子プロパティの値。 以前のSessionでセーブまたはロードされた一時的インスタンスと区別するために 使います。
pt_br: <literal>unsaved-value</literal> (opcional - default para um valor "sensível"): Uma propriedade de identificação que indica que a instancia foi novamente instanciada (unsaved), diferenciando de instancias desconectadas que foram salvas ou carregadas em uma sessão anterior.

source: If the <literal>name</literal> attribute is missing, it is assumed that the class has no identifier property.
ja_jp: <literal>name</literal> 属性がなければ、クラスには識別子プロパティがないものとみなされます。
pt_br: Se o atributo <literal>name</literal> não for declarado, assume-se que a classe não tem a propriedade de identificação.

source: The <literal>unsaved-value</literal> attribute is almost never needed in Hibernate3.
ja_jp: <literal>unsaved-value</literal> 属性はHibernate3ではほとんどの場合、必要ではありません。
pt_br: O atributo <literal>unsaved-value</literal> não é mais necessário no Hibernate 3.

source: There is an alternative <literal>&lt;composite-id&gt;</literal> declaration to allow access to legacy data with composite keys. We strongly discourage its use for anything else.
ja_jp: 複合キーを持つレガシーデータにアクセスできるように、 <literal>&lt;composite-id&gt;</literal> という代替のマッピング定義があります。 しかし他の用途への使用は全くおすすめできません。
pt_br: Há declaração alternativa <literal>&lt;composite-id&gt;</literal> permite o acesso a dados legados com chaves compostas. Nós desencorajamos fortemente o seu uso por qualquer pessoa.

source: Generator
ja_jp: ジェネレータ

source: The optional <literal>&lt;generator&gt;</literal> child element names a Java class used to generate unique identifiers for instances of the persistent class. If any parameters are required to configure or initialize the generator instance, they are passed using the <literal>&lt;param&gt;</literal> element.
ja_jp: オプションの <literal>&lt;generator&gt;</literal> 子要素は、 永続クラスのインスタンスのユニークな識別子を生成するために使う、Javaクラスを指定します。 ジェネレータインスタンスの設定、もしくは初期化にパラメータが必要であれば、<literal>&lt;param&gt;</literal> 要素を使って渡すことができます。
pt_br: O elemento filho opcional <literal>&lt;generator&gt;</literal> nomeia uma classe Java usada para gerar identificadores unicos para instancias de uma classe persistente. Se algum parâmetro é requerido para configurar ou inicializar a instancia geradora, eles são passados utilizando o elemento <literal>&lt;param&gt;</literal>.

source: generates identifiers of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal> that are unique only when no other process is inserting data into the same table. <emphasis>Do not use in a cluster.</emphasis>
ja_jp: <literal>long</literal> , <literal>short</literal> , <literal>int</literal> 型の識別子を生成します。 これらは他のプロセスが同じテーブルにデータを挿入しないときだけユニークです。 <emphasis>クラスタ内では使わないでください</emphasis> 。
pt_br: gera identificadores dos tipos <literal>long</literal>, <literal>short</literal> ou <literal>int</literal> que são unicos apenas quando nenhum outro processo está inserindo dados na mesma tabela. <emphasis>Não utilize em ambientes de cluster.</emphasis>

source: supports identity columns in DB2, MySQL, MS SQL Server, Sybase and HypersonicSQL. The returned identifier is of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>.
ja_jp: DB2, MySQL, MS SQL Server, Sybase, HypersonicSQLの識別子カラムを サポートします。 返される識別子の型は <literal>long</literal> , <literal>short</literal> , <literal>int</literal> のいずれかです。
pt_br: suporta colunas de identidade em DB2, MySQL, MS SQL Server, Sybase e HypersonicSQL. O identificador retornado é do tipo <literal>long</literal>, <literal>short</literal> ou <literal>int</literal>.

source: uses a sequence in DB2, PostgreSQL, Oracle, SAP DB, McKoi or a generator in Interbase. The returned identifier is of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>
ja_jp: DB2, PostgreSQL, Oracle, SAP DB, McKoiのシーケンスや、Interbaseのジェネレータを使用します。 返される識別子の型は <literal>long</literal> , <literal>short</literal> , <literal>int</literal> のいずれかです。
pt_br: utiliza uma sequence em DB2, PostgreSQL, Oracle, SAP DB, McKoi ou um generator no Interbase. O identificador de retorno é do tipo <literal> long</literal>, <literal>short</literal> ou <literal>int</literal>.

source: uses a hi/lo algorithm to efficiently generate identifiers of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>, given a table and column (by default <literal>hibernate_unique_key</literal> and <literal>next_hi</literal> respectively) as a source of hi values. The hi/lo algorithm generates identifiers that are unique only for a particular database.
ja_jp: <literal>long</literal> , <literal>short</literal> , <literal>int</literal> 型の識別子を効率的に生成するhi/loアルゴリズムを使います。 hi値のソースとして、テーブルとカラムを与えます(デフォルトではそれぞれ <literal>hibernate_unique_key</literal> と <literal>next_hi</literal> )。 hi/loアルゴリズムは特定のデータベースに対してのみユニークな識別子を生成します。
pt_br: utiliza um algoritmo hi/lo para gerar de forma eficiente identificadores do tipo <literal>long</literal>, <literal>short</literal> ou <literal>int</literal>, a partir de uma tabela e coluna fornecida (por default <literal>hibernate_unique_key</literal> e <literal>next_hi</literal>) como fonte para os valores hi. O algoritmo hi/lo gera identificadores que são únicos apenas para um banco de dados particular.

source: uses a hi/lo algorithm to efficiently generate identifiers of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>, given a named database sequence.
ja_jp: <literal>long</literal> , <literal>short</literal> , <literal>int</literal> 型の識別子を効率的に生成するhi/loアルゴリズムを使います。 指定されたデータベースシーケンスを与えます。
pt_br: utiliza um algoritmo hi/lo para gerar de forma eficinete identificadores do tipo <literal>long</literal>, <literal>short</literal> ou <literal>int</literal>, a partir de uma sequence de banco de dados fornecida.

source: uses a 128-bit UUID algorithm to generate identifiers of type string, unique within a network (the IP address is used). The UUID is encoded as a string of hexadecimal digits of length 32.
ja_jp: (IPアドレスが使用される)ネットワーク内でユニークな文字列型の識別子を生成するために、 128ビットのUUIDアルゴリズムを使用します。UUIDは長さ32の16進数字の文字列としてエンコードされます。
pt_br: utiliza um algortimo UUID de 128-bits para gerar identificadores do tipo string, unicos em uma rede(o endereço IP é utilizado). O UUID é codificado como um string de digitos hexadecimais de tamanho 32.

source: uses a database-generated GUID string on MS SQL Server and MySQL.
ja_jp: MS SQLサーバとMySQLでデータベースが生成するGUID文字列を使用します。
pt_br: utiliza um string GUID gerado pelo banco de dados no MS SQL Server e MySQL.

source: picks <literal>identity</literal>, <literal>sequence</literal> or <literal>hilo</literal> depending upon the capabilities of the underlying database.
ja_jp: 使用するデータベースの性能により <literal>identity</literal> , <literal>sequence</literal> , <literal>hilo</literal> のいずれかが選ばれます。
pt_br: seleciona entre <literal>identity</literal>, <literal>sequence</literal> ou <literal>hilo</literal> dependendo das capacidades do banco de dados utilizado.

source: lets the application to assign an identifier to the object before <literal>save()</literal> is called. This is the default strategy if no <literal>&lt;generator&gt;</literal> element is specified.
ja_jp: <literal>save()</literal> が呼ばれる前に、 アプリケーションがオブジェクトに識別子を代入できるようにします。 <literal>&lt;generator&gt;</literal> が指定されていなければ、これがデフォルトの戦略になります。
pt_br: deixa a aplicação definir um identificador para o objeto antes que o <literal>save()</literal> seja chamado. Esta é a estratégia default se nenhum elemento <literal>&lt;generator&gt;</literal> é especificado.

source: retrieves a primary key assigned by a database trigger by selecting the row by some unique key and retrieving the primary key value.
ja_jp: あるユニークキーによる行の選択と主キーの値の復元により、 データベーストリガが割り当てた主キーを取得します。
pt_br: retorna a chave primaria recuperada por uma trigger do banco de dados, selecionado uma linha pela chave única e recuperando o valor da chave primária.

source: uses the identifier of another associated object. Usually used in conjunction with a <literal>&lt;one-to-one&gt;</literal> primary key association.
ja_jp: 他の関連オブジェクトの識別子を使います。 普通は、<literal>&lt;one-to-one&gt;</literal> 主キー関連と組み合わせて使います。
pt_br: utiliza o identificador de um outro objeto associado. Normalmente utilizado em conjunto com uma associaçõa de chave primária do tipo <literal>&lt;one-to-one&gt;</literal>.

source: Hi/lo algorithm
ja_jp: Hi/lo アルゴリズム
pt_br: Algoritmo Hi/lo

source: The <literal>hilo</literal> and <literal>seqhilo</literal> generators provide two alternate implementations of the hi/lo algorithm, a favorite approach to identifier generation. The first implementation requires a "special" database table to hold the next available "hi" value. The second uses an Oracle-style sequence (where supported).
ja_jp: <literal>hilo</literal> と <literal>seqhilo</literal> ジェネレータは、 識別子生成の代表的なアプローチであるhi/loアルゴリズムの2つの代替実装を提供します。 1番目の実装は、次回に利用される"hi"値を保持する「特別な」データベーステーブルを 必要とします。 2番目の実装は、Oracleスタイルのシーケンスを使います（サポートされている場合）。
pt_br: Os geradores <literal>hilo</literal> e <literal>seqhilo</literal> fornecem duas implementações alternativas do algoritmo hi/lo, uma solução preferencial para a geração de identificadores. A primeira implementação requer uma tabela especial do banco de dados para manter o proximo valor "hi" disponível. A segunda utiliza uma seqüência do estilo Oracle (quando suportado).
