Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: ja_jp, pt_br

source: <literal>name</literal>: The logical name of the grouping - <emphasis>not</emphasis> an actual property name.
ja_jp: <literal>name</literal> : グルーピングの論理名。 実際のプロパティ名では <emphasis>ありません</emphasis> 。
pt_br: <literal>name</literal>:: O nome lógico do agrupamento – <emphasis>não </emphasis> é o nome atual de propriedade.

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to these properties do or do not require acquisition of the optimistic lock. In other words, determines if a version increment should occur when these properties are dirty.
ja_jp: <literal>optimistic-lock</literal> (オプション - デフォルトは <literal>true</literal> ): これらのプロパティの更新に楽観的ロックの取得を要求するかどうかを指定します。 言い換えれば、このプロパティがダーティであるときにバージョンを増やすべきかを決定します。
pt_br: <literal>optimistic-lock</literal> (opcional – valor default <literal>true</literal>): Especifica que atualizações para estes componentes requerem ou não aquisição de um lock otimista. Em outras palavras, determina se uma versão de incremento deve ocorrer quando estas propriedades estiverem modificadas.

source: For example, if we have the following <literal>&lt;properties&gt;</literal> mapping:
ja_jp: 例えば、もし以下のような <literal>&lt;properties&gt;</literal> マッピングがあった場合：
pt_br: Por exemplo, se nós temos o seguinte mapeamento de <literal>&lt;properties&gt;</literal>:

source: Then we might have some legacy data association which refers to this unique key of the <literal>Person</literal> table, instead of to the primary key:
ja_jp: 主キーの代わりに <literal>Person</literal> テーブルのユニークキーへの参照を持つ、 レガシーデータの関連を持つかもしれません。：
pt_br: Então nós podemos ter uma associação de dados herdados que referem a esta chave exclusiva da tabela <literal>Person</literal>, ao invés de se referirem a chave primária:

source: We don't recommend the use of this kind of thing outside the context of mapping legacy data.
ja_jp: しかし、このようなレガシーデータマッピングのコンテキスト外への使用は推奨しません。
pt_br: Nós não recomendamos o uso deste tipo de coisa fora do contexto de mapeamento de dados herdados.

source: Finally, polymorphic persistence requires the declaration of each subclass of the root persistent class. For the table-per-class-hierarchy mapping strategy, the <literal>&lt;subclass&gt;</literal> declaration is used.
ja_jp: 最後にポリモーフィックな永続化には、ルートの永続クラスの各サブクラスの定義が必要です。 table-per-class-hierarchyマッピング戦略では、 <literal>&lt;subclass&gt;</literal> 定義が使われます。
pt_br: Finalmente, a persistência polimórfica requer a declaração de cada subclasse da classe de persistência raiz. Para a estratégia de mapeamento table-per-class-hierarchy, a declaração <literal>&lt;subclass&gt;</literal> deve ser usada.

source: <literal>name</literal>: The fully qualified class name of the subclass.
ja_jp: <literal>name</literal>：サブクラスの完全修飾されたクラス名。

source: <literal>discriminator-value</literal> (optional - defaults to the class name): A value that distiguishes individual subclasses.
ja_jp: <literal>discriminator-value</literal>（オプション - デフォルトはクラス名）： 個々のサブクラスを区別するための値。
pt_br: <literal>discriminator-value</literal> (opcional – valor default o nome da classe): Um valor que distingue subclasses individuais.

source: Each subclass should declare its own persistent properties and subclasses. <literal>&lt;version&gt;</literal> and <literal>&lt;id&gt;</literal> properties are assumed to be inherited from the root class. Each subclass in a heirarchy must define a unique <literal>discriminator-value</literal>. If none is specified, the fully qualified Java class name is used.
ja_jp: 各サブクラスでは、永続プロパティとサブクラスを定義します。 <literal>&lt;version&gt;</literal> と <literal>&lt;id&gt;</literal> プロパティは、 ルートクラスから継承されると仮定されます。 階層構造におけるサブクラスは、 ユニークな <literal>discriminator-value</literal> を定義しなければなりません。 noneが指定されると、完全修飾されたJavaクラス名が使われます。
pt_br: Cada subclasse deve declarar suas próprias propriedades persistentes e subclasses. As propriedades <literal>&lt;version&gt;</literal> e <literal>&lt;id&gt;</literal> são configuradas para serem herdades da classe raiz. Cada subclasse numa hierarquia deve definir um único <literal>discriminator-value</literal>. Se nenhum for especificado, o nome da classe Java completamente qualificada será usada.

source: For information about inheritance mappings, see <xref linkend="inheritance"/>.
ja_jp: 継承のマッピングに関する情報は <xref linkend="inheritance"/> を見てください。

source: Alternatively, each subclass may be mapped to its own table (table-per-subclass mapping strategy). Inherited state is retrieved by joining with the table of the superclass. We use the <literal>&lt;joined-subclass&gt;</literal> element.
ja_jp: もう1つの方法として、各サブクラスを自身のテーブルへマッピングすることができます (table-per-subclass mapping strategy)。 継承した状態はスーパークラスのテーブルを使った結合で検索します。 <literal>&lt;joined-subclass&gt;</literal> 要素を使用します。
pt_br: Alternativamente, cada subclasse pode ser mapeada para sua própria tabela (Estratégia de mapeamento table-per-subclass). O estado herdado é devolvido por associação com a tabela da superclasse. Nós usamos o elemento <literal>&lt;joined-subclass&gt;</literal>.

source: <literal>table</literal>: The name of the subclass table.
ja_jp: <literal>table</literal> :サブクラステーブルの名前。
pt_br: <literal>table</literal>: O nome da tabela da subclasse.

source: No discriminator column is required for this mapping strategy. Each subclass must, however, declare a table column holding the object identifier using the <literal>&lt;key&gt;</literal> element. The mapping at the start of the chapter would be re-written as:
ja_jp: このマッピング戦略には、識別カラムは必要ありません。 しかし各サブクラスは <literal>&lt;key&gt;</literal> 要素を使い、 オブジェクト識別子を保持するテーブルカラムを定義しなければなりません。 この章の初めのマッピングは以下のように書き直せます：
pt_br: A coluna discriminator requerida para esta estratégia de mapeamento. Porém, cada subclasse deve declarar uma coluna de tabela com o identificador do objeto usando o elemento <literal>&lt;key&gt;</literal>. O mapeamento no início do capítulo poderia ser re-escrito assim:

source: A third option is to map only the concrete classes of an inheritance hierarchy to tables, (the table-per-concrete-class strategy) where each table defines all persistent state of the class, including inherited state. In Hibernate, it is not absolutely necessary to explicitly map such inheritance hierarchies. You can simply map each class with a separate <literal>&lt;class&gt;</literal> declaration. However, if you wish use polymorphic associations (e.g. an association to the superclass of your hierarchy), you need to use the <literal>&lt;union-subclass&gt;</literal> mapping.
ja_jp: 3つ目の選択肢は、継承階層の具象クラスのみをテーブルにマッピングすることです (the table-per-concrete-class戦略)。 それぞれのテーブルは継承の状態を含めすべてのクラスの永続状態を定義します。 Hibernateではその様な継承階層が必ずしも必要ではありません。 単純にそれぞれのクラスを、 別々の <literal>&lt;class&gt;</literal> 宣言を使ってマッピングすることができます。 しかしポリモーフィックな関連(例えば 階層のスーパークラスへの関連)を使いたいなら、 <literal>&lt;union-subclass&gt;</literal> マッピングを使う必要があります。
pt_br: Uma terceira opção é mapear para tabelas apenas as classes concretas de uma hierarquia de heranças, (a estratégia table-per-concrete-class) onde cada tabela define todos os estados persistentes da classe, incluindo estados herdados. No Hibernate, não é absolutamente necessário mapear explicitamente como hierarquia de heranças. Você pode simplesmente mapear cada classe com uma declaração <literal>&lt;class&gt;</literal> separada. Porém, se você deseja usar associações polimórficas (por exemplo: uma associação para a superclasse de sua hierarquia), você precisa usar o mapeamento <literal>&lt;union-subclass&gt;</literal>.

source: No discriminator column or key column is required for this mapping strategy.
ja_jp: このマッピング戦略では識別カラムやキーカラムは必要ありません。
pt_br: A coluna discriminatõria não é requerida para esta estratégia de mapeamento.

source: Using the <literal>&lt;join&gt;</literal> element, it is possible to map properties of one class to several tables, when there's a 1-to-1 relationship between the tables.
ja_jp: <literal>&lt;join&gt;</literal> 要素を使うことで、 １つのクラスのプロパティをいくつものテーブルにマッピングすることができます。
pt_br: Usando o elemento <literal>&lt;join&gt;</literal>&gt;, é possível mapear propriedades de uma classe para várias tabelas.

source: <literal>table</literal>: The name of the joined table.
ja_jp: <literal>table</literal> :結合したテーブルの名前
pt_br: <literal>table</literal>: O nome da tabela associada.

source: <literal>fetch</literal> (optional - defaults to <literal>join</literal>): If set to <literal>join</literal>, the default, Hibernate will use an inner join to retrieve a <literal>&lt;join&gt;</literal> defined by a class or its superclasses and an outer join for a <literal>&lt;join&gt;</literal> defined by a subclass. If set to <literal>select</literal> then Hibernate will use a sequential select for a <literal>&lt;join&gt;</literal> defined on a subclass, which will be issued only if a row turns out to represent an instance of the subclass. Inner joins will still be used to retrieve a <literal>&lt;join&gt;</literal> defined by the class and its superclasses.
ja_jp: <literal>fetch</literal> (オプション - デフォルトは <literal>join</literal> ): <literal>join</literal> を設定した場合、 Hibernateはデフォルトで、クラスやスーパークラスで定義された <literal>&lt;join&gt;</literal> を検索するのに内部結合を使い、サブクラスで定義された <literal>&lt;join&gt;</literal> を検索するのに外部結合を使います。 <literal>select</literal> を設定した場合には、 Hibernateはサブクラスで定義された <literal>&lt;join&gt;</literal> の選択に順次選択を使います。この場合、 行がサブクラスのインスタンスを代表することがわかった場合にのみ発行されます。 内部結合はクラスやそのスーパークラスで定義された <literal>&lt;join&gt;</literal> を検索 するために使用します。
pt_br: <literal>fetch</literal>(opcional – valor default <literal>join</literal>): Se setado para <literal>join</literal>, o padrão, o Hibernate irá usar um inner join para restaurar um <literal>join</literal> definido por uma classe ou suas subclasses e uma outer join para um <literal>join</literal> definido por uma subclasse. Se setado para <literal>select</literal>, então o Hibernate irá usar uma seleção seqüencial para um <literal>&lt;join&gt;</literal> definida numa subclasse, que irá ser emitido apenas se uma linha se concentrar para representar uma instância da subclasse. Inner joins irá ainda ser usado para restaurar um <literal>&lt;join&gt;</literal> definido pela classe e suas superclasses.

source: <literal>inverse</literal> (optional - defaults to <literal>false</literal>): If enabled, Hibernate will not try to insert or update the properties defined by this join.
ja_jp: <literal>inverse</literal> (オプション - デフォルトは <literal>false</literal> ): もし可能であれば、Hibernateはこの結合で定義されているプロパティに対し 挿入や更新を行いません。
pt_br: <literal>inverse</literal> (opcional – valor default <literal>false</literal>): Se habilitado, o Hibernate não irá tentar inserir ou atualizar as propriedades definidas por este join.

source: <literal>optional</literal> (optional - defaults to <literal>false</literal>): If enabled, Hibernate will insert a row only if the properties defined by this join are non-null and will always use an outer join to retrieve the properties.
ja_jp: <literal>optional</literal> (オプション - デフォルトは <literal>false</literal> ): もし可能であれば、Hibernateはこの結合で定義されたプロパティがnullでない場合にのみ 行を挿入し、そのプロパティの検索には常に外部結合を使用します。
pt_br: <literal>optional</literal> (opcional – valor default <literal>false</literal>): Se habilitado, o Hibernate irá inserir uma linha apenas se as propriedades definidas por esta junção não forem nulas e irá sempre usar uma outer join para recuperar as propriedades.

source: For example, the address information for a person can be mapped to a separate table (while preserving value type semantics for all properties):
ja_jp: 例えば人のアドレスの情報を分離したテーブルにマッピングすることが可能です (すべてのプロパティに対して値型のセマンティクスを保持します)。
pt_br: Por exemplo, a informação de endereço para uma pessoa pode ser mapeada para uma tabela separada (enquanto preservando o valor da semântica de tipos para todas as propriedades):

source: This feature is often only useful for legacy data models, we recommend fewer tables than classes and a fine-grained domain model. However, it is useful for switching between inheritance mapping strategies in a single hierarchy, as explained later.
ja_jp: この特徴はしばしばレガシーデータモデルに対してのみ有用ですが、 クラスよりも少ないテーブルと、きめの細かいドメインモデルを推奨します。 しかし後で説明するように、１つのクラス階層で継承のマッピング戦略を切り替える時には有用です。
pt_br: Esta característica é útil apenas para modelos de dados legados, nós recomendamos menos tabelas do que classes e um modelo de domínio bem granulado. Porém, é útil para ficar trocando entre estratégias de mapeamento de herança numa hierarquia simples, como explicado mais a frente.

source: We've seen the <literal>&lt;key&gt;</literal> element crop up a few times now. It appears anywhere the parent mapping element defines a join to a new table, and defines the foreign key in the joined table, that references the primary key of the original table.
ja_jp: 今まで何度か <literal>&lt;key&gt;</literal> 要素が出てきました。 この要素は新しいテーブルへの結合を定義したり、 結合テーブルで外部キーを定義したりする親要素のどこにでも現れ、 オリジナルテーブルの主キーを参照します。
pt_br: Nós vimos que o elemento <literal>&lt;key&gt;</literal> surgiu algumas vezes até agora. Ele aparece em qualquer lugar que o elemento pai define uma junção para a nova tabela, e define a chave estrangeira para a tabela associada, que referencia a chave primária da tabela original.

source: <literal>on-delete</literal> (optional, defaults to <literal>noaction</literal>): Specifies whether the foreign key constraint has database-level cascade delete enabled.
ja_jp: <literal>on-delete</literal> (オプション, デフォルトは <literal>noaction</literal>): 外部キー制約がデータベースレベルでカスケード削除が可能かどうかを指定します。
pt_br: <literal>on-delete</literal> (opcional, valor default <literal>noaction</literal>): Especifica se a constraint da chave estrangeira no banco de dados esta habilitada para cascade delete .

source: <literal>property-ref</literal> (optional): Specifies that the foreign key refers to columns that are not the primary key of the orginal table. (Provided for legacy data.)
ja_jp: <literal>property-ref</literal> (オプション): オリジナルテーブルの主キーではないカラムを参照する外部キーを指定します (レガシーデータに対して提供されます)。
pt_br: <literal>property-ref</literal> (opcional): Especifica que a chave estrangeira se refere a colunas que não são chave primária da tabela original. (Util para base de dados legadas.)

source: <literal>not-null</literal> (optional): Specifies that the foreign key columns are not nullable (this is implied whenever the foreign key is also part of the primary key).
ja_jp: <literal>not-null</literal> (オプション): 外部キーカラムがnull値を許容しないことを指定します (このことは外部キーが主キーの一部であることを暗黙的に示します)。
pt_br: <literal>not-null</literal> (opcional): Especifica que a coluna da chave estrangeira não aceita valores nulos (isto é implícito em qualquer momento que a chave estrangeira também fizer parte da chave primária).

source: <literal>update</literal> (optional): Specifies that the foreign key should never be updated (this is implied whenever the foreign key is also part of the primary key).
ja_jp: <literal>update</literal> (オプション): 外部キーを決して更新してはならないことを指定します (このことは外部キーが主キーの一部であることを暗黙的に示します)。
pt_br: <literal>update</literal> (optional): Specifies that the foreign key should never be updated (this is implied whenever the foreign key is also part of the primary key). <literal>update</literal> (opcional): Especifica que a chave estrangeira nunca deve ser atualizada (isto é implícito em qualquer momento que a chave estrangeira também fizer parte da chave primária).

source: <literal>unique</literal> (optional): Specifies that the foreign key should have a unique constraint (this is implied whenever the foreign key is also the primary key).
ja_jp: <literal>unique</literal> (オプション): 外部キーがユニーク制約を持つべきであることを指定します (このことは外部キーが主キーの一部であることを暗黙的に示します)。
pt_br: <literal>unique</literal> (opcional): Especifica que a chave estrangeira deve ter uma constraint unique (sto é implícito em qualquer momento que a chave estrangeira também fizer parte da chave primária).

source: We recommend that for systems where delete performance is important, all keys should be defined <literal>on-delete="cascade"</literal>, and Hibernate will use a database-level <literal>ON CASCADE DELETE</literal> constraint, instead of many individual <literal>DELETE</literal> statements. Be aware that this feature bypasses Hibernate's usual optimistic locking strategy for versioned data.
ja_jp: 削除のパフォーマンスが重要であるシステムには、 すべてのキーを <literal>on-delete="cascade"</literal> と定義することを推奨します。 そうすることでHibernateは、<literal>DELETE</literal> 文を毎回発行する代わりに、 データベースレベルの <literal>ON CASCADE DELETE</literal> 制約を使用します。 この特徴はバージョン付けられたデータに対するHibernateの通常の楽観的ロック戦略を 無視するということに注意してください。
pt_br: Nós recomendamos que para sistemas que a performance de delete seja importante, todas as chaves deve ser definida <literal>on-delete="cascade"</literal>, e o Hibernate irá usar uma constraint a nível de banco de dados <literal>ON CASCADE DELETE</literal>, ao invés de muitas instruções <literal>DELETE</literal>. Esteja ciente que esta característica é um atalho da estratégia usual de optimistic locking do Hibernate para dados versionados.

source: The <literal>not-null</literal> and <literal>update</literal> attributes are useful when mapping a unidirectional one to many association. If you map a unidirectional one to many to a non-nullable foreign key, you <emphasis>must</emphasis> declare the key column using <literal>&lt;key not-null="true"&gt;</literal>.
ja_jp: <literal>not-null</literal> と <literal>update</literal> 属性は、単方向一対多関連の時には有用です。 単方向一対多関連をnullを許容しない外部キーにマッピングするときは、 <literal>&lt;key not-null="true"&gt;</literal> を使ってキーカラムを宣言 <emphasis> しなくてはなりません</emphasis> 。
pt_br: Os atributos <literal>not-null</literal> e <literal>update</literal> são úteis quando estamos mapeamos uma associação unidirecional um para muitos. Se você mapear uma asociação unidirecional um para muitos para uma chave estrangeira non-nullable, você <emphasis>deve</emphasis> declarar a coluna chave usando <literal>&lt;key not-null="true"&gt;</literal>.

source: column and formula elements
ja_jp: column と formula 要素
pt_br: elementos column e formula

source: Any mapping element which accepts a <literal>column</literal> attribute will alternatively accept a <literal>&lt;column&gt;</literal> subelement. Likewise, <literal>&lt;formula&gt;</literal> is an alternative to the <literal>formula</literal> attribute.
ja_jp: <literal>column</literal> 属性を記述できる任意のマッピング要素はまた、 <literal>&lt;column&gt;</literal> サブ要素も記述できます。 同様に <literal>&lt;formula&gt;</literal> も <literal>formula</literal> 属性の代替手段です。
pt_br: Qualquer elemento de mapeamente que aceita um atributo <literal>column</literal> irá aceitar alternativamente um subelemento <literal>&lt;column&gt;</literal>. Da mesma forma, <literal>formula</literal> é uma alternativa para o atributo <literal>formula</literal>.

source: <literal>column</literal> and <literal>formula</literal> attributes may even be combined within the same property or association mapping to express, for example, exotic join conditions.
ja_jp: 同じプロパティや関連のマッピングの中で、 <literal>column</literal> と <literal>formula</literal> 属性を組み合わせることができます。 例えば、特殊な結合条件などです。
pt_br: O atributo <literal>column</literal> e <literal>formula</literal> podem até ser combinados dentro da mesma propriedade ou associação mapeando para expressar, por exemplo, associações exóticas.

source: Suppose your application has two persistent classes with the same name, and you don't want to specify the fully qualified (package) name in Hibernate queries. Classes may be "imported" explicitly, rather than relying upon <literal>auto-import="true"</literal>. You may even import classes and interfaces that are not explicitly mapped.
ja_jp: アプリケーションに同じ名前の2つの永続クラスがあり、 Hibernateクエリで完全修飾された（パッケージの）名前を指定したくないと仮定します。 そのような場合は <literal>auto-import="true"</literal> に頼らず、 クラスが「インポート」されたものであると明示できます。 明示的にマッピングされていないクラスやインターフェイスでさえもインポートできます。
pt_br: Suponha que a sua aplicação tem duas classes persistentes com o mesmo nome, e você não quer especificar o nome qualificado (do pacote) nas queries do Hibernate. As Classes devem ser "importadas" explicitamente, de preferência contando com <literal>auto-import="true"</literal>. Você pode até importar classes e interfaces que não estão explicitamente mapeadas.

source: <literal>class</literal>: The fully qualified class name of of any Java class.
ja_jp: <literal>class</literal>：Javaクラスの完全修飾されたクラス名。
pt_br: <literal>class</literal>: O nome qualificado (do pacote) de qualquer classe Java.

source: <literal>rename</literal> (optional - defaults to the unqualified class name): A name that may be used in the query language.
ja_jp: <literal>rename</literal>（オプション - デフォルトは修飾されていないクラス名）： クエリ言語で使われる名前。
pt_br: <literal>rename</literal> (opcional – valor default, o nome da classe não qualificada): Um nome que pode ser usado numa linguagem de consulta.

source: There is one further type of property mapping. The <literal>&lt;any&gt;</literal> mapping element defines a polymorphic association to classes from multiple tables. This type of mapping always requires more than one column. The first column holds the type of the associated entity. The remaining columns hold the identifier. It is impossible to specify a foreign key constraint for this kind of association, so this is most certainly not meant as the usual way of mapping (polymorphic) associations. You should use this only in very special cases (eg. audit logs, user session data, etc).
ja_jp: プロパティマッピングにはさらにもう1つの型があります。 <literal>&lt;any&gt;</literal> マッピング要素は、 複数のテーブルからクラスへのポリモーフィックな関連を定義します。 この型のマッピングには必ず複数のカラムが必要です。1番目のカラムは関連エンティティの型を保持します。 残りのカラムは識別子を保持します。この種類の関連には外部キー制約を指定することはできません。 そのためこれは最も使われることのない（ポリモーフィックな）関連のマッピング方法です。 非常に特別な場合（例えば、検査ログやユーザセッションデータなど)に限って、これを使うべきです。
pt_br: Existe mais um tipo de propriedade de mapeamento. O elemento de mapeamento <literal>&lt;any&gt;</literal> define uma associação polimórfica para classes de múltiplas tabelas. Este tipo de mapeamento sempre requer mais de uma coluna. A primeira coluna possui o tipo da entidade associada. A outra coluna que ficou possui o identificador. É impossível especificar uma restrição de chave estrangeira para este tipo de associação, assim isto claramente não é visto como um caminho usual para associações (polimórficas) de mapeamento. Você deve usar este mapeamento apenas em casos muito especiais (exemplo: audit logs, dados de sessão do usuário, etc).

source: The <literal>meta-type</literal> attribute lets the application specify a custom type that maps database column values to persistent classes which have identifier properties of the type specified by <literal>id-type</literal>. You must specify the mapping from values of the meta-type to class names.
ja_jp: <literal>meta-type</literal> により、 アプリケーションはカスタム型を指定できます。このカスタム型は データベースカラムの値を、<literal>id-type</literal> で指定した型の 識別子プロパティを持った永続クラスへマッピングします。 meta-typeの値からクラス名へのマッピングを指定しなければなりません。
pt_br: O atributo <literal>meta-type</literal> permite a aplicação especificar um tipo adaptado que mapeia valores de colunas de banco de dados para classes persistentes que tem propriedades identificadoras do tipo especificado através do <literal>id-type</literal>. Você deve especificar o mapeamento de valores do meta-type para nome de classes.

source: <literal>name</literal>: the property name.
ja_jp: <literal>name</literal>：プロパティ名。
pt_br: <literal>name</literal>: o nome da propriedade.

source: <literal>id-type</literal>: the identifier type.
ja_jp: <literal>id-type</literal>：識別子の型。
pt_br: <literal>id-type</literal>: o tipo identificador.

source: <literal>meta-type</literal> (optional - defaults to <literal>string</literal>): Any type that is allowed for a discriminator mapping.
ja_jp: <literal>meta-type</literal>（オプション - デフォルトは <literal>string</literal> ）： ディスクリミネータマッピングで許された型
pt_br: <literal>meta-type</literal> (opcional – valor default <literal>string</literal>): Qualquer tipo que é permitido para um mapeamento discriminador.
