Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/batch.po
Languages: pt_br

source: Batch processing
pt_br: Processamento de lotes

source: A naive approach to inserting 100 000 rows in the database using Hibernate might look like this:
pt_br: Uma alternativa para inserir 100.000 linhas no banco de dados usando o Hibernate pode ser a seguinte:

source: This would fall over with an <literal>OutOfMemoryException</literal> somewhere around the 50 000th row. That's because Hibernate caches all the newly inserted <literal>Customer</literal> instances in the session-level cache.
pt_br: Isto irá falhar em algum lugar próximo a linha 50.000, lançando uma <literal>OutOfMemoryException</literal>. Isso ocorre devido ao fato do Hibernate fazer cache de todas as instâncias de <literal>Customer</literal> inseridas num cachê em nível de sessão.

source: In this chapter we'll show you how to avoid this problem. First, however, if you are doing batch processing, it is absolutely critical that you enable the use of JDBC batching, if you intend to achieve reasonable performance. Set the JDBC batch size to a reasonable number (say, 10-50):
pt_br: Neste capítulo veremos como contornar esse problema. Entretanto, se você vai realizar processamento de lotes, é muito importante que você habilite o uso de lotes JDBC, se você pretende obter um desempenho razoável. Defina o tamanho do lote JDBC em um valor razoável (algo entre 10-50):

source: Note that Hibernate disables insert batching at the JDBC level transparently if you use an <literal>identiy</literal> identifier generator.
pt_br: Você também pode querer rodar esse tipo de processamento de lotes com o cache secundário completamente desabilitado:

source: You also might like to do this kind of work in a process where interaction with the second-level cache is completely disabled:
pt_br: Note that Hibernate disables insert batching at the JDBC level transparently if you use an <literal>identiy</literal> identifier generator.

source: However, this is not absolutely necessary, since we can explicitly set the <literal>CacheMode</literal> to disable interaction with the second-level cache.
pt_br: Mas isto não é absolutamente necessário, desde que nós possamos ajustar o <literal>CacheMode</literal> para desabilitar a interação com o cache secundário.

source: Batch inserts
pt_br: Inserção de lotes

source: When making new objects persistent, you must <literal>flush()</literal> and then <literal>clear()</literal> the session regularly, to control the size of the first-level cache.
pt_br: Quando você estiver inserindo novos objetos persistentes, vocês deve executar os métodos <literal>flush()</literal> e <literal>clear()</literal> regularmente na sessão, para controlar o tamanho do cache primário.

source: For retrieving and updating data the same ideas apply. In addition, you need to use <literal>scroll()</literal> to take advantage of server-side cursors for queries that return many rows of data.
pt_br: Para recuperar e atualizar informações a mesma idéia é válida. Adicionalmente, pode precisar usar o <literal>scroll()</literal> para usar recursos no lado do servidor em queries que retornam muita informação.

source: The StatelessSession interface
pt_br: A interface StatelessSession

source: Alternatively, Hibernate provides a command-oriented API that may be used for streaming data to and from the database in the form of detached objects. A <literal>StatelessSession</literal> has no persistence context associated with it and does not provide many of the higher-level life cycle semantics. In particular, a stateless session does not implement a first-level cache nor interact with any second-level or query cache. It does not implement transactional write-behind or automatic dirty checking. Operations performed using a stateless session do not ever cascade to associated instances. Collections are ignored by a stateless session. Operations performed via a stateless session bypass Hibernate's event model and interceptors. Stateless sessions are vulnerable to data aliasing effects, due to the lack of a first-level cache. A stateless session is a lower-level abstraction, much closer to the underlying JDBC.
pt_br: Alternativamente, o Hibernate provê uma API orientada à comandos, usada para transmitir um fluxo de dados de e para o banco de dados na forma de objetos soltos. Uma <literal>StatelessSession</literal> não tem um contexto persistente associado e não fornece muito das semânticas de alto nível para controle do ciclo de vida. Em especial, uma StatelessSession não implemente o cache primário e nem interage com o cache secundário ou query cache. Ele não implementa salvamento transacional automatico ou checagem automática de mudanças. Operação realizadas usando uma StatelessSession não fazem nenhum tipo de cascade com as instancias associadas. As coleções são ignoradas por uma StatelessSession. Operações realizadas com um StatelessSession ignoram a arquitetura de eventos e os interceptadores. StatelessSession são vulneráveis aos efeitos do aliasing dos dados, devido a falta do cache primário. Uma StatelessSession é uma abstração de baixo nível, muito mais próxima do JDBC.

source: Note that in this code example, the <literal>Customer</literal> instances returned by the query are immediately detached. They are never associated with any persistence context.
pt_br: Veja neste exempo, as instancias de <literal>Customer</literal> retornadas pela query são imediatamente desvinculadas. Elas nunca serão assossiadas à um contexto persistente.

source: The <literal>insert(), update()</literal> and <literal>delete()</literal> operations defined by the <literal>StatelessSession</literal> interface are considered to be direct database row-level operations, which result in immediate execution of a SQL <literal>INSERT, UPDATE</literal> or <literal>DELETE</literal> respectively. Thus, they have very different semantics to the <literal>save(), saveOrUpdate()</literal> and <literal>delete()</literal> operations defined by the <literal>Session</literal> interface.
pt_br: As operações <literal>insert(), update()</literal> e <literal>delete()</literal> definidos pela interface <literal>StatelessSession</literal> são considerados operações diretas no banco de dados (row-level operations), isso resulta em uma execução imediata de comandos SQL <literal>INSERT, UPDATE</literal> ou <literal>DELETE</literal> respectivamente. Devido a isso, eles possuem uma semântica bem diferente das operações <literal>save(), saveOrUpdate()</literal> ou <literal>delete()</literal> definidas na interface <literal>Session</literal>.

source: DML-style operations
pt_br: Operações no estilo DML

source: As already discussed, automatic and transparent object/relational mapping is concerned with the management of object state. This implies that the object state is available in memory, hence manipulating (using the SQL <literal>Data Manipulation Language</literal> (DML) statements: <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>) data directly in the database will not affect in-memory state. However, Hibernate provides methods for bulk SQL-style DML statement execution which are performed through the Hibernate Query Language (<link linkend="queryhql">HQL</link>).
pt_br: Como já discutido, mapeamento objeto/relacional automático e transparente é conseguido com a gerência do estado do objeto. Com isto o estado daquele objeto fica disponível na memória, manipulando(usando as expressões SQL <literal>Data Manipulation Language</literal> (SQL-style DML): <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>) os dados diretamente no banco de dados não irá afetar o estado registrado em memória. Entretanto, o Hibernate provê métodos para executar queries SQL-style DML, que são totalmente executas com HQL (Hibernate Query Language) (<xref linkend="queryhql">HQL</xref>).

source: The pseudo-syntax for <literal>UPDATE</literal> and <literal>DELETE</literal> statements is: <literal>( UPDATE | DELETE ) FROM? EntityName (WHERE where_conditions)?</literal>. Some points to note:
pt_br: A pseudo-sintaxe para expressões <literal>UPDATE</literal> e <literal>DELETE</literal> é: <literal>( UPDATE | DELETE ) FROM? NomeEntidade (WHERE condições_where)?</literal>. Algumas observações:

source: In the from-clause, the FROM keyword is optional
pt_br: Na clausula from, a palavra chave FROM é opcional;

source: There can only be a single entity named in the from-clause; it can optionally be aliased. If the entity name is aliased, then any property references must be qualified using that alias; if the entity name is not aliased, then it is illegal for any property references to be qualified.
pt_br: Somente uma entidade pode ser chamada na clausula from; opcionalmente pode ter um alias. Se o nome da entidade for possuir um alias, então qualquer propriedade referenciada deve usar esse alias qualificado; se o nome da entidade não possuir um alias, então nenhuma das propriedade precisa usar o acesso qualificado.

source: No <link linkend="queryhql-joins-forms">joins</link> (either implicit or explicit) can be specified in a bulk HQL query. Sub-queries may be used in the where-clause; the subqueries, themselves, may contain joins.
pt_br: Na <xref linkend="queryhql-joins-forms">joins</xref> (ambas implícita ou explicita) pode ser especificada em um bulk HQL query. Sub-queries podem ser usadas na clausula where; as subqueries podem conter joins.

source: The where-clause is also optional.
pt_br: A clausula where também é opcional.

source: As an example, to execute an HQL <literal>UPDATE</literal>, use the <literal>Query.executeUpdate()</literal> method (the method is named for those familiar with JDBC's <literal>PreparedStatement.executeUpdate()</literal>):
pt_br: Como exemplo para executar um HQL <literal>UPDATE</literal>, use o método <literal>Query.executeUpdate()</literal>(o método ganhou o nome devido a sua familiaridade com o do JDBC <literal>PreparedStatement.executeUpdate()</literal>):

source: HQL <literal>UPDATE</literal> statements, by default do not effect the <link linkend="mapping-declaration-version">version</link> or the <link linkend="mapping-declaration-timestamp">timestamp</link> property values for the affected entities; this is in keeping with the EJB3 specification. However, you can force Hibernate to properly reset the <literal>version</literal> or <literal>timestamp</literal> property values through the use of a <literal>versioned update</literal>. This is achieved by adding the <literal>VERSIONED</literal> keyword after the <literal>UPDATE</literal> keyword.
pt_br: HQL <literal>UPDATE</literal> statements, by default do not effect the <xref linkend="mapping-declaration-version">version</xref> or the <xref linkend="mapping-declaration-timestamp">timestamp</xref> property values for the affected entities; this is in keeping with the EJB3 specification. However, you can force Hibernate to properly reset the <literal>version</literal> or <literal>timestamp</literal> property values through the use of a <literal>versioned update</literal>. This is achieved by adding the <literal>VERSIONED</literal> keyword after the <literal>UPDATE</literal> keyword.

source: To execute an HQL <literal>DELETE</literal>, use the same <literal>Query.executeUpdate()</literal> method:
pt_br: Para executar um HQL <literal>DELETE</literal>, use o mesmo método <literal>Query.executeUpdate()</literal>:

source: The <literal>int</literal> value returned by the <literal>Query.executeUpdate()</literal> method indicate the number of entities effected by the operation. Consider this may or may not correlate to the number of rows effected in the database. An HQL bulk operation might result in multiple actual SQL statements being executed, for joined-subclass, for example. The returned number indicates the number of actual entities affected by the statement. Going back to the example of joined-subclass, a delete against one of the subclasses may actually result in deletes against not just the table to which that subclass is mapped, but also the "root" table and potentially joined-subclass tables further down the inheritence hierarchy.
pt_br: O valor <literal>int</literal> retornado pelo método <literal>Query.executeUpdate()</literal> indica o numero de entidade afetadas pela operação. Lembre-se que isso pode estar ou não relacionado ao número de linhas alteradas no banco de dados. Uma operação bulk HQL pode resultar em várias expressões SQL reais a serem executadas, por exemplo, no caso de joined-subclass. O número retornado indica a quantidade real de entidades afetadas pela expressão. Voltando ao exemplo da joined-subclass, a exclusão de uma das subclasses pode resultar numa exclusão em outra tabelas, não apenas na tabela para qual a subclasses está mapeada, mas também tabela "root" e possivelmente nas tabelas joined-subclass num nível hierárquico imediatamente abaixo.

source: The pseudo-syntax for <literal>INSERT</literal> statements is: <literal>INSERT INTO EntityName properties_list select_statement</literal>. Some points to note:
pt_br: A pseudo-sintaxe para o comando <literal>INSERT</literal> é: <literal>INSERT INTO EntityName properties_list select_statement</literal>. Alguns pontos a observar:

source: Only the INSERT INTO ... SELECT ... form is supported; not the INSERT INTO ... VALUES ... form.
pt_br: Apenas a forma INSERT INTO ... SELECT ... é suportada; INSERT INTO ... VALUES ... não é suportada.

source: The properties_list is analogous to the <literal>column speficiation</literal> in the SQL <literal>INSERT</literal> statement. For entities involved in mapped inheritence, only properties directly defined on that given class-level can be used in the properties_list. Superclass properties are not allowed; and subclass properties do not make sense. In other words, <literal>INSERT</literal> statements are inherently non-polymorphic.
pt_br: A lista de propriedade é análoga à <literal>especificação da coluna</literal> do comando SQL <literal>INSERT</literal>. Para entidades envolvidas em mapeamentos, apenas a propriedades definidas diretamente a nível da classe podem ser usandas na properties_list. Propriedades da superclass não são permitidas; e as propriedades da subclasse não faz sentido. Em outras palavras, os comandos <literal>INSERT</literal> não são polimorficos.

source: select_statement can be any valid HQL select query, with the caveat that the return types must match the types expected by the insert. Currently, this is checked during query compilation rather than allowing the check to relegate to the database. Note however that this might cause problems between Hibernate <literal>Type</literal>s which are <emphasis>equivalent</emphasis> as opposed to <emphasis>equal</emphasis>. This might cause issues with mismatches between a property defined as a <literal>org.hibernate.type.DateType</literal> and a property defined as a <literal>org.hibernate.type.TimestampType</literal>, even though the database might not make a distinction or might be able to handle the conversion.
pt_br: O camando select pode ser qualquer query HQL válida, que tenha um retorno compatível com o tipo com o esperado pela inclusão. Atualmente, isto é verificado durante a compilação da query, isto é melhor do que permitir que a verificação chegue ao banco de dados. Entretanto perceba que isso pode causar problemas entre os <literal>Tipo</literal> do Hibernate que são <emphasis>equivalentes</emphasis> em oposição a <emphasis>equal</emphasis>. Isso pode causar problemas nas combinações entre a propriedade definida como <literal>org.hibernate.type.DateType</literal>e um propriedade definida como <literal>org.hibernate.type.TimestampType</literal>, embora o banco de dados não possa fazer uma distinção ou possa ser capaz de manusear a conversão.

source: For the id property, the insert statement gives you two options. You can either explicitly specify the id property in the properties_list (in which case its value is taken from the corresponding select expression) or omit it from the properties_list (in which case a generated value is used). This later option is only available when using id generators that operate in the database; attempting to use this option with any "in memory" type generators will cause an exception during parsing. Note that for the purposes of this discussion, in-database generators are considered to be <literal>org.hibernate.id.SequenceGenerator</literal> (and its subclasses) and any implementors of <literal>org.hibernate.id.PostInsertIdentifierGenerator</literal>. The most notable exception here is <literal>org.hibernate.id.TableHiLoGenerator</literal>, which cannot be used because it does not expose a selectable way to get its values.
pt_br: Para a propriedade id, a expressão insert oferece duas opções. Você pode especificar qualquer propriedade id explicitamente no properties_list (em alguns casos esse valor é obtido diretamente da expressão select) ou pode omitir do properties_list (nesse caso, um valor gerado é usado). Essa ultima opção só é válida quando são usados geradores de ids que operam no banco de dados; a tentativa de usar essa opção com geradores do tipo "em memória" vai causar um exceção durante a etapa de parser. Veja a finalidades desta discussão, os seguintes geradores operam com o banco de dados <literal>org.hibernate.id.SequenceGenerator</literal> (e suas subclasses) e qualquer implementação de <literal>org.hibernate.id.PostInsertIdentifierGenerator</literal>. Aqui, a exceção mais notável é o <literal>org.hibernate.id.TableHiLoGenerator</literal>, que não pode ser usado porque ele não dispõe de mecanismos para recuperar o seu valor.

source: For properties mapped as either <literal>version</literal> or <literal>timestamp</literal>, the insert statement gives you two options. You can either specify the property in the properties_list (in which case its value is taken from the corresponding select expressions) or omit it from the properties_list (in which case the <literal>seed value</literal> defined by the <literal>org.hibernate.type.VersionType</literal> is used).
pt_br: For properties mapped as either <literal>version</literal> or <literal>timestamp</literal>, the insert statement gives you two options. You can either specify the property in the properties_list (in which case its value is taken from the corresponding select expressions) or omit it from the properties_list (in which case the <literal>seed value</literal> defined by the <literal>org.hibernate.type.VersionType</literal> is used). Para propriedades mapeadas como <literal>version</literal> ou <literal>timestamp</literal>, a expressão insert oferece a você duas opções. Você pode especificar a propriedade na properties_list (nesse caso o seu valor é obtido a partir da expressão select correspondente) ou ele pode ser omitido da properties_list (neste caso o usa o <literal>valor semente</literal> definido pela classe <literal>org.hibernate.type.VersionType</literal>).

source: An example HQL <literal>INSERT</literal> statement execution:
pt_br: Exemplo da execução de um HQL <literal>INSERT</literal>:
