Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/component_mapping.po
Languages: es_es

source: Component Mapping
es_es: Mapeo de Componentes

source: The notion of a <emphasis>component</emphasis> is re-used in several different contexts, for different purposes, throughout Hibernate.
es_es: La noci&#x00f3;n de un <emphasis>componente</emphasis> es reusada en muchos contextos diferentes, para prop&#x00f3;sitos diferentes, a trav&#x00e9;s de Hibernate.

source: Dependent objects
es_es: Objetos dependientes

source: A component is a contained object that is persisted as a value type, not an entity reference. The term "component" refers to the object-oriented notion of composition (not to architecture-level components). For example, you might model a person like this:
es_es: Un componente es un objeto contenido que es persistido como un tipo de valor, no una referencia de entidad. El t&#x00e9;rmino "componente" hace referencia a la noci&#x00f3;n orientada a objetos de composici&#x00f3;n (no a componentes a nivel de arquitectura). Por ejemplo, podr&#x00ed;as modelar una persona como:

source: Now <literal>Name</literal> may be persisted as a component of <literal>Person</literal>. Notice that <literal>Name</literal> defines getter and setter methods for its persistent properties, but doesn't need to declare any interfaces or identifier properties.
es_es: Ahora <literal>Name</literal> puede ser persistido como un componente de <literal>Person</literal>. Observa que <literal>Name</literal> define m&#x00e9;todos getter y setter para sus propiedades persistentes, pero no necesita declarar ninguna interface ni propiedades identificadoras.

source: Our Hibernate mapping would look like:
es_es: Nuestro mapeo de Hibernate se ver&#x00ed;a as&#x00ed;:

source: <![CDATA[<class name="eg.Person" table="person"> <id name="Key" column="pid" type="string"> <generator class="uuid"/> </id> <property name="birthday" type="date"/> <component name="Name" class="eg.Name"> <!-- class attribute optional --> <property name="initial"/> <property name="first"/> <property name="last"/> </component> </class>]]>
es_es: <![CDATA[<class name="eg.Person" table="person"> <id name="Key" column="pid" type="string"> <generator class="uuid.hex"/> </id> <property name="birthday" type="date"/> <component name="Name" class="eg.Name"> <!-- class attribute optional --> <property name="initial"/> <property name="first"/> <property name="last"/> </component> </class>]]>

source: The person table would have the columns <literal>pid</literal>, <literal>birthday</literal>, <literal>initial</literal>, <literal>first</literal> and <literal>last</literal>.
es_es: La tabla person tendr&#x00ed;a las columnas <literal>pid</literal>, <literal>birthday</literal>, <literal>initial</literal>, <literal>first</literal> y <literal>last</literal>.

source: Like all value types, components do not support shared references. In other words, two persons could have the same name, but the two person objects would contain two independent name ojects, only "the same" by value. The null value semantics of a component are <emphasis>ad hoc</emphasis>. When reloading the containing object, Hibernate will assume that if all component columns are null, then the entire component is null. This should be okay for most purposes.
es_es: Como todos los tipos de valor, los componentes no soportan referencias compartidas. En otras palabras, dos personas pueden tener el mismo nombre, pero los dos objetos persona contendr&#x00ed;an dos objetos nombre independientes, s&#x00f3;lo "iguales" en valor. La sem&#x00e1;ntica de valor nulo de un componente es <emphasis>ad hoc</emphasis>. Cuando se recargue el objeto contenedor, Hibernate asumir&#x00e1; que si todas las columnas del componente son nulas, el componente entero es nulo. Esto debe estar bien para la mayor&#x00ed;a de prop&#x00f3;sitos.

source: The properties of a component may be of any Hibernate type (collections, many-to-one associations, other components, etc). Nested components should <emphasis>not</emphasis> be considered an exotic usage. Hibernate is intended to support a very fine-grained object model.
es_es: Las propiedades de un componentes pueden ser de cualquier tipo de Hibernate (colecciones, muchos-a-uno, asociaciones, otros componentes, etc). Los componentes anidados <emphasis>no</emphasis> deben ser considerados un uso ex&#x00f3;tico. Hibernate est&#x00e1; concebido para soportar un modelo de objetos granularizado en fino.

source: The <literal>&lt;component&gt;</literal> element allows a <literal>&lt;parent&gt;</literal> subelement that maps a property of the component class as a reference back to the containing entity.
es_es: El elemento <literal>&lt;component&gt;</literal> permite un subelemento <literal>&lt;parent&gt;</literal> que mapee una propiedad de la clase del componente como una referencia de regreso a la entidad contenedora.

source: <![CDATA[<class name="eg.Person" table="person"> <id name="Key" column="pid" type="string"> <generator class="uuid"/> </id> <property name="birthday" type="date"/> <component name="Name" class="eg.Name" unique="true"> <parent name="namedPerson"/> <!-- reference back to the Person --> <property name="initial"/> <property name="first"/> <property name="last"/> </component> </class>]]>
es_es: <![CDATA[<class name="eg.Person" table="person"> <id name="Key" column="pid" type="string"> <generator class="uuid.hex"/> </id> <property name="birthday" type="date"/> <component name="Name" class="eg.Name" unique="true"> <parent name="namedPerson"/> <!-- reference back to the Person --> <property name="initial"/> <property name="first"/> <property name="last"/> </component> </class>]]>

source: Collections of dependent objects
es_es: Colecciones de objetos dependientes

source: Collections of components are supported (eg. an array of type <literal>Name</literal>). Declare your component collection by replacing the <literal>&lt;element&gt;</literal> tag with a <literal>&lt;composite-element&gt;</literal> tag.
es_es: Las colecciones de componentes est&#x00e1;n soportadas (por ejemplo, un array de tipo <literal>Name</literal>). Declara tu colecci&#x00f3;n de componentes remplazando la etiqueta <literal>&lt;element&gt;</literal> por una etiqueta <literal>&lt;composite-element&gt;</literal>.

source: Note: if you define a <literal>Set</literal> of composite elements, it is very important to implement <literal>equals()</literal> and <literal>hashCode()</literal> correctly.
es_es: Nota: si defines un <literal>Set</literal> de elementos compuestos, es muy importante implementar <literal>equals()</literal> y <literal>hashCode()</literal> correctamente.

source: Composite elements may contain components but not collections. If your composite element itself contains components, use the <literal>&lt;nested-composite-element&gt;</literal> tag. This is a pretty exotic case - a collection of components which themselves have components. By this stage you should be asking yourself if a one-to-many association is more appropriate. Try remodelling the composite element as an entity - but note that even though the Java model is the same, the relational model and persistence semantics are still slightly different.
es_es: Los elementos compuestos pueden contener componentes pero no colecciones. Si tu elemento compuesto contiene a su vez componentes, usa la etiqueta <literal>&lt;nested-composite-element&gt;</literal>. Este es un caso bastante ex&#x00f3;tico - una colecci&#x00f3;n de componentes que a su vez tienen componentes. A esta altura debes estar pregunt&#x00e1;ndote si una asociaci&#x00f3;n uno-a-muchos es m&#x00e1;s apropiada. Intenta remodelar el elemento compuesto como una entidad - pero observa que aunque el modelo Java es el mismo, el modelo relacional y la sem&#x00e1;ntica de persistencia siguen siendo ligeramente diferentes.

source: Please note that a composite element mapping doesn't support null-able properties if you're using a <literal>&lt;set&gt;</literal>. Hibernate has to use each columns value to identify a record when deleting objects (there is no separate primary key column in the composite element table), which is not possible with null values. You have to either use only not-null properties in a composite-element or choose a <literal>&lt;list&gt;</literal>, <literal>&lt;map&gt;</literal>, <literal>&lt;bag&gt;</literal> or <literal>&lt;idbag&gt;</literal>.
es_es: Por favor observa que un mapeo de elemento compuesto no soporta propiedades nulables si est&#x00e1;s usando un <literal>&lt;set&gt;</literal>. Hibernate tiene que usar cada columna para identificar un registro al borrar objetos (no hay una columna clave primaria separada en la tabla del elemento compuesto), lo que es imposible con valores nulos. Tienes que, o bien usar s&#x00f3;lo propiedades no nulas en un elemento compuesto o elegir un <literal>&lt;list&gt;</literal>, <literal>&lt;map&gt;</literal>, <literal>&lt;bag&gt;</literal> o <literal>&lt;idbag&gt;</literal>.

source: A special case of a composite element is a composite element with a nested <literal>&lt;many-to-one&gt;</literal> element. A mapping like this allows you to map extra columns of a many-to-many association table to the composite element class. The following is a many-to-many association from <literal>Order</literal> to <literal>Item</literal> where <literal>purchaseDate</literal>, <literal>price</literal> and <literal>quantity</literal> are properties of the association:
es_es: Un caso especial de un elemento compuesto es un elemento compuesto con un elemento anidado <literal>&lt;many-to-one&gt;</literal>. Un mapeo como este te permite mapear columnas extra de una tabla de asociaci&#x00f3;n muchos-a-muchos a la clase del elemento compuesto. La siguiente es una asociaci&#x00f3;n muchos-a-muchos de <literal>Order</literal> a <literal>Item</literal> donde <literal>purchaseDate</literal>, <literal>price</literal> y <literal>quantity</literal> son propiedades de la asociaci&#x00f3;n:

source: Of course, there can't be a reference to the purchae on the other side, for bidirectional association navigation. Remember that components are value types and don't allow shared references. A single <literal>Purchase</literal> can be in the set of an <literal>Order</literal>, but it can't be referenced by the <literal>Item</literal> at the same time.
es_es: Por supuesto, no puede haber una referencia a la compra del otro lado para la navegaci&#x00f3;n bidireccional de la asociaci&#x00f3;n. Recuerda que los componentes son tipos de valor no permiten referencias compartidas. Una sola <literal>Purchase</literal> puede estar en el conjunto de una <literal>Order</literal>, pero no puede ser referenciada por el <literal>Item</literal> al mismo tiempo.

source: Even ternary (or quaternary, etc) associations are possible:
es_es: Incluso son posibles las asociaciones ternarias (o cuaternarias, etc):

source: Composite elements may appear in queries using the same syntax as associations to other entities.
es_es: Los elementos compuestos pueden aparecer en consultas usando la misma sint&#x00e1;xis que las asociaciones a otras entidades.

source: Components as Map indices
es_es: Componentes como &#x00ed;ndices de Map

source: The <literal>&lt;composite-map-key&gt;</literal> element lets you map a component class as the key of a <literal>Map</literal>. Make sure you override <literal>hashCode()</literal> and <literal>equals()</literal> correctly on the component class.
es_es: El elemento <literal>&lt;composite-map-key&gt;</literal> te permite mapear una clase componente como la clave de un <literal>Map</literal>. Aseg&#x00fa;rate que sobrescribes <literal>hashCode()</literal> y <literal>equals()</literal> correctamente en la clase componente.

source: Components as composite identifiers
es_es: Componentes como identificadores compuestos

source: You may use a component as an identifier of an entity class. Your component class must satisfy certain requirements:
es_es: Puedes usar un componente como un identidicador de una clase entidad. Tu clase componente debe satisfacer ciertos requerimientos:

source: It must implement <literal>java.io.Serializable</literal>.
es_es: Debe implementar <literal>java.io.Serializable</literal>.

source: It must re-implement <literal>equals()</literal> and <literal>hashCode()</literal>, consistently with the database's notion of composite key equality.
es_es: Debe re-implementar <literal>equals()</literal> y <literal>hashCode()</literal>, consistentemente con la noci&#x00f3;n de base de datos de igualdad de clave compuesta.

source: Note: in Hibernate3, the second requirement is not an absolutely hard requirement of Hibernate. But do it anyway.
es_es: Nota: en Hibernat3, el segundo requerimiento no es absolutamente un requerimiento r&#x00ed;gido de Hibernate. Pero de todas formas, h&#x00e1;zlo.

source: You can't use an <literal>IdentifierGenerator</literal> to generate composite keys. Instead the application must assign its own identifiers.
es_es: No puedes usar un <literal>IdentifierGenerator</literal> para generar claves compuestas. La aplicaci&#x00f3;n debe, en cambio, asignar sus propios identificadores.

source: Use the <literal>&lt;composite-id&gt;</literal> tag (with nested <literal>&lt;key-property&gt;</literal> elements) in place of the usual <literal>&lt;id&gt;</literal> declaration. For example, the <literal>OrderLine</literal> class has a primary key that depends upon the (composite) primary key of <literal>Order</literal>.
es_es: Usa la etiqueta <literal>&lt;composite-id&gt;</literal> (con elementos anidados <literal>&lt;key-property&gt;</literal>) en lugar de la usual declaraci&#x00f3;n <literal>&lt;id&gt;</literal>. Por ejemplo, la clase <literal>OrderLine</literal> tiene una clave primaria que depende de la clave primaria (compuesta) de <literal>Order</literal>.

source: Now, any foreign keys referencing the <literal>OrderLine</literal> table are also composite. You must declare this in your mappings for other classes. An association to <literal>OrderLine</literal> would be mapped like this:
es_es: Ahora, cualquier clave for&#x00e1;nea que referencie la tabla de <literal>OrderLine</literal> es tambi&#x00e9;n compuesta. Debes declarar esto en tus mapeos de otras clases. Una asociaci&#x00f3;n a <literal>OrderLine</literal> ser&#x00ed;a mapeado as&#x00ed;:

source: (Note that the <literal>&lt;column&gt;</literal> tag is an alternative to the <literal>column</literal> attribute everywhere.)
es_es: (Nota que la etiqueta <literal>&lt;column&gt;</literal> es una alternativa al atributo <literal>column</literal> en cualquier sitio.)

source: A <literal>many-to-many</literal> association to <literal>OrderLine</literal> also uses the composite foreign key:
es_es: Una asociaci&#x00f3;n <literal>muchos-a-muchos</literal> a <literal>OrderLine</literal> tambi&#x00e9;n usa la clave for&#x00e1;nea compuesta:

source: The collection of <literal>OrderLine</literal>s in <literal>Order</literal> would use:
es_es: La colecci&#x00f3;n de <literal>OrderLine</literal>s en <literal>Order</literal> usar&#x00ed;a:

source: (The <literal>&lt;one-to-many&gt;</literal> element, as usual, declares no columns.)
es_es: (El elemento <literal>&lt;one-to-many&gt;</literal>, como es usual, no declara columnas.)

source: If <literal>OrderLine</literal> itself owns a collection, it also has a composite foreign key.
es_es: Si <literal>OrderLine</literal> posee una colecci&#x00f3;n por s&#x00ed; misma, tiene tambi&#x00e9;n una clave for&#x00e1;nea compuesta.

source: Dynamic components
es_es: Componentes din&#x00e1;micos

source: You may even map a property of type <literal>Map</literal>:
es_es: Puedes incluso mapear una propiedad de tipo <literal>Map</literal>:

source: The semantics of a <literal>&lt;dynamic-component&gt;</literal> mapping are identical to <literal>&lt;component&gt;</literal>. The advantage of this kind of mapping is the ability to determine the actual properties of the bean at deployment time, just by editing the mapping document. Runtime manipulation of the mapping document is also possible, using a DOM parser. Even better, you can access (and change) Hibernate's configuration-time metamodel via the <literal>Configuration</literal> object.
es_es: La sem&#x00e1;ntica de un mapeo <literal>&lt;dynamic-component&gt;</literal> es &#x00ed;dentica a la de <literal>&lt;component&gt;</literal>. La ventaja de este tipo de mapeos es la habilidad para determinar las propiedades reales del bean en tiempo de despliegue, s&#x00f3;lo con editar el documento de mapeo. La manipulaci&#x00f3;n del documento de mapeo en tiempo de ejecuci&#x00f3;n es tambi&#x00e9;n posible, usando un analizador DOM. Incluso mejor, puedes acceder (y cambiar) el metamodelo de tiempo de configuraci&#x00f3;n de Hibernate por medio del objeto <literal>Configuration</literal>.

source: ROLES_OF_TRANSLATORS
es_es: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
es_es: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
