Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/persistent_classes.po
Languages: es_es

source: Persistent Classes
es_es: Clases Persistentes

source: Persistent classes are classes in an application that implement the entities of the business problem (e.g. Customer and Order in an E-commerce application). Not all instances of a persistent class are considered to be in the persistent state - an instance may instead be transient or detached.
es_es: Clases presistentes son clases en una aplicaci&#x00f3;n que implementan las entidades del problema de negocio (por ejemplo, Customer y Order en una aplicaci&#x00f3;n de comercio electr&#x00f3;nico). No todas las instancias de una clase persistente se considera que est&#x00e9;n en el estado persistente, una instancia puede en cambio ser transitoria o estar separada.

source: Hibernate works best if these classes follow some simple rules, also known as the Plain Old Java Object (POJO) programming model. However, none of these rules are hard requirements. Indeed, Hibernate3 assumes very little about the nature of your persistent objects. You may express a domain model in other ways: using trees of <literal>Map</literal> instances, for example.
es_es: Hibernate funciona mejor si las clases siguen algunas simples reglas, tambi&#x00e9;n conocidas como el modelo de programaci&#x00f3;n de Viejas Clases Java Planas (Plain Old Java Object o POJO). Sin embargo, ninguna de estas reglas son requerimientos r&#x00ed;gidos. En cambio, Hibernate3 asume muy poco acerca de la naturaleza de tus objetos persistentes. Puedes expresar un modelo de dominio en otras formas: usando &#x00e1;rboles de instancias de <literal>Map</literal>, por ejemplo.

source: A simple POJO example
es_es: Un ejemplo simple de POJO

source: Most Java applications require a persistent class representing felines.
es_es: La mayor&#x00ed;a de aplicaciones Java requieren una clase representando felinos.

source: There are four main rules to follow here:
es_es: Aqu&#x00ed; hay cuatro reglas principales a seguir:

source: Implement a no-argument constructor
es_es: Implementa un constructor sin argumentos

source: <literal>Cat</literal> has a no-argument constructor. All persistent classes must have a default constructor (which may be non-public) so that Hibernate can instantiate them using <literal>Constructor.newInstance()</literal>. We strongly recommend having a default constructor with at least <emphasis>package</emphasis> visibility for runtime proxy generation in Hibernate.
es_es: <literal>Cat</literal> tiene un contructor sin argumentos. Todas las clases persistentes deben tener un constructor por defecto (que puede no ser p&#x00fa;blico) de modo que Hibernate pueda instanciarlas usando <literal>Constructor.newInstance()</literal>. Recomendamos fuertemente tener un constructor por defecto con al menos visibilidad de <emphasis>package</emphasis> para la generaci&#x00f3;n de proxies en tiempo de ejecuci&#x00f3;n en Hibernate.

source: Provide an identifier property (optional)
es_es: Provee una propiedad identificadora (opcional)

source: <literal>Cat</literal> has a property called <literal>id</literal>. This property maps to the primary key column of a database table. The property might have been called anything, and its type might have been any primitive type, any primitive "wrapper" type, <literal>java.lang.String</literal> or <literal>java.util.Date</literal>. (If your legacy database table has composite keys, you can even use a user-defined class with properties of these types - see the section on composite identifiers later.)
es_es: <literal>Cat</literal> tiene una propiedad llamada <literal>id</literal>. Esta propiedad mapea a la columna clave primaria de la tabla de base de datos. La propiedad podr&#x00ed;a llamarse cualquierCosa, y su tipo podr&#x00ed;a haber sido cualquier tipo primitivo, cualquier tipo de "envoltura" primitivo, <literal>java.lang.String</literal> o <literal>java.util.Date</literal>. (Si tu tabla de base de datos heredada tiene claves compuestas, puedes incluso usar una clase definida por el usuario con propiedades de estos tipos, ver la secci&#x00f3;n sobre identificadores compuestos luego.)

source: The identifier property is strictly optional. You can leave them off and let Hibernate keep track of object identifiers internally. We do not recommend this, however.
es_es: La propiedad identificadora es estrictamente opcional. Puedes olvidarla y dejar que Hibernate siga internamente la pista de los identificadores del objeto. Sin embargo, no recomendamos esto.

source: In fact, some functionality is available only to classes which declare an identifier property:
es_es: De hecho, alguna funcionalidad est&#x00e1; disponible s&#x00f3;lo para clases que declaran una propiedad identificadora:

source: Transitive reattachment for detached objects (cascade update or cascade merge) - see
es_es: Reasociaci&#x00f3;n transitiva de objetos separados (actualizaciones o fusiones en cascada) - ver

source: We recommend you declare consistently-named identifier properties on persistent classes. We further recommend that you use a nullable (ie. non-primitive) type.
es_es: Recomendamos que declares propiedades identificadoras nombradas-consistentemente en clases persistentes. Mas a&#x00fa;n, recomendamos que uses un tipo nulable (es decir, no primitivo).

source: Prefer non-final classes (optional)
es_es: Prefiere las clases no finales (opcional)

source: A central feature of Hibernate, <emphasis>proxies</emphasis>, depends upon the persistent class being either non-final, or the implementation of an interface that declares all public methods.
es_es: Un aspecto central de Hibernate, <emphasis>proxies</emphasis>, depende de que las clases persistentes sean ya no finales, o sean ya la implementaci&#x00f3;n de una interface que declare todos los m&#x00e9;todos p&#x00fa;blicos.

source: You can persist <literal>final</literal> classes that do not implement an interface with Hibernate, but you won't be able to use proxies for lazy association fetching - which will limit your options for performance tuning.
es_es: Puedes persistir con Hibernate clases <literal>final</literal> que no implementen una interface, pero no ser&#x00e1;s capaz de usar proxies para recuperaci&#x00f3;n perezosa de asociaciones, lo que limitar&#x00e1; tus opciones para afinar el rendimiento.

source: You should also avoid declaring <literal>public final</literal> methods on the non-final classes. If you want to use a class with a <literal>public final</literal> method, you must explicitly disable proxying by setting <literal>lazy="false"</literal>.
es_es: Debes tambi&#x00e9;n evitar declarar m&#x00e9;todos <literal>public final</literal> en clases non-final. Si quieres usar una clase con un m&#x00e9;todo <literal>public final</literal>, debes deshabilitar expl&#x00ed;citamente el uso de proxies estableciendo <literal>lazy="false"</literal>.

source: Declare accessors and mutators for persistent fields (optional)
es_es: Declara m&#x00e9;todos de acceso y modificaci&#x00f3;n para los campos persistentes (opcional)

source: <literal>Cat</literal> declares accessor methods for all its persistent fields. Many other ORM tools directly persist instance variables. We believe it is better to provide an indirection between the relational schema and internal data structures of the class. By default, Hibernate persists JavaBeans style properties, and recognizes method names of the form <literal>getFoo</literal>, <literal>isFoo</literal> and <literal>setFoo</literal>. You may switch to direct field access for particular properties, if needed.
es_es: <literal>Cat</literal> declara m&#x00e9;todos de acceso para todos sus campos persistente. Muchas otras herramientas ORM persisten directamente variables de instancia. Creemos que es mejor proveer una indirecci&#x00f3;n entre el esquema relacional y las estructuras internas de la clase. Por defecto, Hibernate persiste propiedades del estilo JavaBeans, y reconoce nombres de m&#x00e9;todo de la forma <literal>getFoo</literal>, <literal>isFoo</literal> y <literal>setFoo</literal>. Puedes cambiar a acceso directo a campos para propiedades en particular, de ser necesario.

source: Properties need <emphasis>not</emphasis> be declared public - Hibernate can persist a property with a default, <literal>protected</literal> or <literal>private</literal> get / set pair.
es_es: Las propiedades <emphasis>no</emphasis> necesitan ser declaradas p&#x00fa;blicas. Hibernate puede persistir una propiedad con un par get / set <literal>protected</literal> o <literal>private</literal>.

source: Implementing inheritance
es_es: Implementando herencia

source: A subclass must also observe the first and second rules. It inherits its identifier property from the superclass, <literal>Cat</literal>.
es_es: Una subclase puede a su vez observar la primera y segunda regla. Hereda su propiedad identificadora de la superclase, <literal>Cat</literal>.

source: Implementing <literal>equals()</literal> and <literal>hashCode()</literal>
es_es: Implementando <literal>equals()</literal> y <literal>hashCode()</literal>

source: You have to override the <literal>equals()</literal> and <literal>hashCode()</literal> methods if you
es_es: Tienes que sobrescribir los m&#x00e9;todos <literal>equals()</literal> y <literal>hashCode()</literal> si :

source: intend to put instances of persistent classes in a <literal>Set</literal> (the recommended way to represent many-valued associations) <emphasis>and</emphasis>
es_es: piensas poner instancias de clases persistentes en un <literal>Set</literal> (la forma recomendada de representar asociaciones multivaluadas) <emphasis>y</emphasis>

source: intend to use reattachment of detached instances
es_es: piensas usar reasociaci&#x00f3;n de instancias separadas.

source: Hibernate guarantees equivalence of persistent identity (database row) and Java identity only inside a particular session scope. So as soon as we mix instances retrieved in different sessions, we must implement <literal>equals()</literal> and <literal>hashCode()</literal> if we wish to have meaningful semantics for <literal>Set</literal>s.
es_es: Hibernate garantiza la equivalencia de identidad persistente (fila de base de datos) y identidad Java s&#x00f3;lo dentro del &#x00e1;mbito de una sesi&#x00f3;n en particular. De modo que en el momento que mezclamos instancias recuperadas en sesiones diferentes, debemos implementar <literal>equals()</literal> y <literal>hashCode()</literal> si deseamos tener una sem&#x00e1;ntica significativa de <literal>Set</literal>s.

source: The most obvious way is to implement <literal>equals()</literal>/<literal>hashCode()</literal> by comparing the identifier value of both objects. If the value is the same, both must be the same database row, they are therefore equal (if both are added to a <literal>Set</literal>, we will only have one element in the <literal>Set</literal>). Unfortunately, we can't use that approach with generated identifiers! Hibernate will only assign identifier values to objects that are persistent, a newly created instance will not have any identifier value! Furthermore, if an instance is unsaved and currently in a <literal>Set</literal>, saving it will assign an identifier value to the object. If <literal>equals()</literal> and <literal>hashCode()</literal> are based on the identifier value, the hash code would change, breaking the contract of the <literal>Set</literal>. See the Hibernate website for a full discussion of this problem. Note that this is not a Hibernate issue, but normal Java semantics of object identity and equality.
es_es: La forma m&#x00e1;s obvia es implementar <literal>equals()</literal>/<literal>hashCode()</literal> comparando el valor identificador de ambos objetos. Si el valor es el mismo, ambos deben ser la misma fila de base de datos, por lo tanto son iguales (si ambos son agregados a un <literal>Set</literal>, s&#x00f3;lo tendremos un elemento en el <literal>Set</literal>). Desafortunadamente, no podemos usar este enfoque con identificadores generados! Hibernate s&#x00f3;lo asignar&#x00e1; valores identificadores a objetos que son persistentes, una instancia reci&#x00e9;n creada no tendr&#x00e1; ning&#x00fa;n valor identificador! Adem&#x00e1;s, si una instancia no est&#x00e1; salvada y est&#x00e1; actualmente en un <literal>Set</literal>, salvarla asignar&#x00e1; un valor identificador al objeto. Si <literal>equals()</literal> and <literal>hashCode()</literal> est&#x00e1;n basados en el valor identificador, el c&#x00f3;digo hash podr&#x00ed;a cambiar, rompiendo el contrato de <literal>Set</literal>. Ver el sitio web de Hibernate para una discusi&#x00f3;n completa de este problema. Observa que esto no es una incidencia de Hibernate, sino la sem&#x00e1;ntica normal de Java de identidad de objeto e igualdad.

source: We recommend implementing <literal>equals()</literal> and <literal>hashCode()</literal> using <emphasis>Business key equality</emphasis>. Business key equality means that the <literal>equals()</literal> method compares only the properties that form the business key, a key that would identify our instance in the real world (a <emphasis>natural</emphasis> candidate key):
es_es: Recomendamos implementar <literal>equals()</literal> y <literal>hashCode()</literal> usando <emphasis>igualdad de clave de negocio (Business key equality)</emphasis>. Igualdad de clave de negocio significa que el m&#x00e9;todo <literal>equals()</literal> compara s&#x00f3;lo las propiedades que forman la clave de negocio, una clave que podr&#x00ed;a identificar nuestra instancia en el mundo real (una clave candidata <emphasis>natural</emphasis>):

source: Note that a business key does not have to be as solid as a database primary key candidate (see <xref linkend="transactions-basics-identity"/>). Immutable or unique properties are usually good candidates for a business key.
es_es: Nota que una clave de negocio no tiene que ser tan s&#x00f3;lida como una clave primaria candidata de base de datos (ver <xref linkend="transactions-basics-identity"/>). Las propiedades inmutables o &#x00fa;nicas son usualmente buenas candidatas para una clave de negocio.

source: Dynamic models
es_es: Modelos din&#x00e1;micos

source: Note that the following features are currently considered experimental and may change in the near future.
es_es: Ten en cuenta que las siguientes funcionalidades est&#x00e1;n consideradas actualmente experimentales y pueden cambiar en el futuro cercano.

source: Persistent entities don't necessarily have to be represented as POJO classes or as JavaBean objects at runtime. Hibernate also supports dynamic models (using <literal>Map</literal>s of <literal>Map</literal>s at runtime) and the representation of entities as DOM4J trees. With this approach, you don't write persistent classes, only mapping files.
es_es: Las entidades persistentes no necesariamente tienen que estar representadas como clases POJO o como objetos JavaBean en tiempo de ejecuci&#x00f3;n. Hibernate soporta adem&#x00e1;s modelos din&#x00e1;micos (usando <literal>Map</literal>s de <literal>Map</literal>s en tiempo de ejecuci&#x00f3;n) y la representaci&#x00f3;n de entidades como &#x00e1;rboles de DOM4J. Con este enfoque no escribes clases persistentes, s&#x00f3;lo ficheros de mapeo.

source: By default, Hibernate works in normal POJO mode. You may set a default entity representation mode for a particular <literal>SessionFactory</literal> using the <literal>default_entity_mode</literal> configuration option (see <xref linkend="configuration-optional-properties"/>.
es_es: Por defecto, Hibernate funciona en modo POJO normal. Puedes establecer una representaci&#x00f3;n de entidad por defecto para una <literal>SessionFactory</literal> en particular usando la opci&#x00f3;n de configuraci&#x00f3;n <literal>default_entity_mode</literal> (ver <xref linkend="configuration-optional-properties"/>).

source: The following examples demonstrates the representation using <literal>Map</literal>s. First, in the mapping file, an <literal>entity-name</literal> has to be declared instead of (or in addition to) a class name:
es_es: Los siguientes ejemplos demuestran la representaci&#x00f3;n usando <literal>Map</literal>s. Primero, en el fichero de mapeo, tiene que declararse un <literal>entity-name</literal> en vez de (o como agregado a) un nombre de clase:

source: Note that even though associations are declared using target class names, the target type of an associations may also be a dynamic entity instead of a POJO.
es_es: Ten en cuenta que aunque las asociaciones se declaran usando nombres de clase objetivo, el tipo objetivo de una asociaci&#x00f3;n puede ser adem&#x00e1;s una entidad din&#x00e1;mica en vez de un POJO.

source: After setting the default entity mode to <literal>dynamic-map</literal> for the <literal>SessionFactory</literal>, we can at runtime work with <literal>Map</literal>s of <literal>Map</literal>s:
es_es: Despu&#x00e9;s de establecer el modo de entidad por defecto a <literal>dynamic-map</literal> para la <literal>SessionFactory</literal>, podemos trabajar en tiempo de ejecuci&#x00f3;n con <literal>Map</literal>s de <literal>Map</literal>s:

source: The advantages of a dynamic mapping are quick turnaround time for prototyping without the need for entity class implementation. However, you lose compile-time type checking and will very likely deal with many exceptions at runtime. Thanks to the Hibernate mapping, the database schema can easily be normalized and sound, allowing to add a proper domain model implementation on top later on.
es_es: Las ventajas de un mapeo din&#x00e1;mico es r&#x00e1;pido tiempo de ciclo de prototipado sin la necesidad de implementaci&#x00f3;n de clases de entidad. Sin embargo, pierdes chequeo de tipos en tiempo de compilaci&#x00f3;n y muy probablemente tratar&#x00e1;s con muchas excepciones en tiempo de ejecuci&#x00f3;n. Gracias al mapeo de Hibernate, el esquema de base de datos puede estar facilmente sano y normalizado, permitiendo agregar una implementaci&#x00f3;n apropiada del modelo de dominio m&#x00e1;s tarde.

source: Entity representation modes can also be set on a per <literal>Session</literal> basis:
es_es: Los modos de representaci&#x00f3;n de entidad pueden ser establecidos por <literal>Session</literal>:

source: Please note that the call to <literal>getSession()</literal> using an <literal>EntityMode</literal> is on the <literal>Session</literal> API, not the <literal>SessionFactory</literal>. That way, the new <literal>Session</literal> shares the underlying JDBC connection, transaction, and other context information. This means you don't have tocall <literal>flush()</literal> and <literal>close()</literal> on the secondary <literal>Session</literal>, and also leave the transaction and connection handling to the primary unit of work.
es_es: Por favor, ten en cuenta que la llamada a <literal>getSession()</literal> usando un <literal>EntityMode</literal> est&#x00e1; en la API de <literal>Session</literal>, no en la de <literal>SessionFactory</literal>. De esta forma, la nueva <literal>Session</literal> comparte la conexi&#x00f3;n JDBC, transacci&#x00f3;n y otra informaci&#x00f3;n de contexto. Esto significa que no tienes que llamar a <literal>flush()</literal> ni a <literal>close()</literal> en la <literal>Session</literal> secundaria, y tembi&#x00e9;n dejar el manejo de la transacci&#x00f3;n y de la conexi&#x00f3;n a la unidad de trabajo primaria.

source: More information about the XML representation capabilities can be found in <xref linkend="xml"/>.
es_es: Puede encontrarse m&#x00e1;s informaci&#x00f3;n sobre las capacidades de representaci&#x00f3;n XML en <xref linkend="xml"/>.

source: Tuplizers
es_es: UNTRANSLATED!!! Tuplizers

source: TODO: Document user-extension framework in the property and proxy packages
es_es: PORHACER: Documentar el framework de extensiones del usuario en los paquetes de propiedad y proxies.

source: ROLES_OF_TRANSLATORS
es_es: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
es_es: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
