Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/preface.po
Languages: es_es

source: Preface
es_es: Prefacio

source: Working with object-oriented software and a relational database can be cumbersome and time consuming in today's enterprise environments. Hibernate is an object/relational mapping tool for Java environments. The term object/relational mapping (ORM) refers to the technique of mapping a data representation from an object model to a relational data model with a SQL-based schema.
es_es: Trabajar con software orientado a objetos y una base de datos relacional puede ser inc&#x00f3;modo y consumir tiempo en los entornos de empresa de hoy. Hibernate es una herramienta de mapeo objeto/relacional para entornos Java. El t&#x00e9;rmino mapeo objeto/relacional (MOR) hace referencia a la t&#x00e9;cnica de mapear una representaci&#x00f3;n de datos desde un modelo de objetos a un modelo de datos relacional con un esquema basado en SQL.

source: Hibernate not only takes care of the mapping from Java classes to database tables (and from Java data types to SQL data types), but also provides data query and retrieval facilities and can significantly reduce development time otherwise spent with manual data handling in SQL and JDBC.
es_es: Hibernate no s&#x00f3;lo se encarga de mapear de clases Java a tablas de base de datos (y de tipos de datos de Java a tipos de datos SQL), sino que tambi&#x00e9;n provee facilidades de consulta y recuperaci&#x00f3;n de datos y puede reducir significativamente el tiempo de desarrollo que de otra forma se gasta en el manejo de los datos en SQL y JDBC.

source: Hibernates goal is to relieve the developer from 95 percent of common data persistence related programming tasks. Hibernate may not be the best solution for data-centric applications that only use stored-procedures to implement the business logic in the database, it is most useful with object-oriented domain models and business logic in the Java-based middle-tier. However, Hibernate can certainly help you to remove or encapsulate vendor-specific SQL code and will help with the common task of result set translation from a tabular representation to a graph of objects.
es_es: La meta de Hibernate es relevar al desarrollador del 95 por ciento de las tareas comunes relacionadas a la programaci&#x00f3;n de la persistencia de los datos. Hibernate puede no ser la mejor soluci&#x00f3;n para aplicaciones que usan solamente procedimientos almacenados para implementar la l&#x00f3;gica de negocio en la base de datos, es mas &#x00fa;til con modelos de dominio orientados a objetos y l&#x00f3;gica de negocio en middle-tier basada en Java. Sin embargo, Hibernate ciertamente puede ayudarte a quitar o encapsular c&#x00f3;digo SQL espec&#x00ed;fico de vendedor y ayudar&#x00e1; con la tarea com&#x00fa;n de traducci&#x00f3;n de resultados desde una representaci&#x00f3;n tabular a un grafo de objetos.

source: If you are new to Hibernate and Object/Relational Mapping or even Java, please follow these steps:
es_es: Si eres nuevo en Hibernate y lo del Mapeo Objeto/Relacional o incluso en Java, sigue por favor estos pasos:

source: Read <xref linkend="tutorial"/> for a tutorial with step-by-step instructions. The source code for the tutorial is included in the distribution in the <literal>doc/reference/tutorial/</literal> directory.
es_es: Lee <xref linkend="quickstart"/> para un tutorial de 30 minutos, usando Tomcat.

source: Read <xref linkend="architecture"/> to understand the environments where Hibernate can be used.
es_es: Lee <xref linkend="architecture"/> para entender los entornos en los que puede ser usado Hibernate.

source: Have a look at the <literal>eg/</literal> directory in the Hibernate distribution, it contains a simple standalone application. Copy your JDBC driver to the <literal>lib/</literal> directory and edit <literal>etc/hibernate.properties</literal>, specifying correct values for your database. From a command prompt in the distribution directory, type <literal>ant eg</literal> (using Ant), or under Windows, type <literal>build eg</literal>.
es_es: Dale una mirada al directorio <literal>eg/</literal> en la distribuci&#x00f3;n de Hibernate, contiene una aplicaci&#x00f3;n independiente simple. Copia tu driver JDBC al directorio <literal>lib/</literal> y edita <literal>etc/hibernate.properties</literal>, especificando los valores correctos para tu base de datos. Desde l&#x00ed;nea de comandos en el directorio de la distribuci&#x00f3;n, tipea <literal>ant eg</literal> (usando Ant), o bajo Windows, tipea <literal>build eg</literal>.

source: Use this reference documentation as your primary source of information. Consider reading <emphasis>Java Persistence with Hibernate</emphasis> (http://www.manning.com/bauer2) if you need more help with application design or if you prefer a step-by-step tutorial. Also visit http://caveatemptor.hibernate.org and download the example application for Java Persistence with Hibernate.
es_es: Usa esta documentaci&#x00f3;n de referencia como tu fuente de informaci&#x00f3;n primaria. Ten en consideraci&#x00f3;n leer <emphasis>Java Persistence with Hibernate</emphasis> (http://www.manning.com/bauer2) si necesitas mas ayuda con el dise&#x00f1;o de aplicaciones o si prefieres un tutorial paso a paso. Visita tambi&#x00e9;n http://caveatemptor.hibernate.org y descarga la aplicaci&#x00f3;n de ejemplo para Java Persistence with Hibernate.

source: FAQs are answered on the Hibernate website.
es_es: Los FAQs son respondidos en el sitio web de Hibernate.

source: Third party demos, examples, and tutorials are linked on the Hibernate website.
es_es: En el sitio web de Hibernate hay enlaces a demos de terceros, ejemplos y tutoriales.

source: The Community Area on the Hibernate website is a good resource for design patterns and various integration solutions (Tomcat, JBoss AS, Struts, EJB, etc.).
es_es: El Area de Comunidad en el sitio web de Hibernate es una buena fuente de patrones de dise&#x00f1;o y varias soluciones de integraci&#x00f3;n (Tomcat, JBoss, Struts, EJB, etc.).

source: If you have questions, use the user forum linked on the Hibernate website. We also provide a JIRA issue trackings system for bug reports and feature requests. If you are interested in the development of Hibernate, join the developer mailing list. If you are interested in translating this documentation into your language, contact us on the developer mailing list.
es_es: Si tienes preguntas, usa el foro de usuarios enlazado en el sitio web de Hibernate. Tambi&#x00e9;n proveemos un sistema de seguimiento JIRA para reportes de defectos y peticiones de nuevas caracter&#x00ed;sticas. Si estas interesado en el desarrollo de Hibernate, &#x00fa;nete a la lista de correo de desarrolladores. Si estas interesado en traducir esta documentaci&#x00f3;n a tu lenguaje, cont&#x00e1;ctanos en la lista de correo de desarrolladores.

source: Commercial development support, production support, and training for Hibernate is available through JBoss Inc. (see http://www.hibernate.org/SupportTraining/). Hibernate is a Professional Open Source project and a critical component of the JBoss Enterprise Middleware System (JEMS) suite of products.
es_es: A trav&#x00e9;s de JBoss Inc. (see http://www.hibernate.org/SupportTraining/) hay disponibilidad de soporte comercial de desarrollo, soporte de producci&#x00f3;n y entrenamiento en Hibernate. Hibernate es un proyecto de la suite de productos de c&#x00f3;digo abierto JBoss Professional.

source: ROLES_OF_TRANSLATORS
es_es: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
es_es: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
