Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: es_es, pt_br, zh_cn

source: This tutorial covered the basics of writing a simple standalone Hibernate application and a small web application.
es_es: Este tutorial cubri&#x00f3; los fundamentos de escribir una simple aplicaci&#x00f3;n independiente de Hibernate.
pt_br: Este manual cobriu os princípios básicos para criação de uma aplicação simples do Hibernate e uma pequena aplicação web.
zh_cn: 本章覆盖了如何编写一个简单独立的Hibernate命令行应用程序及小型的Hibernate web应用程序的基本要素。

source: If you already feel confident with Hibernate, continue browsing through the reference documentation table of contents for topics you find interesting - most asked are transactional processing (<xref linkend="transactions"/>), fetch performance (<xref linkend="performance"/>), or the usage of the API (<xref linkend="objectstate"/>) and the query features (<xref linkend="objectstate-querying"/>).
es_es: Si ya te sientes confidente con Hibernate, contin&#x00fa;a navegando a trav&#x00e9;s de la tabla de contenidos de la documentaci&#x00f3;n de referencia para los temas que encuentres interesantes. Los m&#x00e1;s consultados son procesamiento transaccional (<xref linkend="transactions"/>), rendimiento de recuperaci&#x00f3;n (<xref linkend="performance"/>), o el uso de la API (<xref linkend="objectstate"/>) y las funcionalidades de consulta (<xref linkend="objectstate-querying"/>).
pt_br: Se você já se sente seguro com o Hibernate, continue navegando na documentação de referência por tópicos que você acha interessante – os tópicos mais questionados são: processo de transação (<xref linkend="transactions"/>), uso da API (<xref linkend="objectstate"/>) e características de consulta (<xref linkend="objectstate-querying"/>).
zh_cn: 如果你已经对Hibernate感到自信，通过开发指南目录，继续浏览你感兴趣的内容－那些会被问到的问题大多是事务处理 (<xref linkend="transactions"/>)，抓取（fetch）的效率 (<xref linkend="performance"/>)，或者API的使用 (<xref linkend="objectstate"/>)和查询的特性(<xref linkend="objectstate-querying"/>)。

source: Don't forget to check the Hibernate website for more (specialized) tutorials.
es_es: No olvides chequear el sitio web de Hibernate por m&#x00e1;s (especializados) tutoriales.
pt_br: Não esqueça de visitar o site do Hibernate para obter mais tutoriais especializados.
zh_cn: 别忘了去Hibernate的网站查看更多（有针对性的）示例。

source: ROLES_OF_TRANSLATORS
es_es: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
es_es: <!--TRANS:CREDIT_FOR_TRANSLATORS-->

source: This time we didnt' use a <emphasis>fetch</emphasis> query to initialize the collection. Hence, the call to its getter method will trigger an additional select to initialize it, so we can add an element to it. Monitor the SQL log and try to optimize this with an eager fetch.
zh_cn: 这次我们没有使用<emphasis>fetch</emphasis>查询来初始化集合。因此，调用其getter方法会触发另一附加的select来初始化集合，这样我们才能把元素添加进去。检查SQL log，试着通过预先抓取来优化它。

source: Let's turn this into a small web application.
pt_br: Agora, vamos portar este exemplo para um pequeno aplicativo para internet.
zh_cn: 让我们把进入一个小型的web应用程序。

source: Part 3 - The EventManager web application
pt_br: EventManager um aplicativo para internet
zh_cn: 第三部分 - EventManager web应用程序

source: A Hibernate web application uses <literal>Session</literal> and <literal>Transaction</literal> almost like a standalone application. However, some common patterns are useful. We now write an <literal>EventManagerServlet</literal>. This servlet can list all events stored in the database, and it provides an HTML form to enter new events.
pt_br: Um aplicativo para internet do Hibernate usa uma <literal>Session</literal> e uma <literal>Transaction</literal> quase do mesmo modo que um aplicativo standalone. Entretanto, alguns patterns comuns são úteis. Nós agora criaremos um <literal>EventManagerServlet</literal>. Esse servlet lista todos os eventos salvos no banco de dados, e cria um formulário HTML para entrada de novos eventos.
zh_cn: Hibernate web应用程序使用<literal>Session</literal> 和<literal>Transaction</literal>的方式几乎和独立应用程序是一样的。但是，有一些常见的模式（pattern）非常有用。现在我们编写一个<literal>EventManagerServlet</literal>。这个servlet可以列出数据库中保存的所有的events，还提供一个HTML表单来增加新的events。

source: Writing the basic servlet
pt_br: Criando um servlet básico
zh_cn: 编写基本的servlet

source: Create a new class in your source directory, in the <literal>events</literal> package:
pt_br: Crie uma nova classe no seu diretório fonte, no pacote <literal>events</literal>:
zh_cn: 在你的源代码目录的<literal>events</literal>包中创建一个新的类：

source: The servlet handles HTTP <literal>GET</literal> requests only, hence, the method we implement is <literal>doGet()</literal>:
pt_br: O servlet manuseia somente requisições <literal>GET</literal> do HTTP, portanto o método que iremos implementar é <literal>doGet()</literal>:
zh_cn: 我们后面会用到<literal>dateFormatter</literal> 的工具， 它把<literal>Date</literal>对象转换为字符串。只要一个formatter作为servlet的成员就可以了。

source: Do <emphasis>not</emphasis> use a new Hibernate <literal>Session</literal> for every database operation. Use one Hibernate <literal>Session</literal> that is scoped to the whole request. Use <literal>getCurrentSession()</literal>, so that it is automatically bound to the current Java thread.
zh_cn: 我们称这里应用的模式为每次请求一个session<emphasis>(session-per-request)</emphasis>。当有请求到达这个servlet的时候，通过对<literal>SessionFactory</literal>的第一次调用，打开一个新的Hibernate <literal>Session</literal>。然后启动一个数据库事务&mdash;所有的数据访问都是在事务中进行，不管是读还是写（我们在应用程序中不使用auto-commit模式）。

source: Next, the possible actions of the request are processed and the response HTML is rendered. We'll get to that part soon.
pt_br: Agora, as possibilidades de ações de uma requisição serão processadas e uma resposta HTML será renderizada. Nós já iremos chegar nesta parte.
zh_cn: <emphasis>不要</emphasis>为每次数据库操作都使用一个新的Hibernate <literal>Session</literal>。将Hibernate <literal>Session</literal>的范围设置为整个请求。要用<literal>getCurrentSession()</literal>，这样它自动会绑定到当前Java线程。

source: Processing and rendering
pt_br: Processando e renderizando
zh_cn: 最后，当处理与渲染都结束的时候，这个工作单元就结束了。假若在处理或渲染的时候有任何错误发生，会抛出一个异常，回滚数据库事务。这样，<literal>session-per-request</literal>模式就完成了。为了避免在每个servlet中都编写事务边界界定的代码，可以考虑写一个servlet 过滤器（filter）来更好地解决。关于这一模式的更多信息，请参阅Hibernate网站和Wiki，这一模式叫做<emphasis>Open Session in View</emphasis>&mdash;只要你考虑用JSP来渲染你的视图（view），而不是在servlet中，你就会很快用到它。

source: Let's implement the processing of the request and rendering of the page.
pt_br: Vamos implementar o processamento da requisição e a restituição da página HTML.
zh_cn: 处理与渲染

source: The <literal>listEvents()</literal> method uses the Hibernate <literal>Session</literal> bound to the current thread to execute a query:
pt_br: O método <literal>listEvents()</literal> usa a <literal>Session</literal> do Hibernate associada a thread atual para executar um query:
zh_cn: <literal>listEvents()</literal>方法使用绑定到当前线程的Hibernate <literal>Session</literal>来执行查询：

source: Finally, the <literal>store</literal> action is dispatched to the <literal>createAndStoreEvent()</literal> method, which also uses the <literal>Session</literal> of the current thread:
pt_br: Finalmente, a action <literal>store</literal> é passada pra o método <literal>createAndStoreEvent()</literal>, que também usa a <literal>Session</literal> da thread atual:
zh_cn: 最后，<literal>store</literal>动作会被导向到<literal>createAndStoreEvent()</literal>方法，它也使用当前线程的<literal>Session</literal>:

source: That's it, the servlet is complete. A request to the servlet will be processed in a single <literal>Session</literal> and <literal>Transaction</literal>. As earlier in the standalone application, Hibernate can automatically bind these ojects to the current thread of execution. This gives you the freedom to layer your code and access the <literal>SessionFactory</literal> in any way you like. Usually you'd use a more sophisticated design and move the data access code into data access objects (the DAO pattern). See the Hibernate Wiki for more examples.
pt_br: Pronto, o servlet está completo. Uma requisição para o servlet será processada em uma <literal>Session</literal> e uma <literal>Transaction</literal> simples. Como anteriormente, no aplicativo standalone, o Hibernate pode automaticamente associar esses objetos a thread atual em execução. Isso possibilita a liberdade de você modelar seu código e acessar o método <literal>SessionFactory</literal> do jeito que achar melhor. Geralmente você irá usar um design mais sofisticado e mover o código de acesso a dados para dentro de objetos de acesso a dados (o patter DAO). Leia o Hibernate Wiki para maiores exemplos.
zh_cn: 大功告成，这个servlet写完了。Hibernate会在单一的<literal>Session</literal> 和<literal>Transaction</literal>中处理到达的servlet请求。如同在前面的独立应用程序中那样，Hibernate可以自动的把这些对象绑定到当前运行的线程中。这给了你用任何你喜欢的方式来对代码分层及访问<literal>SessionFactory</literal>的自由。通常，你会用更加完备的设计，把数据访问代码转移到数据访问对象中(DAO模式）。请参见Hibernate Wiki，那里有更多的例子。

source: Deploying and testing
pt_br: Instalando e testando
zh_cn: 部署与测试

source: To deploy this application you have to create a web archive, a WAR. Add the following Ant target to your <literal>build.xml</literal>:
pt_br: Para fazer o deploy desta aplicação você tem que criar um arquivo para web, um WAR. Adicione o alvo Ant abaixo em seu <literal>build.xml</literal>:
zh_cn: 要发布这个程序，你得把它打成web发布包：WAR文件。把下面的脚本加入到你的<literal>build.xml</literal>中：

source: This target creates a file called <literal>hibernate-tutorial.war</literal> in your project directory. It packages all libraries and the <literal>web.xml</literal> descriptor, which is expected in the base directory of your project:
pt_br: Esta target cria um arquivo chamado <literal>hibernate-tutorial.war</literal> no diretório do seu projeto. Ele empacota todas as bibliotecas e o arquivo de descrição <literal>web.xml</literal>, o qual é esperado no diretório base do seu projeto:
zh_cn: 这段代码在你的开发目录中创建一个<literal>hibernate-tutorial.war</literal>的文件。它把所有的类库和<literal>web.xml</literal>描述文件都打包进去，web.xml 文件应该位于你的开发根目录中：

source: Before you compile and deploy the web application, note that an additional library is required: <literal>jsdk.jar</literal>. This is the Java servlet development kit, if you don't have this library already, get it from the Sun website and copy it to your library directory. However, it will be only used for compliation and excluded from the WAR package.
pt_br: Antes de você compilar e fazer o deploy desta aplicação web, note que uma biblioteca adicional é requerida: <literal>jsdk.jar</literal>. Esse é o Java servlet development kit, se você não possui esta biblioteca, faça seu download na página da Sun e copie-a para seu diretório de bibliotecas. Entretanto, será usado somente para a compilação e excluído do pacote WAR.
zh_cn: 请注意在你编译和部署web应用程之前，需要一个附加的类库：<literal>jsdk.jar</literal>。这是Java Servlet开发包，假若你还没有，可以从Sun网站上下载，把它copy到你的lib目录。但是，它仅仅是在编译时需要，不会被打入WAR包。

source: To build and deploy call <literal>ant war</literal> in your project directory and copy the <literal>hibernate-tutorial.war</literal> file into your Tomcat <literal>webapp</literal> directory. If you don't have Tomcat installed, download it and follow the installation instructions. You don't have to change any Tomcat configuration to deploy this application though.
pt_br: Para compilar e instalar execute <literal>ant war</literal> no seu diretório do projeto e copie o arquivo <literal>hibernate-tutorial.war</literal> para o diretório <literal>webapp</literal> do Tomcat. Se você não possui o Tomcat instalado faça o download e siga as instruções de instalação. Você não precisa modificar nenhuma configuração do Tomcat para rodar este aplicativo.
zh_cn: 在你的开发目录中，调用<literal>ant war</literal>来构建、打包，然后把<literal>hibernate-tutorial.war</literal>文件拷贝到你的tomcat的<literal>webapps</literal>目录下。假若你还没安装Tomcat，就去下载一个，按照指南来安装。对此应用的发布，你不需要修改任何Tomcat的配置。

source: Once deployed and Tomcat is running, access the application at <literal>http://localhost:8080/hibernate-tutorial/eventmanager</literal>. Make sure you watch the Tomcat log to see Hibernate initialize when the first request hits your servlet (the static initializer in <literal>HibernateUtil</literal> is called) and to get the detailed output if any exceptions occurs.
pt_br: Uma vez feito o deploy e com Tomcat rodando, acesse o aplicativo em <literal>http://localhost:8080/hibernate-tutorial/eventmanager</literal>. Veja o log do Tomcat para observar a inicialização do Hibernate quando a primeira requisição chega ao servlet (o inicializador estático dentro de <literal>HibernateUtil</literal> é chamado) e para ter uma depuração detalhada se ocorrer alguma exceção.
zh_cn: 在部署完，启动Tomcat之后，通过<literal>http://localhost:8080/hibernate-tutorial/eventmanager</literal>进行访问你的应用，在第一次servlet 请求发生时，请在Tomcat log中确认你看到Hibernate被初始化了（<literal>HibernateUtil</literal>的静态初始化器被调用），假若有任何异常抛出，也可以看到详细的输出。

source: Summary
pt_br: Sumário
zh_cn: 总结
