Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: es_es, pt_br, zh_cn

source: The <literal>id</literal> element is the declaration of the identifer property, <literal>name="id"</literal> declares the name of the Java property - Hibernate will use the getter and setter methods to access the property. The column attribute tells Hibernate which column of the <literal>EVENTS</literal> table we use for this primary key. The nested <literal>generator</literal> element specifies the identifier generation strategy, in this case we used <literal>native</literal>, which picks the best strategy depending on the configured database (dialect). Hibernate supports database generated, globally unique, as well as application assigned identifiers (or any strategy you have written an extension for).
es_es: El elemento <literal>id</literal> el la declaraci&#x00f3;n de la propiedad identificadora, <literal>name="id"</literal> declara el nombre de la propiedad Java. Hibernate usar&#x00e1; los m&#x00e9;todos getter y setter para acceder a la propiedad. El attributo de columna dice a Hibernate cu&#x00e1;l columna de la tabla <literal>EVENTS</literal> usamos para esta clave primaria. El elemento anidado <literal>generator</literal> especifica la estrategia de generaci&#x00f3;n de identificadores, en este caso usamos <literal>increment</literal>, que es un m&#x00e9;todo muy simple de incremento de n&#x00fa;mero en-memoria &#x00fa;til mayormente para testeo (y tutoriales). Hibernate tambi&#x0e9;n soporta identificadores generados por base de datos, globalmente &#x00fa;nicos, as&#x00ed; como tambi&#x00e9;n asignados por aplicaci&#x00f3;n (o cualquier estrategia para la que hayas escrito una extensi&#x00f3;n).
pt_br: O elemento <literal>id</literal> é a declaração da propriedade identificadora, o <literal>name="id"</literal> declara o nome da propriedade Java – o Hibernate irá usar os métodos getter e setter para acessar a propriedade. O atributo da coluna informa ao Hibernate qual coluna da tabela <literal>EVENTS</literal> nós iremos usar como chave primária. O elemento <literal>generator</literal> especifica a estratégia de geração do identificador, neste caso usaremos <literal>native</literal>, que escolhe a melhor estratégia dependendo da base de dados (dialeto) configurada. O Hibernate suporta a base de dados gerada, globalmente única, bem como a atribuição aos identificadores da aplicação (ou toda estratégia escrita para uma extensão).
zh_cn: <literal>id</literal>元素是标识符属性的声明，<literal>name="id"</literal> 声明了Java属性的名字 － Hibernate会使用<literal>getId()</literal>和<literal>setId()</literal>来访问它。 <literal>column</literal>属性则告诉Hibernate, 我们使用<literal>EVENTS</literal>表的哪个字段作为主键。嵌套的<literal>generator</literal>元素指定了标识符生成策略，在这里我们指定<literal>native</literal>，它根据已配置的数据库（方言）自动选择最佳的标识符生成策略。Hibernate支持由数据库生成，全局唯一性（globally unique）和应用程序指定（或者你自己为任何已有策略所写的扩展）这些策略来生成标识符。

source: Finally we include declarations for the persistent properties of the class in the mapping file. By default, no properties of the class are considered persistent:
es_es: Finalmente inclu&#x00ed;mos declaraciones para las propiedades persistentes de la clases en el fichero de mapeo. Por defecto, ninguna propiedad de la clase se considera persistente:
pt_br: Finalmente incluiremos as declarações para as propriedades persistentes da classe no arquivo mapeado. Por default, nenhuma das propriedades da classe é considerada persistente:
zh_cn: 最后我们在映射文件里面包含需要持久化属性的声明。默认情况下，类里面的属性都被视为非持久化的：

source: <![CDATA[ <hibernate-mapping> <class name="events.Event" table="EVENTS"> <id name="id" column="EVENT_ID"> <generator class="native"/> </id> <property name="date" type="timestamp" column="EVENT_DATE"/> <property name="title"/> </class> </hibernate-mapping>]]>
es_es: <![CDATA[ <hibernate-mapping> <class name="Event" table="EVENTS"> <id name="id" column="EVENT_ID"> <generator class="increment"/> </id> <property name="date" type="timestamp" column="EVENT_DATE"/> <property name="title"/> </class> </hibernate-mapping>]]>

source: Just as with the <literal>id</literal> element, the <literal>name</literal> attribute of the <literal>property</literal> element tells Hibernate which getter and setter methods to use. So, in this case, Hibernate will look for <literal>getDate()/setDate()</literal>, as well as <literal>getTitle()/setTitle()</literal>.
es_es: Al igual que con el elemento <literal>id</literal>, el atributo <literal>name</literal> del elemento <literal>property</literal> dice a Hibernate c&#x00e1;les m&#x00e9;todos getter y setter usar.
pt_br: Da mesma maneira que com o elemento <literal>id</literal>, o atributo <literal>name</literal> do elemento <literal>property</literal> informa ao Hibernate qual método getter e setter deverá usar. Assim, neste caso, o Hibernate irá procurar pelo <literal>getDate()/setDate()</literal>, como também pelo <literal>getTitle()/setTitle()</literal>.
zh_cn: 和<literal>id</literal>元素一样，<literal>property</literal>元素的<literal>name</literal>属性告诉Hibernate使用哪个getter和setter方法。在此例中，Hibernate会寻找<literal>getDate()/setDate()</literal>, 以及<literal>getTitle()/setTitle()</literal>。

source: Why does the <literal>date</literal> property mapping include the <literal>column</literal> attribute, but the <literal>title</literal> doesn't? Without the <literal>column</literal> attribute Hibernate by default uses the property name as the column name. This works fine for <literal>title</literal>. However, <literal>date</literal> is a reserved keyword in most database, so we better map it to a different name.
es_es: ٯPor qu&#x00e9; el mapeo de la propiedad <literal>date</literal> incluye el atributo <literal>column</literal>, pero el de la de <literal>title</literal> no? Sin el atributo <literal>column</literal> Hibernate usa por defecto el nombre de propiedad como nombre de columna. Esto funciona bien para <literal>title</literal>. Sin embargo, However, <literal>date</literal> es una palabra reservada en la mayor&#x00ed;a de las bases de datos, as&#x00ed; que mejor la mapeamos a un nombre diferente.
pt_br: Porque fazer o mapeamento da propriedade <literal>date</literal> incluído no atributo <literal>column</literal>, e no title não fazer? Sem o atributo <literal>column</literal> o Hibernate por padrão usa o nome da propriedade como o nome da coluna. Isto trabalha muito bem para o <literal>title</literal>. Entretanto o <literal>date</literal> é uma palavra-chave reservada na maioria dos bancos de dados, assim nós melhoramos o mapeamentos disto com um nome diferente.
zh_cn: 为什么<literal>date</literal>属性的映射含有<literal>column</literal> attribute，而<literal>title</literal>却没有？当没有设定<literal>column</literal> attribute 的时候，Hibernate缺省地使用JavaBean的属性名作为字段名。对于<literal>title</literal>，这样工作得很好。然而，<literal>date</literal>在多数的数据库里，是一个保留关键字，所以我们最好把它映射成一个不同的名字。

source: The next interesting thing is that the <literal>title</literal> mapping also lacks a <literal>type</literal> attribute. The types we declare and use in the mapping files are not, as you might expect, Java data types. They are also not SQL database types. These types are so called <emphasis>Hibernate mapping types</emphasis>, converters which can translate from Java to SQL data types and vice versa. Again, Hibernate will try to determine the correct conversion and mapping type itself if the <literal>type</literal> attribute is not present in the mapping. In some cases this automatic detection (using Reflection on the Java class) might not have the default you expect or need. This is the case with the <literal>date</literal> property. Hibernate can't know if the property (which is of <literal>java.util.Date</literal>) should map to a SQL <literal>date</literal>, <literal>timestamp</literal>, or <literal>time</literal> column. We preserve full date and time information by mapping the property with a <literal>timestamp</literal> converter.
es_es: La pr&#x00f3;xima cosa interesante es que el mapeo de <literal>title</literal> carece de un atributo <literal>type</literal>. Los tipos que declaramos y usamos en el fichero de mapeo no son, como podr&#x00ed;as esperar, tipos de datos Java. Tampoco son tipos de base de datos SQL. Estos tipos son los llamados as&#x00ed; <emphasis>Tipos de mapeo de Hibernate</emphasis>, convertidores que pueden traducir de tipos Java a SQL y vice versa. De nuevo, Hibernate intentar&#x00e1; determinar la conversi&#x00f3;n y el mapeo mismo de tipo correctos si el atributo <literal>type</literal> no estuviese presente en el mapeo. En algunos casos esta detecci&#x00f3;n autom&#x00e1;tica (usando reflecci&#x00f3;n en la clase Java) puede no tener lo que esperas o necesitas. Este es el caso de la propiedad <literal>date</literal>. Hibernate no puede saber is la propiedad mapear&#x00e1; a una columna <literal>date</literal>, <literal>timestamp</literal> o <literal>time</literal>. Declaramos que queremos preservar la informaci&#x00f3;n completa de fecha y hora mapeando la propiedad con un <literal>timestamp</literal>.
pt_br: A próxima coisa interessante é que mapemanto do <literal>title</literal> também falta o atributo <literal>type</literal>. O tipo que declaramos e o uso nos arquivos mapeados, não são como você pôde esperar, atributos de dados Java. Eles não são como os tipos de base de dados SQL. Esses tipos podem ser chamados de <emphasis>Tipos de mapeamento Hibernate</emphasis>, que são conversores que podem traduzir tipos de dados do Java para os tipos de dados SQL e vice-versa. Novamente, o Hibernate irá tentar determinar a conversão correta e mapeará o <literal>type</literal> próprio, caso o tipo do atributo não estiver presente no mapeamento. Em alguns casos, esta detecção automática (que usa Reflection sobre as classes Java) poderá não ter padrão que você espera ou necessita. Este é o caso com a propriedade <literal>date</literal>. O Hibernate não pode saber se a propriedade (que é do <literal>java.util.Date</literal>) pode mapear para uma coluna do tipo <literal>date</literal> do SQL, <literal>timestamp</literal>, ou <literal>time</literal> . Nós preservamos a informação cheia de datas e horas pelo mapeamento da propriedade com um conversor <literal>timestamp</literal>.
zh_cn: 另一有趣的事情是<literal>title</literal>属性缺少一个<literal>type</literal> attribute。我们在映射文件里声明并使用的类型，却不是我们期望的那样，是Java数据类型，同时也不是SQL数据库的数据类型。这些类型就是所谓的Hibernate 映射类型<emphasis>（mapping types）</emphasis>，它们能把Java数据类型转换到SQL数据类型，反之亦然。再次重申，如果在映射文件中没有设置<literal>type</literal>属性的话，Hibernate会自己试着去确定正确的转换类型和它的映射类型。在某些情况下这个自动检测机制（在Java 类上使用反射机制）不会产生你所期待或需要的缺省值。<literal>date</literal>属性就是个很好的例子，Hibernate无法知道这个属性（<literal>java.util.Date</literal>类型的）应该被映射成：SQL <literal>date</literal>，或<literal>timestamp</literal>，还是<literal>time</literal> 字段。在此例中，把这个属性映射成<literal>timestamp</literal> 转换器，这样我们预留了日期和时间的全部信息。

source: This mapping file should be saved as <literal>Event.hbm.xml</literal>, right in the directory next to the <literal>Event</literal> Java class source file. The naming of mapping files can be arbitrary, however the <literal>hbm.xml</literal> suffix is a convention in the Hibernate developer community. The directory structure should now look like this:
es_es: Este fichero de mapeo debe ser salvado como <literal>Event.hbm.xml</literal>, justo en el directorio pr&#x00f3;ximo al fichero de c&#x00f3;digo fuente de la clase Java <literal>Event</literal>. El nombrado de los ficheros de mapeo puede ser arbitrario, sin embargo, el sufijo <literal>hbm.xml</literal> se ha vuelto una convenci&#x00f3;n el la comunidad de desarrolladores de Hibernate. La estructura de directorio debe ahora verse como esto:
pt_br: Este arquivo de mapeamento deve ser salvo como <literal>Event.hbm.xml</literal>, corretamente no diretório próximo ao arquivo fonte da Classe Java <literal>Event</literal>. O nomeamento dos arquivos de mapeamento podem ser arbitrários, porém o sufixo <literal>hbm.xml</literal> é uma convenção da comunidade dos desenvolvedores do Hibernate. Esta estrutura do diretório deve agora se parecer com isso:
zh_cn: 应该把这个映射文件保存为<literal>Event.hbm.xml</literal>，且就在<literal>Event</literal>Java类的源文件目录下。映射文件可随意地命名，但<literal>hbm.xml</literal>的后缀已成为Hibernate开发者社区的约定。现在目录结构看起来应该像这样：

source: <![CDATA[. +lib <Hibernate and third-party libraries> +src +events Event.java Event.hbm.xml]]>
es_es: <![CDATA[. +lib <Hibernate and third-party libraries> +src Event.java Event.hbm.xml]]>

source: We continue with the main configuration of Hibernate.
es_es: Continuamos con la configuraci&#x00f3;n principal de Hibernate.
pt_br: Nós iremos continuar com a configuração principal do Hibernate.
zh_cn: 我们继续进行Hibernate的主要配置。

source: Hibernate configuration
es_es: Configuraci&#x00f3;n de Hibernate
pt_br: Configuração do Hibernate
zh_cn: Hibernate配置

source: We now have a persistent class and its mapping file in place. It is time to configure Hibernate. Before we do this, we will need a database. HSQL DB, a java-based SQL DBMS, can be downloaded from the HSQL DB website(http://hsqldb.org/). Actually, you only need the <literal>hsqldb.jar</literal> from this download. Place this file in the <literal>lib/</literal> directory of the development folder.
es_es: Tenemos ahora una clase persistente y su fichero de mapeo en su sitio. Es momento de configurar Hibernate. Antes que hagamos esto, necesitaremos una base de datos. HSQL DB, un DBMS SQL en-memoria basado en Java, puede ser descargado del sitio web de HSQL DB. Realmente, de esta descarga s&#x00f3;lo necesitas el <literal>hsqldb.jar</literal>. Coloca este fichero en el directorio <literal>lib/</literal> de la carpeta de desarrollo.
pt_br: Agora nós temos uma classe persistente e este arquivo de mapeamento no lugar. Está na hora de configurar o Hibernate. Antes de fazermos isso, iremos precisar de uma base de dados. O HSQL DB, um SQL DBMS feito em java, pode ser baixado através do site do HSQL DB(http://hsqldb.org/). Atualmente, você só precisa baixar o <literal>hsqldb.jar</literal>. Coloque este arquivo no diretório da pasta de desenvolvimento <literal>lib/</literal>.
zh_cn: 现在我们已经有了一个持久化类和它的映射文件，该是配置Hibernate的时候了。在此之前，我们需要一个数据库。 HSQL DB是种基于Java 的SQL数据库管理系统（DBMS），可以从HSQL DB的网站上下载。实际上，你只需下载的包中的<literal>hsqldb.jar</literal>文件，并把这个文件放在开发文件夹的<literal>lib/</literal>目录下即可。

source: Create a directory called <literal>data</literal> in the root of the development directory - this is where HSQL DB will store its data files. Now start the database by running <literal>java -classpath ../lib/hsqldb.jar org.hsqldb.Server</literal> in this data directory. You can see it start up and bind to a TCP/IP socket, this is where our application will connect later. If you want to start with a fresh database during this tutorial, shutdown HSQL DB (press <literal>CTRL + C</literal> in the window), delete all files in the <literal>data/</literal> directory, and start HSQL DB again.
es_es: Crea un directorio llamado <literal>data</literal> en la ra&#x00ed;z del directorio de desarrollo. All&#x00ed; es donde HSQL DB almacenar&#x00e1; sus ficheros de datos.
pt_br: Crie um diretório chamado <literal>data</literal> no diretório root de desenvolvimento – Isto será onde o HSQL DB irá armazenar arquivos de dados. Agora iremos iniciar o banco de dados executando <literal>java -classpath ../lib/hsqldb.jar org.hsqldb.Server</literal> neste diretório de dados. Você pode ver ele iniciando e conectando ao socket TCP/IP, isto será onde nossa aplicação irá se conectar depois. Se você deseja iniciar uma nova base de dados durante este tutorial, finalize o HSQL DB(pressionando o <literal>CTRL + C</literal> na janela), delete todos os arquivos no diretório <literal>data/</literal>, e inicie o HSQL BD novamente.
zh_cn: 在开发的根目录下创建一个<literal>data</literal>目录 － 这是HSQL DB存储数据文件的地方。此时在data目录中运行<literal>java -classpath ../lib/hsqldb.jar org.hsqldb.Server</literal>就可启动数据库。你可以在log中看到它的启动，及绑定到TCP/IP套结字，这正是我们的应用程序稍后会连接的地方。如果你希望在本例中运行一个全新的数据库，就在窗口中按下<literal>CTRL + C</literal>来关闭HSQL数据库，并删除<literal>data/</literal>目录下的所有文件，再重新启动HSQL数据库。

source: Hibernate is the layer in your application which connects to this database, so it needs connection information. The connections are made through a JDBC connection pool, which we also have to configure. The Hibernate distribution contains several open source JDBC connection pooling tools, but will use the Hibernate built-in connection pool for this tutorial. Note that you have to copy the required library into your classpath and use different connection pooling settings if you want to use a production-quality third party JDBC pooling software.
es_es: Hibernate es la capa en tu aplicaci&#x00f3;n que se conecta a esta base de datos, de modo que necesita informaci&#x00f3;n de conexi&#x00f3;n. Las conexiones se hacen a trav&#x00e9;s de un pool de conexiones JDBC, que tamb&#x00e9;n tenemos que configurar. La distribuci&#x00f3;n de Hibernate contiene muchas herramientas de pooling de conexiones JDBC de c&#x00f3;digo abierto, pero para este tutorial usaremos el pool de conexiones prefabricado dentro de Hibernate. Observa que tienes que copiar la biblioteca requerida en tu classpath y usar diferentes configuraciones de pooling de conexiones si quieres usar un software de pooling JDBC de terceros de calidad de producci&#x00f3;n.
pt_br: O Hibernate é uma camada na sua aplicação na qual se conecta com a base de dados, para isso necessita de informação da conexão. As conexões são feitas através de um pool de conexão JDBC, na qual teremos que configurar. A distribuição do Hibernate contém diversas ferramentas de pooling da conexão JDBC de fonte aberta, mas iremos usar o pool de conexão interna para este tutorial. Note que você tem que copiar a biblioteca necessária em seu classpath e use configurações diferentes para pooling de conexão caso você deseje utilizar um software de pooling JDBC terceirizado para qualidade de produção.
zh_cn: Hibernate是你的应用程序里连接数据库的那层，所以它需要连接用的信息。连接（connection）是通过一个也由我们配置的JDBC连接池（connection pool）来完成的。Hibernate的发布包里包含了许多开源的（open source）连接池，但在我们例子中使用Hibernate内置的连接池。注意，如果你希望使用一个产品级(production-quality)的第三方连接池软件，你必须拷贝所需的库文件到你的classpath下，并使用不同的连接池设置。

source: For Hibernate's configuration, we can use a simple <literal>hibernate.properties</literal> file, a slightly more sophisticated <literal>hibernate.cfg.xml</literal> file, or even complete programmatic setup. Most users prefer the XML configuration file:
es_es: Para la configuraci&#x00f3;n de Hibernate, podemos usar un fichero <literal>hibernate.properties</literal> simple, un fichero <literal>hibernate.cfg.xml</literal> ligeramente m&#x00e1;s sofisticado, o incluso una configuraci&#x00f3;n completamente program&#x00e1;tica. La mayor&#x00ed;a de los usuarios prefieren el fichero de configuraci&#x00f3;n XML:
pt_br: Para as configurações do Hibernate, nós podemos usar um arquivo simples <literal>hibernate.properties</literal>, um arquivo mais ligeiramente sofisticado <literal>hibernate.cfg.xml</literal> ou até mesmo uma instalação programática completa. A maioria dos usuários preferem utilizar o arquivo de configuração XML
zh_cn: 为了保存Hibernate的配置，我们可以使用一个简单的<literal>hibernate.properties</literal>文件，或者一个稍微复杂的<literal>hibernate.cfg.xml</literal>，甚至可以完全使用程序来配置Hibernate。多数用户更喜欢使用XML配置文件：

source: <![CDATA[<?xml version='1.0' encoding='utf-8'?> <!DOCTYPE hibernate-configuration PUBLIC "-//Hibernate/Hibernate Configuration DTD 3.0//EN" "http://hibernate.sourceforge.net/hibernate-configuration-3.0.dtd"> <hibernate-configuration> <session-factory> <!-- Database connection settings --> <property name="connection.driver_class">org.hsqldb.jdbcDriver</property> <property name="connection.url">jdbc:hsqldb:hsql://localhost</property> <property name="connection.username">sa</property> <property name="connection.password"></property> <!-- JDBC connection pool (use the built-in) --> <property name="connection.pool_size">1</property> <!-- SQL dialect --> <property name="dialect">org.hibernate.dialect.HSQLDialect</property> <!-- Enable Hibernate's automatic session context management --> <property name="current_session_context_class">thread</property> <!-- Disable the second-level cache --> <property name="cache.provider_class">org.hibernate.cache.NoCacheProvider</property> <!-- Echo all executed SQL to stdout --> <property name="show_sql">true</property> <!-- Drop and re-create the database schema on startup --> <property name="hbm2ddl.auto">create</property> <mapping resource="events/Event.hbm.xml"/> </session-factory> </hibernate-configuration>]]>
es_es: <![CDATA[<?xml version='1.0' encoding='utf-8'?> <!DOCTYPE hibernate-configuration PUBLIC "-//Hibernate/Hibernate Configuration DTD 3.0//EN" "http://hibernate.sourceforge.net/hibernate-configuration-3.0.dtd"> <hibernate-configuration> <session-factory> <!-- Database connection settings --> <property name="connection.driver_class">org.hsqldb.jdbcDriver</property> <property name="connection.url">jdbc:hsqldb:data/tutorial</property> <property name="connection.username">sa</property> <property name="connection.password"></property> <!-- JDBC connection pool (use the built-in) --> <property name="connection.pool_size">1</property> <!-- SQL dialect --> <property name="dialect">org.hibernate.dialect.HSQLDialect</property> <!-- Echo all executed SQL to stdout --> <property name="show_sql">true</property> <!-- Drop and re-create the database schema on startup --> <property name="hbm2ddl.auto">create</property> <mapping resource="Event.hbm.xml"/> </session-factory> </hibernate-configuration>]]>

source: Note that this XML configuration uses a different DTD. We configure Hibernate's <literal>SessionFactory</literal> - a global factory responsible for a particular database. If you have several databases, use several <literal>&lt;session-factory&gt;</literal> configurations, usually in several configuration files (for easier startup).
es_es: Observa que esta configuraci&#x00f3;n XML usa un DTD diferente. Configuramos la <literal>SessionFactory</literal> de Hibernate, una f&#x00e1;brica global responsable de una base de datos en particular. Si tienes varias bases de datos, usa varias configuraciones <literal>&lt;session-factory&gt;</literal> , usualmente en varios ficheros de configuraci&#x00f3;n (para un arranque m&#x00e1;s f&#x00e1;cil).
pt_br: Note que esta configuração XML usa um diferente DTD. Nós configuraremos as <literal>SessionFactory</literal> do Hibernate – uma factory global responsável por uma base de dedados particular. Se você tiver diversas bases de dados, use diversas configurações <literal>&lt;session-factory&gt;</literal>, geralmente em diversos arquivos de configuração (para uma partida mais fácil).
zh_cn: 注意这个XML配置使用了一个不同的DTD。在这里，我们配置了Hibernate的<literal>SessionFactory</literal>－一个关联于特定数据库全局的工厂（factory）。如果你要使用多个数据库，就要用多个的<literal>&lt;session-factory&gt;</literal>，通常把它们放在多个配置文件中（为了更容易启动）。
