Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: es_es, pt_br, zh_cn

source: A <literal>Session</literal> is a single unit of work. For now we'll keep things simple and assume a one-to-one granularity between a Hibernate <literal>Session</literal> and a database transaction. To shield our code from the actual underlying transaction system (in this case plain JDBC, but it could also run with JTA) we use the <literal>Transaction</literal> API that is available on the Hibernate <literal>Session</literal>.
es_es: <![CDATA[import org.hibernate.Transaction; import org.hibernate.Session; import java.util.Date; public class EventManager { public static void main(String[] args) { EventManager mgr = new EventManager(); if (args[0].equals("store")) { mgr.createAndStoreEvent("My Event", new Date()); } HibernateUtil.sessionFactory.close(); } }]]>
pt_br: Um <literal>Session</literal> é uma unidade simples de trabalho. Por agora nós iremos pegar coisas simples e assumir uma granularidade de um-pra-um entre uma <literal>Session</literal> do Hibernate e uma transação de banco de dados. Para proteger nosso código de um atual sistema subjacente de transação (nesse caso puro JDBC, mas também poderia rodar com JTA), nos usamos a API <literal>Transaction</literal>, que está disponível na <literal>Session</literal> do Hibernate.
zh_cn: 一个<literal>Session</literal>就是个单一的工作单元。我们暂时让事情简单一些，并假设Hibernate<literal>Session</literal>和数据库事务是一一对应的。为了让我们的代码从底层的事务系统中脱离出来（此例中是JDBC，但也可能是JTA），我们使用Hibernate <literal>Session</literal>中的<literal>Transaction</literal> API。

source: What does <literal>sessionFactory.getCurrentSession()</literal> do? First, you can call it as many times and anywhere you like, once you get hold of your <literal>SessionFactory</literal> (easy thanks to <literal>HibernateUtil</literal>). The <literal>getCurrentSession()</literal> method always returns the "current" unit of work. Remember that we switched the configuration option for this mechanism to "thread" in <literal>hibernate.cfg.xml</literal>? Hence, the current unit of work is bound to the current Java thread that executes our application. However, this is not the full picture, you also have to consider scope, when a unit of work begins and when it ends.
es_es: Leemos algunos argumentos de la l&#x00ed;nea de comandos, y si el primer argumento es "store", creamos y almacenamos un nuevo Event:
pt_br: O que a <literal>sessionFactory.getCurrentSession()</literal> faz? Primeiro, você pode chamar quantas vezes e de onde quiser, uma vez você recebe sua <literal>SessionFactory</literal> (fácil graças ao <literal>HibernateUtil</literal>). O método <literal>getCurrentSession()</literal> sempre retorna a unidade de trabalho "corrente". Lembra de que nós mudamos a opção de configuração desse mecanismo para thread no <literal>hibernate.cfg.xml</literal>? Daqui em diante, o escopo da unidade de trabalho corrente é a thread Java corrente que executa nossa aplicação. Entretanto, esta não é toda a verdade. Uma
zh_cn: <literal>sessionFactory.getCurrentSession()</literal>是干什么的呢？首先，只要你持有<literal>SessionFactory</literal>（幸亏我们有<literal>HibernateUtil</literal>，可以随时获得），大可在任何时候、任何地点调用这个方法。<literal>getCurrentSession()</literal>方法总会返回“当前的”工作单元。记得我们在<literal>hibernate.cfg.xml</literal>中把这一配置选项调整为"thread"了吗？因此，因此，当前工作单元被绑定到当前执行我们应用程序的Java线程。但是，这并非是完全准确的,你还得考虑工作单元的生命周期范围 (scope),它何时开始,又何时结束.

source: A <literal>Session</literal> begins when it is first needed, when the first call to <literal>getCurrentSession()</literal> is made. It is then bound by Hibernate to the current thread. When the transaction ends, either through commit or rollback, Hibernate automatically unbinds the <literal>Session</literal> from the thread and closes it for you. If you call <literal>getCurrentSession()</literal> again, you get a new <literal>Session</literal> and can start a new unit of work. This <emphasis>thread-bound</emphasis> programming model is the most popular way of using Hibernate, as it allows flexible layering of your code (transaction demarcation code can be separated from data access code, we'll do this later in this tutorial).
es_es: <![CDATA[private void createAndStoreEvent(String title, Date theDate) { Session session = HibernateUtil.currentSession(); Transaction tx = session.beginTransaction(); Event theEvent = new Event(); theEvent.setTitle(title); theEvent.setDate(theDate); session.save(theEvent); tx.commit(); HibernateUtil.closeSession(); }]]>
pt_br: <literal>Session</literal> começa quando é primeiramente necessária, quando é feita a primeira chamada à <literal>getCurrentSession()</literal>. É então limitado pelo Hibernate para thread corrente. Quando a transação termina, tanto com commit quanto rollback, o Hibernate também desune a <literal>Session</literal> da thread e fecha isso pra você. Se você chamar <literal>getCurrentSession()</literal> novamente, você receberá uma nova <literal>Session</literal> e pode começar uma nova unidade de trabalho. Esse modelo de programação de limite de thread <emphasis>thread-bound</emphasis>, é o modo mais popular de se usar o Hibernate.
zh_cn: <literal>Session</literal>在第一次被使用的时候,即第一次调用<literal>getCurrentSession()</literal>的时候,其生命周期就开始。然后它被Hibernate绑定到当前线程。当事务结束的时候，不管是提交还是回滚，Hibernate会自动把<literal>Session</literal>从当前线程剥离，并且关闭它。假若你再次调用<literal>getCurrentSession()</literal>，你会得到一个新的<literal>Session</literal>，并且开始一个新的工作单元。这种<emphasis>线程绑定(thread-bound)</emphasis>的编程模型（model）是使用Hibernate的最广泛的方式,因为它支持对你的代码灵活分层(事务划分可以和你的数据访问代码分离开来,在本教程的后面部分就会这么做)。

source: Related to the unit of work scope, should the Hibernate <literal>Session</literal> be used to execute one or several database operations? The above example uses one <literal>Session</literal> for one operation. This is pure coincidence, the example is just not complex enough to show any other approach. The scope of a Hibernate <literal>Session</literal> is flexible but you should never design your application to use a new Hibernate <literal>Session</literal> for <emphasis>every</emphasis> database operation. So even if you see it a few more times in the following (very trivial) examples, consider <emphasis>session-per-operation</emphasis> an anti-pattern. A real (web) application is shown later in this tutorial.
es_es: Creamos un nuevo objeto <literal>Event</literal>, y se lo damos a Hibernate. Hibernate cuida ahora del SQL y ejecuta <literal>INSERT</literal>s en la base de datos. Echemos una mirada al c&#x00f3;digo de manejo de <literal>Session</literal> y <literal>Transaction</literal> antes de ejecutar esto.
zh_cn: 和工作单元的生命周期这个话题相关，Hibernate <literal>Session</literal>是否被应该用来执行多次数据库操作？上面的例子对每一次操作使用了一个<literal>Session</literal>，这完全是巧合，这个例子不是很复杂，无法展示其他方式。Hibernate <literal>Session</literal>的生命周期可以很灵活，但是你绝不要把你的应用程序设计成为<emphasis>每一次</emphasis>数据库操作都用一个新的Hibernate <literal>Session</literal>。因此就算下面的例子（它们都很简单）中你可以看到这种用法，记住<emphasis>每次操作一个session</emphasis>是一个反模式。在本教程的后面会展示一个真正的(web)程序。

source: Have a look at <xref linkend="transactions"/> for more information about transaction handling and demarcation. We also skipped any error handling and rollback in the previous example.
es_es: Una <literal>Session</literal> es una sola unidad de trabajo. Podr&#x00ed;a sorprenderte que tengamos una API adicional, <literal>Transaction</literal>. Esto implica que una unidad de trabajo puede ser "m&#x00e1;s larga" que una sola transacci&#x00f3;n de base de datos; imagina una unidad de trabajo que se abarca varios ciclos petici&#x00f3;n/respuesta HTTP (por ejemplo, un di&#x00e1;logo asistente) en una aplicaci&#x00f3;n web. Separar las transacciones de base de datos de "las unidades de trabajo de la aplicaci&#x00f3;n desde el punto de vista del usuario" es uno de los conceptos b&#x00e1;sicos de dise&#x00f1;o de Hibernate. Llamamos una unidad de trabajo larga <emphasis>Transacci&#x00f3;n de Aplicaci&#x00f3;n</emphasis>, usualmente encapsulando varias transacciones de base de datos m&#x00e1;s cortas. Por ahora mantendremos las cosas simples y asumiremos una granularidad uno-a-uno entre una <literal>Session</literal> y una <literal>Transaction</literal>.
pt_br: Dê uma olhada no <xref linkend="transactions"/> para mais informações a respeito de manipulação de transação e demarcação. Nós também pulamos qualquer manipulação de erro e rollback no exemplo anterior.
zh_cn: 关于事务处理及事务边界界定的详细信息，请参看<xref linkend="transactions"/>。在上面的例子中，我们也忽略了所有的错误与回滚的处理。

source: To run this first routine we have to add a callable target to the Ant build file:
es_es: ٯQu&#x00e9; es lo que hacen <literal>Transaction.begin()</literal> y <literal>commit()</literal>? ٯD&#x00f3;nde est&#x00e1; el rollback en caso que algo vaya mal? La API de <literal>Transaction</literal> de Hibernate es opcional realmente, pero la usamos por conveniencia y portabilidad. Si manejases la transacci&#x00f3;n de base de datos por ti mismo (por ejemplo, llamando a <literal>session.connection.commit()</literal>), ligar&#x00ed;as el c&#x00f3;digo a un entorno de despliegue particular, en este JDBC directo no manejado. Estableciendo la f&#x00e1;brica de <literal>Transaction</literal> en tu configuraci&#x00f3;n de Hibernate puedes desplegar tu capa de persistencia en cualquier sitio. Echa una mirada al <xref linkend="transactions"/> para m&#x00e1;s informaci&#x00f3;n sobre manejo y demarcaci&#x00f3;n de transacciones. Hemos saltado tambi&#x00e9;n cualquier manejo de excepciones y rollback en este ejemplo.
pt_br: Para executar esta primeira rotina, nos teremos que adicionar um ponto de chamada para o arquivo de build do Ant:
zh_cn: 为第一次运行我们的程序，我们得在Ant的build文件中增加一个可以调用得到的target。

source: <![CDATA[<target name="run" depends="compile"> <java fork="true" classname="events.EventManager" classpathref="libraries"> <classpath path="${targetdir}"/> <arg value="${action}"/> </java> </target>]]>
es_es: Para ejecutar la primera rutina tenemos que agregar un objetivo llamable al fichero de construcci&#x00f3;n de Ant:

source: The value of the <literal>action</literal> argument is set on the command line when calling the target:
es_es: <![CDATA[<target name="run" depends="compile"> <java fork="true" classname="EventManager" classpathref="libraries"> <classpath path="${targetdir}"/> <arg value="${action}"/> </java> </target>]]>
pt_br: O valor do argumento <literal>action</literal>, é setado na linha de comando quando chamando esse ponto:
zh_cn: <literal>action</literal>参数（argument）的值是通过命令行调用这个target的时候设置的：

source: <![CDATA[C:\hibernateTutorial\>ant run -Daction=store]]>
es_es: El valor del argumento <literal>action</literal> es establecido por l&#x00ed;nea de comandos al llamar al objetivo:

source: You should see, after compilation, Hibernate starting up and, depending on your configuration, lots of log output. At the end you will find the following line:
es_es: <![CDATA[C:\hibernateTutorial\>ant run -Daction=store]]>
pt_br: Você deverá ver, após a compilação, o startup do Hibernate e, dependendo da sua configuração, muito log de saída. No final você verá a seguinte linha:
zh_cn: 你应该会看到，编译以后，Hibernate根据你的配置启动，并产生一大堆的输出日志。在日志最后你会看到下面这行：

source: <![CDATA[[java] Hibernate: insert into EVENTS (EVENT_DATE, title, EVENT_ID) values (?, ?, ?)]]>
es_es: Debes ver, despu&#x00e9;s de la compilaci&#x00f3;n, a Hibernate arrancando y, dependiendo de tu configuraci&#x00f3;n mucha salida de registro (log). Al final encontrar&#x00e1;s la siguiente l&#x00ed;nea:

source: This is the <literal>INSERT</literal> executed by Hibernate, the question marks represent JDBC bind parameters. To see the values bound as arguments, or to reduce the verbosity of the log, check your <literal>log4j.properties</literal>.
es_es: <![CDATA[[java] Hibernate: insert into EVENTS (EVENT_DATE, title, EVENT_ID) values (?, ?, ?)]]>
pt_br: Este é o <literal>INSERT</literal> executado pelo Hibernate, os pontos de interrogação representam parêmetros de união do JDBC. Para ver os valores substituídos, ou para diminuir a verbalidade do log, check seu l<literal>log4j.properties</literal>.
zh_cn: 这是Hibernate执行的<literal>INSERT</literal>命令，问号代表JDBC的绑定参数。如果想要看到绑定参数的值或者减少日志的长度，就要调整你在<literal>log4j.properties</literal>文件里的设置。

source: Now we'd like to list stored events as well, so we add an option to the main method:
es_es: Esta es la <literal>INSERT</literal> ejecutada por Hibernate, los signos de preguntas representan par&#x00e1;metros de ligado JDBC. Para ver los valores ligados como argumentos, o para reducir la verborragia del registro, chequea tu <literal>log4j.properties</literal>.
pt_br: Agora nós gostaríamos de listar os eventos arquivados, então nós adicionamos uma opção para o método main:
zh_cn: 我们想要列出所有已经被存储的events，就要增加一个条件分支选项到main方法中去。

source: <![CDATA[if (args[0].equals("store")) { mgr.createAndStoreEvent("My Event", new Date()); } else if (args[0].equals("list")) { List events = mgr.listEvents(); for (int i = 0; i < events.size(); i++) { Event theEvent = (Event) events.get(i); System.out.println("Event: " + theEvent.getTitle() + " Time: " + theEvent.getDate()); } }]]>
es_es: Ahora quisi&#x00e9;ramos listar acontecimientos almacenados tambi&#x00e9;n, as&#x00ed; que agregamos una opci&#x00f3;n al m&#x00e9;todo principal:

source: We also add a new <literal>listEvents() method</literal>:
es_es: <![CDATA[if (args[0].equals("store")) { mgr.createAndStoreEvent("My Event", new Date()); } else if (args[0].equals("list")) { List events = mgr.listEvents(); for (int i = 0; i < events.size(); i++) { Event theEvent = (Event) events.get(i); System.out.println("Event: " + theEvent.getTitle() + " Time: " + theEvent.getDate()); } }]]>
pt_br: Nos também adicionamos um novo <literal>método listEvents()</literal>:
zh_cn: 我们也增加一个新的<literal>listEvents()</literal>方法:

source: <![CDATA[private List listEvents() { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); List result = session.createQuery("from Event").list(); session.getTransaction().commit(); return result; }]]>
es_es: Agregamos tambi&#x00e9;n un nuevo m&#x00e9;todo <literal>listEvents()</literal>:

source: What we do here is use an HQL (Hibernate Query Language) query to load all existing <literal>Event</literal> objects from the database. Hibernate will generate the appropriate SQL, send it to the database and populate <literal>Event</literal> objects with the data. You can create more complex queries with HQL, of course.
es_es: <![CDATA[private List listEvents() { Session session = HibernateUtil.currentSession(); Transaction tx = session.beginTransaction(); List result = session.createQuery("from Event").list(); tx.commit(); session.close(); return result; }]]>
pt_br: O que nós fazemos aqui, é usar uma query HQL (Hibernate Query Language), para carregar todos os objetos <literal>Event</literal> exitentes no banco de dados. O Hibernate irá gerar o SQL apropriado, enviar para o banco de dados e popular objetos <literal>Event</literal> com os dados. Você pode criar queries mais complexas com HQL, claro.
zh_cn: 我们在这里是用一个HQL（Hibernate Query Language－Hibernate查询语言）查询语句来从数据库中加载所有存在的<literal>Event</literal>对象。Hibernate会生成适当的SQL，把它发送到数据库，并操作从查询得到数据的<literal>Event</literal>对象。当然，你可以使用HQL来创建更加复杂的查询。

source: Now, to execute and test all of this, follow these steps:
es_es: Lo que hacemos aqu&#x00ed; es usar una consulta HQL (Lenguaje de Consulta de Hibernate o Hibernate Query Language) para cargar todos los objetos <literal>Event</literal> existentes de la base de datos. Hibernate generar&#x00e1; el SQL apropiado, lo enviar&#x00e1; a la base de datosy poblar&#x00e1; los objetos <literal>Event</literal> con datos. Puedes, por supuesto, crear consultas m&#x00e1;s complejas con HQL.
pt_br: Agora, para executar e testar tudo isso, siga os passos a seguir:
zh_cn: 现在，根据以下步骤来执行并测试以上各项：

source: Run <literal>ant run -Daction=store</literal> to store something into the database and, of course, to generate the database schema before through hbm2ddl.
es_es: Now, to execute and test all of this, follow these steps:
pt_br: Execute <literal>ant run -Daction=store</literal> para armazenar algo no banco de dados e, claro, gerar o esquema do banco de dados antes pelo hbm2ddl.
zh_cn: 运行<literal>ant run -Daction=store</literal>来保存一些内容到数据库。当然，先得用hbm2ddl来生成数据库schema。

source: Now disable hbm2ddl by commenting out the property in your <literal>hibernate.cfg.xml</literal> file. Usually you only leave it turned on in continous unit testing, but another run of hbm2ddl would <emphasis>drop</emphasis> everything you have stored - the <literal>create</literal> configuration setting actually translates into "drop all tables from the schema, then re-create all tables, when the SessionFactory is build".
es_es: Run <literal>ant run -Daction=store</literal> to store something into the database and, of course, to generate the database schema before through hbm2ddl.
pt_br: Agora desabilite hbm2ddl comentando a propriedade no seu arquivo <literal>hibernate.cfg.xml</literal>. Normalmente só se deixa habilitado em teste unitários contínuos, mas outra carga de hbm2ddl pode <emphasis>remover</emphasis> tudo que você já tenha arquivado. Sa configuração <literal>create</literal>, atualmente são traduzidas para "apague todas as tabelas do esquema, então recrie todas quando a SessionFactory estiver pronta".
zh_cn: 现在把<literal>hibernate.cfg.xml</literal>文件中hbm2ddl属性注释掉，这样我们就取消了在启动时用hbm2ddl来生成数据库schema。通常只有在不断重复进行单元测试的时候才需要打开它，但再次运行hbm2ddl会把你保存的一切都删掉（<emphasis>drop</emphasis>）——<literal>create</literal>配置的真实含义是：“在创建SessionFactory的时候，从schema 中drop 掉所有的表，再重新创建它们”。

source: If you now call Ant with <literal>-Daction=list</literal>, you should see the events you have stored so far. You can of course also call the <literal>store</literal> action a few times more.
es_es: Now disable hbm2ddl by commenting out the property in your <literal>hibernate.cfg.xml</literal> file. Usually you only leave it turned on in continous unit testing, but another run of hbm2ddl would <emphasis>drop</emphasis> everything you have stored - the <literal>create</literal> configuration setting actually translates into "drop all tables from the schema, then re-create all tables, when the SessionFactory is build".
pt_br: Se você agora chamar o Ant com <literal>-Daction=list</literal>, você deverá ver os eventos que você acabou de criar. Você pode também chamar a ação <literal>store</literal> mais algumas vezes.
zh_cn: 如果你现在使用命令行参数<literal>-Daction=list</literal>运行Ant，你会看到那些至今为止我们所储存的events。当然，你也可以多调用几次<literal>store</literal>以保存更多的envents。

source: Note: Most new Hibernate users fail at this point and we see questions about <emphasis>Table not found</emphasis> error messages regularly. However, if you follow the steps outlined above you will not have this problem, as hbm2ddl creates the database schema on the first run, and subsequent application restarts will use this schema. If you change the mapping and/or database schema, you have to re-enable hbm2ddl once again.
es_es: If you now call Ant with <literal>-Daction=list</literal>, you should see the events you have stored so far. You can of course also call the <literal>store</literal> action a few times more.
pt_br: Nota: A maioria dos novos usuários do Hibernate falha nesse ponto e nós regularmente, vemos questões sobre mensagens de erro de <emphasis>tabela não encontrada </emphasis> . Entretanto, se você seguir os passos marcados acima, você não terá esse problema, com o hbm2ddl criando o esquema do banco de dados na primeira execução, e restarts subsequentes da aplicação irão usar este esquema. Se você mudar o mapeamento e/ou o esquema do banco de dados, terá de re-habilitar o hbm2ddl mais uma vez.
zh_cn: 注意，很多Hibernate新手在这一步会失败，我们不时看到关于<emphasis>Table not found</emphasis>错误信息的提问。但是，只要你根据上面描述的步骤来执行，就不会有这个问题，因为hbm2ddl会在第一次运行的时候创建数据库schema，后继的应用程序重起后还能继续使用这个schema。假若你修改了映射，或者修改了数据库schema，你必须把hbm2ddl重新打开一次。

source: Part 2 - Mapping associations
es_es: Note: Most new Hibernate users fail at this point and we see questions about <emphasis>Table not found</emphasis> error messages regularly. However, if you follow the steps outlined above you will not have this problem, as hbm2ddl creates the database schema on the first run, and subsequent application restarts will use this schema. If you change the mapping and/or database schema, you have to re-enable hbm2ddl once again.
pt_br: Part 2 - Mapeando associações
zh_cn: 第二部分 － 关联映射

source: We mapped a persistent entity class to a table. Let's build on this and add some class associations. First we'll add people to our application, and store a list of events they participate in.
es_es: Part 2 - Mapeando asociaciones
pt_br: Nós mapeamos uma classe de entidade de persistência para uma tabela. Agora vamos continuar e adicionar algumas associações de classe. Primeiro nos iremos adicionar pessoas a nossa aplicação, e armazenar os eventos de que elas participam.
zh_cn: 我们已经映射了一个持久化实体类到表上。让我们在这个基础上增加一些类之间的关联。首先我们往应用程序里增加人（people）的概念，并存储他们所参与的一个Event列表。（译者注：与Event一样，我们在后面将直接使用person来表示“人”而不是它的中文翻译）

source: Mapping the Person class
es_es: Hemos mapeado un clase de entidad persistente a una tabla. Construyamos sobre esto y agreguemos algunas asociaciones de clase. Primero agregaremos personas a nuestra aplicaci&#x00f3;n, y almacenaremos una lista de eventos en las que participan.
pt_br: Mapeando a classe Person
zh_cn: 映射Person类

source: The first cut of the <literal>Person</literal> class is simple:
es_es: Mapeando la clase Person
pt_br: O primeiro código da classe <literal>Person</literal> é simples:
zh_cn: 最初简单的<literal>Person</literal>类：

source: <![CDATA[package events; public class Person { private Long id; private int age; private String firstname; private String lastname; public Person() {} // Accessor methods for all properties, private setter for 'id' }]]>
es_es: El primer corte de la clase <literal>Person</literal> es simple:

source: Create a new mapping file called <literal>Person.hbm.xml</literal> (don't forget the DTD reference at the top):
es_es: <![CDATA[public class Person { private Long id; private int age; private String firstname; private String lastname; Person() {} // Accessor methods for all properties, private setter for 'id' }]]>
pt_br: Crie um novo arquivo de mapeamento, chamado <literal>Person.hbm.xml</literal> (não esqueça a referencia ao DTD no topo)
zh_cn: 创建一个名为<literal>Person.hbm.xml</literal>的新映射文件（别忘了最上面的DTD引用）：

source: <![CDATA[<hibernate-mapping> <class name="events.Person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="native"/> </id> <property name="age"/> <property name="firstname"/> <property name="lastname"/> </class> </hibernate-mapping>]]>
es_es: Crea un fichero de mapeo llamado <literal>Person.hbm.xml</literal>:

source: Finally, add the new mapping to Hibernate's configuration:
es_es: <![CDATA[<hibernate-mapping> <class name="Person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="increment"/> </id> <property name="age"/> <property name="firstname"/> <property name="lastname"/> </class> </hibernate-mapping>]]>
pt_br: Finalmente, adicione o novo mapeamento a configuração do Hibernate:
zh_cn: 最后，把新的映射加入到Hibernate的配置中：

source: <![CDATA[<mapping resource="events/Event.hbm.xml"/> <mapping resource="events/Person.hbm.xml"/>]]>
es_es: Finalmente, agrega el nuevo mapeo a la configuraci&#x00f3;n de Hibernate:
