Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: es_es, pt_br, zh_cn

source: This was an example of an association between two equally important classes, two entities. As mentioned earlier, there are other classes and types in a typical model, usually "less important". Some you have already seen, like an <literal>int</literal> or a <literal>String</literal>. We call these classes <emphasis>value types</emphasis>, and their instances <emphasis>depend</emphasis> on a particular entity. Instances of these types don't have their own identity, nor are they shared between entities (two persons don't reference the same <literal>firstname</literal> object, even if they have the same first name). Of course, value types can not only be found in the JDK (in fact, in a Hibernate application all JDK classes are considered value types), but you can also write dependent classes yourself, <literal>Address</literal> or <literal>MonetaryAmount</literal>, for example.
es_es: Esto fue un ejemplo de una asociaci&#x00f3;n entre dos clases igualmente importantes, dos entidades. Como se ha mencionado anteriormente, hay otras clases y tipos en un modelo t&#x00ed;pico, usualmente "menos importantes". Algunos ya los habr&#x00e1;s visto, como un <literal>int</literal> o un <literal>String</literal>. Llamamos a estas clases <emphasis>tipos de valor (value types)</emphasis>, y sus instancias <emphasis>dependen</emphasis> de una entidad en particular. Las instancias de estos tipos no tienen su propia identidad, ni son compartidas entre entidades (dos personas no referencian el mismo objeto <literal>firstname</literal>, incluso si tuvieran el mismo primer nombre). Por supuesto, los tipos de valor no s&#x00f3;lo pueden encontrarse en el JDK (de hecho, en una aplicaci&#x00f3;n Hibernate todas las clases del JDK son consideradas tipos de valor), sino que adem&#x00e1;s puedes escribir por ti mismo clases dependientes, por ejemplo, <literal>Address</literal> o <literal>MonetaryAmount</literal>.
pt_br: Este foi um exemplo de uma associação entre duas classes igualmente importantes, duas entidades. Como mencionado anteriormente, há outras classes e tipos dentro de um modelo típico, geralmente "menos importante". Alguns você já viu, como um <literal>int</literal> ou uma <literal>String</literal>. Nós chamamos essas classes de <emphasis>value types</emphasis>, e suas instâncias <emphasis>depend</emphasis> de uma entidade particular. As instâncias desses tipos não possuem sua própria identidade, nem são compartilhados entre entidades (duas pessoas não referenciam o mesmo objeto <literal>firstname</literal> mesmo se elas tiverem o mesmo objeto firstname). Naturalmente, os value types não são apenas encontrados dentro da JDK (de fato, em um aplicativo Hibernate todas as classes JDK são consideradas como value types), mas você pode também criar suas classes como, por exemplo, <literal>Address</literal> ou <literal>MonetaryAmount</literal>.
zh_cn: 上面是个关于两个同等重要的实体类间关联的例子。像前面所提到的那样，在特定的模型中也存在其它的类和类型，这些类和类型通常是“次要的”。你已看到过其中的一些，像<literal>int</literal>或<literal>String</literal>。我们称这些类为<emphasis>值类型（value type）</emphasis>，它们的实例<emphasis>依赖（depend）</emphasis>在某个特定的实体上。这些类型的实例没有它们自己的标识（identity），也不能在实体间被共享（比如，两个person不能引用同一个<literal>firstname</literal>对象，即使他们有相同的first name）。当然，值类型并不仅仅在JDK中存在（事实上，在一个Hibernate应用程序中，所有的JDK类都被视为值类型），而且你也可以编写你自己的依赖类，例如<literal>Address</literal>，<literal>MonetaryAmount</literal>。

source: You can also design a collection of value types. This is conceptually very different from a collection of references to other entities, but looks almost the same in Java.
es_es: Tambi&#x00e9;n puedes dise&#x00f1;ar una colecci&#x00f3;n de tipos de valor. Esto es conceptualmente muy diferente de una colecci&#x00f3;n de referencias a otras entidades, pero se ve casi lo mismo en Java.
pt_br: Você também pode criar uma coleção de value types. Isso é conceitualmente muito diferente de uma coleção de referências para outras entidades, mas em Java parece ser quase a mesma coisa.
zh_cn: 你也可以设计一个值类型的集合，这在概念上与引用其它实体的集合有很大的不同，但是在Java里面看起来几乎是一样的。

source: Collection of values
es_es: Colecci&#x00f3;n de valores
pt_br: Coleção de valores
zh_cn: 值类型的集合

source: We add a collection of value typed objects to the <literal>Person</literal> entity. We want to store email addresses, so the type we use is <literal>String</literal>, and the collection is again a <literal>Set</literal>:
es_es: Agregamos una colecci&#x00f3;n de objetos tipificados en valor a la entidad <literal>Person</literal>. Queremos almacenar direcciones de email, de modo que el tipo que usamos es <literal>String</literal>, y la colecci&#x00f3;n es nuevamente un <literal>Set</literal>:
pt_br: Nós adicionamos uma coleção de objetos de tipo de valores à entidade <literal>Person</literal>. Nós querermos armazenar endereços de e-mail, para isso utilizamos o tipo <literal>String</literal>, e a coleção novamente será um <literal>Set</literal>:
zh_cn: 我们把一个值类型对象的集合加入<literal>Person</literal>实体中。我们希望保存email地址，所以使用<literal>String</literal>类型，而且这次的集合类型又是<literal>Set</literal>：

source: The mapping of this <literal>Set</literal>:
es_es: El mapeo de este <literal>Set</literal>:
pt_br: O mapeamento deste <literal>Set</literal>:
zh_cn: 这个<literal>Set</literal>的映射

source: The difference compared with the earlier mapping is the <literal>element</literal> part, which tells Hibernate that the collection does not contain references to another entity, but a collection of elements of type <literal>String</literal> (the lowercase name tells you it's a Hibernate mapping type/converter). Once again, the <literal>table</literal> attribute of the <literal>set</literal> element determines the table name for the collection. The <literal>key</literal> element defines the foreign-key column name in the collection table. The <literal>column</literal> attribute in the <literal>element</literal> element defines the column name where the <literal>String</literal> values will actually be stored.
es_es: La diferencia comparada con el mapeo anterior es la parte <literal>element</literal>, que le dice a Hibernate que la colecci&#x00f3;n no contiene referencias a otra entidad, sino una colecci&#x00f3;n de elementos de tipo <literal>String</literal> (el nombre en min&#x00fa;sculas te dice que es un tipo/conversor de mapeo de Hibernate). Una vez m&#x00e1;s, el atributo <literal>table</literal> del elemento <literal>set</literal> determina el nombre de la tabla para la colecci&#x00f3;n. El elemento <literal>key</literal> define el nombre de la columna clave for&#x00e1;nea en la tabla de colecci&#x00f3;n. El atributo <literal>column</literal> en el elemento <literal>element</literal> define el nombre de columna donde realmente ser&#x00e1;n almacenados los valores <literal>String</literal>.
pt_br: A diferença comparada com o mapeamento anterior se encontra na parte <literal>element</literal>, que indica ao Hibernate que a coleção não contém referências à outra entidade, mas uma coleção de elementos do tipo <literal>String</literal> (a tag name em miniscula indica que se trata de um mapeamento do Hibernate para conversão de tipos). Mais uma vez, o atributo <literal>table</literal> do elemento <literal>set</literal> determina o nome da tabela para a coleção. O elemento <literal>key</literal> define o nome da coluna de chave estrangeira na tabela de coleção. O atributo <literal>column</literal> dentro do elemento <literal>element</literal> define o nome da coluna onde os valores da <literal>String</literal> serão armazenados.
zh_cn: 比较这次和此前映射的差别，主要在于<literal>element</literal>部分，这次并没有包含对其它实体引用的集合，而是元素类型为<literal>String</literal>的集合（在映射中使用小写的名字”string“是向你表明它是一个Hibernate的映射类型或者类型转换器）。和之前一样，<literal>set</literal>元素的<literal>table</literal>属性决定了用于集合的表名。<literal>key</literal>元素定义了在集合表中外键的字段名。<literal>element</literal>元素的<literal>column</literal>属性定义用于实际保存<literal>String</literal>值的字段名。

source: Have a look at the updated schema:
es_es: Echa una mirada al esquema actualizado:
pt_br: Dê uma olhada no esquema atualizado:
zh_cn: 看一下修改后的数据库schema。

source: You can see that the primary key of the collection table is in fact a composite key, using both columns. This also implies that there can't be duplicate email addresses per person, which is exactly the semantics we need for a set in Java.
es_es: Puedes ver que la clave primaria de la tabla de colecci&#x00f3;n es de hecho una clave compuesta, usando ambas columnas. Esto implica tambi&#x00e9;n que no pueden haber direcciones de email duplicadas por persona, que es exactamente la sem&#x00e1;ntica que necesitamos para un conjunto en Java.
pt_br: Você pode observar que a chave primária da tabela da coleção é de na verdade uma chave composta, usando ambas colunas. Isso também implica que cada pessoa não pode ter endereços de e-mail duplicados, o que é exatamente a semântica que precisamos para um set em Java.
zh_cn: 你可以看到集合表的主键实际上是个复合主键，同时使用了2个字段。这也暗示了对于同一个person不能有重复的email地址，这正是Java里面使用Set时候所需要的语义（Set里元素不能重复）。

source: You can now try and add elements to this collection, just like we did before by linking persons and events. It's the same code in Java:
es_es: <![CDATA[private void addEmailToPerson(Long personId, String emailAddress) { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); Person aPerson = (Person) session.load(Person.class, personId); // The getEmailAddresses() might trigger a lazy load of the collection aPerson.getEmailAddresses().add(emailAddress); session.getTransaction().commit(); }]]>
pt_br: Você pode agora tentar adicionar elementos a essa coleção, do mesmo modo que fizemos anteriormente ligando pessoas e eventos. È o mesmo código em Java:
zh_cn: 你现在可以试着把元素加入到这个集合，就像我们在之前关联person和event的那样。其实现的Java代码是相同的：

source: <![CDATA[private void addEmailToPerson(Long personId, String emailAddress) { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); Person aPerson = (Person) session.load(Person.class, personId); // The getEmailAddresses() might trigger a lazy load of the collection aPerson.getEmailAddresses().add(emailAddress); session.getTransaction().commit(); }]]>
es_es: Puedes ahora intentar y agregar elementos a esta colecci&#x00f3;n, al igual que hicimos antes enlazando personas y eventos. Es el mismo c&#x00f3;digo en Java.

source: Bi-directional associations
es_es: Asociaciones bidireccionales
pt_br: Associações bidirecionais
zh_cn: 双向关联

source: Next we are going to map a bi-directional association - making the association between person and event work from both sides in Java. Of course, the database schema doesn't change, we still have many-to-many multiplicity. A relational database is more flexible than a network programming language, so it doesn't need anything like a navigation direction - data can be viewed and retrieved in any possible way.
es_es: A continuacion vamos a mapear una asociaci&#x00f3;n bidireccional, haciendo que la asociaci&#x00f3;n entre persona y evento funcione desde ambos lados en Java. Por supuesto, el esquema de base de datos no cambia; todav&#x00ed;a necesitamos multiplicidad muchos-a-muchos. Una base de datos relacional es m&#x00e1;s flexible que un lenguaje de programaci&#x00f3;n de red, as&#x00ed; que no necesita nada parecido a una direcci&#x00f3;n de navegaci&#x00f3;n; los datos pueden ser vistos y recuperados en cualquier forma posible.
pt_br: Agora iremos mapear uma associação bidirecional – fazendo a associação entre pessoas e eventos, de ambos os lados, em Java. Logicamente, o esquema do banco de dados não muda, nós continuamos tendo multiplicidades muitos-para-muitos. Um banco de dados é mais flexível do que uma linguagem de programação para redes, ele não precisa de nenhuma direção de navegação – os dados podem ser acessados em qualquer caminho possível.
zh_cn: 接下来我们将映射双向关联（bi-directional association）－ 在Java里让person和event可以从关联的任何一端访问另一端。当然，数据库schema没有改变，我们仍然需要多对多的阶数。一个关系型数据库要比网络编程语言 更加灵活，所以它并不需要任何像导航方向（navigation direction）的东西 － 数据可以用任何可能的方式进行查看和获取。

source: First, add a collection of participants to the <literal>Event</literal> Event class:
es_es: Primero agrega una colecci&#x00f3;n de participantes a la clase de eventos <literal>Event</literal>:
pt_br: Primeiramente, adicione uma coleção de participantes à classe <literal>Event</literal>:
zh_cn: 首先，把一个参与者（person）的集合加入<literal>Event</literal>类中：

source: Now map this side of the association too, in <literal>Event.hbm.xml</literal>.
es_es: Ahora mapea este lado de la asociaci&#x00f3;n tambi&#x00e9;n, en <literal>Event.hbm.xml</literal>.
pt_br: Agora mapeie este lado da associação em <literal>Event.hbm.xml</literal>.
zh_cn: 在<literal>Event.hbm.xml</literal>里面也映射这个关联。

source: <![CDATA[<set name="participants" table="PERSON_EVENT" inverse="true"> <key column="EVENT_ID"/> <many-to-many column="PERSON_ID" class="events.Person"/> </set>]]>
es_es: <![CDATA[<set name="participants" table="PERSON_EVENT" inverse="true"> <key column="EVENT_ID"/> <many-to-many column="PERSON_ID" class="Person"/> </set>]]>

source: As you see, these are normal <literal>set</literal> mappings in both mapping documents. Notice that the column names in <literal>key</literal> and <literal>many-to-many</literal> are swapped in both mapping documents. The most important addition here is the <literal>inverse="true"</literal> attribute in the <literal>set</literal> element of the <literal>Event</literal>'s collection mapping.
es_es: Como ves, estos son mapeos normales de <literal>set</literal> en ambos documentos de mapeo. Nota que los nombres de columnas en <literal>key</literal> y <literal>many-to-many</literal> fueron permutados en ambos documentos de mapeo. Aqu&#x00ed; la adici&#x00f3;n m&#x00e1;s importante es el atributo <literal>inverse="true"</literal> en el elemento <literal>set</literal> del mapeo de colecci&#x00f3;n de <literal>Event</literal>.
pt_br: Como você pode ver, esses é uma mapeamento normal usando <literal>set</literal> em ambos documenentos de mapeamento. Observe que o nome das colunas em <literal>key</literal> e <literal>many-to-many</literal> estão trocados em ambos os documentos de mapeamento. A adição mais importante feita está no atributo <literal>inverse="true"</literal> no elemento set do mapeamento da coleção da classe <literal>Event</literal>.
zh_cn: 如你所见，两个映射文件里都有普通的<literal>set</literal>映射。注意在两个映射文件中，互换了<literal>key</literal>和<literal>many-to-many</literal>的字段名。这里最重要的是<literal>Event</literal>映射文件里增加了<literal>set</literal>元素的<literal>inverse="true"</literal>属性。

source: What this means is that Hibernate should take the other side - the <literal>Person</literal> class - when it needs to find out information about the link between the two. This will be a lot easier to understand once you see how the bi-directional link between our two entities is created .
es_es: Lo que esto significa es que Hibernate debe tomar el otro lado - la clase <literal>Person</literal> - cuando necesite descubrir informaci&#x00f3;n sobre el enlace entre las dos. Esto ser&#x00e1; mucho m&#x00e1;s f&#x00e1;cil de entender una vez que veas c&#x00f3;mo se crea el enlace bidireccional entre nuestras dos entidades.
pt_br: Isso significa que o Hibernate deve pegar o outro lado – a classe <literal>Person</literal> – quando necessitar encontrar informação sobre a relação entre as duas entidades. Isso será muito mais facilmente compreendido quando você analisar como a relação bidirecional entre as entidades é criada.
zh_cn: 这意味着在需要的时候，Hibernate能在关联的另一端 － <literal>Person</literal>类得到两个实体间关联的信息。这将会极大地帮助你理解双向关联是如何在两个实体间被创建的。

source: Working bi-directional links
es_es: Trabajando enlaces bidireccionales
pt_br: Trabalhando com links bidirecionais
zh_cn: 使双向连起来

source: First, keep in mind that Hibernate does not affect normal Java semantics. How did we create a link between a <literal>Person</literal> and an <literal>Event</literal> in the unidirectional example? We added an instance of <literal>Event</literal> to the collection of event references, of an instance of <literal>Person</literal>. So, obviously, if we want to make this link working bi-directional, we have to do the same on the other side - adding a <literal>Person</literal> reference to the collection in an <literal>Event</literal>. This "setting the link on both sides" is absolutely necessary and you should never forget doing it.
es_es: Primero, ten en mente que Hhibernate no afecta la sem&#x00e1;ntica normal de Java. ٯC&#x00f3;mo hemos creado un enlace entre una <literal>Person</literal> y un <literal>Event</literal> en el ejemplo unidireccional? Hemos agregado una instancia de <literal>Event</literal> a la colecci&#x00f3;n de referencias de eventos de una instancia de <literal>Person</literal>. De modo que, obviamente, si queremos que este enlace funcione bidireccionalmente, tenemos que hacer lo mismo del otro lado, agregando una referencia a <literal>Person</literal> a la colecci&#x00f3;n en un <literal>Event</literal>. Este "establecer el enlace a ambos lados" es absolutamente necesario y nunca debes olvidar hacerlo.
pt_br: Primeiro tenha em mente que o Hibernate não afeta a semântica normal do Java. Como nós criamos um link entre uma <literal>Person</literal> e um <literal>Event</literal> no exemplo unidirecional? Nós adicionamos uma instância de <literal>Event</literal>, da coleção de referências de eventos, a uma instância de <literal>Person</literal>. Então, obviamente, se nós queremos que este link funcione bidirecionalmente, nós devemos fazer a mesma coisa para o outro lado – adicionando uma referência de <literal>Person</literal> na coleção de um <literal>Event</literal>. Esse acerto de link de ambos os lados é absolutamente necessário e você nunca deve esquecer de faze-lo.
zh_cn: 首先请记住，Hibernate并不影响通常的Java语义。 在单向关联的例子中，我们是怎样在<literal>Person</literal>和<literal>Event</literal>之间创建联系的？我们把<literal>Event</literal>实例添加到<literal>Person</literal>实例内的event引用集合里。因此很显然，如果我们要让这个关联可以双向地工作，我们需要在另外一端做同样的事情 － 把<literal>Person</literal>实例加入<literal>Event</literal>类内的Person引用集合。这“在关联的两端设置联系”是完全必要的而且你都得这么做。

source: Many developers program defensive and create link management methods to correctly set both sides, e.g. in <literal>Person</literal>:
es_es: Muchos desarrolladores programan a la defensiva y crean m&#x00e9;todos de manejo de un enlace para establecer correctamente ambos lados, por ejemplo en <literal>Person</literal>:
pt_br: Muitos desenvolvedores programam de maneira defensiva e criam métodos gerenciador de associações que ajusta corretamente ambos os lados:
zh_cn: 许多开发人员防御式地编程，创建管理关联的方法来保证正确的设置了关联的两端，比如在<literal>Person</literal>里：

source: Notice that the get and set methods for the collection are now protected - this allows classes in the same package and subclasses to still access the methods, but prevents everybody else from messing with the collections directly (well, almost). You should probably do the same with the collection on the other side.
es_es: Nota que los m&#x00e9;todos get y set para esta colecci&#x00f3;n son ahora protegidos. Esto le permite a clases en el mismo paquete y a subclases acceder a&#x00fa;n a los m&#x00e9;todos, pero previene a cualquier otro de ensuciarse con la colecci&#x00f3;n directamente (bueno, casi). Probablemente debas hacer lo mismo con la colecci&#x00f3;n al otro lado.
pt_br: Observe que os métodos set e get da a coleção estão protegidos – isso permite que classes e subclasses do mesmo pacote continuem acessando os métodos, mas previne que qualquer outra classe, que não esteja no mesmo pacote, acesse a coleção diretamente. Você provavelmente deve fazer a mesma coisa para a coleção do outro lado.
zh_cn: 注意现在对于集合的get和set方法的访问级别是protected - 这允许在位于同一个包（package）中的类以及继承自这个类的子类可以访问这些方法，但禁止其他任何人的直接访问，避免了集合内容的混乱。你应尽可能地在另一端也把集合的访问级别设成protected。

source: What about the <literal>inverse</literal> mapping attribute? For you, and for Java, a bi-directional link is simply a matter of setting the references on both sides correctly. Hibernate however doesn't have enough information to correctly arrange SQL <literal>INSERT</literal> and <literal>UPDATE</literal> statements (to avoid constraint violations), and needs some help to handle bi-directional associations properly. Making one side of the association <literal>inverse</literal> tells Hibernate to basically ignore it, to consider it a <emphasis>mirror</emphasis> of the other side. That's all that is necessary for Hibernate to work out all of the issues when transformation a directional navigation model to a SQL database schema. The rules you have to remember are straightforward: All bi-directional associations need one side as <literal>inverse</literal>. In a one-to-many association it has to be the many-side, in many-to-many association you can pick either side, there is no difference.
es_es: Y ٯqu&#x00e9; del atributo de mapeo <literal>inverse</literal>? Para ti, y para Java, un enlace bidireccional es simplemente cuesti&#x00f3;n de establecer correctamente las referencias a ambos lados. Hibernate, sin embargo, no tiene suficiente informaci&#x00f3;n para arreglar correctamente sentencias <literal>INSERT</literal> y <literal>UPDATE</literal> de SQL (para evitar violaci&#x00f3;n de restricciones), y necesita alguna ayuda para manejar asociaciones bidireccionales apropiadamente. El hacer un lado de la asociaci&#x00f3;n <literal>inverse</literal> le dice a Hibernate que basicamente lo ignore, que lo considere un <emphasis>espejo</emphasis> del otro lado. Esto es todo lo necesario para que Hibernate resuelva todas las incidencias al transformar un modelo de navegaci&#x00f3;n direccional a un esquema SQL de base de datos. Las reglas que tienes que recordar son directas: Todas las asociaciones bidireccionales necesitan uno de los lados como <literal>inverse</literal>. En una asociaci&#x00f3;n uno-a-muchos debe ser el lado-de-muchos. En una asociaci&#x00f3;n muchos-a-muchos, puedes tomar cualquier lado, no hay diferencia.
pt_br: E sobre o mapeamento do atributo <literal>inverse</literal>? Pra você, e para o Java, um link bidirecional é simplesmente o fato de ajustar corretamente as referências de ambos os lados. O Hibernate, entretanto não possui informação necessária para corretamente adaptar os estados <literal>INSERT</literal> e <literal>UPDATE</literal> do SQL, e precisa de ajuda para manipular as propriedades das associações bidirecionais. Fazer um lado da associação com o atributo <literal>inverse</literal> instrui o Hibernate para basicamente ignora-lo, considerando-o uma <emphasis>cópia</emphasis> do outro lado. Isso é todo o necessário para o Hibernate trabalhar com todas as possibilidades quando transformando um modelo de navegação bidirecional em esquema de banco de dados do SQL. As regras que você possui para lembrar são diretas: Todas associações bidirecionais necessitam que um lado possua o atributo inverse. Em uma associação de um-para-muitos, o lado de "muitos" deve conter o atributo <literal>inverse</literal>, já em uma associação de muitos-para-muitos você pode pegar qualquer lado, não há diferença.
zh_cn: <literal>inverse</literal>映射属性究竟表示什么呢？对于你和Java来说，一个双向关联仅仅是在两端简单地正确设置引用。然而，Hibernate并没有足够的信息去正确地执行<literal>INSERT</literal>和<literal>UPDATE</literal>语句（以避免违反数据库约束），所以它需要一些帮助来正确的处理双向关联。把关联的一端设置为<literal>inverse</literal>将告诉Hibernate忽略关联的这一端，把这端看成是另外一端的一个<emphasis>镜象（mirror）</emphasis>。这就是所需的全部信息，Hibernate利用这些信息来处理把一个有向导航模型转移到数据库schema时的所有问题。你只需要记住这个直观的规则：所有的双向关联需要有一端被设置为<literal>inverse</literal>。在一对多关联中它必须是代表多（many）的那端。而在多对多（many-to-many）关联中，你可以任意选取一端，因为两端之间并没有差别。
