Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: es_es, pt_br, zh_cn

source: Introduction to Hibernate
es_es: Introducci&#x00f3;n a Hibernate
pt_br: Introdução ao Hibernate
zh_cn: Hibernate入门

source: Preface
es_es: Prefacio
pt_br: Prefácio
zh_cn: 前言

source: This chapter is an introductory tutorial for new users of Hibernate. We start with a simple command line application using an in-memory database and develop it in easy to understand steps.
es_es: Este cap&#x00ed;tulo es un tutorial introductorio de Hibernate. Comenzamos con una aplicaci&#x00f3;n simple de l&#x00ed;nea de comandos usando un base de datos en-memoria y desarroll&#x00e1;ndola en f&#x00e1;cil para entender los pasos.
pt_br: Este capítulo é um tutorial introdutório para novos usuários do Hibernate. Nós iniciaremos com uma simples linha de comando em uma aplicação usando uma base de dados em memória tornando isto um passo de fácil de compreender.
zh_cn: 本章是面向Hibernate初学者的一个入门教程。我们从一个使用驻留内存式(in-memory)数据库的简单命令行应用程序开始, 用易于理解的方式逐步开发。

source: This tutorial is intended for new users of Hibernate but requires Java and SQL knowledge. It is based on a tutorial by Michael Gloegl, the third-party libraries we name are for JDK 1.4 and 5.0. You might need others for JDK 1.3.
es_es: Este tutorial est&#x00e1; concebido para usuarios nuevos de Hibernate pero requiere conocimiento en Java y SQL. Est&#x00e1; basado en un tutorial de Michael Gloegl. Las bibliotecas de terceros que mencionamos son para JDK 1.4 y 5.0. Podr&#x00ed;as necesitar otras para JDK 1.3.
pt_br: Este tutorial é voltado para novos usuários do Hibernate, mas requer um conhecimento de Java e SQL. Este tutorial é baseado no tutorial de Michael Gloegl, as bibliotecas Third Party foram nomeadas para JDK 1.4 e 5.0. Você pode precisar de outras bibliotecas para JDK 1.3.
zh_cn: 本章面向Hibernate初学者，但需要Java和SQL知识。它是在Michael Goegl所写的指南的基础上完成的。在这里，我们称第三方库文件是指JDK 1.4和5.0。若使用JDK1.3，你可能需要其它的库文件。

source: The source code for the tutorial is included in the distribution in the <literal>doc/reference/tutorial/</literal> directory.
es_es: UNTRANSLATED!!! The source code for the tutorial is included in the distribution in the <literal>doc/reference/tutorial/</literal> directory.
pt_br: O código fonte para o tutorial está incluído no diretório da distribuição <literal>doc/reference/tutorial/</literal>.
zh_cn: 本章的源代码已包含在发布包中，位于<literal>doc/reference/tutorial/</literal>目录下。

source: Part 1 - The first Hibernate Application
es_es: Parte 1 - La primera Aplicaci&#x00f3;n Hibernate
pt_br: Parte 1 – A primeira aplicação Hibernate
zh_cn: 第一部分 － 第一个Hibernate应用程序

source: First, we'll create a simple console-based Hibernate application. We use an Java database (HSQL DB), so we do not have to install any database server.
es_es: Primero, crearemos una aplicaci&#x00f3;n simple de Hibenate basada en consola. Usamos usamos una base de datos en-memoria (HSQL DB), de modo que no necesitamos instalar ning&#x00fa;n servidor de base de datos.
pt_br: Primeiro, iremos criar uma simples aplicação Hibernate baseada em console. Usaremos uma base de dados Java (HSQL DB), então não teremos que instalar nenhum servidor de base de dados.
zh_cn: 首先我们将创建一个简单的基于控制台的(console-based)Hibernate应用程序。由于我们使用Java数据库(HSQL DB)，所以不必安装任何数据库服务器。

source: Let's assume we need a small database application that can store events we want to attend, and information about the hosts of these events.
es_es: Asumamos que necesitamos una aplicaci&#x00f3;n peque&#x00f1;a de base de datos que pueda almacenar eventos que queremos atender, e informaci&#x00f3;n acerca de los hostales de estos eventos.
pt_br: Vamos supor que precisemos de uma aplicação com um banco de dados pequeno que possa armazenar e atender os eventos que queremos, e as informaççes sobre os hosts destes eventos.
zh_cn: 假设我们希望有一个小应用程序可以保存我们希望参加的活动（events）和这些活动主办方的相关信息。 （译者注：在本教程的后面部分，我们将直接使用event而不是它的中文翻译“活动”，以免混淆。）

source: The first thing we do, is set up our development directory and put all the Java libraries we need into it. Download the Hibernate distribution from the Hibernate website. Extract the package and place all required libraries found in <literal>/lib</literal> into into the <literal>/lib</literal> directory of your new development working directory. It should look like this:
es_es: La primera cosa que hacemos, es armar nuestro directorio de desarrollo y poner en &#x00e9;l todas las bibliotecas Java que necesitamos. Descarga la distribuci&#x00f3;n de Hibernate del sitio web de Hibernate. Extrae el paquete y coloca todas las bibliotecas requeridas encontradas en <literal>/lib</literal> dentro del directorio <literal>/lib</literal> de nuestro nuevo directorio de desarrollo de trabajo. Debe asemejarse a esto:
pt_br: A primeira coisa que devemos fazer é configurar nosso diretório de desenvolvimento, e colocar todas as bibliotecas Java que precisamos dentro dele. Faça o download da distribuição do Hibernate no site do Hibernate. Descompacte o pacote e coloque todas as bibliotecas necessárias encontradas no diretório <literal>/lib</literal>, dentro do diretório <literal>/lib</literal> do seu novo projeto. Você deverá ter algo parecido com isso:
zh_cn: 我们所做的第一件事就是创建我们的开发目录，并且把所有需要用到的Java库文件放进去。解压缩从Hibernate网站下载的Hibernate发布包，并把<literal>/lib</literal>目录下所有需要的库文件拷到我们新建开发目录下的<literal>/lib</literal>目录下。看起来就像这样：

source: <![CDATA[. +lib antlr.jar cglib.jar asm.jar asm-attrs.jars commons-collections.jar commons-logging.jar hibernate3.jar jta.jar dom4j.jar log4j.jar ]]>
es_es: <![CDATA[. +lib antlr.jar cglib-full.jar asm.jar asm-attrs.jars commons-collections.jar commons-logging.jar ehcache.jar hibernate3.jar jta.jar dom4j.jar log4j.jar ]]>

source: This is the minimum set of required libraries (note that we also copied hibernate3.jar, the main archive) for Hibernate <emphasis>at the time of writing</emphasis>. The Hibernate release you are using might require more or less libraries. See the <literal>README.txt</literal> file in the <literal>lib/</literal> directory of the Hibernate distribution for more information about required and optional third-party libraries. (Actually, Log4j is not required but preferred by many developers.)
es_es: Este es el conjunto m&#x00ed;nimo de bibliotecas requeridas para Hibernate (observa que tambi&#x00e9;n hemos copiado hibernate3.jar, el fichero principal). Ver el fichero <literal>README.txt</literal> en el directorio <literal>lib/</literal> de la distribuci&#x00f3;n de Hibernate para m&#x00e1;s informaci&#x00f3;n sobre bibliotecas de terceros requeridas y opcionales. (Realmente, Log4J no es requerida aunque preferida por muchos desarrolladores).
pt_br: Esta é a configuração mínima requerida das bibliotecas (observe que também foi copiado o hibernate3.jar da pasta principal do Hibernate) para o Hibernate <emphasis>na hora do desenvolvimento</emphasis>. O Hibernate permite que você utilize mais ou menos bibliotecas. Veja o arquivo <literal>README.txt</literal> no diretório <literal>lib/</literal> da distribuição do Hibernate para maiores informaççes sobre bibliotecas requeridas e opcionais. (Atualmente, a biblioteca Log4j não é requerida, mas é preferida por muitos desenvolvedores.)
zh_cn: <emphasis>到编写本文时为止</emphasis>，这些是Hibernate运行所需要的最小库文件集合（注意我们也拷贝了 Hibernate3.jar，这个是最主要的文件）。你正使用的Hibernate版本可能需要比这更多或少一些的库文件。请参见发布包中的<literal>lib/</literal>目录下的<literal>README.txt</literal>，以获取更多关于所需和可选的第三方库文件信息（事实上，Log4j并不是必须的库文件，但被许多开发者所喜欢）。

source: Next we create a class that represents the event we want to store in database.
es_es: Por siguiente, creamos una clase que represente el evento que queremos almacenar en base de datos.
pt_br: Agora, iremos criar uma classe que representa o evento que queremos armazenar na base de dados..
zh_cn: 接下来我们创建一个类，用来代表那些我们希望储存在数据库里的event。

source: The first class
es_es: La primera clase
pt_br: A primeira Classe
zh_cn: 第一个class

source: Our first persistent class is a simple JavaBean class with some properties:
es_es: Nuestra primera clase persistente es un JavaBean simple con algunas propiedades:
pt_br: Nossa primeira classe de persistência é uma simples classe JavaBean com algumas propriedades:
zh_cn: 我们的第一个持久化类是一个带有一些属性（property）的简单JavaBean类：

source: <![CDATA[package events; import java.util.Date; public class Event { private Long id; private String title; private Date date; public Event() {} public Long getId() { return id; } private void setId(Long id) { this.id = id; } public Date getDate() { return date; } public void setDate(Date date) { this.date = date; } public String getTitle() { return title; } public void setTitle(String title) { this.title = title; } }]]>
es_es: <![CDATA[import java.util.Date; public class Event { private Long id; private String title; private Date date; Event() {} public Long getId() { return id; } private void setId(Long id) { this.id = id; } public Date getDate() { return date; } public void setDate(Date date) { this.date = date; } public String getTitle() { return title; } public void setTitle(String title) { this.title = title; } }]]>

source: You can see that this class uses standard JavaBean naming conventions for property getter and setter methods, as well as private visibility for the fields. This is a recommended design - but not required. Hibernate can also access fields directly, the benefit of accessor methods is robustness for refactoring. The no-argument constructor is required to instantiate an object of this class through reflection.
es_es: Puedes ver que esta clase usa las convenciones de nombrado est&#x00e1;ndar de JavaBean para m&#x00e9;todos getter y setter de propiedad, as&#x00ed; como visibilidad privada para los campos. Esto es un dise&#x00f1;o recomendado, aunque no requerido. Hibernate tambi&#x00e9;n puede acceder a los campos directamente; el beneficio de los m&#x00e9;todos de acceso es la robustez para la refactorizaci&#x00f3;n.
pt_br: Você pode ver que esta classe usa o padrão JavaBean para o nomeamento convencional da propriedade getter e dos métodos setter, como também a visibilidade private dos campos. Este é um padrão de projeto recomendado, mas não requerido. O Hibernate pode também acessar campos diretamente, o benefício para os métodos de acesso é a robustez para o Refactoring. O construtor sem argumento é requerido para instanciar um objeto desta classe com a reflexão.
zh_cn: 你可以看到这个类对属性的存取方法（getter and setter method）使用了标准JavaBean命名约定，同时把类属性（field）的访问级别设成私有的（private）。这是推荐的设计，但并不是必须的。Hibernate也可以直接访问这些field，而使用访问方法（accessor method）的好处是提供了重构时的健壮性（robustness）。为了通过反射机制（Reflection）来实例化这个类的对象，我们需要提供一个无参的构造器（no-argument constructor)。

source: The <literal>id</literal> property holds a unique identifier value for a particular event. All persistent entity classes (there are less important dependent classes as well) will need such an identifier property if we want to use the full feature set of Hibernate. In fact, most applications (esp. web applications) need to distinguish objects by identifier, so you should consider this a feature rather than a limitation. However, we usually don't manipulate the identity of an object, hence the setter method should be private. Only Hibernate will assign identifiers when an object is saved. You can see that Hibernate can access public, private, and protected accessor methods, as well as (public, private, protected) fields directly. The choice is up to you and you can match it to fit your application design.
es_es: La propiedad <literal>id</literal> tiene un valor &#x00fa;nico de identificador para un evento en particular. Todas las clase de entidad persistentes ( tambi&#x00e9;n hay clases dependientes menos importantes) necesitar&#x00e1;n una propiedad identificadora similar si queremos usar el conjunto completo de funcionalidades de Hibernate. De hecho, la mayor&#x00ed;a de las aplicaciones (esp. aplicaciones web) necesitan distinguir objetos por identificador, de modo que debes considerar esto como un aspecto en vez de una limitaci&#x00f3;n. Sin embargo, usualmente no manipulamos la identidad de un objeto, por lo tanto el m&#x00e9;todo setter debe ser privado. S&#x00f3;lo Hibernate asignar&#x00e1; identificadores cuando un objeto sea salvado. Puedes ver que Hibernate puede acceder a m&#x00e9;todos de acceso p&#x00fa;blicos, privados y protegidos, tanto como directamente a campos (p&#x00fa;blicos, privados y protegidos). La elecci&#x00f3;n est&#x00e1; en ti, y puedes ajustarla a tu dise&#x00f1;o de aplicaci&#x00f3;n.
pt_br: A propriedade <literal>id</literal> mantém um único valor de identificação para um evento particular. Todas as classes persistentes da entidade (bem como aquelas classes dependentes de menos importância) precisam de uma propriedade de identificação, caso nós queiramos usar o conjunto completo de características do Hibernate. De fato, a maioria das aplicações (esp. aplicações web) precisam destinguir os objetos pelo identificador, então você deverá considerar esta, uma característica em lugar de uma limitação. Porém, nós normalmente não manipulamos a identidade de um objeto, consequentemente o método setter deverá ser privado. O Hibernate somente nomeará os identificadores quando um objeto for salvo. Você pode ver como o Hibernate pode acessar métodos públicos, privados, e protegidos, como também campos (públicos, privados, protegidos) diretamente. A escolha está até você, e você pode combinar isso para adaptar seu projeto de aplicação
zh_cn: 对一特定的event, <literal>id</literal> 属性持有唯一的标识符（identifier）的值。如果我们希望使用Hibernate提供的所有特性，那么所有的持久化实体（persistent entity）类（这里也包括一些次要依赖类）都需要一个这样的标识符属性。而事实上，大多数应用程序（特别是web应用程序）都需要通过标识符来区别对象，所以你应该考虑使用标识符属性而不是把它当作一种限制。然而，我们通常不会操作对象的标识（identity），因此它的setter方法的访问级别应该声明private。这样当对象被保存的时候，只有Hibernate可以为它分配标识符值。你可看到Hibernate可以直接访问public，private和protected的访问方法和field。所以选择哪种方式完全取决于你，你可以使你的选择与你的应用程序设计相吻合。

source: The no-argument constructor is a requirement for all persistent classes; Hibernate has to create objects for you, using Java Reflection. The constructor can be private, however, package visibility is required for runtime proxy generation and efficient data retrieval without bytecode instrumentation.
es_es: El constructor sin argumentos es un requerimiento para todas las clases persistentes. Hibernate tiene que crear objetos para ti, usando reflecci&#x00f3;n Java. El constructor puede ser privado, sin embargo, la visibilidad de paquete es requerida para la generaci&#x00f3;n de proxies en tiempo de ejecuci&#x00f3;n y la recuperaci&#x00f3;n de datos sin instrumentaci&#x00f3;n del bytecode.
pt_br: O construtor sem argumentos é um requerimento para todas as classes persistentes; O Hibernate tem que criar para você os objetos usando Java Reflection. O construtor pode ser privado, porém, a visibilidade do pacote é requerida para a procuração da geração em tempo de execução e recuperação eficiente dos dados sem a instrumentação de bytecode
zh_cn: 所有的持久化类（persistent classes）都要求有无参的构造器，因为Hibernate必须使用Java反射机制来为你创建对象。构造器（constructor）的访问级别可以是private，然而当生成运行时代理（runtime proxy）的时候则要求使用至少是package 级别的访问控制，这样在没有字节码指令（bytecode instrumentation）的情况下，从持久化类里获取数据会更有效率。

source: Place this Java source file in a directory called <literal>src</literal> in the development folder, and in its correct package. The directory should now look like this:
es_es: Coloca este fichero de c&#x00f3;digo Java en un directorio llamado <literal>src</literal> en la carpeta de desarrollo. El directorio ahora debe verse como esto:
pt_br: Coloque este fonte Java no diretório chamado <literal>src</literal> na pasta de desenvolvimento, e em seu pacote correto. O diretório deverá ser parecido como este:
zh_cn: 把这个Java源代码文件放到开发目录下的<literal>src</literal>目录里，注意包位置要正确。 现在这个目录看起来应该像这样：

source: <![CDATA[. +lib <Hibernate and third-party libraries> +src +events Event.java]]>
es_es: <![CDATA[. +lib <Hibernate and third-party libraries> +src Event.java]]>

source: In the next step, we tell Hibernate about this persistent class.
es_es: En el pr&#x00f3;ximo paso, le decimos a Hibernate sobre esta clase persistente.
pt_br: No próximo passo, iremos falar sobre as classes de persistência do Hibernate..
zh_cn: 下一步，我们把这个持久化类的信息告诉Hibernate。

source: The mapping file
es_es: El fichero de mapeo
pt_br: O mapeamento do arquivo
zh_cn: 映射文件

source: Hibernate needs to know how to load and store objects of the persistent class. This is where the Hibernate mapping file comes into play. The mapping file tells Hibernate what table in the database it has to access, and what columns in that table it should use.
es_es: Hibernate necesita saber c&#x00f3;mo cargar y almacenar objetos de la clase persistente. Aqu&#x00ed; es donde el fichero de mapeo de Hibernate entra en juego. El fichero de mapeo le dice a Hibernate a qu&#x00e9; tabla en la base de datos tiene que acceder, y qu&#x00e9; columnas en esta tabla debe usar.
pt_br: O Hibernate precisa saber como carregar e armazenar objetos da classe de persistência. Isto será onde o mapeamento do arquivo do Hibernate entrará em jogo. O arquivo mapeado informa ao Hibernate, qual tabela no banco de dados ele deverá acessar, e quais as colunas na tabela ele deverá usar.
zh_cn: Hibernate需要知道怎样去加载（load）和存储（store）持久化类的对象。这正是Hibernate映射文件发挥作用的地方。映射文件告诉Hibernate它，应该访问数据库(database)里面的哪个表（table）及应该使用表里面的哪些字段（column）。

source: The basic structure of a mapping file looks like this:
es_es: La estructura b&#x00e1;sica de un fichero de mapeo se parece a esto:
pt_br: A estrutura básica de um arquivo de mapeamento é parecida com:
zh_cn: 一个映射文件的基本结构看起来像这样：

source: Note that the Hibernate DTD is very sophisticated. You can use it for auto-completion of XML mapping elements and attributes in your editor or IDE. You also should open up the DTD file in your text editor - it's the easiest way to get an overview of all elements and attributes and to see the defaults, as well as some comments. Note that Hibernate will not load the DTD file from the web, but first look it up from the classpath of the application. The DTD file is included in <literal>hibernate3.jar</literal> as well as in the <literal>src/</literal> directory of the Hibernate distribution.
es_es: Observa que el DTD de Hibernate es muy sofisticado. Puedes usarlo para autocompleci&#x00f3;n de los elementos y atributos XML de mapeo en tu editor o IDE. Debes tambi&#x00e9;n abrir el fichero DTD en tu editor de texto. Es la forma m&#x00e1;s f&#x00e1;cil para tener un panorama de todos los elementos y atributos y ver los valores por defectos, as&#x00ed; como algunos comentarios. Nota que Hibernate no cargar&#x00e1; el fichero DTD de la web, sino que primero buscar&#x00e1; en el classpath de la aplicaci&#x00f3;n. El fichero DTD est&#x00e1; inclu&#x00ed;do en <literal>hibernate3.jar</literal> as&#x00ed; como tambi&#x00e9;n en el directorio <literal>src/</literal> de la distribuci&#x00f3;n de Hibernate.
pt_br: Note que o Hibernate DTD é muito sofisticado. Você pode usar isso para auto-conclusão no mapeamento XML dos elementos e atributos no seu editor ou IDE. Você também pode abrir o arquivo DTD no seu editor – é a maneira mais fácil de ter uma visão geral de todos os elementos e atributos e dos padrões, como também alguns comentários. Note que o Hibernate não irá carregar o arquivo DTD da web, e sim do diretório da aplicação (classpath). O arquivo DTD está incluído no <literal>hibernate3.jar</literal> como também no diretório <literal>src/</literal> da distribuição do Hibernate.
zh_cn: 注意Hibernate的DTD是非常复杂的。你的编辑器或者IDE里使用它来自动完成那些用来映射的XML元素（element）和属性（attribute）。你也可以在文本编辑器里打开DTD－这是最简单的方式来概览所有的元素和attribute，并查看它们的缺省值以及注释。注意Hibernate不会从web加载DTD文件，但它会首先在应用程序的classpath中查找。DTD文件已包括在<literal>hibernate3.jar</literal>里，同时也在Hibernate发布包的<literal>src/</literal>目录下。

source: We will omit the DTD declaration in future examples to shorten the code. It is of course not optional.
es_es: Omitiremos la declaraci&#x00f3;n de DTD en futuros ejemplos para acortar el c&#x00f3;digo. Por supuesto, no es opcional.
pt_br: Nós omitiremos a declaração do DTD nos exemplos futuros para encurtar o código. Isto, é claro, não é opcional.
zh_cn: 为缩短代码长度，在以后的例子里我们会省略DTD的声明。当然，在实际的应用程序中，DTD声明是必须的。

source: Between the two <literal>hibernate-mapping</literal> tags, include a <literal>class</literal> element. All persistent entity classes (again, there might be dependent classes later on, which are not first-class entities) need such a mapping, to a table in the SQL database:
es_es: Entre las dos etiquetas <literal>hibernate-mapping</literal>, incluye un elemento <literal>class</literal>. Todas las clases de entidad persistentes (de nuevo, podr&#x00ed;a haber m&#x00e1;s adelante clases dependientes, que no sean entidades de-primera-clase) necesitan dicho mapeo a una tabla en la base de datos SQL:
pt_br: Entre os dois tags <literal>hibernate-mapping</literal>, inclua um elemento <literal>class</literal>. Todas as classes persistentes da entidade (novamente, poderá haver mais tarde, dependências sobre as classes que não são classes-primárias de entidades) necessitam do tal mapeamento, para uma tabela na base de dados SQL
zh_cn: 在<literal>hibernate-mapping</literal>标签（tag）之间, 含有一个<literal>class</literal>元素。所有的持久化实体类（再次声明，或许接下来会有依赖类，就是那些次要的实体）都需要一个这样的映射，来把类对象映射到SQL数据库里的表。

source: <![CDATA[<hibernate-mapping> <class name="events.Event" table="EVENTS"> </class> </hibernate-mapping>]]>
es_es: <![CDATA[<hibernate-mapping> <class name="Event" table="EVENTS"> </class> </hibernate-mapping>]]>

source: So far we told Hibernate how to persist and load object of class <literal>Event</literal> to the table <literal>EVENTS</literal>, each instance represented by a row in that table. Now we continue with a mapping of the unique identifier property to the tables primary key. In addition, as we don't want to care about handling this identifier, we configure Hibernate's identifier generation strategy for a surrogate primary key column:
es_es: Hasta ahora dijimos a Hibernate c&#x00f3;mo persistir y cargar el objeto de clase <literal>Event</literal> a la tabla <literal>EVENTS</literal>, cada instancia representada por una fila en esta tabla. Ahora continuamos con un mapeo de la propiedad de identificado &#x00fa;nico a la clave primaria de la tabla. Adem&#x00e1;s, como no queremos cuidar del manejo de este identificador, configuramos la estrategia de generaci&#x00f3;n de identificadores para una columna clave primaria delegada:
pt_br: Mais adiante iremos dizer ao Hibernate como fazer para persistir e carregar objetos da classe <literal>Event</literal> da tabela <literal>EVENTS</literal>, cada instancia representada por uma coluna na tabela. Agora, continuaremos com o mapeamento de uma única propriedade identificadora para as chaves primárias da tabela. Além disso, nós não iremos se importar com esta propriedade identificadora, nós iremos configurar uma estratégia de geração de id’s para uma chave primária de uma surrogate key:
zh_cn: 到目前为止，我们告诉了Hibernate怎样把<literal>Events</literal>类的对象持久化到数据库的<literal>EVENTS</literal>表里，以及怎样从<literal>EVENTS</literal>表加载到<literal>Events</literal>类的对象。每个实例对应着数据库表中的一行。现在我们将继续讨论有关唯一标识符属性到数据库表的映射。另外，由于我们不关心怎样处理这个标识符，我们就配置由Hibernate的标识符生成策略来产生代理主键字段。

source: <![CDATA[<hibernate-mapping> <class name="events.Event" table="EVENTS"> <id name="id" column="EVENT_ID"> <generator class="native"/> </id> </class> </hibernate-mapping>]]>
es_es: <![CDATA[<hibernate-mapping> <class name="Event" table="EVENTS"> <id name="id" column="EVENT_ID"> <generator class="increment"/> </id> </class> </hibernate-mapping>]]>
