Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: es_es, pt_br, zh_cn

source: The first four <literal>property</literal> elements contain the necessary configuration for the JDBC connection. The dialect <literal>property</literal> element specifies the particular SQL variant Hibernate generates. Hibernate's automatic session management for persistence contexts will come in handy as you will soon see. The <literal>hbm2ddl.auto</literal> option turns on automatic generation of database schemas - directly into the database. This can of course also be turned off (by removing the config option) or redirected to a file with the help of the <literal>SchemaExport</literal> Ant task. Finally, we add the mapping file(s) for persistent classes to the configuration.
es_es: Los primeros cuatro elementos <literal>property</literal> contienen la configuraci&#x00f3;n necesaria para la conexi&#x00f3;n JDBC. El elemento de dialecto <literal>property</literal> especifica la variante de SQL en particular que genera Hibernate. La opci&#x00f3;n <literal>hbm2ddl.auto</literal> activa la generaci&#x00f3;n autom&#x00e1;tica de esquemas de base de datos, directamente en la base de datos. Esto, por supuesto, puede desactivarse (quitando la opci&#x00f3;n config) o redirigido a un fichero con la ayuda de la tarea de Ant <literal>SchemaExport</literal>. Finalmente, agregamos el(los) fichero(s) de mapeo para clases persistentes.
pt_br: As primeiras quatro <literal>propriedades</literal> do elemento contém a configuração necessária para a conexão ao JDBC. A propriedade <literal>propriedade</literal> dialect do elemento especifica a variante particular do SQL que o Hibernate gera. O gerenciamento automático de sessão do Hibernate para contextos de persistência estará disponível em breve. A opção <literal>hbm2ddl.auto</literal> habilita a geração automática de schemas da base de dados – diretamente na base de dados. Isto também pode ser naturalmente desligado (removendo a opção de configuração) ou redirecionando para um arquivo com ajuda do <literal>SchemaExport</literal> nas tarefas do Ant. Finalmente, iremos adicionar os arquivos das classes de persistência mapeadas na configuração.
zh_cn: 最开始的4个<literal>property</literal>元素包含必要的JDBC连接信息。方言（dialect）的<literal>property</literal>元素指明Hibernate 生成的特定SQL变量。你很快会看到，Hibernate对持久化上下文的自动session管理就会派上用场。 打开<literal>hbm2ddl.auto</literal>选项将自动生成数据库模式（schema）－ 直接加入数据库中。当然这个选项也可以被关闭（通过去除这个配置选项）或者通过Ant任务<literal>SchemaExport</literal>的帮助来把数据库schema重定向到文件中。最后，在配置中为持久化类加入映射文件。

source: Copy this file into the source directory, so it will end up in the root of the classpath. Hibernate automatically looks for a file called <literal>hibernate.cfg.xml</literal> in the root of the classpath, on startup.
es_es: Copia este fichero dentro del directorio de c&#x00f3;digo fuente, de modo que termine ubicado en la rai&#x00ed;z del classpath. Hibernate busca autom&#x00e1;ticamente un fichero llamado <literal>hibernate.cfg.xml</literal> en la ra&#x00ed;z del classpath al arrancar.
pt_br: Copie este arquivo no diretório fonte, assim isto irá terminar na raiz (root) do classpath. O Hibernate automaticamente procura por um arquivo chamado <literal>hibernate.cfg.xml</literal> na raiz do classpath, no startup.
zh_cn: 把这个文件拷贝到源代码目录下面，这样它就位于classpath的根目录的最后。Hibernate在启动时会自动在classpath的根目录查找名为<literal>hibernate.cfg.xml</literal>的配置文件。

source: Building with Ant
es_es: Construyendo con Ant
pt_br: Construindo com o Ant
zh_cn: 用Ant构建

source: We'll now build the tutorial with Ant. You will need to have Ant installed - get it from the <ulink url="http://ant.apache.org/bindownload.cgi">Ant download page</ulink>. How to install Ant will not be covered here. Please refer to the <ulink url="http://ant.apache.org/manual/index.html">Ant manual</ulink>. After you have installed Ant, we can start to create the buildfile. It will be called <literal>build.xml</literal> and placed directly in the development directory.
es_es: Construiremos ahora el tutorial con Ant. Necesitar&#x00e1;s tener Ant instalado. Obt&#x00e9;nlo de <ulink url="http://ant.apache.org/bindownload.cgi">P&#x00e1;gina de descarga de Ant</ulink>. No se cubrir&#x00e1; aqu&#x00ed; c&#x00f3;mo instalar Ant. Por favor refi&#x00e9;rete al <ulink url="http://ant.apache.org/manual/index.html"> Manual de Ant</ulink>. Despu&#x00e9;s que hayas instalado Ant, podemos comenzar a crear el buildfile. Ser&#x00e1; llamado <literal>build.xml</literal> y colocado directamente en el directorio de desarrollo.
pt_br: Nos iremos, agora, construir o tutorial com Ant. Você ira precisar o Ant instalado – se encontra disponível <ulink url="http://ant.apache.org/bindownload.cgi">na página de download do Ant</ulink>. Como instalar o Ant, não será abordado aqui. Caso tenha alguma dúvida, por favor, vá ao <ulink url="http://ant.apache.org/manual/index.html">Ant manual</ulink>. Depois que tiver instalado o Ant, podemos começar a criar o arquivo de construção <literal>build.xml</literal>. Este arquivo será chamado de <literal>build.xml</literal> e posto diretamente no diretório de desenvolvimento.
zh_cn: 现在我们用Ant来构建应用程序。你必须先安装Ant－可以从<ulink url="http://ant.apache.org/bindownload.cgi">Ant 下载页面</ulink>得到它。怎样安装Ant就不在这里介绍了，请参考<ulink url="http://ant.apache.org/manual/index.html">Ant 用户手册</ulink>。当你安装完了Ant，就可以开始创建<literal>build.xml</literal>文件，把它直接放在开发目录下面。

source: A basic build file looks like this:
es_es: Reparar Ant
pt_br: Um arquivo básico de build, se parece com isto:
zh_cn: 一个简单的build文件看起来像这样：

source: <![CDATA[<project name="hibernate-tutorial" default="compile"> <property name="sourcedir" value="${basedir}/src"/> <property name="targetdir" value="${basedir}/bin"/> <property name="librarydir" value="${basedir}/lib"/> <path id="libraries"> <fileset dir="${librarydir}"> <include name="*.jar"/> </fileset> </path> <target name="clean"> <delete dir="${targetdir}"/> <mkdir dir="${targetdir}"/> </target> <target name="compile" depends="clean, copy-resources"> <javac srcdir="${sourcedir}" destdir="${targetdir}" classpathref="libraries"/> </target> <target name="copy-resources"> <copy todir="${targetdir}"> <fileset dir="${sourcedir}"> <exclude name="**/*.java"/> </fileset> </copy> </target> </project>]]>
es_es: Observa que la distribuci&#x00f3;n de Ant est&#x00e1; por defecto rota (como se describe en el FAQ de Ant) y tiene que ser reparado por ti, por ejemplo, si quisieras usar JUnit desde dentro de tu fichero de construcci&#x00f3;n. Para hacer que funcione la tarea de JUnit (no lo necesitaremos en este tutorial), copia junit.jar a <literal>ANT_HOME/lib</literal> o quita el trozo de plugin <literal>ANT_HOME/lib/ant-junit.jar</literal>.

source: This will tell Ant to add all files in the lib directory ending with <literal>.jar</literal> to the classpath used for compilation. It will also copy all non-Java source files to the target directory, e.g. configuration and Hibernate mapping files. If you now run Ant, you should get this output:
es_es: Un fichero de construcci&#x00f3;n b&#x00e1;sico se ve como esto:
pt_br: Isto irá avisar ao Ant para adicionar todos os arquivos no diretório lib terminando com <literal>.jar</literal>, para o classpath usado para compilação. Irá também copiar todos os arquivos não-java para o diretório alvo (arquivos de configuração, mapeamento). Se você rodar o ant agora, deverá ter esta saída.
zh_cn: 这将告诉Ant把所有在lib目录下以<literal>.jar</literal>结尾的文件拷贝到classpath中以供编译之用。它也把所有的非Java源代码文件，例如配置和Hibernate映射文件，拷贝到目标目录。如果你现在运行Ant，会得到以下输出：

source: <![CDATA[C:\hibernateTutorial\>ant Buildfile: build.xml copy-resources: [copy] Copying 2 files to C:\hibernateTutorial\bin compile: [javac] Compiling 1 source file to C:\hibernateTutorial\bin BUILD SUCCESSFUL Total time: 1 second ]]>
es_es: <![CDATA[<project name="hibernate-tutorial" default="compile"> <property name="sourcedir" value="${basedir}/src"/> <property name="targetdir" value="${basedir}/bin"/> <property name="librarydir" value="${basedir}/lib"/> <path id="libraries"> <fileset dir="${librarydir}"> <include name="*.jar"/> </fileset> </path> <target name="clean"> <delete dir="${targetdir}"/> <mkdir dir="${targetdir}"/> </target> <target name="compile" depends="clean, copy-resources"> <javac srcdir="${sourcedir}" destdir="${targetdir}" classpathref="libraries"/> </target> <target name="copy-resources"> <copy todir="${targetdir}"> <fileset dir="${sourcedir}"> <exclude name="**/*.java"/> </fileset> </copy> </target> </project>]]>

source: Startup and helpers
es_es: Esto dir&#x00e1; a Ant que agregue todos los ficheros en el directorio lib que terminen con <literal>.jar</literal> al classpath usado para la compilaci&#x00f3;n. Tambi&#x00e9;n copiar&#x00e1; todos los ficheros que no sean c&#x00f3;digo Java al directorio objetivo, por ejemplo, ficheros de configuraci&#x00f3;n y mapeos de Hibernate. Si ahora corres Ant, debes obtener esta salida:
zh_cn: 启动和辅助类

source: It's time to load and store some <literal>Event</literal> objects, but first we have to complete the setup with some infrastructure code. We have to startup Hibernate. This startup includes building a global <literal>SessionFactory</literal> object and to store it somewhere for easy access in application code. A <literal>SessionFactory</literal> can open up new <literal>Session</literal>'s. A <literal>Session</literal> represents a single-threaded unit of work, the <literal>SessionFactory</literal> is a thread-safe global object, instantiated once.
es_es: <![CDATA[C:\hibernateTutorial\>ant Buildfile: build.xml copy-resources: [copy] Copying 2 files to C:\hibernateTutorial\bin compile: [javac] Compiling 1 source file to C:\hibernateTutorial\bin BUILD SUCCESSFUL Total time: 1 second ]]>
pt_br: É hora de carregar e arquivar alguns objetos <literal>Event</literal>, mas primeiro nós temos de completar o setup com algum código de infraestrutura. Este startup inclui a construção de um objeto <literal>SessionFactory</literal> global e armazenar isto em algum lugar de fácil acesso para o código da aplicação. Uma <literal>SessionFactory</literal> pode abrir novas <literal>Session</literal>'s. Uma <literal>Session</literal> representa uma unidade single-theaded do trabalho, a <literal>SessionFactory</literal> é um objeto global thread-safe, instanciado uma vez.
zh_cn: 是时候来加载和储存一些<literal>Event</literal>对象了，但首先我们得编写一些基础的代码以完成设置。我们必须启动Hibernate，此过程包括创建一个全局的<literal>SessoinFactory</literal>，并把它储存在应用程序代码容易访问的地方。<literal>SessionFactory</literal>可以创建并打开新的<literal>Session</literal>。一个<literal>Session</literal>代表一个单线程的单元操作，<literal>SessionFactory</literal>则是个线程安全的全局对象，只需要被实例化一次。

source: We'll create a <literal>HibernateUtil</literal> helper class which takes care of startup and makes accessing a <literal>SessionFactory</literal> convenient. Let's have a look at the implementation:
es_es: Arranque y ayudantes
pt_br: Nos iremos criar uma classe de ajuda <literal>HibernateUtil</literal>, que toma conta do startup e faz acesso a uma <literal>SessionFactory</literal> conveniente. Vamos dar uma olhada na implementação:
zh_cn: 我们将创建一个<literal>HibernateUtil</literal>辅助类（helper class）来负责启动Hibernate和更方便地操作<literal>SessionFactory</literal>。让我们来看一下它的实现：

source: <![CDATA[package util; import org.hibernate.*; import org.hibernate.cfg.*; public class HibernateUtil { private static final SessionFactory sessionFactory; static { try { // Create the SessionFactory from hibernate.cfg.xml sessionFactory = new Configuration().configure().buildSessionFactory(); } catch (Throwable ex) { // Make sure you log the exception, as it might be swallowed System.err.println("Initial SessionFactory creation failed." + ex); throw new ExceptionInInitializerError(ex); } } public static SessionFactory getSessionFactory() { return sessionFactory; } }]]>
es_es: Es momento de cargar y almacenar algunos objetos <literal>Event</literal>, pero primero tenemos que completar la configuraci&#x00f3;n de alg&#x00fa;n c&#x00f3;digo de infraestructura. Tenemos que arrancar Hibernate. Este arranque incluye construir un objeto <literal>SessionFactory</literal> global y almacenarlo en alg&#x00fa;n sitio de f&#x00e1;cil acceso en el c&#x00f3;digo de aplicaci&#x00f3;n. Una <literal>SessionFactory</literal> puede abrir nuevas <literal>Session</literal>'s. Una <literal>Session</literal> representa un unidad de trabajo mono-hebra. La <literal>SessionFactory</literal> es un objeto global seguro entre hebras, instanciado una sola vez.

source: This class does not only produce the global <literal>SessionFactory</literal> in its static initializer (called once by the JVM when the class is loaded), but also hides the fact that it uses a static singleton. It might as well lookup the <literal>SessionFactory</literal> from JNDI in an application server.
es_es: Crearemos una clase de ayuda <literal>HibernateUtil</literal> que cuide del arranque y haga conveniente el manejo de <literal>Session</literal>. El as&#x00ed; llamado patr&#x00f3;n <emphasis>Sesi&#x00f3;n de Hebra Local (ThreadLocal Session)</emphasis> es &#x00fa;til aqu&#x00ed;; mantenemos la unidad de trabajo actual asociada a la hebra actual. Echemos una mirada a la implementaci&#x00f3;n:
pt_br: Esta classe não só produz a global <literal>SessionFactory</literal> no seu static initializer (chamado uma vez pela JVM quando a classe é carregada), mas também esconde o fato de que isto usa um static singleton. Ela pode muito bem, enxergar a <literal>SessionFactory</literal> do JNDI em um application server.
zh_cn: 这个类不但在它的静态初始化过程（仅当加载这个类的时候被JVM执行一次）中产生全局的<literal>SessionFactory</literal>，而且隐藏了它使用了静态singleton的事实。它也可能在应用程序服务器中的JNDI查找<literal>SessionFactory</literal>。

source: If you give the <literal>SessionFactory</literal> a name in your configuration file, Hibernate will in fact try to bind it to JNDI after it has been built. To avoid this code completely you could also use JMX deployment and let the JMX-capable container instantiate and bind a <literal>HibernateService</literal> to JNDI. These advanced options are discussed in the Hibernate reference documentation.
es_es: <![CDATA[import org.hibernate.*; import org.hibernate.cfg.*; public class HibernateUtil { public static final SessionFactory sessionFactory; static { try { // Create the SessionFactory from hibernate.cfg.xml sessionFactory = new Configuration().configure().buildSessionFactory(); } catch (Throwable ex) { // Make sure you log the exception, as it might be swallowed System.err.println("Initial SessionFactory creation failed." + ex); throw new ExceptionInInitializerError(ex); } } public static final ThreadLocal session = new ThreadLocal(); public static Session currentSession() throws HibernateException { Session s = (Session) session.get(); // Open a new Session, if this thread has none yet if (s == null) { s = sessionFactory.openSession(); // Store it in the ThreadLocal variable session.set(s); } return s; } public static void closeSession() throws HibernateException { Session s = (Session) session.get(); if (s != null) s.close(); session.set(null); } }]]>
pt_br: Se você der à <literal>SessionFactory</literal> um nome, no seu arquivo de configuração. O Hibernate irá, de fato, tentar uni-lo ao JNDI depois que estiver construído. Para evitar este completamente este código, você também poderia usar JMX deployment e deixar o contêiner JMX capaz, instanciar e unir um <literal>HibernateService</literal> no JNDI. Essas opções avançadas são discutidas no documento de referência do Hibernate.
zh_cn: 如果你在配置文件中给<literal>SessionFactory</literal>一个名字，在<literal>SessionFactory</literal>创建后，Hibernate会试着把它绑定到JNDI。要完全避免这样的代码，你也可以使用JMX部署，让具有JMX能力的容器来实例化<literal>HibernateService</literal>并把它绑定到JNDI。这些高级可选项在后面的章节中会讨论到。

source: Place <literal>HibernateUtil.java</literal> in the development source directory, in a package next to <literal>events</literal>:
es_es: Esta clase no &#x00f3;lo produce la <literal>SessionFactory</literal> global en su inicializador static (llamado s&#x00f3;lo una vez por la JVM al cargar la clase), sino que tambi&#x00e9;n tiene una variable <literal>ThreadLocal</literal> para tener la <literal>Session</literal> para la hebra actual. No importa cu&#x00e1;ndo llames a <literal>HibernateUtil.currentSession()</literal>, siempre devolver&#x00e1; la misma unidad de trabajo de Hibernate en la misma hebra. Una llamada a <literal>HibernateUtil.closeSession()</literal> termina la unidad de trabajo actualmente asociada a la hebra.
pt_br: Coloque o <literal>HibernateUtil.java</literal> no diretório de arquivos de desenvolvimento(source), em um pacote após o <literal>events</literal>:
zh_cn: 把<literal>HibernateUtil.java</literal>放在开发目录的源代码路径下，与放<literal>events</literal>的包并列：

source: <![CDATA[. +lib <Hibernate and third-party libraries> +src +events Event.java Event.hbm.xml +util HibernateUtil.java hibernate.cfg.xml +data build.xml]]>
es_es: Aseg&#x00fa;rate de entender el concepto Java de una variable local a una hebra antes de usar esta ayuda. Una clase <literal>HibernateUtil</literal> m&#x00e1;s potente puede encontrarse en <literal>CaveatEmptor</literal>, http://caveatemptor.hibernate.org/, as&#x00ed; como en el libro "Java Persistence with Hibernate". Observa que esta clase no es necesaria si despliegas Hibernate en un servidor de aplicaciones J2EE: una <literal>Session</literal> ser&#x00e1; autom&#x00e1;ticamente ligada a la transacci&#x00f3;n JTA actual, y puedes buscar la <literal>SessionFactory</literal> a trav&#x00e9;s de JNDI. Si usas JBoss AS, Hibernate puede ser desplegado como un servicio de sistema manejado y autom&#x00e1;ticamente ligar&#x00e1; la <literal>SessionFactory</literal> a un nombre JNDI.

source: This should again compile without problems. We finally need to configure a logging system - Hibernate uses commons logging and leaves you the choice between Log4j and JDK 1.4 logging. Most developers prefer Log4j: copy <literal>log4j.properties</literal> from the Hibernate distribution (it's in the <literal>etc/</literal> directory) to your <literal>src</literal> directory, next to <literal>hibernate.cfg.xml</literal>. Have a look at the example configuration and change the settings if you like to have more verbose output. By default, only Hibernate startup message are shown on stdout.
es_es: Coloca <literal>HibernateUtil.java</literal> en el directorio de fuentes de desarrollo, junto a <literal>Event.java</literal>:
pt_br: Novamente, isto deve compilar sem problemas. Finalmente, nós precisamos configurar um sistema de logging – o Hibernate usa commons logging e deixa você escolher entre o Log4j e o logging do JDK 1.4 . A maioria dos desenvolvedores preferem o Log4j: copie <literal>log4j.properties</literal> da distribuição do Hibernate (está no diretório <literal>etc/</literal>), para seu diretório <literal>src</literal>, depois vá em hibernate.cfg.xml. Dê uma olhada no exemplo de configuração e mude as configurações se você quizer ter uma saída mais detalhada. Por default, apenas as mensagems de startup e shwwn do Hibernate é mostrada no stdout.
zh_cn: 再次编译这个应用程序应该不会有问题。最后我们需要配置一个日志（logging)系统 － Hibernate使用通用日志接口，允许你在Log4j和JDK 1.4 日志之间进行选择。多数开发者更喜欢Log4j：从Hibernate的发布包中（它在<literal>etc/</literal>目录下）拷贝<literal>log4j.properties</literal>到你的<literal>src</literal>目录，与<literal>hibernate.cfg.xml</literal>.放在一起。看一下配置示例，如果你希望看到更加详细的输出信息，你可以修改配置。默认情况下，只有Hibernate的启动信息才会显示在标准输出上。

source: The tutorial infrastructure is complete - and we are ready to do some real work with Hibernate.
es_es: <![CDATA[. +lib <Hibernate and third-party libraries> +src Event.java Event.hbm.xml HibernateUtil.java hibernate.cfg.xml +data build.xml]]>
pt_br: O tutorial de infra-estrutura está completo - e nós já estamos preparados para algum trabalho de verdade com o Hibernate.
zh_cn: 示例的基本框架完成了 － 现在我们可以用Hibernate来做些真正的工作。

source: Loading and storing objects
es_es: Esto tambi&#x00e9;n debe compilar sin problemas. Finalmente necesitamos configurar un sistema de logging (registro). Hibernate usa commons logging y te deja la elecci&#x00f3;n entre Log4J y logging de JDK 1.4. La mayor&#x00ed;a de los desarrolladores prefieren Log4J: copia <literal>log4j.properties</literal> de la distribuci&#x00f3;n de Hibernate (est&#x00e1; en el directorio <literal>etc/</literal>) a tu directorio <literal>src</literal>, junto a <literal>hibernate.cfg.xml</literal>. Echa una mirada a la configuraci&#x00f3;n de ejemplo y cambia los ajustes si te gusta tener una salida m&#x00e1;s verborr&#x00e1;gica. Por defecto, s&#x00f3;lo se muestra el mensaje de arranque de Hibernate en la salida.
pt_br: Carregando e salvando objetos
zh_cn: 加载并存储对象

source: Finally, we can use Hibernate to load and store objects. We write an <literal>EventManager</literal> class with a <literal>main()</literal> method:
es_es: La infraestructura del tutorial est&#x00e1; completa, y estamos listos para hacer alg&#x00fa;n trabajo real con Hibernate.
pt_br: Finalmente, nós podemos usar o Hibernate para carregar e armazenar objetos. Nós escrevemos uma classe <literal>EventManager</literal> com um método main():
zh_cn: 我们终于可以使用Hibernate来加载和存储对象了，编写一个带有<literal>main()</literal>方法的<literal>EventManager</literal>类：

source: <![CDATA[package events; import org.hibernate.Session; import java.util.Date; import util.HibernateUtil; public class EventManager { public static void main(String[] args) { EventManager mgr = new EventManager(); if (args[0].equals("store")) { mgr.createAndStoreEvent("My Event", new Date()); } HibernateUtil.getSessionFactory().close(); } private void createAndStoreEvent(String title, Date theDate) { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); Event theEvent = new Event(); theEvent.setTitle(title); theEvent.setDate(theDate); session.save(theEvent); session.getTransaction().commit(); } }]]>
es_es: Cargando y almacenando objetos

source: We create a new <literal>Event</literal> object, and hand it over to Hibernate. Hibernate now takes care of the SQL and executes <literal>INSERT</literal>s on the database. Let's have a look at the <literal>Session</literal> and <literal>Transaction</literal>-handling code before we run this.
es_es: Finalmente, podemos usar Hibernate para cargar y almacenar objetos. Escribimos una clase <literal>EventManager</literal> con un m&#x00e9;todo <literal>main()</literal>:
pt_br: Nós criamos um novo objeto <literal>Event</literal>, e passamos para o Hibernate. O Hibernate sabe como tomar conta do SQL e executa <literal>INSERT</literal>s no banco de dados. Vamos dar uma olhada na <literal>Session</literal> e no código <literal>Transaction</literal>-handling antes de executarmos.
zh_cn: 我们创建了个新的<literal>Event</literal>对象并把它传递给Hibernate。现在Hibernate负责与SQL打交道，并把<literal>INSERT</literal>命令传给数据库。在运行之前，让我们看一下处理<literal>Session</literal>和<literal>Transaction</literal>的代码。
