Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: es_es, pt_br, zh_cn

source: We'll now create an association between these two entities. Obviously, persons can participate in events, and events have participants. The design questions we have to deal with are: directionality, multiplicity, and collection behavior.
es_es: <![CDATA[ <mapping resource="Event.hbm.xml"/> <mapping resource="Person.hbm.xml"/> ]]>
pt_br: Nos iremos agora criar uma associação entre estas duas entidades. Obviamente, pessoas (Person) podem participar de eventos, e eventos possuem participantes. As questões de design com que teremos de lidar são: direcionalidade, multiplicidade e comportamento de coleção.
zh_cn: 现在我们在这两个实体之间创建一个关联。显然，persons可以参与一系列events，而events也有不同的参加者（persons）。我们需要处理的设计问题是关联方向（directionality），阶数（multiplicity）和集合（collection）的行为。

source: A unidirectional Set-based association
es_es: Crearemos ahora una asociaci&#x00f3;n entre estas dos entidades. Obviamente, las personas pueden participar en eventos, y los eventos tienen participantes. Las cuestiones de dise&#x00f1;o con que tenemos que tratar son: direccionalidad, multiplicidad y comportamiento de colecci&#x00f3;n.
pt_br: Uma associação Set-based unidirectional
zh_cn: 单向Set-based的关联

source: We'll add a collection of events to the <literal>Person</literal> class. That way we can easily navigate to the events for a particular person, without executing an explicit query - by calling <literal>aPerson.getEvents()</literal>. We use a Java collection, a <literal>Set</literal>, because the collection will not contain duplicate elements and the ordering is not relevant for us.
es_es: Una asociaci&#x00f3;n unidireccional basada en Set
pt_br: Nos iremos adicionar uma coleção de eventos na classe <literal>Person</literal>. Desse jeito poderemos navegar pelos eventos de uma pessoa em particular, sem executar uma query explicitamente – apenas chamando <literal>aPerson.getEvents()</literal>. Nos usaremos uma coleção Java, um <literal>Set</literal>, porquê a coleção não conterá elementos duplicados e a ordem não é relevante para nós.
zh_cn: 我们将向<literal>Person</literal>类增加一连串的events。那样，通过调用<literal>aPerson.getEvents()</literal>，就可以轻松地导航到特定person所参与的events，而不用去执行一个显式的查询。我们使用Java的集合类（collection）：<literal>Set</literal>，因为set 不包含重复的元素及与我们无关的排序。

source: We need a unidirectional, many-valued associations, implemented with a <literal>Set</literal>. Let's write the code for this in the Java classes and then map it:
es_es: Agregaremos una colecci&#x00f3;n de eventos a la clase <literal>Person</literal>. De esta forma podemos navegar facilmente a los eventos de una persona en particular, sin ejecutar una consulta expl&#x00ed;cita, llamando a <literal>aPerson.getEvents()</literal>. Usamos una colecci&#x00f3;n Java, un <literal>Set</literal>, porque la colecci&#x00f3;n no contendr&#x00e1; elementos duplicados y el ordenamiento no nos es relevante.
pt_br: Vamos escrever o código para isto nas classes Java e então mapear:
zh_cn: 我们需要用set 实现一个单向多值关联。让我们在Java类里为这个关联编码，接着映射它：

source: <![CDATA[public class Person { private Set events = new HashSet(); public Set getEvents() { return events; } public void setEvents(Set events) { this.events = events; } }]]>
es_es: Hasta ahora hemos dise&#x00f1;ado asociaciones unidireccionales multivaluadas, implementadas con un <literal>Set</literal>. Escribamos el c&#x00f3;digo para esto en las clases Java y luego lo mapeemos:

source: Before we map this association, think about the other side. Clearly, we could just keep this unidirectional. Or, we could create another collection on the <literal>Event</literal>, if we want to be able to navigate it bi-directional, i.e. <literal>anEvent.getParticipants()</literal>. This is not necessary, from a functional perspective. You could always execute an explicit query to retrieve the participants for a particular event. This is a design choice left to you, but what is clear from this discussion is the multiplicity of the association: "many" valued on both sides, we call this a <emphasis>many-to-many</emphasis> association. Hence, we use Hibernate's many-to-many mapping:
es_es: <![CDATA[public class Person { private Set events = new HashSet(); public Set getEvents() { return events; } public void setEvents(Set events) { this.events = events; } }]]>
pt_br: Antes de mapearmos esta associação, pense no outro lado. Claramente, poderíamos apenas fazer isto de forma unidirecional. Ou poderíamos criar outra coleção no <literal>Event</literal>, se quisermos ser capaz de navegar bidirecionalmente, i.e. um - <literal>anEvent.getParticipants()</literal>. Isto não é necessário, de perspectiva funcional. Você poderia sempre executar uma query explicita que retornasse os participantes de um evento em particular. Esta é uma escolha de design que cabe a você, mas o que é claro nessa discussão é a multiplicidade da associação: "muitos" valores em ambos os lados, nós chamamos isto uma associação <emphasis>muitos-para-muitos</emphasis>. Daqui pra frente, nos usaremos o mapeamento muitos-para-muitos do Hibernate:
zh_cn: 在映射这个关联之前，先考虑一下此关联的另外一端。很显然，我们可以保持这个关联是单向的。或者，我们可以在<literal>Event</literal>里创建另外一个集合，如果希望能够双向地导航，如：<literal>anEvent.getParticipants()</literal>。从功能的角度来说，这并不是必须的。因为你总可以显式地执行一个查询，以获得某个特定event的所有参与者。这是个在设计时需要做出的选择，完全由你来决定，但此讨论中关于关联的阶数是清楚的：即两端都是“多”值的，我们把它叫做<emphasis>多对多(many-to-many)</emphasis>关联。因而，我们使用Hibernate的多对多映射：

source: <![CDATA[<class name="events.Person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="native"/> </id> <property name="age"/> <property name="firstname"/> <property name="lastname"/> <set name="events" table="PERSON_EVENT"> <key column="PERSON_ID"/> <many-to-many column="EVENT_ID" class="events.Event"/> </set> </class>]]>
es_es: Antes que mapeemos esta asociaci&#x00f3;n, piensa sobre el otro lado. Claramente, podemos mantener esto solamente unidireccional. O podemos crear otra colecci&#x00f3;n en el <literal>Event</literal>, si queremos ser capaces de navegarlos bidireccionalmente; por ejemplo, <literal>anEvent.getParticipants()</literal>. Esta es una elecci&#x00f3;n de dise&#x00f1;o que recae en ti, pero lo que est&#x00e1; claro de esta discusi&#x00f3;n es la multiplicidad de la asociaci&#x00f3;n: "multi" valuada a ambos lados, llamamos a esto una asociaci&#x00f3;n <emphasis>muchos-a-muchos</emphasis>. Por lo tanto, usamos un mapeo many-to-many de Hibernate:

source: Hibernate supports all kinds of collection mappings, a <literal>&lt;set&gt;</literal> being most common. For a many-to-many association (or <emphasis>n:m</emphasis> entity relationship), an association table is needed. Each row in this table represents a link between a person and an event. The table name is configured with the <literal>table</literal> attribute of the <literal>set</literal> element. The identifier column name in the association, for the person's side, is defined with the <literal>&lt;key&gt;</literal> element, the column name for the event's side with the <literal>column</literal> attribute of the <literal>&lt;many-to-many&gt;</literal>. You also have to tell Hibernate the class of the objects in your collection (correct: the class on the other side of the collection of references).
es_es: <![CDATA[<class name="Person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="increment"/> </id> <property name="age"/> <property name="firstname"/> <property name="lastname"/> <set name="events" table="PERSON_EVENT"> <key column="PERSON_ID"/> <many-to-many column="EVENT_ID" class="Event"/> </set> </class>]]>
pt_br: O Hibernate suporta todo tipo de mapeamento de coleção , sendo um <literal>&lt;set&gt;</literal> mais comum. Para uma associação muitos-para-muitos (ou relacionamento de entidade <emphasis>n:m</emphasis> ), uma tabela de associação é necessária. Cada linha nessa tabela representa um link entre uma pessoa e um evento. O nome da tabela é configurado com o atributo <literal>table</literal> do elemento <literal>set</literal>. O nome da coluna identificadora na associção, peloo lado da pessoa, é definido com o elemento <literal>&lt;key&gt;</literal> , o nome da coluna pelo lado dos eventos, e definido com o atributo <literal>column</literal> do <literal>&lt;many-to-many&gt;</literal>. Você também precisa dizer para o Hibernate a classe dos objetos na sua coleção (a classe do outro lado das coleções de referência).
zh_cn: Hibernate支持各种各样的集合映射，<literal>&lt;set&gt;</literal>使用的最为普遍。对于多对多关联（或叫<emphasis>n:m</emphasis>实体关系）, 需要一个关联表（association table）。<literal>表</literal>里面的每一行代表从person到event的一个关联。表名是由<literal>set</literal>元素的<literal>table</literal>属性配置的。关联里面的标识符字段名，对于person的一端，是由<literal>&lt;key&gt;</literal>元素定义，而event一端的字段名是由<literal>&lt;many-to-many&gt;</literal>元素的<literal>column</literal>属性定义。你也必须告诉Hibernate集合中对象的类（也就是位于这个集合所代表的关联另外一端的类）。

source: The database schema for this mapping is therefore:
es_es: Hibernate soporta todo tipo de mapeos de colecci&#x00f3;n, siendo el m&#x00e1;s com&#x00fa;n un <literal>&lt;set&gt;</literal>. Para una asociaci&#x00f3;n muchos-a-muchos (o relaci&#x00f3;n de entidad <emphasis>n:m</emphasis>), se necesita una tabla de asociaci&#x00f3;n. Cada fila en esta tabla representa un enlace entre una persona y un evento. Esta tabla se configura con el atributo <literal>table</literal> del elemento <literal>set</literal>. El nombre de la columna identificadora en la asociaci&#x00f3;n, para el lado de la persona, se define con el elemento <literal>&lt;key&gt;</literal>. El nombre de columna para el lado del evento se define con el atributo <literal>column</literal> del <literal>&lt;many-to-many&gt;</literal>. Tambi&#x00e9;n tienes que decirle a Hibernate la clase de los objetos en tu colecci&#x00f3;n (correcto: la clase del otro lado de la colecci&#x00f3;n de referencias).
pt_br: O esquema de mapeamento para o banco de dados está a seguir:
zh_cn: 因而这个映射的数据库schema是：

source: <![CDATA[ _____________ __________________ | | | | _____________ | EVENTS | | PERSON_EVENT | | | |_____________| |__________________| | PERSON | | | | | |_____________| | *EVENT_ID | <--> | *EVENT_ID | | | | EVENT_DATE | | *PERSON_ID | <--> | *PERSON_ID | | TITLE | |__________________| | AGE | |_____________| | FIRSTNAME | | LASTNAME | |_____________| ]]>
es_es: El esquema de base de datos para este mapeo es, por lo tanto:

source: Working the association
es_es: <![CDATA[ _____________ __________________ | | | | _____________ | EVENTS | | PERSON_EVENT | | | |_____________| |__________________| | PERSON | | | | | |_____________| | *EVENT_ID | <--> | *EVENT_ID | | | | EVENT_DATE | | *PERSON_ID | <--> | *PERSON_ID | | TITLE | |__________________| | AGE | |_____________| | FIRSTNAME | | LASTNAME | |_____________| ]]>
pt_br: Trabalhando a associação
zh_cn: 使关联工作

source: Let's bring some people and events together in a new method in <literal>EventManager</literal>:
es_es: Trabajando la asociaci&#x00f3;n
pt_br: Vamos trazer juntos algumas pessoas e eventos em um novo método na classe <literal>EventManager</literal>::
zh_cn: 我们把一些people和events 一起放到<literal>EventManager</literal>的新方法中：

source: <![CDATA[private void addPersonToEvent(Long personId, Long eventId) { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); Person aPerson = (Person) session.load(Person.class, personId); Event anEvent = (Event) session.load(Event.class, eventId); aPerson.getEvents().add(anEvent); session.getTransaction().commit(); }]]>
es_es: Traigamos alguna gente y eventos juntos en un nuevo m&#x00e9;todo en <literal>EventManager</literal>:

source: After loading a <literal>Person</literal> and an <literal>Event</literal>, simply modify the collection using the normal collection methods. As you can see, there is no explicit call to <literal>update()</literal> or <literal>save()</literal>, Hibernate automatically detects that the collection has been modified and needs to be updated. This is called <emphasis>automatic dirty checking</emphasis>, and you can also try it by modifying the name or the date property of any of your objects. As long as they are in <emphasis>persistent</emphasis> state, that is, bound to a particular Hibernate <literal>Session</literal> (i.e. they have been just loaded or saved in a unit of work), Hibernate monitors any changes and executes SQL in a write-behind fashion. The process of synchronizing the memory state with the database, usually only at the end of a unit of work, is called <emphasis>flushing</emphasis>. In our code, the unit of work ends with a commit (or rollback) of the database transaction - as defined by the <literal>thread</literal> configuration option for the <literal>CurrentSessionContext</literal> class.
es_es: <![CDATA[private void addPersonToEvent(Long personId, Long eventId) { Session session = HibernateUtil.currentSession(); Transaction tx = session.beginTransaction(); Person aPerson = (Person) session.load(Person.class, personId); Event anEvent = (Event) session.load(Event.class, eventId); aPerson.getEvents().add(anEvent); tx.commit(); HibernateUtil.closeSession(); }]]>
pt_br: Após carregar um <literal>Person</literal> e um <literal>Event</literal>, simplesmente modifique a coleção usando os métodos normais de uma coleção. Como você pode ver, não há chamada explícita para <literal>update()</literal> ou <literal>save()</literal>, o Hibernate detecta automaticamente que a coleção foi modificada e necessita ser atualizada. Isso é chamado de <emphasis>checagem suja automática</emphasis>, e você também pode usá-la modificando o nome ou a data de qualquer um dos seus objetos. Assim que eles estiverem no estado <emphasis>persistent</emphasis>, ou seja, limitado por uma <literal>Session</literal> do Hibernate em particular (i.e. eles foram carregados ou salvos dentro de uma unidade de trabalho), o Hibernate monitora qualquer alteração e executa o SQL em modo de escrita em segundo plano. O processo de sincronização do estado da memória com o banco de dados, geralmente apenas no final de uma unidade de trabalho, é chamado de <emphasis>flushing</emphasis>. No nosso código, a unidade de trabalho termina com o commit da transação do banco de dados – como definido pela opção de configuração da <literal>thread</literal> da classe <literal>CurrentSessionContext</literal>.
zh_cn: 在加载一<literal>Person</literal>和<literal>Event</literal>后，使用普通的集合方法就可容易地修改我们定义的集合。如你所见，没有显式的<literal>update()</literal>或<literal>save()</literal>，Hibernate会自动检测到集合已经被修改并需要更新回数据库。这叫做自动脏检查（<emphasis>automatic dirty checking</emphasis>），你也可以尝试修改任何对象的name或者date属性，只要他们处于<emphasis>持久化</emphasis>状态，也就是被绑定到某个Hibernate 的<literal>Session</literal>上（如：他们刚刚在一个单元操作被加载或者保存），Hibernate监视任何改变并在后台隐式写的方式执行SQL。同步内存状态和数据库的过程，通常只在单元操作结束的时候发生，称此过程为清理缓存<emphasis>（flushing）</emphasis>。在我们的代码中，工作单元由数据库事务的提交（或者回滚）来结束——这是由<literal>CurrentSessionContext</literal>类的<literal>thread</literal>配置选项定义的。

source: You might of course load person and event in different units of work. Or you modify an object outside of a <literal>Session</literal>, when it is not in persistent state (if it was persistent before, we call this state <emphasis>detached</emphasis>). You can even modify a collection when it is detached:
es_es: Despu&#x00e9;s de cargar una <literal>Person</literal> y un <literal>Event</literal>, simplemente modifica la colecci&#x00f3;n usando sus m&#x00e9;todos normales. Como puedes ver, no hay una llamada expl&#x00ed;cita a <literal>update()</literal> o <literal>save()</literal>. Hibernate detecta autom&#x00e1;ticamente que la colecci&#x00f3;n ha sido modificada y necesita ser salvada. Esto es llamado <emphasis>chequeo sucio autom&#x00f3;tico (automatic dirty checking)</emphasis>, y tambi&#x00e9;n puedes intentarlo modificando el nombre de la propiedad de fecha de cualquiera de tus objetos. Mientras est&#x00e9;n en estado <emphasis>persistente</emphasis>, esto es, ligados a una <literal>Session</literal> de Hibernate particular (es decir, justo han sido cargados o almacenados en una unidad de trabajo), Hibernate monitoriza cualquier cambio y ejecuta SQL en estilo escribe-por-detr&#x00e1;s. El proceso de sincronizaci&#x00f3;n del estado de memoria con la base de datos, usualmente s&#x00f3;lo al final de una unidad de trabajo, es llamado <emphasis>limpieza (flushing)</emphasis>.
pt_br: Você pode também querer carregar pessoas e eventos em diferentes unidades de trabalho. Ou você modifica um objeto fora de uma <literal>Session</literal>, quando não se encontra no estado persistent (se já esteve neste estado anteriormente, chamamos esse estado de <emphasis>detached</emphasis>). Você pode até mesmo modificar uma coleção quando esta se encontrar no estado detached.
zh_cn: 当然，你也可以在不同的单元操作里面加载person和event。或在<literal>Session</literal>以外修改不是处在持久化（persistent）状态下的对象（如果该对象以前曾经被持久化，那么我们称这个状态为<emphasis>脱管（detached）</emphasis>）。你甚至可以在一个集合被脱管时修改它：

source: <![CDATA[private void addPersonToEvent(Long personId, Long eventId) { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); Person aPerson = (Person) session .createQuery("select p from Person p left join fetch p.events where p.id = :pid") .setParameter("pid", personId) .uniqueResult(); // Eager fetch the collection so we can use it detached Event anEvent = (Event) session.load(Event.class, eventId); session.getTransaction().commit(); // End of first unit of work aPerson.getEvents().add(anEvent); // aPerson (and its collection) is detached // Begin second unit of work Session session2 = HibernateUtil.getSessionFactory().getCurrentSession(); session2.beginTransaction(); session2.update(aPerson); // Reattachment of aPerson session2.getTransaction().commit(); }]]>
es_es: Podr&#x00ed;as, por supuesto, cargar persona y evento en unidades de trabajo diferentes. O modificas un objeto fuera de una <literal>Session</literal>, cuando no est&#x00e1; en estado persistente (si antes era persistente llamamos a este estado <emphasis>separado (detached) </emphasis>). En c&#x00f3;digo (no muy realista), esto se ver&#x00ed;a como sigue:

source: The call to <literal>update</literal> makes a detached object persistent again, you could say it binds it to a new unit of work, so any modifications you made to it while detached can be saved to the database. This includes any modifications (additions/deletions) you made to a collection of that entity object.
es_es: <![CDATA[ private void addPersonToEvent(Long personId, Long eventId) { Session session = HibernateUtil.currentSession(); Transaction tx = session.beginTransaction(); Person aPerson = (Person) session.load(Person.class, personId); Event anEvent = (Event) session.load(Event.class, eventId); tx.commit(); HibernateUtil.closeSession(); aPerson.getEvents().add(anEvent); // aPerson is detached Session session2 = HibernateUtil.currentSession(); Transaction tx2 = session.beginTransaction(); session2.update(aPerson); // Reattachment of aPerson tx2.commit(); HibernateUtil.closeSession(); } ]]>
pt_br: A chamada <literal>update</literal> cria um objeto persistent novamente, você poderia dizer que ele liga o objeto a uma nova unidade de trabalho, assim qualquer modificação que você faça neste objeto enquanto estiver no estado detached pode ser salvo no banco de dados. Isso inclui qualquer modificação (adição/exclusão) que você faça em uma coleção da entidade deste objeto.
zh_cn: 对<literal>update</literal>的调用使一个脱管对象重新持久化，你可以说它被绑定到一个新的单元操作上，所以在脱管状态下对它所做的任何修改都会被保存到数据库里。这也包括你对这个实体对象的集合所作的任何改动（增加/删除）。

source: Well, this is not much use in our current situation, but it's an important concept you can design into your own application. For now, complete this exercise by adding a new action to the <literal>EventManager</literal>'s main method and call it from the command line. If you need the identifiers of a person and an event - the <literal>save()</literal> method returns it (you might have to modify some of the previous methods to return that identifier):
es_es: La llamada a <literal>update</literal> hace a un objeto persistente de nuevo, podr&#x00ed;as decir que la liga a una nueva unidad de trabajo, de modo que cualquier modificaci&#x00f3;n que le hagas mientras est&#x00e9; separado puede ser salvada a base de datos.
pt_br: Bom, isso não foi muito usado na nossa situação, porém, é um importante conceito que você pode aplicar em seus aplicativos. Agora, complete este exercício adicionando uma nova ação ao método main( ) da classe <literal>EventManager</literal> e chame-o pela linha de comando. Se você precisar dos identificadores de uma pessoa ou evento – o método <literal>save()</literal> retorna estes identificadores (você poderá modificar alguns dos métodos anteriores para retornar aquele identificador):
zh_cn: 这对我们当前的情形不是很有用，但它是非常重要的概念，你可以把它融入到你自己的应用程序设计中。在<literal>EventManager</literal>的main方法中添加一个新的动作，并从命令行运行它来完成我们所做的练习。如果你需要person及event的标识符 — 那就用<literal>save()</literal>方法返回它（你可能需要修改前面的一些方法来返回那个标识符）：

source: <![CDATA[else if (args[0].equals("addpersontoevent")) { Long eventId = mgr.createAndStoreEvent("My Event", new Date()); Long personId = mgr.createAndStorePerson("Foo", "Bar"); mgr.addPersonToEvent(personId, eventId); System.out.println("Added person " + personId + " to event " + eventId); }]]>
es_es: Bueno, esto no es muy usado en nuestra situaci&#x00f3;n actual, pero es un concepto importante que puedes dise&#x00f1;ar en tu propia aplicaci&#x00f3;n. Por ahora, completa este ejercicio agregando una nueva acci&#x00f3;n al m&#x00e9;todo main de <literal>EventManager</literal> y ll&#x00e1;mala desde la l&#x00ed;nea de comandos. Si necesitas los identificadores de una persona o evento, el m&#x00e9;todo <literal>save()</literal> los devuelve.
