Repository: mznm9t/hibernate
Catalog: lib/hibernate-distribution-3.3.0.*/project/documentation/manual/src/main/docbook/*/content/xml.po
Languages: es_es

source: XML Mapping
es_es: Mapeo XML

source: Note that this is an experimental feature in Hibernate 3.0 and is under extremely active development.
es_es: Nota que esta es una funcionalidad experimental en Hibernate 3.0 y está bajo un desarrollo extremadamente activo.

source: Working with XML data
es_es: Trabajando con datos XML

source: Hibernate lets you work with persistent XML data in much the same way you work with persistent POJOs. A parsed XML tree can be thought of as just another way to represent the relational data at the object level, instead of POJOs.
es_es: Hibernate te permite trabajar con datos XML persistentes en casi la misma forma que trabajas con POJOs persistentes. Un árbol XML analizado (parsed) puede ser pensado como sólo otra forma de representar los datos relacionales a nivel de objetos, en vez de POJOs.

source: Hibernate supports dom4j as API for manipulating XML trees. You can write queries that retrieve dom4j trees from the database and have any modification you make to the tree automatically synchronized to the database. You can even take an XML document, parse it using dom4j, and write it to the database with any of Hibernate's basic operations: <literal>persist(), saveOrUpdate(), merge(), delete(), replicate()</literal> (merging is not yet supported).
es_es: Hibernate soporta dom4j como API para manipular árboles XML. Puedes escribir consultas que traigan árboles dom4j de la base de datos y tener cualquier modificación que hagas al árbol sincronizada automáticamente a la base de datos. Puedes incluso tomar un documento XML, analizarlo usando dom4j, y escribirlo a la base de datos con cualquiera de las operaciones básicas de Hibernate: <literal>persist(), saveOrUpdate(), merge(), delete(), replicate()</literal> (la fusión no está aún soportada).

source: This feature has many applications including data import/export, externalization of entity data via JMS or SOAP and XSLT-based reporting.
es_es: Esta funcionalidad tiene muchas aplicaciones incluyendo la importación/exportación de datos, externalización de datos de entidad vía JMS o SOAP y reportes basados en XSLT.

source: A single mapping may be used to simultaneously map properties of a class and nodes of an XML document to the database, or, if there is no class to map, it may be used to map just the XML.
es_es: Un solo mapeo puede ser usado para mapear simultáneamente las propiedades de una clase y los nodos de un documento XML a la base de datos, o, si no hay ninguna clase a mapear, puede ser usado para mapear sólo el XML.

source: Specifying XML and class mapping together
es_es: Especificando los mapeos de XML y de clase juntos

source: Here is an example of mapping a POJO and XML simultaneously:
es_es: He aquí un ejemplo de mapear un POJO y XML simultáneamente:

source: Specifying only an XML mapping
es_es: Especificando sólo un mapeo XML

source: Here is an example where there is no POJO class:
es_es: He aquí un ejemplo donde no hay ninguna clase POJO:

source: This mapping allows you to access the data as a dom4j tree, or as a graph of property name/value pairs (java <literal>Map</literal>s). The property names are purely logical constructs that may be referred to in HQL queries.
es_es: Este mapeo te permite acceder a los datos como un árbol dom4j, o como un grafo de pares nombre/valor de propiedad (<literal>Map</literal>s de Java). Los nombres de propiedades son construcciones puramente lógicas a las que se puede hacer referencia en consultas HQL.

source: XML mapping metadata
es_es: Mapeo de metadatos XML

source: Many Hibernate mapping elements accept the <literal>node</literal> attribute. This let's you specify the name of an XML attribute or element that holds the property or entity data. The format of the <literal>node</literal> attribute must be one of the following:
es_es: Muchos elementos de mapeo de Hibernate aceptan el atributo <literal>node</literal>. Esto te permite espcificar el nombre de un atributo o elemento XML que contenga los datos de la propiedad o entidad. El formato del atributo <literal>node</literal> debe ser uno de los siguientes:

source: <literal>"element-name"</literal> - map to the named XML element
es_es: <literal>"element-name"</literal> - mapea al elemento XML mencionado

source: <literal>"@attribute-name"</literal> - map to the named XML attribute
es_es: <literal>"@attribute-name"</literal> - mapea al atributo XML mencionado

source: <literal>"."</literal> - map to the parent element
es_es: <literal>"."</literal> - mapea al elemento padre

source: <literal>"element-name/@attribute-name"</literal> - map to the named attribute of the named element
es_es: <literal>"element-name/@attribute-name"</literal> - mapea al atributo mencionado del elemento mencionado

source: For collections and single valued associations, there is an additional <literal>embed-xml</literal> attribute. If <literal>embed-xml="true"</literal>, the default, the XML tree for the associated entity (or collection of value type) will be embedded directly in the XML tree for the entity that owns the association. Otherwise, if <literal>embed-xml="false"</literal>, then only the referenced identifier value will appear in the XML for single point associations and collections will simply not appear at all.
es_es: Para las colecciones y asociaciones monovaluadas, existe un atributo adicional <literal>embed-xml</literal>. Si <literal>embed-xml="true"</literal>, que es el valor por defecto, el árbol XML para la entidad asociada (o colección de tipo de valor) será embebida directamente en el árbol XML para la entidad que posee la asociación. En otro caso, si <literal>embed-xml="false"</literal>, sólo el valor identificador referenciado aparecerá en el XML para asociaciones de punto único y para las colecciones simplemente no aparecerá en absoluto.

source: You should be careful not to leave <literal>embed-xml="true"</literal> for too many associations, since XML does not deal well with circularity!
es_es: ¡Debes ser cuidadoso de no dejar <literal>embed-xml="true"</literal> para demasiadas asociaciones, ya que XML no trata bien la circularidad!

source: in this case, we have decided to embed the collection of account ids, but not the actual account data. The following HQL query:
es_es: en este caso, hemos decidido embeber la colección de ids de cuenta, pero no los datos reales de cuenta. La siguiente consulta HQL:

source: Would return datasets such as this:
es_es: devolvería conjuntos de datos como estos:

source: If you set <literal>embed-xml="true"</literal> on the <literal>&lt;one-to-many&gt;</literal> mapping, the data might look more like this:
es_es: Si estableces <literal>embed-xml="true"</literal> en el mapeo <literal>&lt;one-to-many&gt;</literal>, los datos podrían verse así:

source: Manipulating XML data
es_es: Manipulando datos XML

source: Let's rearead and update XML documents in the application. We do this by obtaining a dom4j session:
es_es: Vamos a releer y actualizar documentos XML en la aplicación. Hacemos esto obteniendo una sesión dom4j:

source: It is extremely useful to combine this feature with Hibernate's <literal>replicate()</literal> operation to implement XML-based data import/export.
es_es: Es extremadamente útil combinar esta funcionalidad con la operación <literal>replicate()</literal> de Hibernate para implementar la importación/exportación de datos basada en XML.

source: ROLES_OF_TRANSLATORS
es_es: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
es_es: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
