<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Chapitre&nbsp;2.&nbsp;Architecture</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Persistance relationnelle en Java standard">
      <link rel="up" href="index.html" title="HIBERNATE - Persistance relationnelle en Java standard">
      <link rel="prev" href="tutorial-summary.html" title="1.5.&nbsp;R&eacute;sum&eacute;">
      <link rel="next" href="architecture-states.html" title="2.2.&nbsp;Etats des instances">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">Chapitre&nbsp;2.&nbsp;Architecture</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="tutorial-summary.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="architecture-states.html">Suivant</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="fr-FR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="architecture"></a>Chapitre&nbsp;2.&nbsp;Architecture
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect1" lang="fr-FR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="architecture-overview"></a>2.1.&nbsp;G&eacute;n&eacute;ralit&eacute;s
                     </h2>
                  </div>
               </div>
            </div>
            <p>Voici une vue (tr&egrave;s) haut niveau de l'architecture d'Hibernate : </p>
            <div class="mediaobject" align="center"><img src="images/overview.png" align="middle"></div>
            <p>Ce diagramme montre Hibernate utilisant une base de donn&eacute;es et des donn&eacute;es de configuration pour fournir un service de persistance
               (et des objets persistants) &agrave; l'application. 
            </p>
            <p>Nous aimerions d&eacute;crire une vue plus d&eacute;taill&eacute;e de l'architecture. Malheureusement, Hibernate est flexible et supporte diff&eacute;rentes
               approches. Nous allons en montrer les deux extr&ecirc;mes. L'architecture l&eacute;g&egrave;re laisse l'application fournir ses propres connexions
               JDBC et g&eacute;rer ses propres transactions. Cette approche utilise le minimum des APIs Hibernate : 
            </p>
            <div class="mediaobject" align="center"><img src="images/lite.png" align="middle"></div>
            <p>L'architecture la plus compl&egrave;te abstrait l'application des APIs JDBC/JTA sous-jacentes et laisse Hibernate s'occuper des d&eacute;tails.
               
            </p>
            <div class="mediaobject" align="center"><img src="images/full_cream.png" align="middle"></div>
            <p>Heres some definitions of the objects in the diagrams: </p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term">SessionFactory (<code class="literal">org.hibernate.SessionFactory</code>)</span></dt>
                  <dd>
                     <p>Un cache threadsafe (immuable) des mappings vers une (et une seule) base de donn&eacute;es. Une factory (fabrique) de <code class="literal">Session</code> et un client de <code class="literal">ConnectionProvider</code>. Peut contenir un cache optionnel de donn&eacute;es (de second niveau) qui est r&eacute;utilisable entre les diff&eacute;rentes transactions que
                        cela soit au sein du m&ecirc;me processus (JVLM) ou par plusieurs n&#339;uds d'un cluster. 
                     </p>
                  </dd>
                  <dt><span class="term">Session (<code class="literal">org.hibernate.Session</code>)</span></dt>
                  <dd>
                     <p>Un objet mono-thread&eacute;, &agrave; dur&eacute;e de vie courte, qui repr&eacute;sente une conversation entre l'application et l'entrep&ocirc;t de persistance.
                        Encapsule une connexion JDBC. Factory (fabrique) des objets <code class="literal">Transaction</code>. Contient un cache (de premier niveau) des objets persistants, ce cache est obligatoire. Il est utilis&eacute; lors de la navigation
                        dans le graphe d'objets ou lors de la r&eacute;cup&eacute;ration d'objets par leur identifiant. 
                     </p>
                  </dd>
                  <dt><span class="term">Objets et Collections persistants</span></dt>
                  <dd>
                     <p>Objets mono-thread&eacute;s &agrave; vie courte contenant l'&eacute;tat de persistance et la fonction m&eacute;tier. Ceux-ci sont en g&eacute;n&eacute;ral les objets
                        de type JavaBean (ou POJOs) ; la seule particularit&eacute; est qu'ils sont associ&eacute;s avec une (et une seule) <code class="literal">Session</code>. D&egrave;s que la <code class="literal">Session</code> est ferm&eacute;e, ils seront d&eacute;tach&eacute;s et libres d'&ecirc;tre utilis&eacute;s par n'importe laquelle des couches de l'application (ie. de et
                        vers la pr&eacute;sentation en tant que Data Transfer Objects - DTO : objet de transfert de donn&eacute;es). 
                     </p>
                  </dd>
                  <dt><span class="term">Objets et collections transients</span></dt>
                  <dd>
                     <p>Instances de classes persistantes qui ne sont actuellement pas associ&eacute;es &agrave; une <code class="literal">Session</code>. Elles ont pu &ecirc;tre instanci&eacute;es par l'application et ne pas avoir (encore) &eacute;t&eacute; persist&eacute;es ou elle ont pu &ecirc;tre instanci&eacute;es
                        par une <code class="literal">Session</code> ferm&eacute;e. 
                     </p>
                  </dd>
                  <dt><span class="term">Transaction (<code class="literal">org.hibernate.Transaction</code>)</span></dt>
                  <dd>
                     <p>(Optionnel) Un objet mono-thread&eacute; &agrave; vie courte utilis&eacute; par l'application pour d&eacute;finir une unit&eacute; de travail atomique. Abstrait
                        l'application des transactions sous-jacentes qu'elles soient JDBC, JTA ou CORBA. Une <code class="literal">Session</code> peut fournir plusieurs <code class="literal">Transaction</code>s dans certains cas. Toutefois, la d&eacute;limitation des transactions, via l'API d'Hibernate ou par la <code class="literal">Transaction</code> sous-jacente, n'est jamais optionnelle! 
                     </p>
                  </dd>
                  <dt><span class="term">ConnectionProvider (<code class="literal">org.hibernate.connection.ConnectionProvider</code>)</span></dt>
                  <dd>
                     <p>(Optionnel) Une fabrique de (pool de) connexions JDBC. Abstrait l'application de la <code class="literal">Datasource</code> ou du <code class="literal">DriverManager</code> sous-jacent. Non expos&eacute; &agrave; l'application, mais peut &ecirc;tre &eacute;tendu/impl&eacute;ment&eacute; par le d&eacute;veloppeur. 
                     </p>
                  </dd>
                  <dt><span class="term">TransactionFactory (<code class="literal">org.hibernate.TransactionFactory</code>)</span></dt>
                  <dd>
                     <p>(Optionnel) Une fabrique d'instances de <code class="literal">Transaction</code>. Non expos&eacute; &agrave; l'application, mais peut &ecirc;tre &eacute;tendu/impl&eacute;ment&eacute; par le d&eacute;veloppeur. 
                     </p>
                  </dd>
                  <dt><span class="term"><span class="emphasis"><em>Interfaces d'extension</em></span></span></dt>
                  <dd>
                     <p>Hibernate fournit de nombreuses interfaces d'extensions optionnelles que vous pouvez impl&eacute;menter pour personnaliser le comportement
                        de votre couche de persistance. Reportez vous &agrave; la documentation de l'API pour plus de d&eacute;tails. 
                     </p>
                  </dd>
               </dl>
            </div>
            <p>
                       
            </p>
            <p>Dans une architecture l&eacute;g&egrave;re, l'application n'aura pas &agrave; utiliser les APIs <code class="literal">Transaction</code>/<code class="literal">TransactionFactory</code> et/ou n'utilisera pas les APIs <code class="literal">ConnectionProvider</code> pour utiliser JTA ou JDBC. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="tutorial-summary.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="architecture-states.html">Suivant</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">1.5.&nbsp;R&eacute;sum&eacute;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td>
               <td width="40%" align="right" valign="top">&nbsp;2.2.&nbsp;Etats des instances</td>
            </tr>
         </table>
      </div>
   </body>
</html>