<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>2.5.&nbsp;Sessions Contextuelles</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Persistance relationnelle en Java standard">
      <link rel="up" href="architecture.html" title="Chapitre&nbsp;2.&nbsp;Architecture">
      <link rel="prev" href="architecture-jca.html" title="2.4.&nbsp;Support JCA">
      <link rel="next" href="session-configuration.html" title="Chapitre&nbsp;3.&nbsp;Configuration">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">2.5.&nbsp;Sessions Contextuelles</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="architecture-jca.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <th width="60%" align="center">Chapitre&nbsp;2.&nbsp;Architecture</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="session-configuration.html">Suivant</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="fr-FR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="architecture-current-session"></a>2.5.&nbsp;Sessions Contextuelles
                  </h2>
               </div>
            </div>
         </div>
         <p>Certaines applications utilisant Hibernate ont besoin d'une sorte de session "contextuelle", o&ugrave; une session est li&eacute;e &agrave; la
            port&eacute;e d'un contexte particulier. Cependant, les applications ne d&eacute;finissent pas toutes la notion de contexte de la m&ecirc;me mani&egrave;re,
            et diff&eacute;rents contextes d&eacute;finissent diff&eacute;rentes port&eacute;es &agrave; la notion de "courant". Les applications &agrave; base d'Hibernate, versions
            pr&eacute;c&eacute;dentes &agrave; la 3.0 utilisaient g&eacute;n&eacute;ralement un principe maison de sessions contextuelles bas&eacute;es sur le <code class="literal">ThreadLocal</code>, ainsi que sur des classes utilitaires comme <code class="literal">HibernateUtil</code>, ou utilisaient des framework tiers (comme Spring ou Pico) qui fournissaient des sessions contextuelles bas&eacute;es sur l'utilisation
            de proxy/interception. 
         </p>
         <p>A partir de la version 3.0.1, Hibernate a ajout&eacute; la m&eacute;thode <code class="literal">SessionFactory.getCurrentSession()</code>. Initialement, cela demandait l'usage de transactions <code class="literal">JTA</code>, o&ugrave; la transaction <code class="literal">JTA</code> d&eacute;finissait la port&eacute;e et le contexte de la session courante. L'&eacute;quipe Hibernate pense que, &eacute;tant donn&eacute;e la maturit&eacute; des impl&eacute;mentations
            de <code class="literal">JTA TransactionManager</code> , la plupart (sinon toutes) des applications devraient utiliser la gestion des transactions par <code class="literal">JTA</code> qu'elles soient ou non d&eacute;ploy&eacute;es dans un conteneur <code class="literal">J2EE</code>. Par cons&eacute;quent, vous devriez toujours contextualiser vos sessions, si vous en avez besoin, via la m&eacute;thode bas&eacute;e sur JTA.
            
         </p>
         <p>Cependant, depuis la version 3.1, la logique derri&egrave;re <code class="literal">SessionFactory.getCurrentSession()</code> est d&eacute;sormais branchable. A cette fin, une nouvelle interface d'extension (<code class="literal">org.hibernate.context.CurrentSessionContext</code>) et un nouveau param&egrave;tre de configuration (<code class="literal">hibernate.current_session_context_class</code>) ont &eacute;t&eacute; ajout&eacute;s pour permettre de configurer d'autres moyens de d&eacute;finir la port&eacute;e et le contexte des sessions courantes.
            
         </p>
         <p>Allez voir les Javadocs de l'interface <code class="literal">org.hibernate.context.CurrentSessionContext</code> pour une description d&eacute;taill&eacute;e de son contrat. Elle d&eacute;finit une seule m&eacute;thode, <code class="literal">currentSession()</code>, depuis laquelle l'impl&eacute;mentation est responsable de traquer la session courante du contexte. Hibernate fournit deux impl&eacute;mentation
            de cette interface. 
         </p>
         <div class="itemizedlist">
            <ul type="disc">
               <li>
                  <p><code class="literal">org.hibernate.context.JTASessionContext</code> - les sessions courantes sont associ&eacute;es &agrave; une transaction <code class="literal">JTA</code>. La logique est la m&ecirc;me que l'ancienne approche bas&eacute;e sur JTA. Voir les javadocs pour les d&eacute;tails. 
                  </p>
               </li>
               <li>
                  <p><code class="literal">org.hibernate.context.ThreadLocalSessionContext</code> - les sessions courantes sont associ&eacute;es au thread d'ex&eacute;cution. Voir les javadocs pour les d&eacute;tails. 
                  </p>
               </li>
               <li>
                  <p><code class="literal">org.hibernate.context.ManagedSessionContext</code> - current sessions are tracked by thread of execution. However, you are responsible to bind and unbind a <code class="literal">Session</code> instance with static methods on this class, it does never open, flush, or close a <code class="literal">Session</code>. 
                  </p>
               </li>
            </ul>
         </div>
         <p>The first two implementations provide a "one session - one database transaction" programming model, also known and used as
            <span class="emphasis"><em>session-per-request</em></span>. The beginning and end of a Hibernate session is defined by the duration of a database transaction. If you use programmatic
            transaction demarcation in plain JSE without JTA, you are advised to use the Hibernate <code class="literal">Transaction</code> API to hide the underlying transaction system from your code. If you use JTA, use the JTA interfaces to demarcate transactions.
            If you execute in an EJB container that supports CMT, transaction boundaries are defined declaratively and you don't need
            any transaction or session demarcation operations in your code. Refer to <a href="transactions.html" title="Chapitre&nbsp;11.&nbsp;Transactions et acc&egrave;s concurrents">Chapitre&nbsp;11, <i xmlns:xlink="http://www.w3.org/1999/xlink">Transactions et acc&egrave;s concurrents</i></a> for more information and code examples. 
         </p>
         <p>Le param&egrave;tre de configuration <code class="literal">hibernate.current_session_context_class</code> d&eacute;finit quelle impl&eacute;mentation de <code class="literal">org.hibernate.context.CurrentSessionContext</code> doit &ecirc;tre utilis&eacute;e. Notez que pour assurer la compatibilit&eacute; avec les versions pr&eacute;c&eacute;dentes, si ce param&egrave;tre n'est pas d&eacute;fini
            mais qu'un <code class="literal">org.hibernate.transaction.TransactionManagerLookup</code> est configur&eacute;, Hibernate utilisera le <code class="literal">org.hibernate.context.JTASessionContext</code>. La valeur de ce param&egrave;tre devrait juste nommer la classe d'impl&eacute;mentation &agrave; utiliser, pour les deux impl&eacute;mentations fournies,
            il y a cependant deux alias correspondant: "jta" et "thread". 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="architecture-jca.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="architecture.html">Niveau sup&eacute;rieur</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="session-configuration.html">Suivant</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">2.4.&nbsp;Support JCA&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td>
               <td width="40%" align="right" valign="top">&nbsp;Chapitre&nbsp;3.&nbsp;Configuration</td>
            </tr>
         </table>
      </div>
   </body>
</html>