<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Chapitre&nbsp;11.&nbsp;Transactions et acc&egrave;s concurrents</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Persistance relationnelle en Java standard">
      <link rel="up" href="index.html" title="HIBERNATE - Persistance relationnelle en Java standard">
      <link rel="prev" href="objectstate-metadata.html" title="10.12.&nbsp;Utilisation des m&eacute;ta-donn&eacute;es">
      <link rel="next" href="transactions-demarcation.html" title="11.2.&nbsp;D&eacute;marcation des transactions">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">Chapitre&nbsp;11.&nbsp;Transactions et acc&egrave;s concurrents</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-metadata.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="transactions-demarcation.html">Suivant</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="fr-FR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="transactions"></a>Chapitre&nbsp;11.&nbsp;Transactions et acc&egrave;s concurrents
                  </h2>
               </div>
            </div>
         </div>
         <p>L'un des principaux avantages du m&eacute;canisme de contr&ocirc;le des acc&egrave;s concurrents d'Hibernate est qu'il est tr&egrave;s facile &agrave; comprendre.
            Hibernate utilise directement les connexions JDBC ainsi que les ressources JTA sans y ajouter davantage de m&eacute;canisme de blocage.
            Nous vous recommandons de vous familiariser avec les sp&eacute;cifications JDBC, ANSI et d'isolement de transaction de la base de
            donn&eacute;es que vous utilisez. 
         </p>
         <p>Hibernate ne v&eacute;rouille pas vos objets en m&eacute;moire. Votre application peut suivre le comportement d&eacute;fini par le niveau d'isolation
            de vos transactions de base de donn&eacute;es. Notez que gr&acirc;ce &agrave; la <code class="literal">Session</code>, qui est aussi un cache de scope transaction, Hibernate fournit des lectures r&eacute;p&eacute;t&eacute;es pour les r&eacute;cup&eacute;ration par identifiants
            et les requ&ecirc;tes d'entit&eacute;s (pas celle de valeurs scalaires). 
         </p>
         <p>En addition au versionning pour le controle automatique de concurrence, Hibernate fournit une API (mineure) pour le verrouillage
            perssimiste des enregistrements, en g&eacute;n&eacute;rant une syntaxe <code class="literal">SELECT FOR UPDATE</code>. Le controle de concurrence optimiste et cette API seront d&eacute;taill&eacute;s plus tard dans ce chapitre. 
         </p>
         <p>Nous aborderons la gestion des acc&egrave;s concurrents en discutant de la granularit&eacute; des objets <code class="literal">Configuration</code>, <code class="literal">SessionFactory</code>, et <code class="literal">Session</code>, ainsi que de certains concepts relatifs &agrave; la base de donn&eacute;es et aux longues transactions applicatives. 
         </p>
         <div class="sect1" lang="fr-FR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="transactions-basics"></a>11.1.&nbsp;Gestion de session et d&eacute;limitation de transactions
                     </h2>
                  </div>
               </div>
            </div>
            <p>Il est important de savoir qu'un objet <code class="literal">SessionFactory</code> est un objet complexe et optimis&eacute; pour fonctionner avec les threads(thread- safe). Il est co&ucirc;teux &agrave; cr&eacute;er et est ainsi pr&eacute;vu
               pour n'&ecirc;tre instanci&eacute; qu?une seule fois via un objet <code class="literal">Configuration</code> au d&eacute;marrage de l'application, et &ecirc;tre partag&eacute; par tous les threads d'une application. 
            </p>
            <p>Un objet <code class="literal">Session</code> est relativement simple et n'est threadsafe. Il est &eacute;galement peu co&ucirc;teux &agrave; cr&eacute;er. Il devrait n'&ecirc;tre utilis&eacute; qu'une seule
               fois, pour un processus d'affaire ou une unit&eacute; de travail ou une conversation et ensuite &ecirc;tre rel&acirc;ch&eacute;. Un objet <code class="literal">Session</code> ne tentera pas d'obtenir de connexion ( <code class="literal">Connection</code> ) JDBC (ou de <code class="literal">Datasource</code> ) si ce n'est pas n&eacute;cessaire. 
            </p>
            <p>Afin de compl&eacute;ter ce tableau, vous devez &eacute;galement penser aux transactions de base de donn&eacute;es. Une transaction de base de
               donn&eacute;es se doit d'&ecirc;tre la plus courte possible afin de r&eacute;duire les risques de collision sur des enregistrements verrouill&eacute;s.
               De longues transactions &agrave; la base de donn&eacute;es nuiront &agrave; l'extensibilit&eacute; de vos applications lorsque confront&eacute;es &agrave; de hauts
               niveaux de charge. Par cons&eacute;quent, il n'est jamais bon de maintenir une transaction ouverte pendant la dur&eacute;e de reflexion
               de l'utilisateur, jusqu'a ce que l'unit&eacute; de travail soit achev&eacute;e. 
            </p>
            <p>Maintenant, comment d&eacute;limiter une unit&eacute; de travail? Est-ce qu'une instance de <code class="literal">Session</code> peut avoir une dur&eacute;e de vie d&eacute;passant plusieurs transactions &agrave; la base de donn&eacute;es, ou bien est-ce que celles-ci doivent &ecirc;tre
               li&eacute;es une &agrave; une? Quand faut-il ouvrir et fermer une <code class="literal">Session</code> ? Comment d&eacute;finir la d&eacute;marcation de vos transactions &agrave; la base de donn&eacute;es? 
            </p>
            <div class="sect2" lang="fr-FR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-uow"></a>11.1.1.&nbsp;Unit&eacute; de travail
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Il est important de mentionner que d'utiliser un paradigme <span class="emphasis"><em>session-par-operation</em></span> est un anti-pattern. Autrement dit: n'ouvrez et ne fermez pas la <code class="literal">Session</code> &agrave; chacun de vos acc&egrave;s simples &agrave; la base de donn&eacute;es dans un m&ecirc;me thread! Bien s&ucirc;r, le m&ecirc;me raisonnement s'applique sur la
                  gestion des transactions &agrave; la base de donn&eacute;es. Les appels &agrave; la base de donn&eacute;es devraient &ecirc;tre faits en ordre et selon une
                  s&eacute;quence d&eacute;finie. Ils devraient &eacute;galement &ecirc;tre regroup&eacute;s en des unit&eacute;s de travail atomiques. (Notez que l?utilisation d?une
                  connexion auto-commit constitue le m&ecirc;me anti-pattern. Ce mode de fonctionnement existe pour les applications &eacute;mettant des
                  commandes SQL &agrave; partir d?une console. Hibernate d&eacute;sengage le mode auto-commit et s'attend &agrave; ce qu'un serveur d'applications
                  le fasse &eacute;galement.) Les transactions avec la base de donn&eacute;es ne sont jamais optionnelles, toute communication avec une base
                  de donn&eacute;es doit se d&eacute;rouler dans une transaction, peu importe si vous lisez ou &eacute;crivez des donn&eacute;es. Comme &eacute;voqu&eacute;, le comportement
                  auto-commit pour lire les donn&eacute;es devrait &ecirc;tre &eacute;vit&eacute;, puisque plusieurs petites transactions ne seront jamais aussi efficaces
                  qu'une seule plus grosse clairement d&eacute;finie comme unit&eacute; de travail. Ce dernier choix et en plus beaucoup plus facile a maintenir
                  et &agrave; faire &eacute;voluer. 
               </p>
               <p>The most common pattern in a multi-user client/server application is <span class="emphasis"><em>session-per-request</em></span>. In this model, a request from the client is sent to the server (where the Hibernate persistence layer runs), a new Hibernate
                  <code class="literal">Session</code> is opened, and all database operations are executed in this unit of work. Once the work has been completed (and the response
                  for the client has been prepared), the session is flushed and closed. You would also use a single database transaction to
                  serve the clients request, starting and committing it when you open and close the <code class="literal">Session</code>. The relationship between the two is one-to-one and this model is a perfect fit for many applications. 
               </p>
               <p>The challenge lies in the implementation. Hibernate provides built-in management of the "current session" to simplify this
                  pattern. All you have to do is start a transaction when a server request has to be processed, and end the transaction before
                  the response is sent to the client. You can do this in any way you like, common solutions are <code class="literal">ServletFilter</code>, AOP interceptor with a pointcut on the service methods, or a proxy/interception container. An EJB container is a standardized
                  way to implement cross-cutting aspects such as transaction demarcation on EJB session beans, declaratively with CMT. If you
                  decide to use programmatic transaction demarcation, prefer the Hibernate <code class="literal">Transaction</code> API shown later in this chapter, for ease of use and code portability. 
               </p>
               <p>Votre application peut acc&eacute;der la "session courante" pour ex&eacute;cuter une requ&ecirc;te en invoquant simplement <code class="literal">sessionFactory.getCurrentSession()</code> n'importe o&ugrave; et autant de fois que souhait&eacute;. Vous obtiendrez toujours une <code class="literal">Session</code> dont le scope est la transaction courante avec la base de donn&eacute;es. Ceci doit &ecirc;tre configur&eacute; soit dans les ressources local
                  ou dans l'environnement JTA, voir <a href="architecture-current-session.html" title="2.5.&nbsp;Sessions Contextuelles">Section&nbsp;2.5, &laquo;&nbsp;Sessions Contextuelles&nbsp;&raquo;</a>. 
               </p>
               <p>Il est parfois utile d'&eacute;tendre le scope d'une <code class="literal">Session</code> et d'une transaction &agrave; la base de donn&eacute;es jusqu'&agrave; ce que "la vue soit rendue". Ceci est particuli&egrave;rement utile dans des applications
                  &agrave; base de servlet qui utilisent une phase de rendue s&eacute;par&eacute;e une fois que la r&eacute;ponse a &eacute;t&eacute; pr&eacute;par&eacute;e. Etendre la transaction
                  avec la base de donn&eacute;es jusqu'&agrave; la fin du rendering de la vue est ais&eacute; si vous impl&eacute;mentez votre propre intercepteur. Cependant,
                  ce n'est pas facile si vous vous appuyez sur les EJBs avec CMT, puisqu'une transaction sera achev&eacute;e au retour de la m&eacute;thode
                  EJB, avant le rendu de la vue. Rendez vous sur le site Hibernate et sur le forum pour des astuces et des exemples sur le pattern
                  <span class="emphasis"><em>Open Session in View</em></span> pattern.. 
               </p>
            </div>
            <div class="sect2" lang="fr-FR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-apptx"></a>11.1.2.&nbsp;Longue conversation
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Le paradigme <span class="emphasis"><em>session-per-request</em></span> n'est pas le seul &eacute;l&eacute;ment &agrave; utiliser dans le design de vos unit&eacute;s de travail. Plusieurs processus d'affaire requi&egrave;rent toute
                  une s&eacute;rie d'interactions avec l'utilisateur, entrelac&eacute;es d'acc&egrave;s &agrave; la base de donn&eacute;e. Dans une application Web ou une application
                  d'entreprise, il serait inacceptable que la dur&eacute;e de vie d'une transaction s'&eacute;tale sur plusieurs interactions avec l'usager.
                  Consid&eacute;rez l'exemple suivant: 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>Un &eacute;cran s'affiche. Les donn&eacute;es vues par l'usager ont &eacute;t&eacute; charg&eacute;es dans l'instance d'un objet <code class="literal">Session</code> , dans le cadre d'une transaction de base de donn&eacute;es. L'usager est libre de modifier ces objets. 
                        </p>
                     </li>
                     <li>
                        <p>L'usager clique "Sauvegarder" apr&egrave;s 5 minutes et souhaite persister les modifications qu'il a apport&eacute;es. Il s'attend &agrave; &ecirc;tre
                           la seule personne a avoir modifi&eacute; ces donn&eacute;es et qu'aucune modification conflictuelle ne se soit produite durant ce laps de
                           temps. 
                        </p>
                     </li>
                  </ul>
               </div>
               <p>Ceci s'appelle une unit&eacute; de travail. Du point de vue de l'utilisateur: une <span class="emphasis"><em>conversation</em></span> (ou <span class="emphasis"><em>transaction d'application</em></span>). Il y a plusieurs fa&ccedil;on de mettre ceci en place dans votre application. 
               </p>
               <p>Une premi&egrave;re impl&eacute;mentation na&iuml;ve pourrait consister &agrave; garder la <code class="literal">Session</code> et la transaction &agrave; la base de donn&eacute;es ouvertes durant le temps de travail de l'usager, &agrave; maintenir les enregistrements verrouill&eacute;s
                  dans la base de donn&eacute;es afin d'&eacute;viter des modifications concurrentes et de maintenir l'isolation et l'atomicit&eacute; de la transaction
                  de l'usager. Ceci est un anti-pattern &agrave; &eacute;viter, puisque le verrouillage des enregistrements dans la base de donn&eacute;es ne permettrait
                  pas &agrave; l'application de g&eacute;rer un grand nombre d'usagers concurrents. 
               </p>
               <p>Clearly, we have to use several database transactions to implement the conversation. In this case, maintaining isolation of
                  business processes becomes the partial responsibility of the application tier. A single conversation usually spans several
                  database transactions. It will be atomic if only one of these database transactions (the last one) stores the updated data,
                  all others simply read data (e.g. in a wizard-style dialog spanning several request/response cycles). This is easier to implement
                  than it might sound, especially if you use Hibernate's features: 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p><span class="emphasis"><em>Automatic Versioning</em></span> - Hibernate can do automatic optimistic concurrency control for you, it can automatically detect if a concurrent modification
                           occurred during user think time. Usually we only check at the end of the conversation. 
                        </p>
                     </li>
                     <li>
                        <p><span class="emphasis"><em>Objets D&eacute;tach&eacute;s</em></span> - Si vous d&eacute;cidez d'utiliser le paradigme <span class="emphasis"><em>session-par-requ&ecirc;te</em></span> discut&eacute; plus haut, toutes les entit&eacute;s charg&eacute;es en m&eacute;moire deviendront des objets d&eacute;tach&eacute;s durant le temps de r&eacute;flexion de
                           l'usager. Hibernate vous permet de rattacher ces objets et de persister les modifications y ayant &eacute;t&eacute; apport&eacute;es. Ce pattern
                           est appel&eacute;: <span class="emphasis"><em>session-per- request-with-detached-objects</em></span> (litt&eacute;ralement: session- par-requ&ecirc;te-avec-objets-d&eacute;tach&eacute;s). Le versionnage automatique est utilis&eacute; afin d'isoler les modifications
                           concurrentes. 
                        </p>
                     </li>
                     <li>
                        <p><span class="emphasis"><em>Extended (or Long) Session</em></span> - The Hibernate <code class="literal">Session</code> may be disconnected from the underlying JDBC connection after the database transaction has been committed, and reconnected
                           when a new client request occurs. This pattern is known as <span class="emphasis"><em>session-per-conversation</em></span> and makes even reattachment unnecessary. Automatic versioning is used to isolate concurrent modifications and the <code class="literal">Session</code> is usually not allowed to be flushed automatically, but explicitly. 
                        </p>
                     </li>
                  </ul>
               </div>
               <p>Les deux patterns <span class="emphasis"><em>session-per-request-with- detached- objects</em></span> (session-par-requ&ecirc;te-avec-objets- d&eacute;tach&eacute;s) et <span class="emphasis"><em>session-per-conversation</em></span> (session-par-conversation) ont chacun leurs avantages et d&eacute;savantages qui seront expos&eacute;s dans ce m&ecirc;me chapitre, dans la section
                  au sujet du contr&ocirc;le optimiste de concurrence. 
               </p>
            </div>
            <div class="sect2" lang="fr-FR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-identity"></a>11.1.3.&nbsp;L'identit&eacute; des objets
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Une application peut acc&eacute;der &agrave; la m&ecirc;me entit&eacute; persistante de mani&egrave;re concurrente dans deux <code class="literal">Session</code> s diff&eacute;rentes. Toutefois, une instance d'une classe persistante n'est jamais partag&eacute;e par deux instances distinctes de la
                  classe <code class="literal">Session</code> . Il existe donc deux notions de l'identit&eacute; d'un objet: 
               </p>
               <div class="variablelist">
                  <dl>
                     <dt><span class="term">Identit&eacute; BD</span></dt>
                     <dd>
                        <p>
                                                       <code class="literal">foo.getId().equals( bar.getId() )</code>
                                                   
                        </p>
                     </dd>
                     <dt><span class="term">Identit&eacute; JVM</span></dt>
                     <dd>
                        <p>
                                                       <code class="literal">foo==bar</code>
                                                   
                        </p>
                     </dd>
                  </dl>
               </div>
               <p>Then for objects attached to a <span class="emphasis"><em>particular</em></span> <code class="literal">Session</code> (i.e. in the scope of a <code class="literal">Session</code>) the two notions are equivalent, and JVM identity for database identity is guaranteed by Hibernate. However, while the application
                  might concurrently access the "same" (persistent identity) business object in two different sessions, the two instances will
                  actually be "different" (JVM identity). Conflicts are resolved using (automatic versioning) at flush/commit time, using an
                  optimistic approach. 
               </p>
               <p>Cette approche permet de rel&eacute;guer &agrave; Hibernate et &agrave; la base de donn&eacute;es sous-jacente le soin de g&eacute;rer les probl&egrave;mes d'acc&egrave;s
                  concurrents. Cette mani&egrave;re de faire assure &eacute;galement une meilleure extensibilit&eacute; de l'application puisque assurer l'identit&eacute;
                  JVM dans un thread ne n&eacute;cessite pas de m&eacute;canismes de verrouillage co&ucirc;teux ou d'autres dispositifs de synchronisation. Une
                  application n'aura jamais le besoin de synchroniser des objets d'affaire tant qu'elle peut garantir qu'un seul thread aura
                  acc&egrave;s &agrave; une instance de <code class="literal">Session</code> . Dans le cadre d'ex&eacute;cution d'un objet <code class="literal">Session</code> , l'application peut utiliser en toute s&eacute;curit&eacute; <code class="literal">== </code> pour comparer des objets. 
               </p>
               <p>Une application qui utiliserait <code class="literal">==</code> &agrave; l'ext&eacute;rieur du cadre d'ex&eacute;cution d'une <code class="literal">Session</code> pourrait obtenir des r&eacute;sultats inattendus et causer certains effets de bords. Par exemple, si vous mettez 2 objets dans le
                  m&ecirc;me <code class="literal">Set</code> , ceux-ci pourraient avoir la m&ecirc;me identit&eacute; BD (i.e. ils repr&eacute;sentent le m&ecirc;me enregistrement), mais leur identit&eacute; JVM pourrait
                  &ecirc;tre diff&eacute;rente (elle ne peut, par d&eacute;finition, pas &ecirc;tre garantie sur deux objets d&eacute;tach&eacute;s). Le d&eacute;veloppeur doit donc red&eacute;finir
                  l'impl&eacute;mentation des m&eacute;thodes <code class="literal">equals()</code> et <code class="literal">hashcode()</code> dans les classes persistantes et y adjoindre sa propre notion d'identit&eacute;. Il existe toutefois une restriction: Il ne faut
                  jamais utiliser uniquement l'identifiant de la base de donn&eacute;es dans l'impl&eacute;mentation de l'&eacute;galit&eacute;; Il faut utiliser une cl&eacute;
                  d'affaire, g&eacute;n&eacute;ralement une combinaison de plusieurs attributs uniques, si possible immuables. Les identifiants de base de
                  donn&eacute;es vont changer si un objet transitoire (transient) devient persistant. Si une instance transitoire est contenue dans
                  un <code class="literal">Set</code> , changer le hashcode brisera le contrat du <code class="literal">Set</code> . Les attributs pour les cl&eacute;s d'affaire n'ont pas &agrave; &ecirc;tre aussi stables que des cl&eacute;s primaires de bases de donn&eacute;es. Il suffit
                  simplement qu'elles soient stables tant et aussi longtemps que les objets sont dans le m&ecirc;me <code class="literal">Set</code> . Veuillez consulter le site web Hibernate pour des discussions plus pointues &agrave; ce sujet. Notez que ce concept n'est pas
                  propre &agrave; Hibernate mais bien g&eacute;n&eacute;ral &agrave; l'impl&eacute;mentation de l'identit&eacute; et de l'&eacute;galit&eacute; en Java. 
               </p>
            </div>
            <div class="sect2" lang="fr-FR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-issues"></a>11.1.4.&nbsp;Probl&egrave;mes communs
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Bien qu'il puisse y avoir quelques rares exceptions &agrave; cette r&egrave;gle, il est recommand&eacute; de ne jamais utiliser les anti-patterns
                  <span class="emphasis"><em>session-per- user-session</em></span> et <span class="emphasis"><em>session-per-application</em></span> . Vous trouverez ici- bas quelques probl&egrave;mes que vous risquez de rencontrer si vous en faite l?utilisation. (Ces probl&egrave;mes
                  pourraient quand m&ecirc;me survenir avec des patterns recommand&eacute;s) Assurez-vous de bien comprendre les implications de chacun des
                  patterns avant de prendre votre d&eacute;cision. 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>L'objet <code class="literal">Session</code> n?est pas con&ccedil;u pour &ecirc;tre utilis&eacute; par de multiples threads. En cons&eacute;quence, les objets potentiellement multi-thread comme
                           les requ&ecirc;tes HTTP, les EJB Session et Swing Worker, risquent de provoquer des conditions de course dans la <code class="literal">Session</code> si celle-ci est partag&eacute;e. Dans un environnement web classique, il serait pr&eacute;f&eacute;rable de synchroniser les acc&egrave;s &agrave; la session
                           http afin d?&eacute;viter qu?un usager ne recharge une page assez rapidement pour que deux requ&ecirc;tes s?ex&eacute;cutant dans des threads
                           concurrents n?utilisent la m&ecirc;me <code class="literal">Session</code> . 
                        </p>
                     </li>
                     <li>
                        <p>Lorsque Hibernate lance une exception, le roll back de la transaction en cours doit &ecirc;tre effectu&eacute; et la <code class="literal">Session</code> doit &ecirc;tre imm&eacute;diatement ferm&eacute;e. (Ceci sera explor&eacute; plus tard dans le chapitre.) Si la <code class="literal">Session</code> est directement associ&eacute;e &agrave; une application, il faut arr&ecirc;ter l?application. Le roll back de la transaction ne remettra pas
                           les objets dans leur &eacute;tat du d&eacute;but de la transaction. Ainsi, ceux-ci pourraient &ecirc;tre d&eacute;synchronis&eacute;s d?avec les enregistrements.
                           (G&eacute;n&eacute;ralement, cela ne cause pas de r&eacute;els probl&egrave;mes puisque la plupart des exceptions sont non traitables et requi&egrave;rent la
                           reprise du processus d?affaire ayant &eacute;chou&eacute;.) 
                        </p>
                     </li>
                     <li>
                        <p>La <code class="literal">Session</code> met en m&eacute;moire cache tous les objets persistants (les objets surveill&eacute;s et dont l'&eacute;tat est g&eacute;r&eacute; par Hibernate.) Si la <code class="literal">Session</code> est ouverte ind&eacute;finiment ou si une trop grande quantit&eacute; d'objets y est charg&eacute;e, l?utilisation de la m&eacute;moire peut potentiellement
                           cro&icirc;tre jusqu?&agrave; atteindre le maximum allouable &agrave; l?application (java.lang.OutOfMemoryError.) Une solution &agrave; ce probl&egrave;me est
                           d?appeler les m&eacute;thodes <code class="literal">Session.clear()</code> et <code class="literal">Session.evict()</code> pour g&eacute;rer la m&eacute;moire cache de la <code class="literal">Session</code> . Vous pouvez &eacute;galement utiliser des stored procedures si vous devez lancer des traitements sur de grandes quantit&eacute;s d?informations.
                           Certaines solutions sont d&eacute;crites ici : <a href="batch.html" title="Chapitre&nbsp;13.&nbsp;Traitement par paquet">Chapitre&nbsp;13, <i xmlns:xlink="http://www.w3.org/1999/xlink">Traitement par paquet</i></a> . Garder une <code class="literal">Session</code> ouverte pour toute la dur&eacute;e d?une session usager augmente &eacute;galement consid&eacute;rablement le risque de travailler avec de l?information
                           p&eacute;rim&eacute;e. 
                        </p>
                     </li>
                  </ul>
               </div>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-metadata.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="transactions-demarcation.html">Suivant</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.12.&nbsp;Utilisation des m&eacute;ta-donn&eacute;es&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td>
               <td width="40%" align="right" valign="top">&nbsp;11.2.&nbsp;D&eacute;marcation des transactions</td>
            </tr>
         </table>
      </div>
   </body>
</html>