<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;&nbsp;19&nbsp;&#31456;&nbsp;&#25552;&#21319;&#24615;&#33021;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#31526;&#21512;Java&#20064;&#24815;&#30340;&#20851;&#31995;&#25968;&#25454;&#24211;&#25345;&#20037;&#21270;">
      <link rel="up" href="index.html" title="HIBERNATE - &#31526;&#21512;Java&#20064;&#24815;&#30340;&#20851;&#31995;&#25968;&#25454;&#24211;&#25345;&#20037;&#21270;">
      <link rel="prev" href="xml-manipulation.html" title="18.3.&nbsp;&#25805;&#20316;XML&#25968;&#25454;">
      <link rel="next" href="performance-cache.html" title="19.2.&nbsp;&#20108;&#32423;&#32531;&#23384;&#65288;The Second Level Cache&#65289;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;&nbsp;19&nbsp;&#31456;&nbsp;&#25552;&#21319;&#24615;&#33021;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="xml-manipulation.html">&#19978;&#19968;&#39029;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="performance-cache.html">&#19979;&#19968;&#39029;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="zh-CN">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="performance"></a>&#31532;&nbsp;19&nbsp;&#31456;&nbsp;&#25552;&#21319;&#24615;&#33021;
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect1" lang="zh-CN">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="performance-fetching"></a>19.1.&nbsp;&#25235;&#21462;&#31574;&#30053;(Fetching strategies)
                     </h2>
                  </div>
               </div>
            </div>
            <p><span class="emphasis"><em>&#25235;&#21462;&#31574;&#30053;&#65288;fetching strategy&#65289;</em></span> &#26159;&#25351;&#65306;&#24403;&#24212;&#29992;&#31243;&#24207;&#38656;&#35201;&#22312;&#65288;Hibernate&#23454;&#20307;&#23545;&#35937;&#22270;&#30340;&#65289;&#20851;&#32852;&#20851;&#31995;&#38388;&#36827;&#34892;&#23548;&#33322;&#30340;&#26102;&#20505;&#65292; Hibernate&#22914;&#20309;&#33719;&#21462;&#20851;&#32852;&#23545;&#35937;&#30340;&#31574;&#30053;&#12290;&#25235;&#21462;&#31574;&#30053;&#21487;&#20197;&#22312;O/R&#26144;&#23556;&#30340;&#20803;&#25968;&#25454;&#20013;&#22768;&#26126;&#65292;&#20063;&#21487;&#20197;&#22312;&#29305;&#23450;&#30340;HQL &#25110;<code class="literal">&#26465;&#20214;&#26597;&#35810;&#65288;Criteria Query&#65289;</code>&#20013;&#37325;&#36733;&#22768;&#26126;&#12290; 
            </p>
            <p>Hibernate3 &#23450;&#20041;&#20102;&#22914;&#19979;&#20960;&#31181;&#25235;&#21462;&#31574;&#30053;&#65306; </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p><span class="emphasis"><em>&#36830;&#25509;&#25235;&#21462;&#65288;Join fetching&#65289;</em></span> - Hibernate&#36890;&#36807; &#22312;<code class="literal">SELECT</code>&#35821;&#21477;&#20351;&#29992;<code class="literal">OUTER JOIN</code>&#65288;&#22806;&#36830;&#25509;&#65289;&#26469; &#33719;&#24471;&#23545;&#35937;&#30340;&#20851;&#32852;&#23454;&#20363;&#25110;&#32773;&#20851;&#32852;&#38598;&#21512;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#26597;&#35810;&#25235;&#21462;&#65288;Select fetching&#65289;</em></span> - &#21478;&#22806;&#21457;&#36865;&#19968;&#26465; <code class="literal">SELECT</code> &#35821;&#21477;&#25235;&#21462;&#24403;&#21069;&#23545;&#35937;&#30340;&#20851;&#32852;&#23454;&#20307;&#25110;&#38598;&#21512;&#12290;&#38500;&#38750;&#20320;&#26174;&#24335;&#30340;&#25351;&#23450;<code class="literal">lazy="false"</code>&#31105;&#27490; &#24310;&#36831;&#25235;&#21462;&#65288;lazy fetching&#65289;&#65292;&#21542;&#21017;&#21482;&#26377;&#24403;&#20320;&#30495;&#27491;&#35775;&#38382;&#20851;&#32852;&#20851;&#31995;&#30340;&#26102;&#20505;&#65292;&#25165;&#20250;&#25191;&#34892;&#31532;&#20108;&#26465;select&#35821;&#21477;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#23376;&#26597;&#35810;&#25235;&#21462;&#65288;Subselect fetching&#65289;</em></span> - &#21478;&#22806;&#21457;&#36865;&#19968;&#26465;<code class="literal">SELECT</code> &#35821;&#21477;&#25235;&#21462;&#22312;&#21069;&#38754;&#26597;&#35810;&#21040;&#65288;&#25110;&#32773;&#25235;&#21462;&#21040;&#65289;&#30340;&#25152;&#26377;&#23454;&#20307;&#23545;&#35937;&#30340;&#20851;&#32852;&#38598;&#21512;&#12290;&#38500;&#38750;&#20320;&#26174;&#24335;&#30340;&#25351;&#23450;<code class="literal">lazy="false"</code> &#31105;&#27490;&#24310;&#36831;&#25235;&#21462;&#65288;lazy fetching&#65289;&#65292;&#21542;&#21017;&#21482;&#26377;&#24403;&#20320;&#30495;&#27491;&#35775;&#38382;&#20851;&#32852;&#20851;&#31995;&#30340;&#26102;&#20505;&#65292;&#25165;&#20250;&#25191;&#34892;&#31532;&#20108;&#26465;select&#35821;&#21477;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#25209;&#37327;&#25235;&#21462;&#65288;Batch fetching&#65289;</em></span> - &#23545;&#26597;&#35810;&#25235;&#21462;&#30340;&#20248;&#21270;&#26041;&#26696;&#65292; &#36890;&#36807;&#25351;&#23450;&#19968;&#20010;&#20027;&#38190;&#25110;&#22806;&#38190;&#21015;&#34920;&#65292;Hibernate&#20351;&#29992;&#21333;&#26465;<code class="literal">SELECT</code>&#35821;&#21477;&#33719;&#21462;&#19968;&#25209;&#23545;&#35937;&#23454;&#20363;&#25110;&#38598;&#21512;&#12290; 
                     </p>
                  </li>
               </ul>
            </div>
            <p>Hibernate&#20250;&#21306;&#20998;&#19979;&#21015;&#21508;&#31181;&#24773;&#20917;&#65306; </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p><span class="emphasis"><em>Immediate fetching&#65292;&#31435;&#21363;&#25235;&#21462;</em></span> - &#24403;&#23487;&#20027;&#34987;&#21152;&#36733;&#26102;&#65292;&#20851;&#32852;&#12289;&#38598;&#21512;&#25110;&#23646;&#24615;&#34987;&#31435;&#21363;&#25235;&#21462;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Lazy collection fetching&#65292;&#24310;&#36831;&#38598;&#21512;&#25235;&#21462;</em></span>- &#30452;&#21040;&#24212;&#29992;&#31243;&#24207;&#23545;&#38598;&#21512;&#36827;&#34892;&#20102;&#19968;&#27425;&#25805;&#20316;&#26102;&#65292;&#38598;&#21512;&#25165;&#34987;&#25235;&#21462;&#12290;&#65288;&#23545;&#38598;&#21512;&#32780;&#35328;&#36825;&#26159;&#40664;&#35748;&#34892;&#20026;&#12290;&#65289; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>"Extra-lazy" collection fetching,"Extra-lazy"&#38598;&#21512;&#25235;&#21462;</em></span> -&#23545;&#38598;&#21512;&#31867;&#20013;&#30340;&#27599;&#20010;&#20803;&#32032;&#32780;&#35328;&#65292;&#37117;&#26159;&#30452;&#21040;&#38656;&#35201;&#26102;&#25165;&#21435;&#35775;&#38382;&#25968;&#25454;&#24211;&#12290;&#38500;&#38750;&#32477;&#23545;&#24517;&#35201;&#65292;Hibernate&#19981;&#20250;&#35797;&#22270;&#21435;&#25226;&#25972;&#20010;&#38598;&#21512;&#37117;&#25235;&#21462;&#21040;&#20869;&#23384;&#37324;&#26469;&#65288;&#36866;&#29992;&#20110;&#38750;&#24120;&#22823;&#30340;&#38598;&#21512;&#65289;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Proxy fetching&#65292;&#20195;&#29702;&#25235;&#21462;</em></span> - &#23545;&#36820;&#22238;&#21333;&#20540;&#30340;&#20851;&#32852;&#32780;&#35328;&#65292;&#24403;&#20854;&#26576;&#20010;&#26041;&#27861;&#34987;&#35843;&#29992;&#65292;&#32780;&#38750;&#23545;&#20854;&#20851;&#38190;&#23383;&#36827;&#34892;get&#25805;&#20316;&#26102;&#25165;&#25235;&#21462;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>"No-proxy" fetching,&#38750;&#20195;&#29702;&#25235;&#21462;</em></span> - &#23545;&#36820;&#22238;&#21333;&#20540;&#30340;&#20851;&#32852;&#32780;&#35328;&#65292;&#24403;&#23454;&#20363;&#21464;&#37327;&#34987;&#35775;&#38382;&#30340;&#26102;&#20505;&#36827;&#34892;&#25235;&#21462;&#12290;&#19982;&#19978;&#38754;&#30340;&#20195;&#29702;&#25235;&#21462;&#30456;&#27604;&#65292;&#36825;&#31181;&#26041;&#27861;&#27809;&#26377;&#37027;&#20040;&#8220;&#24310;&#36831;&#8221;&#24471;&#21385;&#23475;(&#23601;&#31639;&#21482;&#35775;&#38382;&#26631;&#35782;&#31526;&#65292;&#20063;&#20250;&#23548;&#33268;&#20851;&#32852;&#25235;&#21462;)&#20294;&#26159;&#26356;&#21152;&#36879;&#26126;&#65292;&#22240;&#20026;&#23545;&#24212;&#29992;&#31243;&#24207;&#26469;&#35828;&#65292;&#19981;&#20877;&#30475;&#21040;proxy&#12290;&#36825;&#31181;&#26041;&#27861;&#38656;&#35201;&#22312;&#32534;&#35793;&#26399;&#38388;&#36827;&#34892;&#23383;&#33410;&#30721;&#22686;&#24378;&#25805;&#20316;&#65292;&#22240;&#27492;&#24456;&#23569;&#38656;&#35201;&#29992;&#21040;&#12290;
                        
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Lazy attribute fetching&#65292;&#23646;&#24615;&#24310;&#36831;&#21152;&#36733;</em></span> - &#23545;&#23646;&#24615;&#25110;&#36820;&#22238;&#21333;&#20540;&#30340;&#20851;&#32852;&#32780;&#35328;&#65292;&#24403;&#20854;&#23454;&#20363;&#21464;&#37327;&#34987;&#35775;&#38382;&#30340;&#26102;&#20505;&#36827;&#34892;&#25235;&#21462;&#12290;&#38656;&#35201;&#32534;&#35793;&#26399;&#23383;&#33410;&#30721;&#24378;&#21270;&#65292;&#22240;&#27492;&#36825;&#19968;&#26041;&#27861;&#24456;&#23569;&#26159;&#24517;&#35201;&#30340;&#12290; 
                     </p>
                  </li>
               </ul>
            </div>
            <p>&#36825;&#37324;&#26377;&#20004;&#20010;&#27491;&#20132;&#30340;&#27010;&#24565;&#65306;&#20851;&#32852;<span class="emphasis"><em>&#20309;&#26102;</em></span>&#34987;&#25235;&#21462;&#65292;&#20197;&#21450;&#34987;<span class="emphasis"><em>&#22914;&#20309;</em></span>&#25235;&#21462;&#65288;&#20250;&#37319;&#29992;&#20160;&#20040;&#26679;&#30340;SQL&#35821;&#21477;&#65289;&#12290;&#19981;&#35201;&#28151;&#28102;&#23427;&#20204;&#65281;&#25105;&#20204;&#20351;&#29992;<code class="literal">&#25235;&#21462;</code>&#26469;&#25913;&#21892;&#24615;&#33021;&#12290;&#25105;&#20204;&#20351;&#29992;<code class="literal">&#24310;&#36831;</code>&#26469;&#23450;&#20041;&#19968;&#20123;&#22865;&#32422;&#65292;&#23545;&#26576;&#29305;&#23450;&#31867;&#30340;&#26576;&#20010;&#33073;&#31649;&#30340;&#23454;&#20363;&#65292;&#30693;&#36947;&#26377;&#21738;&#20123;&#25968;&#25454;&#26159;&#21487;&#20197;&#20351;&#29992;&#30340;&#12290; 
            </p>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-lazy"></a>19.1.1.&nbsp;&#25805;&#20316;&#24310;&#36831;&#21152;&#36733;&#30340;&#20851;&#32852;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;Hibernate 3&#23545;&#38598;&#21512;&#20351;&#29992;&#24310;&#36831;select&#25235;&#21462;&#65292;&#23545;&#36820;&#22238;&#21333;&#20540;&#30340;&#20851;&#32852;&#20351;&#29992;&#24310;&#36831;&#20195;&#29702;&#25235;&#21462;&#12290;&#23545;&#20960;&#20046;&#26159;&#25152;&#26377;&#30340;&#24212;&#29992;&#32780;&#35328;&#65292;&#20854;&#32477;&#22823;&#22810;&#25968;&#30340;&#20851;&#32852;&#65292;&#36825;&#31181;&#31574;&#30053;&#37117;&#26159;&#26377;&#25928;&#30340;&#12290; </p>
               <p><span class="emphasis"><em>&#27880;&#24847;:</em></span>&#20551;&#33509;&#20320;&#35774;&#32622;&#20102;<code class="literal">hibernate.default_batch_fetch_size</code>,Hibernate&#20250;&#23545;&#24310;&#36831;&#21152;&#36733;&#37319;&#21462;&#25209;&#37327;&#25235;&#21462;&#20248;&#21270;&#25514;&#26045;&#65288;&#36825;&#31181;&#20248;&#21270;&#20063;&#21487;&#33021;&#20250;&#22312;&#26356;&#32454;&#21270;&#30340;&#32423;&#21035;&#25171;&#24320;&#65289;&#12290; 
               </p>
               <p>&#28982;&#32780;&#65292;&#20320;&#24517;&#39035;&#20102;&#35299;&#24310;&#36831;&#25235;&#21462;&#24102;&#26469;&#30340;&#19968;&#20010;&#38382;&#39064;&#12290;&#22312;&#19968;&#20010;&#25171;&#24320;&#30340;Hibernate session&#19978;&#19979;&#25991;&#20043;&#22806;&#35843;&#29992;&#24310;&#36831;&#38598;&#21512;&#20250;&#23548;&#33268;&#19968;&#27425;&#24847;&#22806;&#12290;&#27604;&#22914;&#65306; </p><pre class="programlisting">s = sessions.openSession();
Transaction tx = s.beginTransaction();
            
User u = (User) s.createQuery("from User u where u.name=:userName")
    .setString("userName", userName).uniqueResult();
Map permissions = u.getPermissions();

tx.commit();
s.close();

Integer accessLevel = (Integer) permissions.get("accounts");  // Error!</pre><p>&#22312;<code class="literal">Session</code>&#20851;&#38381;&#21518;&#65292;permessions&#38598;&#21512;&#23558;&#26159;&#26410;&#23454;&#20363;&#21270;&#30340;&#12289;&#19981;&#20877;&#21487;&#29992;&#65292;&#22240;&#27492;&#26080;&#27861;&#27491;&#24120;&#36733;&#20837;&#20854;&#29366;&#24577;&#12290; <span class="emphasis"><em>Hibernate&#23545;&#33073;&#31649;&#23545;&#35937;&#19981;&#25903;&#25345;&#24310;&#36831;&#23454;&#20363;&#21270;</em></span>. &#36825;&#37324;&#30340;&#20462;&#25913;&#26041;&#27861;&#26159;&#65306;&#23558;permissions&#35835;&#21462;&#25968;&#25454;&#30340;&#20195;&#30721; &#31227;&#21040;tx.commit()&#20043;&#21069;&#12290; 
               </p>
               <p>&#38500;&#27492;&#20043;&#22806;&#65292;&#36890;&#36807;&#23545;&#20851;&#32852;&#26144;&#23556;&#25351;&#23450;<code class="literal">lazy="false"</code>,&#25105;&#20204;&#20063;&#21487;&#20197;&#20351;&#29992;&#38750;&#24310;&#36831;&#30340;&#38598;&#21512;&#25110;&#20851;&#32852;&#12290;&#20294;&#26159;&#65292; &#23545;&#32477;&#22823;&#37096;&#20998;&#38598;&#21512;&#26469;&#35828;&#65292;&#26356;&#25512;&#33616;&#20351;&#29992;&#24310;&#36831;&#26041;&#24335;&#25235;&#21462;&#25968;&#25454;&#12290;&#22914;&#26524;&#22312;&#20320;&#30340;&#23545;&#35937;&#27169;&#22411;&#20013;&#23450;&#20041;&#20102;&#22826;&#22810;&#30340;&#38750;&#24310;&#36831;&#20851;&#32852;&#65292;Hibernate&#26368;&#32456;&#20960;&#20046;&#38656;&#35201;&#22312;&#27599;&#20010;&#20107;&#21153;&#20013;&#36733;&#20837;&#25972;&#20010;&#25968;&#25454;&#24211;&#21040;&#20869;&#23384;&#20013;&#65281; 
               </p>
               <p>&#20294;&#26159;&#65292;&#21478;&#19968;&#26041;&#38754;&#65292;&#22312;&#19968;&#20123;&#29305;&#27530;&#30340;&#20107;&#21153;&#20013;&#65292;&#25105;&#20204;&#20063;&#32463;&#24120;&#38656;&#35201;&#20351;&#29992;&#21040;&#36830;&#25509;&#25235;&#21462;&#65288;&#23427;&#26412;&#36523;&#19978;&#23601;&#26159;&#38750;&#24310;&#36831;&#30340;&#65289;&#65292;&#20197;&#20195;&#26367;&#26597;&#35810;&#25235;&#21462;&#12290; &#19979;&#38754;&#25105;&#20204;&#23558;&#20250;&#24456;&#24555;&#26126;&#30333;&#22914;&#20309;&#20855;&#20307;&#30340;&#23450;&#21046;Hibernate&#20013;&#30340;&#25235;&#21462;&#31574;&#30053;&#12290;&#22312;Hibernate3&#20013;&#65292;&#20855;&#20307;&#36873;&#25321;&#21738;&#31181;&#25235;&#21462;&#31574;&#30053;&#30340;&#26426;&#21046;&#26159;&#21644;&#36873;&#25321; &#21333;&#20540;&#20851;&#32852;&#25110;&#38598;&#21512;&#20851;&#32852;&#30456;&#19968;&#33268;&#30340;&#12290;
                  
               </p>
            </div>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-custom"></a>19.1.2.&nbsp;&#35843;&#25972;&#25235;&#21462;&#31574;&#30053;&#65288;Tuning fetch strategies&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#26597;&#35810;&#25235;&#21462;&#65288;&#40664;&#35748;&#30340;&#65289;&#22312;N+1&#26597;&#35810;&#30340;&#24773;&#20917;&#19979;&#26159;&#26497;&#20854;&#33030;&#24369;&#30340;&#65292;&#22240;&#27492;&#25105;&#20204;&#21487;&#33021;&#20250;&#35201;&#27714;&#22312;&#26144;&#23556;&#25991;&#26723;&#20013;&#23450;&#20041;&#20351;&#29992;&#36830;&#25509;&#25235;&#21462;&#65306; </p><pre class="programlisting">&lt;set name="permissions" 
            fetch="join"&gt;
    &lt;key column="userId"/&gt;
    &lt;one-to-many class="Permission"/&gt;
&lt;/set</pre><pre class="programlisting">&lt;many-to-one name="mother" class="Cat" fetch="join"/&gt;</pre><p>&#22312;&#26144;&#23556;&#25991;&#26723;&#20013;&#23450;&#20041;&#30340;<code class="literal">&#25235;&#21462;</code>&#31574;&#30053;&#23558;&#20250;&#23545;&#20197;&#19979;&#21015;&#34920;&#26465;&#30446;&#20135;&#29983;&#24433;&#21709;&#65306; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>&#36890;&#36807;<code class="literal">get()</code>&#25110;<code class="literal">load()</code>&#26041;&#27861;&#21462;&#24471;&#25968;&#25454;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>&#21482;&#26377;&#22312;&#20851;&#32852;&#20043;&#38388;&#36827;&#34892;&#23548;&#33322;&#26102;&#65292;&#25165;&#20250;&#38544;&#24335;&#30340;&#21462;&#24471;&#25968;&#25454;&#12290; </p>
                     </li>
                     <li>
                        <p>&#26465;&#20214;&#26597;&#35810; </p>
                     </li>
                     <li>
                        <p>&#20351;&#29992;&#20102;<code class="literal">subselect</code>&#25235;&#21462;&#30340;HQL&#26597;&#35810; 
                        </p>
                     </li>
                  </ul>
               </div>
               <p>&#19981;&#31649;&#20320;&#20351;&#29992;&#21738;&#31181;&#25235;&#21462;&#31574;&#30053;&#65292;&#23450;&#20041;&#20026;&#38750;&#24310;&#36831;&#30340;&#31867;&#22270;&#20250;&#34987;&#20445;&#35777;&#19968;&#23450;&#35013;&#36733;&#20837;&#20869;&#23384;&#12290;&#27880;&#24847;&#36825;&#21487;&#33021;&#24847;&#21619;&#30528;&#22312;&#19968;&#26465;HQL&#26597;&#35810;&#21518;&#32039;&#36319;&#30528;&#19968;&#31995;&#21015;&#30340;&#26597;&#35810;&#12290; </p>
               <p>&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#24182;&#19981;&#20351;&#29992;&#26144;&#23556;&#25991;&#26723;&#36827;&#34892;&#25235;&#21462;&#31574;&#30053;&#30340;&#23450;&#21046;&#12290;&#26356;&#22810;&#30340;&#26159;&#65292;&#20445;&#25345;&#20854;&#40664;&#35748;&#20540;&#65292;&#28982;&#21518;&#22312;&#29305;&#23450;&#30340;&#20107;&#21153;&#20013;&#65292; &#20351;&#29992;HQL&#30340;<code class="literal">&#24038;&#36830;&#25509;&#25235;&#21462;&#65288;left join fetch&#65289;</code> &#23545;&#20854;&#36827;&#34892;&#37325;&#36733;&#12290;&#36825;&#23558;&#36890;&#30693; Hibernate&#22312;&#31532;&#19968;&#27425;&#26597;&#35810;&#20013;&#20351;&#29992;&#22806;&#37096;&#20851;&#32852;&#65288;outer join&#65289;&#65292;&#30452;&#25509;&#24471;&#21040;&#20854;&#20851;&#32852;&#25968;&#25454;&#12290; &#22312;<code class="literal">&#26465;&#20214;&#26597;&#35810;</code> API&#20013;&#65292;&#24212;&#35813;&#35843;&#29992; <code class="literal">setFetchMode(FetchMode.JOIN)</code>&#35821;&#21477;&#12290; 
               </p>
               <p>&#20063;&#35768;&#20320;&#21916;&#27426;&#20165;&#20165;&#36890;&#36807;&#26465;&#20214;&#26597;&#35810;&#65292;&#23601;&#21487;&#20197;&#25913;&#21464;<code class="literal">get()</code> &#25110; <code class="literal">load()</code>&#35821;&#21477;&#20013;&#30340;&#25968;&#25454;&#25235;&#21462;&#31574;&#30053;&#12290;&#20363;&#22914;&#65306; 
               </p><pre class="programlisting">User user = (User) session.createCriteria(User.class)
                .setFetchMode("permissions", FetchMode.JOIN)
                .add( Restrictions.idEq(userId) )
                .uniqueResult();</pre><p>&#65288;&#36825;&#23601;&#26159;&#20854;&#20182;ORM&#35299;&#20915;&#26041;&#26696;&#30340;&#8220;&#25235;&#21462;&#35745;&#21010;(fetch plan)&#8221;&#22312;Hibernate&#20013;&#30340;&#31561;&#20215;&#29289;&#12290;&#65289; </p>
               <p>&#25130;&#28982;&#19981;&#21516;&#30340;&#19968;&#31181;&#36991;&#20813;N+1&#27425;&#26597;&#35810;&#30340;&#26041;&#27861;&#26159;&#65292;&#20351;&#29992;&#20108;&#32423;&#32531;&#23384;&#12290; </p>
            </div>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-proxies"></a>19.1.3.&nbsp;&#21333;&#31471;&#20851;&#32852;&#20195;&#29702;&#65288;Single-ended association proxies&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#22312;Hinerbate&#20013;&#65292;&#23545;&#38598;&#21512;&#30340;&#24310;&#36831;&#25235;&#21462;&#30340;&#37319;&#29992;&#20102;&#33258;&#24049;&#30340;&#23454;&#29616;&#26041;&#27861;&#12290;&#20294;&#26159;&#65292;&#23545;&#20110;&#21333;&#31471;&#20851;&#32852;&#30340;&#24310;&#36831;&#25235;&#21462;&#65292;&#21017;&#38656;&#35201;&#37319;&#29992; &#20854;&#20182;&#19981;&#21516;&#30340;&#26426;&#21046;&#12290;&#21333;&#31471;&#20851;&#32852;&#30340;&#30446;&#26631;&#23454;&#20307;&#24517;&#39035;&#20351;&#29992;&#20195;&#29702;&#65292;Hihernate&#22312;&#36816;&#34892;&#26399;&#20108;&#36827;&#21046;&#32423;&#65288;&#36890;&#36807;&#20248;&#24322;&#30340;CGLIB&#24211;&#65289;&#65292; &#20026;&#25345;&#20037;&#23545;&#35937;&#23454;&#29616;&#20102;&#24310;&#36831;&#36733;&#20837;&#20195;&#29702;&#12290;
                  
               </p>
               <p>&#40664;&#35748;&#30340;&#65292;Hibernate3&#23558;&#20250;&#20026;&#25152;&#26377;&#30340;&#25345;&#20037;&#23545;&#35937;&#20135;&#29983;&#20195;&#29702;&#65288;&#22312;&#21551;&#21160;&#38454;&#27573;&#65289;&#65292;&#28982;&#21518;&#20351;&#29992;&#20182;&#20204;&#23454;&#29616; <code class="literal">&#22810;&#23545;&#19968;&#65288;many-to-one&#65289;</code>&#20851;&#32852;&#21644;<code class="literal">&#19968;&#23545;&#19968;&#65288;one-to-one&#65289;</code> &#20851;&#32852;&#30340;&#24310;&#36831;&#25235;&#21462;&#12290; 
               </p>
               <p>&#22312;&#26144;&#23556;&#25991;&#20214;&#20013;&#65292;&#21487;&#20197;&#36890;&#36807;&#35774;&#32622;<code class="literal">proxy</code>&#23646;&#24615;&#20026;&#30446;&#26631;class&#22768;&#26126;&#19968;&#20010;&#25509;&#21475;&#20379;&#20195;&#29702;&#25509;&#21475;&#20351;&#29992;&#12290; &#40664;&#35748;&#30340;&#65292;Hibernate&#23558;&#20250;&#20351;&#29992;&#35813;&#31867;&#30340;&#19968;&#20010;&#23376;&#31867;&#12290; <span class="emphasis"><em>&#27880;&#24847;&#65306;&#34987;&#20195;&#29702;&#30340;&#31867;&#24517;&#39035;&#23454;&#29616;&#19968;&#20010;&#33267;&#23569;&#21253;&#21487;&#35265;&#30340;&#40664;&#35748;&#26500;&#36896;&#20989;&#25968;&#65292;&#25105;&#20204;&#24314;&#35758;&#25152;&#26377;&#30340;&#25345;&#20037;&#31867;&#37117;&#24212;&#25317;&#26377;&#36825;&#26679;&#30340;&#26500;&#36896;&#20989;&#25968;</em></span> 
               </p>
               <p>&#22312;&#22914;&#27492;&#26041;&#24335;&#23450;&#20041;&#19968;&#20010;&#22810;&#24577;&#31867;&#30340;&#26102;&#20505;&#65292;&#26377;&#35768;&#22810;&#20540;&#24471;&#27880;&#24847;&#30340;&#24120;&#35265;&#24615;&#30340;&#38382;&#39064;&#65292;&#20363;&#22914;&#65306; </p><pre class="programlisting">&lt;class name="Cat" proxy="Cat"&gt;
    ......
    &lt;subclass name="DomesticCat"&gt;
        .....
    &lt;/subclass&gt;
&lt;/class&gt;</pre><p>&#39318;&#20808;&#65292;<code class="literal">Cat</code>&#23454;&#20363;&#27704;&#36828;&#19981;&#21487;&#20197;&#34987;&#24378;&#21046;&#36716;&#25442;&#20026;<code class="literal">DomesticCat</code>, &#21363;&#20351;&#23427;&#26412;&#36523;&#23601;&#26159;<code class="literal">DomesticCat</code>&#23454;&#20363;&#12290; 
               </p><pre class="programlisting">Cat cat = (Cat) session.load(Cat.class, id);  // instantiate a proxy (does not hit the db)
if ( cat.isDomesticCat() ) {                  // hit the db to initialize the proxy
    DomesticCat dc = (DomesticCat) cat;       // Error!
    ....
}</pre><p>&#20854;&#27425;&#65292;&#20195;&#29702;&#30340;&#8220;<code class="literal">==</code>&#8221;&#21487;&#33021;&#19981;&#20877;&#25104;&#31435;&#12290; 
               </p><pre class="programlisting">Cat cat = (Cat) session.load(Cat.class, id);            // instantiate a Cat proxy
DomesticCat dc = 
        (DomesticCat) session.load(DomesticCat.class, id);  // acquire new DomesticCat proxy!
System.out.println(cat==dc);                            // false</pre><p>&#34429;&#28982;&#22914;&#27492;&#65292;&#20294;&#23454;&#38469;&#24773;&#20917;&#24182;&#27809;&#26377;&#30475;&#19978;&#21435;&#37027;&#20040;&#31967;&#31957;&#12290;&#34429;&#28982;&#25105;&#20204;&#29616;&#22312;&#26377;&#20004;&#20010;&#19981;&#21516;&#30340;&#24341;&#29992;&#65292;&#20998;&#21035;&#25351;&#21521;&#36825;&#20004;&#20010;&#19981;&#21516;&#30340;&#20195;&#29702;&#23545;&#35937;&#65292; &#20294;&#23454;&#38469;&#19978;&#65292;&#20854;&#24213;&#23618;&#24212;&#35813;&#26159;&#21516;&#19968;&#20010;&#23454;&#20363;&#23545;&#35937;&#65306; </p><pre class="programlisting">cat.setWeight(11.0);  // hit the db to initialize the proxy
System.out.println( dc.getWeight() );  // 11.0</pre><p>&#31532;&#19977;&#65292;&#20320;&#19981;&#33021;&#23545;&#8220;final&#31867;&#8221;&#25110;&#8220;&#20855;&#26377;final&#26041;&#27861;&#30340;&#31867;&#8221;&#20351;&#29992;CGLIB&#20195;&#29702;&#12290; </p>
               <p>&#26368;&#21518;&#65292;&#22914;&#26524;&#20320;&#30340;&#25345;&#20037;&#21270;&#23545;&#35937;&#22312;&#23454;&#20363;&#21270;&#26102;&#38656;&#35201;&#26576;&#20123;&#36164;&#28304;&#65288;&#20363;&#22914;&#65292;&#22312;&#23454;&#20363;&#21270;&#26041;&#27861;&#12289;&#40664;&#35748;&#26500;&#36896;&#26041;&#27861;&#20013;&#65289;&#65292; &#37027;&#20040;&#20195;&#29702;&#23545;&#35937;&#20063;&#21516;&#26679;&#38656;&#35201;&#20351;&#29992;&#36825;&#20123;&#36164;&#28304;&#12290;&#23454;&#38469;&#19978;&#65292;&#20195;&#29702;&#31867;&#26159;&#25345;&#20037;&#21270;&#31867;&#30340;&#23376;&#31867;&#12290; </p>
               <p>&#36825;&#20123;&#38382;&#39064;&#37117;&#28304;&#20110;Java&#30340;&#21333;&#26681;&#32487;&#25215;&#27169;&#22411;&#30340;&#22825;&#29983;&#38480;&#21046;&#12290;&#22914;&#26524;&#20320;&#24076;&#26395;&#36991;&#20813;&#36825;&#20123;&#38382;&#39064;&#65292;&#37027;&#20040;&#20320;&#30340;&#27599;&#20010;&#25345;&#20037;&#21270;&#31867;&#24517;&#39035;&#23454;&#29616;&#19968;&#20010;&#25509;&#21475;&#65292; &#22312;&#27492;&#25509;&#21475;&#20013;&#24050;&#32463;&#22768;&#26126;&#20102;&#20854;&#19994;&#21153;&#26041;&#27861;&#12290;&#28982;&#21518;&#65292;&#20320;&#38656;&#35201;&#22312;&#26144;&#23556;&#25991;&#26723;&#20013;&#20877;&#25351;&#23450;&#36825;&#20123;&#25509;&#21475;&#12290;&#20363;&#22914;&#65306; </p><pre class="programlisting">&lt;class name="CatImpl" proxy="Cat"&gt;
    ......
    &lt;subclass name="DomesticCatImpl" proxy="DomesticCat"&gt;
        .....
    &lt;/subclass&gt;
&lt;/class&gt;</pre><p>&#36825;&#37324;<code class="literal">CatImpl</code>&#23454;&#29616;&#20102;<code class="literal">Cat</code>&#25509;&#21475;&#65292; <code class="literal">DomesticCatImpl</code>&#23454;&#29616;<code class="literal">DomesticCat</code>&#25509;&#21475;&#12290; &#22312;<code class="literal">load()</code>&#12289;<code class="literal">iterate()</code>&#26041;&#27861;&#20013;&#23601;&#20250;&#36820;&#22238; <code class="literal">Cat</code>&#21644;<code class="literal">DomesticCat</code>&#30340;&#20195;&#29702;&#23545;&#35937;&#12290; (&#27880;&#24847;<code class="literal">list()</code>&#24182;&#19981;&#20250;&#36820;&#22238;&#20195;&#29702;&#23545;&#35937;&#12290;) 
               </p><pre class="programlisting">Cat cat = (Cat) session.load(CatImpl.class, catid);
Iterator iter = session.createQuery("from CatImpl as cat where cat.name='fritz'").iterate();
Cat fritz = (Cat) iter.next();</pre><p>&#36825;&#37324;&#65292;&#23545;&#35937;&#20043;&#38388;&#30340;&#20851;&#31995;&#20063;&#23558;&#34987;&#24310;&#36831;&#36733;&#20837;&#12290;&#36825;&#23601;&#24847;&#21619;&#30528;&#65292;&#20320;&#24212;&#35813;&#23558;&#23646;&#24615;&#22768;&#26126;&#20026;<code class="literal">Cat</code>&#65292;&#32780;&#19981;&#26159;<code class="literal">CatImpl</code>&#12290; 
               </p>
               <p>&#20294;&#26159;&#65292;&#22312;&#26377;&#20123;&#26041;&#27861;&#20013;&#26159;<span class="emphasis"><em>&#19981;&#38656;&#35201;</em></span>&#20351;&#29992;&#20195;&#29702;&#30340;&#12290;&#20363;&#22914;&#65306; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc" compact>
                     <li>
                        <p><code class="literal">equals()</code>&#26041;&#27861;&#65292;&#22914;&#26524;&#25345;&#20037;&#31867;&#27809;&#26377;&#37325;&#36733;<code class="literal">equals()</code>&#26041;&#27861;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p><code class="literal">hashCode()</code>&#26041;&#27861;&#65292;&#22914;&#26524;&#25345;&#20037;&#31867;&#27809;&#26377;&#37325;&#36733;<code class="literal">hashCode()</code>&#26041;&#27861;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>&#26631;&#24535;&#31526;&#30340;getter&#26041;&#27861;&#12290; </p>
                     </li>
                  </ul>
               </div>
               <p>Hibernate&#23558;&#20250;&#35782;&#21035;&#20986;&#37027;&#20123;&#37325;&#36733;&#20102;<code class="literal">equals()</code>&#12289;&#25110;<code class="literal">hashCode()</code>&#26041;&#27861;&#30340;&#25345;&#20037;&#21270;&#31867;&#12290; 
               </p>
               <p>&#33509;&#36873;&#25321;<code class="literal">lazy="no-proxy"</code>&#32780;&#38750;&#40664;&#35748;&#30340;<code class="literal">lazy="proxy"</code>&#65292;&#25105;&#20204;&#21487;&#20197;&#36991;&#20813;&#31867;&#22411;&#36716;&#25442;&#24102;&#26469;&#30340;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292;&#36825;&#26679;&#25105;&#20204;&#23601;&#38656;&#35201;&#32534;&#35793;&#26399;&#23383;&#33410;&#30721;&#22686;&#24378;&#65292;&#24182;&#19988;&#25152;&#26377;&#30340;&#25805;&#20316;&#37117;&#20250;&#23548;&#33268;&#31435;&#21051;&#36827;&#34892;&#20195;&#29702;&#21021;&#22987;&#21270;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-initialization"></a>19.1.4.&nbsp;&#23454;&#20363;&#21270;&#38598;&#21512;&#21644;&#20195;&#29702;&#65288;Initializing collections and proxies&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#22312;<code class="literal">Session</code>&#33539;&#22260;&#20043;&#22806;&#35775;&#38382;&#26410;&#21021;&#22987;&#21270;&#30340;&#38598;&#21512;&#25110;&#20195;&#29702;&#65292;Hibernate&#23558;&#20250;&#25243;&#20986;<code class="literal">LazyInitializationException</code>&#24322;&#24120;&#12290; &#20063;&#23601;&#26159;&#35828;&#65292;&#22312;&#20998;&#31163;&#29366;&#24577;&#19979;&#65292;&#35775;&#38382;&#19968;&#20010;&#23454;&#20307;&#25152;&#25317;&#26377;&#30340;&#38598;&#21512;&#65292;&#25110;&#32773;&#35775;&#38382;&#20854;&#25351;&#21521;&#20195;&#29702;&#30340;&#23646;&#24615;&#26102;&#65292;&#20250;&#24341;&#21457;&#27492;&#24322;&#24120;&#12290; 
               </p>
               <p>&#26377;&#26102;&#20505;&#25105;&#20204;&#38656;&#35201;&#20445;&#35777;&#26576;&#20010;&#20195;&#29702;&#25110;&#32773;&#38598;&#21512;&#22312;Session&#20851;&#38381;&#21069;&#23601;&#24050;&#32463;&#34987;&#21021;&#22987;&#21270;&#20102;&#12290; &#24403;&#28982;&#65292;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;&#24378;&#34892;&#35843;&#29992;<code class="literal">cat.getSex()</code>&#25110;&#32773;<code class="literal">cat.getKittens().size()</code>&#20043;&#31867;&#30340;&#26041;&#27861;&#26469;&#30830;&#20445;&#36825;&#19968;&#28857;&#12290; &#20294;&#26159;&#36825;&#26679;&#30340;&#31243;&#24207;&#20250;&#36896;&#25104;&#35835;&#32773;&#30340;&#30097;&#24785;&#65292;&#20063;&#19981;&#31526;&#21512;&#36890;&#24120;&#30340;&#20195;&#30721;&#35268;&#33539;&#12290; 
               </p>
               <p>&#38745;&#24577;&#26041;&#27861;<code class="literal">Hibernate.initialized()</code> &#20026;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#20102;&#19968;&#20010;&#20415;&#25463;&#30340;&#36884;&#24452;&#26469;&#24310;&#36831;&#21152;&#36733;&#38598;&#21512;&#25110;&#20195;&#29702;&#12290; &#21482;&#35201;&#23427;&#30340;Session&#22788;&#20110;open&#29366;&#24577;&#65292;<code class="literal">Hibernate.initialize(cat)</code> &#23558;&#20250;&#20026;cat&#24378;&#21046;&#23545;&#20195;&#29702;&#23454;&#20363;&#21270;&#12290; &#21516;&#26679;&#65292;<code class="literal">Hibernate.initialize( cat.getKittens() )</code> &#23545;kittens&#30340;&#38598;&#21512;&#20855;&#26377;&#21516;&#26679;&#30340;&#21151;&#33021;&#12290; 
               </p>
               <p>&#36824;&#26377;&#21478;&#22806;&#19968;&#31181;&#36873;&#25321;&#65292;&#23601;&#26159;&#20445;&#25345;<code class="literal">Session</code>&#19968;&#30452;&#22788;&#20110;open&#29366;&#24577;&#65292;&#30452;&#21040;&#25152;&#26377;&#38656;&#35201;&#30340;&#38598;&#21512;&#25110;&#20195;&#29702;&#37117;&#34987;&#36733;&#20837;&#12290; &#22312;&#26576;&#20123;&#24212;&#29992;&#26550;&#26500;&#20013;&#65292;&#29305;&#21035;&#26159;&#23545;&#20110;&#37027;&#20123;&#20351;&#29992;Hibernate&#36827;&#34892;&#25968;&#25454;&#35775;&#38382;&#30340;&#20195;&#30721;&#65292;&#20197;&#21450;&#37027;&#20123;&#22312;&#19981;&#21516;&#24212;&#29992;&#23618;&#21644;&#19981;&#21516;&#29289;&#29702;&#36827;&#31243;&#20013;&#20351;&#29992;Hibernate&#30340;&#20195;&#30721;&#12290; &#22312;&#38598;&#21512;&#23454;&#20363;&#21270;&#26102;&#65292;&#22914;&#20309;&#20445;&#35777;<code class="literal">Session</code>&#22788;&#20110;open&#29366;&#24577;&#32463;&#24120;&#20250;&#26159;&#19968;&#20010;&#38382;&#39064;&#12290;&#26377;&#20004;&#31181;&#26041;&#27861;&#21487;&#20197;&#35299;&#20915;&#27492;&#38382;&#39064;&#65306; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>&#22312;&#19968;&#20010;&#22522;&#20110;Web&#30340;&#24212;&#29992;&#20013;&#65292;&#21487;&#20197;&#21033;&#29992;servlet&#36807;&#28388;&#22120;&#65288;filter&#65289;&#65292;&#22312;&#29992;&#25143;&#35831;&#27714;&#65288;request&#65289;&#32467;&#26463;&#12289;&#39029;&#38754;&#29983;&#25104; &#32467;&#26463;&#26102;&#20851;&#38381;<code class="literal">Session</code>&#65288;&#36825;&#37324;&#20351;&#29992;&#20102;<span class="emphasis"><em>&#22312;&#23637;&#31034;&#23618;&#20445;&#25345;&#25171;&#24320;Session&#27169;&#24335;&#65288;Open Session in View&#65289;</em></span>&#65289;&#65292; &#24403;&#28982;&#65292;&#36825;&#23558;&#20381;&#36182;&#20110;&#24212;&#29992;&#26694;&#26550;&#20013;&#24322;&#24120;&#38656;&#35201;&#34987;&#27491;&#30830;&#30340;&#22788;&#29702;&#12290;&#22312;&#36820;&#22238;&#30028;&#38754;&#32473;&#29992;&#25143;&#20043;&#21069;&#65292;&#20035;&#33267;&#22312;&#29983;&#25104;&#30028;&#38754;&#36807;&#31243;&#20013;&#21457;&#29983;&#24322;&#24120;&#30340;&#24773;&#20917;&#19979;&#65292; &#27491;&#30830;&#20851;&#38381;<code class="literal">Session</code>&#21644;&#32467;&#26463;&#20107;&#21153;&#23558;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#65292; &#35831;&#21442;&#35265;Hibernate wiki&#19978;&#30340;"Open Session in View"&#27169;&#24335;&#65292;&#20320;&#21487;&#20197;&#25214;&#21040;&#31034;&#20363;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>&#22312;&#19968;&#20010;&#25317;&#26377;&#21333;&#29420;&#19994;&#21153;&#23618;&#30340;&#24212;&#29992;&#20013;&#65292;&#19994;&#21153;&#23618;&#24517;&#39035;&#22312;&#36820;&#22238;&#20043;&#21069;&#65292;&#20026;web&#23618;&#8220;&#20934;&#22791;&#8221;&#22909;&#20854;&#25152;&#38656;&#30340;&#25968;&#25454;&#38598;&#21512;&#12290;&#36825;&#23601;&#24847;&#21619;&#30528; &#19994;&#21153;&#23618;&#24212;&#35813;&#36733;&#20837;&#25152;&#26377;&#34920;&#29616;&#23618;/web&#23618;&#25152;&#38656;&#30340;&#25968;&#25454;&#65292;&#24182;&#23558;&#36825;&#20123;&#24050;&#23454;&#20363;&#21270;&#23436;&#27605;&#30340;&#25968;&#25454;&#36820;&#22238;&#12290;&#36890;&#24120;&#65292;&#24212;&#29992;&#31243;&#24207;&#24212;&#35813; &#20026;web&#23618;&#25152;&#38656;&#30340;&#27599;&#20010;&#38598;&#21512;&#35843;&#29992;<code class="literal">Hibernate.initialize()</code>&#65288;&#36825;&#20010;&#35843;&#29992;&#24517;&#39035;&#21457;&#29983;&#21681;session&#20851;&#38381;&#20043;&#21069;&#65289;&#65307; &#25110;&#32773;&#20351;&#29992;&#24102;&#26377;<code class="literal">FETCH</code>&#20174;&#21477;&#65292;&#25110;<code class="literal">FetchMode.JOIN</code>&#30340;Hibernate&#26597;&#35810;&#65292; &#20107;&#20808;&#21462;&#24471;&#25152;&#26377;&#30340;&#25968;&#25454;&#38598;&#21512;&#12290;&#22914;&#26524;&#20320;&#22312;&#24212;&#29992;&#20013;&#20351;&#29992;&#20102;<span class="emphasis"><em>Command</em></span>&#27169;&#24335;&#65292;&#20195;&#26367;<span class="emphasis"><em>Session Facade</em></span> &#65292; &#37027;&#20040;&#36825;&#39033;&#20219;&#21153;&#23558;&#20250;&#21464;&#24471;&#31616;&#21333;&#30340;&#22810;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>&#20320;&#20063;&#21487;&#20197;&#36890;&#36807;<code class="literal">merge()</code>&#25110;<code class="literal">lock()</code>&#26041;&#27861;&#65292;&#22312;&#35775;&#38382;&#26410;&#23454;&#20363;&#21270;&#30340;&#38598;&#21512;&#65288;&#25110;&#20195;&#29702;&#65289;&#20043;&#21069;&#65292; &#20026;&#20808;&#21069;&#36733;&#20837;&#30340;&#23545;&#35937;&#32465;&#23450;&#19968;&#20010;&#26032;&#30340;<code class="literal">Session</code>&#12290; &#26174;&#28982;&#65292;Hibernate&#23558;&#19981;&#20250;&#65292;&#20063;&#19981;<span class="emphasis"><em>&#24212;&#35813;</em></span>&#33258;&#21160;&#23436;&#25104;&#36825;&#20123;&#20219;&#21153;&#65292;&#22240;&#20026;&#36825;&#23558;&#24341;&#20837;&#19968;&#20010;&#29305;&#27530;&#30340;&#20107;&#21153;&#35821;&#20041;&#12290; 
                        </p>
                     </li>
                  </ul>
               </div>
               <p>&#26377;&#26102;&#20505;&#65292;&#20320;&#24182;&#19981;&#38656;&#35201;&#23436;&#20840;&#23454;&#20363;&#21270;&#25972;&#20010;&#22823;&#30340;&#38598;&#21512;&#65292;&#20165;&#38656;&#35201;&#20102;&#35299;&#23427;&#30340;&#37096;&#20998;&#20449;&#24687;&#65288;&#20363;&#22914;&#20854;&#22823;&#23567;&#65289;&#12289;&#25110;&#32773;&#38598;&#21512;&#30340;&#37096;&#20998;&#20869;&#23481;&#12290; </p>
               <p>&#20320;&#21487;&#20197;&#20351;&#29992;&#38598;&#21512;&#36807;&#28388;&#22120;&#24471;&#21040;&#20854;&#38598;&#21512;&#30340;&#22823;&#23567;&#65292;&#32780;&#19981;&#24517;&#23454;&#20363;&#21270;&#25972;&#20010;&#38598;&#21512;&#65306; </p><pre class="programlisting">( (Integer) s.createFilter( collection, "select count(*)" ).list().get(0) ).intValue()</pre><p>&#36825;&#37324;&#30340;<code class="literal">createFilter()</code>&#26041;&#27861;&#20063;&#21487;&#20197;&#34987;&#29992;&#26469;&#26377;&#25928;&#30340;&#25235;&#21462;&#38598;&#21512;&#30340;&#37096;&#20998;&#20869;&#23481;&#65292;&#32780;&#26080;&#38656;&#23454;&#20363;&#21270;&#25972;&#20010;&#38598;&#21512;&#65306; 
               </p><pre class="programlisting">s.createFilter( lazyCollection, "").setFirstResult(0).setMaxResults(10).list();</pre></div>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-batch"></a>19.1.5.&nbsp;&#20351;&#29992;&#25209;&#37327;&#25235;&#21462;&#65288;Using batch fetching&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Hibernate&#21487;&#20197;&#20805;&#20998;&#26377;&#25928;&#30340;&#20351;&#29992;&#25209;&#37327;&#25235;&#21462;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#22914;&#26524;&#20165;&#19968;&#20010;&#35775;&#38382;&#20195;&#29702;&#65288;&#25110;&#38598;&#21512;&#65289;&#65292;&#37027;&#20040;Hibernate&#23558;&#19981;&#36733;&#20837;&#20854;&#20182;&#26410;&#23454;&#20363;&#21270;&#30340;&#20195;&#29702;&#12290; &#25209;&#37327;&#25235;&#21462;&#26159;&#24310;&#36831;&#26597;&#35810;&#25235;&#21462;&#30340;&#20248;&#21270;&#26041;&#26696;&#65292;&#20320;&#21487;&#20197;&#22312;&#20004;&#31181;&#25209;&#37327;&#25235;&#21462;&#26041;&#26696;&#20043;&#38388;&#36827;&#34892;&#36873;&#25321;&#65306;&#22312;&#31867;&#32423;&#21035;&#21644;&#38598;&#21512;&#32423;&#21035;&#12290; </p>
               <p>&#31867;/&#23454;&#20307;&#32423;&#21035;&#30340;&#25209;&#37327;&#25235;&#21462;&#24456;&#23481;&#26131;&#29702;&#35299;&#12290;&#20551;&#35774;&#20320;&#22312;&#36816;&#34892;&#26102;&#23558;&#38656;&#35201;&#38754;&#23545;&#19979;&#38754;&#30340;&#38382;&#39064;&#65306;&#20320;&#22312;&#19968;&#20010;<code class="literal">Session</code>&#20013;&#36733;&#20837;&#20102;25&#20010; <code class="literal">Cat</code>&#23454;&#20363;&#65292;&#27599;&#20010;<code class="literal">Cat</code>&#23454;&#20363;&#37117;&#25317;&#26377;&#19968;&#20010;&#24341;&#29992;&#25104;&#21592;<code class="literal">owner</code>&#65292; &#20854;&#25351;&#21521;<code class="literal">Person</code>&#65292;&#32780;<code class="literal">Person</code>&#31867;&#26159;&#20195;&#29702;&#65292;&#21516;&#26102;<code class="literal">lazy="true"</code>&#12290; &#22914;&#26524;&#20320;&#24517;&#39035;&#36941;&#21382;&#25972;&#20010;cats&#38598;&#21512;&#65292;&#23545;&#27599;&#20010;&#20803;&#32032;&#35843;&#29992;<code class="literal">getOwner()</code>&#26041;&#27861;&#65292;Hibernate&#23558;&#20250;&#40664;&#35748;&#30340;&#25191;&#34892;25&#27425;<code class="literal">SELECT</code>&#26597;&#35810;&#65292; &#24471;&#21040;&#20854;owner&#30340;&#20195;&#29702;&#23545;&#35937;&#12290;&#36825;&#26102;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;&#22312;&#26144;&#23556;&#25991;&#20214;&#30340;<code class="literal">Person</code>&#23646;&#24615;&#65292;&#26174;&#24335;&#22768;&#26126;<code class="literal">batch-size</code>&#65292;&#25913;&#21464;&#20854;&#34892;&#20026;&#65306; 
               </p><pre class="programlisting">&lt;class name="Person" batch-size="10"&gt;...&lt;/class&gt;</pre><p>&#38543;&#20043;&#65292;Hibernate&#23558;&#21482;&#38656;&#35201;&#25191;&#34892;&#19977;&#27425;&#26597;&#35810;&#65292;&#20998;&#21035;&#20026;10&#12289;10&#12289; 5&#12290; </p>
               <p>You may also enable batch fetching of collections. For example, if each <code class="literal">Person</code> has a lazy collection of <code class="literal">Cat</code>s, and 10 persons are currently loaded in the <code class="literal">Session</code>, iterating through all persons will generate 10 <code class="literal">SELECT</code>s, one for every call to <code class="literal">getCats()</code>. If you enable batch fetching for the <code class="literal">cats</code> collection in the mapping of <code class="literal">Person</code>, Hibernate can pre-fetch collections: 
               </p><pre class="programlisting">&lt;class name="Person"&gt;
    &lt;set name="cats" batch-size="3"&gt;
        ...
    &lt;/set&gt;
&lt;/class&gt;</pre><p>&#22914;&#26524;&#25972;&#20010;&#30340;<code class="literal">batch-size</code>&#26159;3&#65288;&#31508;&#35823;&#65311;&#65289;&#65292;&#37027;&#20040;Hibernate&#23558;&#20250;&#20998;&#22235;&#27425;&#25191;&#34892;<code class="literal">SELECT</code>&#26597;&#35810;&#65292; &#25353;&#29031;3&#12289;3&#12289;3&#12289;1&#30340;&#22823;&#23567;&#20998;&#21035;&#36733;&#20837;&#25968;&#25454;&#12290;&#36825;&#37324;&#30340;&#27599;&#27425;&#36733;&#20837;&#30340;&#25968;&#25454;&#37327;&#36824;&#20855;&#20307;&#20381;&#36182;&#20110;&#24403;&#21069;<code class="literal">Session</code>&#20013;&#26410;&#23454;&#20363;&#21270;&#38598;&#21512;&#30340;&#20010;&#25968;&#12290; 
               </p>
               <p>&#22914;&#26524;&#20320;&#30340;&#27169;&#22411;&#20013;&#26377;&#23884;&#22871;&#30340;&#26641;&#29366;&#32467;&#26500;&#65292;&#20363;&#22914;&#20856;&#22411;&#30340;&#24080;&#21333;&#65293;&#21407;&#26009;&#32467;&#26500;&#65288;bill-of-materials pattern&#65289;&#65292;&#38598;&#21512;&#30340;&#25209;&#37327;&#25235;&#21462;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#12290; &#65288;&#23613;&#31649;&#22312;&#26356;&#22810;&#24773;&#20917;&#19979;&#23545;&#26641;&#36827;&#34892;&#35835;&#21462;&#26102;&#65292;<span class="emphasis"><em>&#23884;&#22871;&#38598;&#21512;&#65288;nested set&#65289;</em></span>&#25110;<span class="emphasis"><em>&#21407;&#26009;&#36335;&#24452;(materialized path)</em></span>&#65288;&times;&times;&#65289; &#26159;&#26356;&#22909;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;&#65289; 
               </p>
            </div>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-subselect"></a>19.1.6.&nbsp;&#20351;&#29992;&#23376;&#26597;&#35810;&#25235;&#21462;&#65288;Using subselect fetching&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#20551;&#33509;&#19968;&#20010;&#24310;&#36831;&#38598;&#21512;&#25110;&#21333;&#20540;&#20195;&#29702;&#38656;&#35201;&#25235;&#21462;&#65292;Hibernate&#20250;&#20351;&#29992;&#19968;&#20010;subselect&#37325;&#26032;&#36816;&#34892;&#21407;&#26469;&#30340;&#26597;&#35810;&#65292;&#19968;&#27425;&#24615;&#35835;&#20837;&#25152;&#26377;&#30340;&#23454;&#20363;&#12290;&#36825;&#21644;&#25209;&#37327;&#25235;&#21462;&#30340;&#23454;&#29616;&#26041;&#27861;&#26159;&#19968;&#26679;&#30340;&#65292;&#19981;&#20250;&#26377;&#30772;&#30862;&#30340;&#21152;&#36733;&#12290; </p>
            </div>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-lazyproperties"></a>19.1.7.&nbsp;&#20351;&#29992;&#24310;&#36831;&#23646;&#24615;&#25235;&#21462;&#65288;Using lazy property fetching&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Hibernate3&#23545;&#21333;&#29420;&#30340;&#23646;&#24615;&#25903;&#25345;&#24310;&#36831;&#25235;&#21462;&#65292;&#36825;&#39033;&#20248;&#21270;&#25216;&#26415;&#20063;&#34987;&#31216;&#20026;<span class="emphasis"><em>&#32452;&#25235;&#21462;&#65288;fetch groups&#65289;</em></span>&#12290; &#35831;&#27880;&#24847;&#65292;&#35813;&#25216;&#26415;&#26356;&#22810;&#30340;&#23646;&#20110;&#24066;&#22330;&#29305;&#24615;&#12290;&#22312;&#23454;&#38469;&#24212;&#29992;&#20013;&#65292;&#20248;&#21270;&#34892;&#35835;&#21462;&#27604;&#20248;&#21270;&#21015;&#35835;&#21462;&#26356;&#37325;&#35201;&#12290;&#20294;&#26159;&#65292;&#20165;&#36733;&#20837;&#31867;&#30340;&#37096;&#20998;&#23646;&#24615;&#22312;&#26576;&#20123;&#29305;&#23450;&#24773;&#20917;&#19979;&#20250;&#26377;&#29992;&#65292;&#20363;&#22914;&#22312;&#21407;&#26377;&#34920;&#20013;&#25317;&#26377;&#20960;&#30334;&#21015;&#25968;&#25454;&#12289;&#25968;&#25454;&#27169;&#22411;&#26080;&#27861;&#25913;&#21160;&#30340;&#24773;&#20917;&#19979;&#12290; 
               </p>
               <p>&#21487;&#20197;&#22312;&#26144;&#23556;&#25991;&#20214;&#20013;&#23545;&#29305;&#23450;&#30340;&#23646;&#24615;&#35774;&#32622;<code class="literal">lazy</code>&#65292;&#23450;&#20041;&#35813;&#23646;&#24615;&#20026;&#24310;&#36831;&#36733;&#20837;&#12290; 
               </p><pre class="programlisting">&lt;class name="Document"&gt;
       &lt;id name="id"&gt;
        &lt;generator class="native"/&gt;
    &lt;/id&gt;
    &lt;property name="name" not-null="true" length="50"/&gt;
    &lt;property name="summary" not-null="true" length="200" lazy="true"/&gt;
    &lt;property name="text" not-null="true" length="2000" lazy="true"/&gt;
&lt;/class&gt;</pre><p>&#23646;&#24615;&#30340;&#24310;&#36831;&#36733;&#20837;&#35201;&#27714;&#22312;&#20854;&#20195;&#30721;&#26500;&#24314;&#26102;&#21152;&#20837;&#20108;&#36827;&#21046;&#25351;&#31034;&#25351;&#20196;&#65288;bytecode instrumentation&#65289;&#65292;&#22914;&#26524;&#20320;&#30340;&#25345;&#20037;&#31867;&#20195;&#30721;&#20013;&#26410;&#21547;&#26377;&#36825;&#20123;&#25351;&#20196;&#65292; Hibernate&#23558;&#20250;&#24573;&#30053;&#36825;&#20123;&#23646;&#24615;&#30340;&#24310;&#36831;&#35774;&#32622;&#65292;&#20173;&#28982;&#23558;&#20854;&#30452;&#25509;&#36733;&#20837;&#12290; </p>
               <p>&#20320;&#21487;&#20197;&#22312;Ant&#30340;Task&#20013;&#65292;&#36827;&#34892;&#22914;&#19979;&#23450;&#20041;&#65292;&#23545;&#25345;&#20037;&#31867;&#20195;&#30721;&#21152;&#20837;&#8220;&#20108;&#36827;&#21046;&#25351;&#20196;&#12290;&#8221; </p><pre class="programlisting">&lt;target name="instrument" depends="compile"&gt;
    &lt;taskdef name="instrument" classname="org.hibernate.tool.instrument.InstrumentTask"&gt;
        &lt;classpath path="${jar.path}"/&gt;
        &lt;classpath path="${classes.dir}"/&gt;
        &lt;classpath refid="lib.class.path"/&gt;
    &lt;/taskdef&gt;

    &lt;instrument verbose="true"&gt;
        &lt;fileset dir="${testclasses.dir}/org/hibernate/auction/model"&gt;
            &lt;include name="*.class"/&gt;
        &lt;/fileset&gt;
    &lt;/instrument&gt;
&lt;/target&gt;</pre><p>A different (better?) way to avoid unnecessary column reads, at least for read-only transactions is to use the projection
                  features of HQL or Criteria queries. This avoids the need for buildtime bytecode processing and is certainly a preferred solution.
                  
               </p>
               <p>&#26377;&#26102;&#20320;&#38656;&#35201;&#22312;HQL&#20013;&#36890;&#36807;<code class="literal">&#25235;&#21462;&#25152;&#26377;&#23646;&#24615;</code>&#65292;&#24378;&#34892;&#25235;&#21462;&#25152;&#26377;&#20869;&#23481;&#12290; 
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="xml-manipulation.html">&#19978;&#19968;&#39029;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="performance-cache.html">&#19979;&#19968;&#39029;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">18.3.&nbsp;&#25805;&#20316;XML&#25968;&#25454;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;19.2.&nbsp;&#20108;&#32423;&#32531;&#23384;&#65288;The Second Level Cache&#65289;</td>
            </tr>
         </table>
      </div>
   </body>
</html>