<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;&nbsp;11&nbsp;&#31456;&nbsp;&#20107;&#21153;&#21644;&#24182;&#21457;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#31526;&#21512;Java&#20064;&#24815;&#30340;&#20851;&#31995;&#25968;&#25454;&#24211;&#25345;&#20037;&#21270;">
      <link rel="up" href="index.html" title="HIBERNATE - &#31526;&#21512;Java&#20064;&#24815;&#30340;&#20851;&#31995;&#25968;&#25454;&#24211;&#25345;&#20037;&#21270;">
      <link rel="prev" href="objectstate-metadata.html" title="10.12.&nbsp;&#20351;&#29992;&#20803;&#25968;&#25454;">
      <link rel="next" href="transactions-demarcation.html" title="11.2.&nbsp;&#25968;&#25454;&#24211;&#20107;&#21153;&#22768;&#26126;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;&nbsp;11&nbsp;&#31456;&nbsp;&#20107;&#21153;&#21644;&#24182;&#21457;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-metadata.html">&#19978;&#19968;&#39029;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="transactions-demarcation.html">&#19979;&#19968;&#39029;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="zh-CN">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="transactions"></a>&#31532;&nbsp;11&nbsp;&#31456;&nbsp;&#20107;&#21153;&#21644;&#24182;&#21457;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate&#30340;&#20107;&#21153;&#21644;&#24182;&#21457;&#25511;&#21046;&#24456;&#23481;&#26131;&#25484;&#25569;&#12290;Hibernate&#30452;&#25509;&#20351;&#29992;JDBC&#36830;&#25509;&#21644;JTA&#36164;&#28304;&#65292;&#19981;&#28155;&#21152;&#20219;&#20309;&#38468;&#21152;&#38145;&#23450; &#34892;&#20026;&#12290;&#25105;&#20204;&#24378;&#28872;&#25512;&#33616;&#20320;&#33457;&#28857;&#26102;&#38388;&#20102;&#35299;JDBC&#32534;&#31243;&#65292;ANSI SQL&#26597;&#35810;&#35821;&#35328;&#21644;&#20320;&#20351;&#29992; &#30340;&#25968;&#25454;&#24211;&#31995;&#32479;&#30340;&#20107;&#21153;&#38548;&#31163;&#35268;&#33539;&#12290; </p>
         <p>Hibernate&#19981;&#38145;&#23450;&#20869;&#23384;&#20013;&#30340;&#23545;&#35937;&#12290;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#20250;&#25353;&#29031;&#20320;&#30340;&#25968;&#25454;&#24211;&#20107;&#21153;&#30340;&#38548;&#31163;&#32423;&#21035;&#35268;&#23450;&#30340;&#37027;&#26679;&#36816;&#20316;&#12290;&#24184;&#20111;&#26377;&#20102;<code class="literal">Session</code>&#65292;&#20351;&#24471;Hibernate&#36890;&#36807;&#26631;&#35782;&#31526;&#26597;&#25214;&#65292;&#21644;&#23454;&#20307;&#26597;&#35810;&#65288;&#19981;&#26159;&#36820;&#22238;&#26631;&#37327;&#20540;&#30340;&#25253;&#34920;&#26597;&#35810;&#65289;&#25552;&#20379;&#20102;&#21487;&#37325;&#22797;&#30340;&#35835;&#21462;&#65288;Repeatable reads&#65289;&#21151;&#33021;&#65292;<code class="literal">Session</code>&#21516;&#26102;&#20063;&#26159;&#20107;&#21153;&#33539;&#22260;&#20869;&#30340;&#32531;&#23384;&#65288;cache&#65289;&#12290; 
         </p>
         <p>&#38500;&#20102;&#23545;&#33258;&#21160;&#20048;&#35266;&#24182;&#21457;&#25511;&#21046;&#25552;&#20379;&#29256;&#26412;&#31649;&#29702;&#65292;&#38024;&#23545;&#34892;&#32423;&#24754;&#35266;&#38145;&#23450;&#65292;Hibernate&#20063;&#25552;&#20379;&#20102;&#36741;&#21161;&#30340;&#65288;&#36739;&#23567;&#30340;)API&#65292;&#23427;&#20351;&#29992;&#20102; <code class="literal">SELECT FOR UPDATE</code>&#30340;SQL&#35821;&#27861;&#12290;&#26412;&#31456;&#21518;&#38754;&#20250;&#35752;&#35770;&#20048;&#35266;&#24182;&#21457;&#25511;&#21046;&#21644;&#36825;&#20010;API&#12290; 
         </p>
         <p>&#25105;&#20204;&#20174;<code class="literal">Configuration</code>&#23618;&#12289;<code class="literal">SessionFactory</code>&#23618;, &#21644; <code class="literal">Session</code>&#23618;&#24320;&#22987;&#35752;&#35770;Hibernate&#30340;&#24182;&#34892;&#25511;&#21046;&#12289;&#25968;&#25454;&#24211;&#20107;&#21153;&#21644;&#24212;&#29992; &#31243;&#24207;&#30340;&#38271;&#20107;&#21153;&#12290; 
         </p>
         <div class="sect1" lang="zh-CN">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="transactions-basics"></a>11.1.&nbsp;Session&#21644;&#20107;&#21153;&#33539;&#22260;(transaction scope)
                     </h2>
                  </div>
               </div>
            </div>
            <p><code class="literal">SessionFactory</code>&#23545;&#35937;&#30340;&#21019;&#24314;&#20195;&#20215;&#24456;&#26114;&#36149;&#65292;&#23427;&#26159;&#32447;&#31243;&#23433;&#20840;&#30340;&#23545;&#35937;&#65292;&#23427;&#20026;&#25152;&#26377;&#30340;&#24212;&#29992;&#31243;&#24207;&#32447;&#31243;&#25152;&#20849;&#20139;&#12290;&#23427;&#21482;&#21019;&#24314;&#19968;&#27425;&#65292;&#36890;&#24120;&#26159;&#22312;&#24212;&#29992;&#31243;&#24207;&#21551;&#21160;&#30340;&#26102;&#20505;&#65292;&#30001;&#19968;&#20010;<code class="literal">Configuraion</code>&#30340;&#23454;&#20363;&#26469;&#21019;&#24314;&#12290; 
            </p>
            <p><code class="literal">Session</code>&#23545;&#35937;&#30340;&#21019;&#24314;&#20195;&#20215;&#27604;&#36739;&#23567;&#65292;&#26159;&#38750;&#32447;&#31243;&#23433;&#20840;&#30340;&#65292;&#23545;&#20110;&#21333;&#20010;&#35831;&#27714;&#65292;&#21333;&#20010;&#20250;&#35805;&#12289;&#21333;&#20010;&#30340; &#24037;&#20316;&#21333;&#20803;&#32780;&#35328;&#65292;&#23427;&#21482;&#34987;&#20351;&#29992;&#19968;&#27425;&#65292;&#28982;&#21518;&#23601;&#20002;&#24323;&#12290;&#21482;&#26377;&#22312;&#38656;&#35201;&#30340;&#26102;&#20505;&#65292;&#19968;&#20010;<code class="literal">Session</code>&#23545;&#35937; &#25165;&#20250;&#33719;&#21462;&#19968;&#20010;JDBC&#30340;<code class="literal">Connection</code>&#65288;&#25110;&#19968;&#20010;<code class="literal">Datasource</code>&#65289; &#23545;&#35937;&#65292;&#22240;&#27492;&#20551;&#33509;&#19981;&#20351;&#29992;&#30340;&#26102;&#20505;&#23427;&#19981;&#28040;&#36153;&#20219;&#20309;&#36164;&#28304;&#12290; 
            </p>
            <p>&#27492;&#22806;&#25105;&#20204;&#36824;&#35201;&#32771;&#34385;&#25968;&#25454;&#24211;&#20107;&#21153;&#12290;&#25968;&#25454;&#24211;&#20107;&#21153;&#24212;&#35813;&#23613;&#21487;&#33021;&#30340;&#30701;&#65292;&#38477;&#20302;&#25968;&#25454;&#24211;&#20013;&#30340;&#38145;&#20105;&#29992;&#12290; &#25968;&#25454;&#24211;&#38271;&#20107;&#21153;&#20250;&#38459;&#27490;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#25193;&#23637;&#21040;&#39640;&#30340;&#24182;&#21457;&#36127;&#36733;&#12290;&#22240;&#27492;&#65292;&#20551;&#33509;&#22312;&#29992;&#25143;&#24605;&#32771;&#26399;&#38388;&#35753;&#25968;&#25454;&#24211;&#20107;&#21153;&#24320;&#30528;&#65292;&#30452;&#21040;&#25972;&#20010;&#24037;&#20316;&#21333;&#20803;&#23436;&#25104;&#25165;&#20851;&#38381;&#36825;&#20010;&#20107;&#21153;&#65292;&#36825;&#32477;&#19981;&#26159;&#19968;&#20010;&#22909;&#30340;&#35774;&#35745;&#12290; </p>
            <p>&#19968;&#20010;&#25805;&#20316;&#21333;&#20803;(Unit of work)&#30340;&#33539;&#22260;&#26159;&#22810;&#22823;&#65311;&#21333;&#20010;&#30340;Hibernate <code class="literal">Session</code>&#33021;&#36328;&#36234;&#22810;&#20010; &#25968;&#25454;&#24211;&#20107;&#21153;&#21527;&#65311;&#36824;&#26159;&#19968;&#20010;<code class="literal">Session</code>&#30340;&#20316;&#29992;&#33539;&#22260;&#23545;&#24212;&#19968;&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#30340;&#33539;&#22260;&#65311;&#24212;&#35813;&#20309;&#26102;&#25171;&#24320; <code class="literal">Session</code>&#65292;&#20309;&#26102;&#20851;&#38381;<code class="literal">Session</code>&#65311;&#65292;&#20320;&#21448;&#22914;&#20309;&#21010;&#20998;&#25968;&#25454;&#24211;&#20107;&#21153;&#30340;&#36793;&#30028;&#21602;&#65311; 
            </p>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-uow"></a>11.1.1.&nbsp;&#25805;&#20316;&#21333;&#20803;(Unit of work)
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#39318;&#20808;&#65292;&#21035;&#29992;<span class="emphasis"><em>session-per-operation</em></span>&#36825;&#31181;&#21453;&#27169;&#24335;&#20102;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#22312;&#21333;&#20010;&#32447;&#31243;&#20013;&#65292; &#19981;&#35201;&#22240;&#20026;&#19968;&#27425;&#31616;&#21333;&#30340;&#25968;&#25454;&#24211;&#35843;&#29992;&#65292;&#23601;&#25171;&#24320;&#21644;&#20851;&#38381;&#19968;&#27425;<code class="literal">Session</code>&#65281;&#25968;&#25454;&#24211;&#20107;&#21153;&#20063;&#26159;&#22914;&#27492;&#12290; &#24212;&#29992;&#31243;&#24207;&#20013;&#30340;&#25968;&#25454;&#24211;&#35843;&#29992;&#26159;&#25353;&#29031;&#35745;&#21010;&#22909;&#30340;&#27425;&#24207;&#65292;&#20998;&#32452;&#20026;&#21407;&#23376;&#30340;&#25805;&#20316;&#21333;&#20803;&#12290;&#65288;&#27880;&#24847;&#65292;&#36825;&#20063;&#24847;&#21619;&#30528;&#65292;&#24212;&#29992;&#31243; &#24207;&#20013;&#65292;&#22312;&#21333;&#20010;&#30340;SQL&#35821;&#21477;&#21457;&#36865;&#20043;&#21518;&#65292;&#33258;&#21160;&#20107;&#21153;&#25552;&#20132;(auto-commit)&#27169;&#24335;&#22833;&#25928;&#20102;&#12290;&#36825;&#31181;&#27169;&#24335;&#19987;&#38376;&#20026;SQL&#25511;&#21046;&#21488;&#25805;&#20316;&#35774;&#35745;&#30340;&#12290; Hibernate&#31105;&#27490;&#31435;&#21363;&#33258;&#21160;&#20107;&#21153;&#25552;&#20132;&#27169;&#24335;&#65292;&#25110;&#32773;&#26399;&#26395;&#24212;&#29992;&#26381;&#21153;&#22120;&#31105;&#27490;&#31435;&#21363;&#33258;&#21160;&#20107;&#21153;&#25552;&#20132;&#27169;&#24335;&#12290;&#65289;&#25968;&#25454;&#24211;&#20107;&#21153;&#32477;&#19981;&#26159;&#21487;&#26377;&#21487;&#26080;&#30340;&#65292;&#20219;&#20309;&#19982;&#25968;&#25454;&#24211;&#20043;&#38388;&#30340;&#36890;&#35759;&#37117;&#24517;&#39035;&#22312;&#26576;&#20010;&#20107;&#21153;&#20013;&#36827;&#34892;&#65292;&#19981;&#31649;&#20320;&#26159;&#22312;&#35835;&#36824;&#26159;&#22312;&#20889;&#25968;&#25454;&#12290;&#23545;&#35835;&#25968;&#25454;&#32780;&#35328;&#65292;&#24212;&#35813;&#36991;&#20813;auto-commit&#34892;&#20026;&#65292;&#22240;&#20026;&#24456;&#22810;&#23567;&#30340;&#20107;&#21153;&#27604;&#19968;&#20010;&#28165;&#26224;&#23450;&#20041;&#30340;&#24037;&#20316;&#21333;&#20803;&#24615;&#33021;&#24046;&#12290;&#21518;&#32773;&#20063;&#26356;&#23481;&#26131;&#32500;&#25252;&#21644;&#25193;&#23637;&#12290;
                  
               </p>
               <p>The most common pattern in a multi-user client/server application is <span class="emphasis"><em>session-per-request</em></span>. In this model, a request from the client is sent to the server (where the Hibernate persistence layer runs), a new Hibernate
                  <code class="literal">Session</code> is opened, and all database operations are executed in this unit of work. Once the work has been completed (and the response
                  for the client has been prepared), the session is flushed and closed. You would also use a single database transaction to
                  serve the clients request, starting and committing it when you open and close the <code class="literal">Session</code>. The relationship between the two is one-to-one and this model is a perfect fit for many applications. 
               </p>
               <p>The challenge lies in the implementation. Hibernate provides built-in management of the "current session" to simplify this
                  pattern. All you have to do is start a transaction when a server request has to be processed, and end the transaction before
                  the response is sent to the client. You can do this in any way you like, common solutions are <code class="literal">ServletFilter</code>, AOP interceptor with a pointcut on the service methods, or a proxy/interception container. An EJB container is a standardized
                  way to implement cross-cutting aspects such as transaction demarcation on EJB session beans, declaratively with CMT. If you
                  decide to use programmatic transaction demarcation, prefer the Hibernate <code class="literal">Transaction</code> API shown later in this chapter, for ease of use and code portability. 
               </p>
               <p>&#22312;&#20219;&#20309;&#26102;&#38388;&#65292;&#20219;&#20309;&#22320;&#26041;&#65292;&#20320;&#30340;&#24212;&#29992;&#20195;&#30721;&#21487;&#20197;&#36890;&#36807;&#31616;&#21333;&#30340;&#35843;&#29992;<code class="literal">sessionFactory.getCurrentSession()</code>&#26469;&#35775;&#38382;"&#24403;&#21069;session"&#65292;&#29992;&#20110;&#22788;&#29702;&#35831;&#27714;&#12290;&#20320;&#24635;&#26159;&#20250;&#24471;&#21040;&#24403;&#21069;&#25968;&#25454;&#24211;&#20107;&#21153;&#33539;&#22260;&#20869;&#30340;<code class="literal">Session</code>&#12290;&#22312;&#20351;&#29992;&#26412;&#22320;&#36164;&#28304;&#25110;JTA&#29615;&#22659;&#26102;&#65292;&#24517;&#39035;&#37197;&#32622;&#23427;&#65292;&#35831;&#21442;&#35265;<a href="architecture-current-session.html" title="2.5.&nbsp;&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#65288;Contextual&#65289;Session">&#31532;&nbsp;2.5&nbsp;&#33410; &#8220;&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#65288;Contextual&#65289;Session&#8221;</a>&#12290; 
               </p>
               <p>&#26377;&#26102;&#65292;&#23558;<code class="literal">Session</code>&#21644;&#25968;&#25454;&#24211;&#20107;&#21153;&#30340;&#36793;&#30028;&#24310;&#20280;&#21040;"&#23637;&#31034;&#23618;&#34987;&#28210;&#26579;&#21518;"&#20250;&#24102;&#26469;&#20415;&#21033;&#12290;&#26377;&#20123;serlvet&#24212;&#29992;&#31243;&#24207;&#22312;&#23545;&#35831;&#27714;&#36827;&#34892;&#22788;&#29702;&#21518;&#65292;&#26377;&#20010;&#21333;&#29420;&#30340;&#28210;&#26579;&#26399;&#65292;&#36825;&#31181;&#24310;&#20280;&#23545;&#36825;&#31181;&#31243;&#24207;&#29305;&#21035;&#26377;&#29992;&#12290;&#20551;&#33509;&#20320;&#23454;&#29616;&#20320;&#33258;&#24049;&#30340;&#25318;&#25130;&#22120;&#65292;&#25226;&#20107;&#21153;&#36793;&#30028;&#24310;&#20280;&#21040;&#23637;&#31034;&#23618;&#28210;&#26579;&#32467;&#26463;&#21518;&#38750;&#24120;&#23481;&#26131;&#12290;&#28982;&#32780;&#65292;&#20551;&#33509;&#20320;&#20381;&#36182;&#26377;&#23481;&#22120;&#31649;&#29702;&#20107;&#21153;&#30340;EJB&#65292;&#36825;&#23601;&#19981;&#22826;&#23481;&#26131;&#20102;&#65292;&#22240;&#20026;&#20107;&#21153;&#20250;&#22312;EJB&#26041;&#27861;&#36820;&#22238;&#21518;&#32467;&#26463;&#65292;&#32780;&#37027;&#26159;&#22312;&#20219;&#20309;&#23637;&#31034;&#23618;&#28210;&#26579;&#24320;&#22987;&#20043;&#21069;&#12290;&#35831;&#35775;&#38382;Hibernate&#32593;&#31449;&#21644;&#35770;&#22363;&#65292;&#20320;&#21487;&#20197;&#25214;&#21040;<span class="emphasis"><em>Open Session in View</em></span>&#36825;&#19968;&#27169;&#24335;&#30340;&#25552;&#31034;&#21644;&#31034;&#20363;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-apptx"></a>11.1.2.&nbsp;&#38271;&#23545;&#35805;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>session-per-request&#27169;&#24335;&#19981;&#20165;&#20165;&#26159;&#19968;&#20010;&#21487;&#20197;&#29992;&#26469;&#35774;&#35745;&#25805;&#20316;&#21333;&#20803;&#30340;&#26377;&#29992;&#27010;&#24565;&#12290;&#24456;&#22810;&#19994;&#21153;&#22788;&#29702;&#37117;&#38656; &#35201;&#19968;&#31995;&#21015;&#23436;&#25972;&#30340;&#19982;&#29992;&#25143;&#20043;&#38388;&#30340;&#20132;&#20114;&#65292;&#32780;&#36825;&#20123;&#29992;&#25143;&#26159;&#25351;&#23545;&#25968;&#25454;&#24211;&#26377;&#20132;&#21449;&#35775;&#38382;&#30340;&#29992;&#25143;&#12290;&#22312;&#22522;&#20110;web&#30340;&#24212;&#29992;&#21644;&#20225;&#19994; &#24212;&#29992;&#20013;&#65292;&#36328;&#29992;&#25143;&#20132;&#20114;&#30340;&#25968;&#25454;&#24211;&#20107;&#21153;&#26159;&#26080;&#27861;&#25509;&#21463;&#30340;&#12290;&#32771;&#34385;&#19979;&#38754;&#30340;&#20363;&#23376;&#65306;
                  
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>&#22312;&#30028;&#38754;&#30340;&#31532;&#19968;&#23631;&#65292;&#25171;&#24320;&#23545;&#35805;&#26694;&#65292;&#29992;&#25143;&#25152;&#30475;&#21040;&#30340;&#25968;&#25454;&#26159;&#34987;&#19968;&#20010;&#29305;&#23450;&#30340; <code class="literal">Session</code> &#21644;&#25968;&#25454; &#24211;&#20107;&#21153;&#36733;&#20837;(load)&#30340;&#12290;&#29992;&#25143;&#21487;&#20197;&#38543;&#24847;&#20462;&#25913;&#23545;&#35805;&#26694;&#20013;&#30340;&#25968;&#25454;&#23545;&#35937;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>5&#20998;&#38047;&#21518;&#65292;&#29992;&#25143;&#28857;&#20987;&#8220;&#20445;&#23384;&#8221;&#65292;&#26399;&#26395;&#25152;&#20570;&#20986;&#30340;&#20462;&#25913;&#34987;&#25345;&#20037;&#21270;&#65307;&#21516;&#26102;&#20182;&#20063;&#26399;&#26395;&#33258;&#24049;&#26159;&#21807;&#19968;&#20462;&#25913;&#36825;&#20010;&#20449;&#24687;&#30340;&#20154;&#65292;&#19981;&#20250;&#20986;&#29616; &#20462;&#25913;&#20914;&#31361;&#12290; </p>
                     </li>
                  </ul>
               </div>
               <p>&#20174;&#29992;&#25143;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#25105;&#20204;&#25226;&#36825;&#20010;&#25805;&#20316;&#21333;&#20803;&#31216;&#20026;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;<span class="emphasis"><em>&#23545;&#35805;</em></span>&#65288;conversation&#65289;,&#25110;&#32773;(or <span class="emphasis"><em>&#24212;&#29992;&#20107;&#21153;</em></span>,application transaction)&#12290; &#22312;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#20013;&#65292;&#21487;&#20197;&#26377;&#24456;&#22810;&#31181;&#26041;&#27861;&#26469;&#23454;&#29616;&#23427;&#12290; 
               </p>
               <p>&#22836;&#19968;&#20010;&#24188;&#31258;&#30340;&#20570;&#27861;&#26159;&#65292;&#22312;&#29992;&#25143;&#24605;&#32771;&#30340;&#36807;&#31243;&#20013;&#65292;&#20445;&#25345;<code class="literal">Session</code>&#21644;&#25968;&#25454;&#24211;&#20107;&#21153;&#26159;&#25171;&#24320;&#30340;&#65292; &#20445;&#25345;&#25968;&#25454;&#24211;&#38145;&#23450;&#65292;&#20197;&#38459;&#27490;&#24182;&#21457;&#20462;&#25913;&#65292;&#20174;&#32780;&#20445;&#35777;&#25968;&#25454;&#24211;&#20107;&#21153;&#38548;&#31163;&#32423;&#21035;&#21644;&#21407;&#23376;&#25805;&#20316;&#12290;&#36825;&#31181;&#26041;&#24335;&#24403;&#28982;&#26159;&#19968;&#20010;&#21453;&#27169;&#24335;&#65292; &#22240;&#20026;&#38145;&#20105;&#29992;&#20250;&#23548;&#33268;&#24212;&#29992;&#31243;&#24207;&#26080;&#27861;&#25193;&#23637;&#24182;&#21457;&#29992;&#25143;&#30340;&#25968;&#30446;&#12290; 
               </p>
               <p>Clearly, we have to use several database transactions to implement the conversation. In this case, maintaining isolation of
                  business processes becomes the partial responsibility of the application tier. A single conversation usually spans several
                  database transactions. It will be atomic if only one of these database transactions (the last one) stores the updated data,
                  all others simply read data (e.g. in a wizard-style dialog spanning several request/response cycles). This is easier to implement
                  than it might sound, especially if you use Hibernate's features: 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p><span class="emphasis"><em>Automatic Versioning</em></span> - Hibernate can do automatic optimistic concurrency control for you, it can automatically detect if a concurrent modification
                           occurred during user think time. Usually we only check at the end of the conversation. 
                        </p>
                     </li>
                     <li>
                        <p><span class="emphasis"><em>&#33073;&#31649;&#23545;&#35937;</em></span>&#65288;Detached Objects&#65289;- &#22914;&#26524;&#20320;&#20915;&#23450;&#37319;&#29992;&#21069;&#38754;&#24050;&#32463;&#35752;&#35770;&#36807;&#30340; <span class="emphasis"><em>session-per-request</em></span>&#27169;&#24335;&#65292;&#25152;&#26377;&#36733;&#20837;&#30340;&#23454;&#20363;&#22312;&#29992;&#25143;&#24605;&#32771;&#30340;&#36807;&#31243; &#20013;&#37117;&#22788;&#20110;&#19982;Session&#33073;&#31163;&#30340;&#29366;&#24577;&#12290;Hibernate&#20801;&#35768;&#20320;&#25226;&#19982;Session&#33073;&#31163;&#30340;&#23545;&#35937;&#37325;&#26032;&#20851;&#32852;&#21040;Session &#19978;&#65292;&#24182;&#19988;&#23545;&#20462;&#25913;&#36827;&#34892;&#25345;&#20037;&#21270;&#65292;&#36825;&#31181;&#27169;&#24335;&#34987;&#31216;&#20026; <span class="emphasis"><em>session-per-request-with-detached-objects</em></span>&#12290;&#33258;&#21160;&#29256;&#26412;&#21270;&#34987;&#29992;&#26469;&#38548;&#31163;&#24182;&#21457;&#20462;&#25913;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p><span class="emphasis"><em>Extended (or Long) Session</em></span> - The Hibernate <code class="literal">Session</code> may be disconnected from the underlying JDBC connection after the database transaction has been committed, and reconnected
                           when a new client request occurs. This pattern is known as <span class="emphasis"><em>session-per-conversation</em></span> and makes even reattachment unnecessary. Automatic versioning is used to isolate concurrent modifications and the <code class="literal">Session</code> is usually not allowed to be flushed automatically, but explicitly. 
                        </p>
                     </li>
                  </ul>
               </div>
               <p><span class="emphasis"><em>session-per-request-with-detached-objects</em></span> &#21644; <span class="emphasis"><em>session-per-conversation</em></span> &#21508;&#26377;&#20248;&#32570;&#28857;&#65292;&#25105;&#20204;&#22312;&#26412;&#31456;&#21518;&#38754;&#20048;&#35266;&#24182;&#21457; &#25511;&#21046;&#37027;&#37096;&#20998;&#20877;&#36827;&#34892;&#35752;&#35770;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-identity"></a>11.1.3.&nbsp;&#20851;&#27880;&#23545;&#35937;&#26631;&#35782;(Considering object identity)
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#24212;&#29992;&#31243;&#24207;&#21487;&#33021;&#22312;&#20004;&#20010;&#19981;&#21516;&#30340;<code class="literal">Session</code>&#20013;&#24182;&#21457;&#35775;&#38382;&#21516;&#19968;&#25345;&#20037;&#21270;&#29366;&#24577;&#65292;&#20294;&#26159;&#65292; &#19968;&#20010;&#25345;&#20037;&#21270;&#31867;&#30340;&#23454;&#20363;&#26080;&#27861;&#22312;&#20004;&#20010; <code class="literal">Session</code>&#20013;&#20849;&#20139;&#12290;&#22240;&#27492;&#26377;&#20004;&#31181;&#19981;&#21516;&#30340;&#26631;&#35782;&#35821;&#20041;&#65306; 
               </p>
               <div class="variablelist">
                  <dl>
                     <dt><span class="term">&#25968;&#25454;&#24211;&#26631;&#35782;</span></dt>
                     <dd>
                        <p>
                                                       <code class="literal">foo.getId().equals( bar.getId() )</code>
                                                   
                        </p>
                     </dd>
                     <dt><span class="term">JVM &#26631;&#35782;</span></dt>
                     <dd>
                        <p>
                                                       <code class="literal">foo==bar</code>
                                                   
                        </p>
                     </dd>
                  </dl>
               </div>
               <p>Then for objects attached to a <span class="emphasis"><em>particular</em></span> <code class="literal">Session</code> (i.e. in the scope of a <code class="literal">Session</code>) the two notions are equivalent, and JVM identity for database identity is guaranteed by Hibernate. However, while the application
                  might concurrently access the "same" (persistent identity) business object in two different sessions, the two instances will
                  actually be "different" (JVM identity). Conflicts are resolved using (automatic versioning) at flush/commit time, using an
                  optimistic approach. 
               </p>
               <p>&#36825;&#31181;&#26041;&#24335;&#25226;&#20851;&#20110;&#24182;&#21457;&#30340;&#22836;&#30140;&#38382;&#39064;&#30041;&#32473;&#20102;Hibernate&#21644;&#25968;&#25454;&#24211;&#65307;&#30001;&#20110;&#22312;&#21333;&#20010;&#32447;&#31243;&#20869;&#65292;&#25805;&#20316;&#21333;&#20803;&#20013;&#30340;&#23545;&#35937;&#35782;&#21035;&#19981; &#38656;&#35201;&#20195;&#20215;&#26114;&#36149;&#30340;&#38145;&#23450;&#25110;&#20854;&#20182;&#24847;&#20041;&#19978;&#30340;&#21516;&#27493;&#65292;&#22240;&#27492;&#23427;&#21516;&#26102;&#21487;&#20197;&#25552;&#20379;&#26368;&#22909;&#30340;&#21487;&#20280;&#32553;&#24615;&#12290;&#21482;&#35201;&#22312;&#21333;&#20010;&#32447;&#31243;&#21482;&#25345;&#26377;&#19968;&#20010; <code class="literal">Session</code>&#65292;&#24212;&#29992;&#31243;&#24207;&#23601;&#19981;&#38656;&#35201;&#21516;&#27493;&#20219;&#20309;&#19994;&#21153;&#23545;&#35937;&#12290;&#22312;<code class="literal">Session</code> &#30340;&#33539;&#22260;&#20869;&#65292;&#24212;&#29992;&#31243;&#24207;&#21487;&#20197;&#25918;&#24515;&#30340;&#20351;&#29992;<code class="literal">==</code>&#36827;&#34892;&#23545;&#35937;&#27604;&#36739;&#12290; 
               </p>
               <p>&#19981;&#36807;&#65292;&#24212;&#29992;&#31243;&#24207;&#22312;<code class="literal">Session</code>&#30340;&#22806;&#38754;&#20351;&#29992;<code class="literal">==</code>&#36827;&#34892;&#23545;&#35937;&#27604;&#36739;&#21487;&#33021;&#20250; &#23548;&#33268;&#26080;&#27861;&#39044;&#26399;&#30340;&#32467;&#26524;&#12290;&#22312;&#19968;&#20123;&#26080;&#27861;&#39044;&#26009;&#30340;&#22330;&#21512;&#65292;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#25226;&#20004;&#20010;&#33073;&#31649;&#23545;&#35937;&#23454;&#20363;&#25918;&#36827;&#21516;&#19968;&#20010; <code class="literal">Set</code>&#30340;&#26102;&#20505;&#65292;&#23601;&#21487;&#33021;&#21457;&#29983;&#12290;&#36825;&#20004;&#20010;&#23545;&#35937;&#23454;&#20363;&#21487;&#33021;&#26377;&#21516;&#19968;&#20010;&#25968;&#25454;&#24211;&#26631;&#35782;&#65288;&#20063;&#23601;&#26159;&#35828;&#65292; &#20182;&#20204;&#20195;&#34920;&#20102;&#34920;&#30340;&#21516;&#19968;&#34892;&#25968;&#25454;&#65289;&#65292;&#20174;JVM&#26631;&#35782;&#30340;&#23450;&#20041;&#19978;&#26469;&#35828;&#65292;&#23545;&#33073;&#31649;&#30340;&#23545;&#35937;&#32780;&#35328;&#65292;Hibernate&#26080;&#27861;&#20445;&#35777;&#20182;&#20204; &#30340;&#30340;JVM&#26631;&#35782;&#19968;&#33268;&#12290;&#24320;&#21457;&#20154;&#21592;&#24517;&#39035;&#35206;&#30422;&#25345;&#20037;&#21270;&#31867;&#30340;<code class="literal">equals()</code>&#26041;&#27861;&#21644; <code class="literal">hashCode()</code> &#26041;&#27861;&#65292;&#20174;&#32780;&#23454;&#29616;&#33258;&#23450;&#20041;&#30340;&#23545;&#35937;&#30456;&#31561;&#35821;&#20041;&#12290;&#35686;&#21578;&#65306;&#19981;&#35201;&#20351;&#29992;&#25968;&#25454;&#24211;&#26631;&#35782; &#26469;&#23454;&#29616;&#23545;&#35937;&#30456;&#31561;&#65292;&#24212;&#35813;&#20351;&#29992;&#19994;&#21153;&#38190;&#20540;&#65292;&#30001;&#21807;&#19968;&#30340;&#65292;&#36890;&#24120;&#19981;&#21464;&#30340;&#23646;&#24615;&#32452;&#25104;&#12290;&#24403;&#19968;&#20010;&#30636;&#26102;&#23545;&#35937;&#34987;&#25345;&#20037;&#21270;&#30340;&#26102; &#20505;&#65292;&#23427;&#30340;&#25968;&#25454;&#24211;&#26631;&#35782;&#20250;&#21457;&#29983;&#25913;&#21464;&#12290;&#22914;&#26524;&#19968;&#20010;&#30636;&#26102;&#23545;&#35937;&#65288;&#36890;&#24120;&#20063;&#21253;&#25324;&#33073;&#31649;&#23545;&#35937;&#23454;&#20363;&#65289;&#34987;&#25918;&#20837;&#19968; &#20010;<code class="literal">Set</code>&#65292;&#25913;&#21464;&#23427;&#30340;hashcode&#20250;&#23548;&#33268;&#19982;&#36825;&#20010;<code class="literal">Set</code>&#30340;&#20851;&#31995;&#20013;&#26029;&#12290;&#34429; &#28982;&#19994;&#21153;&#38190;&#20540;&#30340;&#23646;&#24615;&#19981;&#35937;&#25968;&#25454;&#24211;&#20027;&#38190;&#37027;&#26679;&#31283;&#23450;&#19981;&#21464;&#65292;&#20294;&#26159;&#20320;&#21482;&#38656;&#35201;&#20445;&#35777;&#22312;&#21516;&#19968;&#20010;<code class="literal">Set</code> &#20013;&#30340;&#23545;&#35937;&#23646;&#24615;&#30340;&#31283;&#23450;&#24615;&#23601;&#36275;&#22815;&#20102;&#12290;&#35831;&#21040;Hibernate&#32593;&#31449;&#21435;&#23547;&#27714;&#36825;&#20010;&#38382;&#39064;&#26356;&#22810;&#30340;&#35814;&#32454;&#30340;&#35752;&#35770;&#12290;&#35831;&#27880;&#24847;&#65292;&#36825;&#19981;&#26159;&#19968; &#20010;&#26377;&#20851;Hibernate&#30340;&#38382;&#39064;&#65292;&#32780;&#20165;&#20165;&#26159;&#19968;&#20010;&#20851;&#20110;Java&#23545;&#35937;&#26631;&#35782;&#21644;&#21028;&#31561;&#34892;&#20026;&#22914;&#20309;&#23454;&#29616;&#30340;&#38382;&#39064;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="zh-CN">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-issues"></a>11.1.4.&nbsp;&#24120;&#35265;&#38382;&#39064;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#20915;&#19981;&#35201;&#20351;&#29992;&#21453;&#27169;&#24335;<span class="emphasis"><em>session-per-user-session</em></span>&#25110;&#32773;<span class="emphasis"><em> session-per-application</em></span>&#65288;&#24403;&#28982;&#65292;&#36825;&#20010;&#35268;&#23450;&#20960;&#20046;&#27809;&#26377;&#20363;&#22806;&#65289;&#12290;&#35831;&#27880;&#24847;&#65292; &#19979;&#36848;&#19968;&#20123;&#38382;&#39064;&#21487;&#33021;&#20063;&#20250;&#20986;&#29616;&#22312;&#25105;&#20204;&#25512;&#33616;&#30340;&#27169;&#24335;&#20013;&#65292;&#22312;&#20320;&#20316;&#20986;&#26576;&#20010;&#35774;&#35745;&#20915;&#23450;&#20043;&#21069;&#65292;&#35831;&#21153;&#24517;&#29702;&#35299;&#35813;&#27169;&#24335;&#30340;&#24212;&#29992;&#21069;&#25552;&#12290; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p><code class="literal">Session</code> &#23545;&#35937;&#26159;&#38750;&#32447;&#31243;&#23433;&#20840;&#30340;&#12290;&#22914;&#26524;&#19968;&#20010;<code class="literal">Session</code> &#23454;&#20363;&#20801;&#35768;&#20849;&#20139;&#30340;&#35805;&#65292;&#37027;&#20123;&#25903;&#25345;&#24182;&#21457;&#36816;&#34892;&#30340;&#19996;&#19996;&#65292;&#20363;&#22914;HTTP request&#65292;session beans,&#25110;&#32773;&#26159; Swing workers&#65292;&#23558;&#20250;&#23548;&#33268;&#20986;&#29616;&#36164;&#28304;&#20105;&#29992;&#65288;race condition&#65289;&#12290;&#22914;&#26524;&#22312;<code class="literal">HttpSession</code>&#20013;&#26377; Hibernate &#30340;<code class="literal">Session</code>&#30340;&#35805;&#65288;&#31245;&#21518;&#35752;&#35770;&#65289;&#65292;&#20320;&#24212;&#35813;&#32771;&#34385;&#21516;&#27493;&#35775;&#38382;&#20320;&#30340;Http session&#12290; &#21542;&#21017;&#65292;&#21482;&#35201;&#29992;&#25143;&#36275;&#22815;&#24555;&#30340;&#28857;&#20987;&#27983;&#35272;&#22120;&#30340;&#8220;&#21047;&#26032;&#8221;&#65292;&#23601;&#20250;&#23548;&#33268;&#20004;&#20010;&#24182;&#21457;&#36816;&#34892;&#32447;&#31243;&#20351;&#29992;&#21516;&#19968;&#20010; <code class="literal">Session</code>&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>&#19968;&#20010;&#30001;Hibernate&#25243;&#20986;&#30340;&#24322;&#24120;&#24847;&#21619;&#30528;&#20320;&#24517;&#39035;&#31435;&#21363;&#22238;&#28378;&#25968;&#25454;&#24211;&#20107;&#21153;&#65292;&#24182;&#31435;&#21363;&#20851;&#38381;<code class="literal">Session</code> &#65288;&#31245;&#21518;&#20250;&#23637;&#24320;&#35752;&#35770;&#65289;&#12290;&#22914;&#26524;&#20320;&#30340;<code class="literal">Session</code>&#32465;&#23450;&#21040;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#19978;&#65292;&#20320;&#24517; &#39035;&#20572;&#27490;&#35813;&#24212;&#29992;&#31243;&#24207;&#12290;&#22238;&#28378;&#25968;&#25454;&#24211;&#20107;&#21153;&#24182;&#19981;&#20250;&#25226;&#20320;&#30340;&#19994;&#21153;&#23545;&#35937;&#36864;&#22238;&#21040;&#20107;&#21153;&#21551;&#21160;&#26102;&#20505;&#30340;&#29366;&#24577;&#12290;&#36825; &#24847;&#21619;&#30528;&#25968;&#25454;&#24211;&#29366;&#24577;&#21644;&#19994;&#21153;&#23545;&#35937;&#29366;&#24577;&#19981;&#21516;&#27493;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36825;&#19981;&#26159;&#20160;&#20040;&#38382;&#39064;&#65292;&#22240;&#20026;&#24322;&#24120;&#26159;&#19981;&#21487; &#24674;&#22797;&#30340;,&#20320;&#24517;&#39035;&#22312;&#22238;&#28378;&#20043;&#21518;&#37325;&#26032;&#24320;&#22987;&#25191;&#34892;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p><code class="literal">Session</code> &#32531;&#23384;&#20102;&#22788;&#20110;&#25345;&#20037;&#21270;&#29366;&#24577;&#30340;&#27599;&#20010;&#23545;&#35937;&#65288;Hibernate&#20250;&#30417;&#35270;&#21644;&#26816;&#26597;&#33039;&#25968;&#25454;&#65289;&#12290; &#36825;&#24847;&#21619;&#30528;&#65292;&#22914;&#26524;&#20320;&#35753;<code class="literal">Session</code>&#25171;&#24320;&#24456;&#38271;&#19968;&#27573;&#26102;&#38388;&#65292;&#25110;&#26159;&#20165;&#20165;&#36733;&#20837;&#20102;&#36807;&#22810;&#30340;&#25968;&#25454;&#65292; <code class="literal">Session</code>&#21344;&#29992;&#30340;&#20869;&#23384;&#20250;&#19968;&#30452;&#22686;&#38271;&#65292;&#30452;&#21040;&#25243;&#20986;OutOfMemoryException&#24322;&#24120;&#12290;&#36825;&#20010; &#38382;&#39064;&#30340;&#19968;&#20010;&#35299;&#20915;&#26041;&#27861;&#26159;&#35843;&#29992;<code class="literal">clear()</code> &#21644;<code class="literal">evict()</code>&#26469;&#31649;&#29702; <code class="literal">Session</code>&#30340;&#32531;&#23384;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#38656;&#35201;&#22823;&#25209;&#37327;&#25968;&#25454;&#25805;&#20316;&#30340;&#35805;&#65292;&#26368;&#22909;&#32771;&#34385; &#20351;&#29992;&#23384;&#20648;&#36807;&#31243;&#12290;&#22312;<a href="batch.html" title="&#31532;&nbsp;13&nbsp;&#31456;&nbsp;&aelig;&#137;&sup1;&eacute;&#135;&#143;&aring;&curren;&#132;&ccedil;&#144;&#134;&iuml;&frac14;&#136;Batch processing&iuml;&frac14;&#137;">&#31532;&nbsp;13&nbsp;&#31456; <i xmlns:xlink="http://www.w3.org/1999/xlink">&aelig;&#137;&sup1;&eacute;&#135;&#143;&aring;&curren;&#132;&ccedil;&#144;&#134;&iuml;&frac14;&#136;Batch processing&iuml;&frac14;&#137;</i></a>&#20013;&#26377;&#19968;&#20123;&#35299;&#20915;&#26041;&#26696;&#12290;&#22312;&#29992;&#25143;&#20250;&#35805;&#26399;&#38388;&#19968;&#30452;&#20445;&#25345; <code class="literal">Session</code>&#25171;&#24320;&#20063;&#24847;&#21619;&#30528;&#20986;&#29616;&#33039;&#25968;&#25454;&#30340;&#21487;&#33021;&#24615;&#24456;&#39640;&#12290; 
                        </p>
                     </li>
                  </ul>
               </div>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-metadata.html">&#19978;&#19968;&#39029;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="transactions-demarcation.html">&#19979;&#19968;&#39029;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.12.&nbsp;&#20351;&#29992;&#20803;&#25968;&#25454;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;11.2.&nbsp;&#25968;&#25454;&#24211;&#20107;&#21153;&#22768;&#26126;</td>
            </tr>
         </table>
      </div>
   </body>
</html>