<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>2.5. &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="architecture.html" title="&#31532;2&#31456; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;">
      <link rel="prev" href="architecture-jca.html" title="2.4. JCA &#12469;&#12509;&#12540;&#12488;">
      <link rel="next" href="session-configuration.html" title="&#31532;3&#31456; &#35373;&#23450;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">2.5. &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="architecture-jca.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;2&#31456; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="session-configuration.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="architecture-current-session"></a>2.5. &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate &#12434;&#20351;&#12387;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#12411;&#12392;&#12435;&#12393;&#12289;&#12394;&#12435;&#12425;&#12363;&#12398;&#24418;&#12391;"&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;"&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12399;&#12289;&#29305;&#23450;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#12473;&#12467;&#12540;&#12503;&#12398;&#12394;&#12363;&#12391;&#26377;&#21177;&#12394;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;&#36890;&#24120;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12372;&#12392;&#12395;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#27083;&#25104;&#12377;&#12427;&#12418;&#12398;&#12398;&#23450;&#32681;&#12399;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
            &#12375;&#12363;&#12418;&#12289;&#30064;&#12394;&#12427;&#35079;&#25968;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12399;&#12289;&#29694;&#26178;&#28857;&#12395;&#23550;&#12375;&#12390;&#30064;&#12394;&#12427;&#12473;&#12467;&#12540;&#12503;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; &#12496;&#12540;&#12472;&#12519;&#12531;3.0&#12424;&#12426;&#21069;&#12398; Hibernate &#12391;&#12399;&#12289;&#33258;&#20316;&#12398; <code class="literal">ThreadLocal</code> &#12505;&#12540;&#12473;&#12398;&#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12434; &#21033;&#29992;&#12377;&#12427;&#12363;&#12289; <code class="literal">HibernateUtil</code> &#12398;&#12424;&#12358;&#12394;&#12504;&#12523;&#12497;&#12540;&#12463;&#12521;&#12473;&#12434;&#21033;&#29992;&#12377;&#12427;&#12363;&#12289; proxy/interception &#12505;&#12540;&#12473;&#12398;&#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12434;&#25552;&#20379;&#12377;&#12427; &#65288;Spring &#12420; Pico &#12398;&#12424;&#12358;&#12394;&#65289;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12398;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#21033;&#29992;&#12377;&#12427;&#12363;&#12398;&#12356;&#12378;&#12428;&#12363;&#12391;&#12375;&#12383;&#12290; 
         </p>
         <p>&#12496;&#12540;&#12472;&#12519;&#12531; 3.0.1 &#12363;&#12425;&#12289;Hibernate &#12395;&#12399; <code class="literal">SessionFactory.getCurrentSession()</code> &#12364; &#21152;&#12431;&#12426;&#12414;&#12375;&#12383;&#12290; &#12371;&#12428;&#12399;&#12289; <code class="literal">JTA</code> &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#20351;&#29992;&#12434;&#21069;&#25552;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; <code class="literal">JTA</code> &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#29694;&#22312;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#12473;&#12467;&#12540;&#12503;&#12392;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#20001;&#26041;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; Hibernate &#12481;&#12540;&#12512;&#12399;&#12289;&#27425;&#12398;&#12371;&#12392;&#12434;&#20027;&#24373;&#12375;&#12414;&#12377;&#12290; &#24040;&#22823;&#12394;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12398; <code class="literal">JTA TransactionManager</code> &#23455;&#35013;&#12364;&#25104;&#29087;&#12375;&#12383;&#12425;&#12289; <code class="literal">J2EE</code> &#12467;&#12531;&#12486;&#12490;&#19978;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289; &#12411;&#12392;&#12435;&#12393;&#12398;&#65288;&#12377;&#12409;&#12390;&#12392;&#12399;&#35328;&#12431;&#12394;&#12356;&#12364;&#65289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12289; <code class="literal">JTA</code> &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#31649;&#29702;&#12434;&#20351;&#29992;&#12377;&#12409;&#12365;&#12391;&#12354;&#12427;&#12392;&#12290; &#12371;&#12398;&#32771;&#12360;&#12395;&#22522;&#12389;&#12367;&#12392;&#12289; <code class="literal">JTA</code> &#12505;&#12540;&#12473;&#12398;&#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12434; &#20351;&#12358;&#12375;&#12363;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290; 
         </p>
         <p>&#12375;&#12363;&#12375;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; 3.1 &#12363;&#12425;&#12399;&#12289; <code class="literal">SessionFactory.getCurrentSession()</code> &#12398;&#24460;&#12398;&#20966;&#29702;&#12364;&#12289; &#12503;&#12521;&#12460;&#12502;&#12523;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290; &#12371;&#12428;&#12434;&#21463;&#12369;&#12390;&#12289;&#29694;&#22312;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#23450;&#32681;&#12377;&#12427;&#12473;&#12467;&#12540;&#12503;&#12392;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#12503;&#12521;&#12460;&#12499;&#12522;&#12486;&#12451;&#12434;&#21487;&#33021;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; &#26032;&#12375;&#12356;&#25313;&#24373;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473; ( <code class="literal">org.hibernate.context.CurrentSessionContext</code> ) &#12392; &#26032;&#12375;&#12356;&#27083;&#25104;&#12497;&#12521;&#12513;&#12540;&#12479; ( <code class="literal">hibernate.current_session_context_class</code> ) &#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290; 
         </p>
         <p><code class="literal">org.hibernate.context.CurrentSessionContext</code> &#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#35215;&#32004;&#12395;&#12388;&#12356;&#12390;&#12398; &#35443;&#32048;&#12394;&#20869;&#23481;&#12399; Javadoc &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12381;&#12428;&#12395;&#12399;&#12289; <code class="literal">currentSession()</code> &#12392;&#12356;&#12358;1&#12388;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#23450;&#32681;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289; &#12381;&#12398;&#23455;&#35013;&#12399;&#12289;&#29694;&#22312;&#12398;&#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12434;&#36861;&#36321;&#12377;&#12427;&#12371;&#12392;&#12395;&#36012;&#20219;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290; &#12381;&#12398;&#12414;&#12414;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12289;Hibernate&#12399;&#12371;&#12398;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#23455;&#35013;&#12434;2&#12388;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; 
         </p>
         <div class="itemizedlist">
            <ul type="disc">
               <li>
                  <p><code class="literal">org.hibernate.context.JTASessionContext</code> - <code class="literal">JTA</code> &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#12289;&#29694;&#22312;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#36861;&#36321;&#12373;&#12428;&#12289; &#12473;&#12467;&#12540;&#12503;&#12434;&#27770;&#12417;&#12425;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#20966;&#29702;&#12399;&#12289;&#21476;&#12356;JTA&#12384;&#12369;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12392;&#12414;&#12387;&#12383;&#12367;&#21516;&#12376;&#12391;&#12377;&#12290; &#35443;&#32048;&#12399;Javadoc&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">org.hibernate.context.ThreadLocalSessionContext</code> - &#12473;&#12524;&#12483;&#12489;&#12398;&#23455;&#34892;&#12395;&#12424;&#12387;&#12390;&#12289;&#29694;&#22312;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#36861;&#36321;&#12373;&#12428;&#12414;&#12377;&#12290; &#35443;&#32048;&#12399;Javadoc&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">org.hibernate.context.ManagedSessionContext</code> - &#12473;&#12524;&#12483;&#12489;&#12398;&#23455;&#34892;&#12395;&#12424;&#12387;&#12390;&#12289;&#29694;&#22312;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#36861;&#36321;&#12373;&#12428;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#12463;&#12521;&#12473;&#12398;static&#12513;&#12477;&#12483;&#12489;&#12391; <code class="literal">Session</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434; &#12496;&#12452;&#12531;&#12489;/&#12450;&#12531;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#36012;&#20219;&#12399;&#12354;&#12394;&#12383;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#27770;&#12375;&#12390; <code class="literal">Session</code> &#12434;&#12458;&#12540;&#12503;&#12531;&#12289;&#12501;&#12521;&#12483;&#12471;&#12517;&#12289;&#12463;&#12525;&#12540;&#12474;&#12375;&#12414;&#12379;&#12435;&#12290; 
                  </p>
               </li>
            </ul>
         </div>
         <p>The first two implementations provide a "one session - one database transaction" programming model, also known and used as
            <span class="emphasis"><em>session-per-request</em></span>. The beginning and end of a Hibernate session is defined by the duration of a database transaction. If you use programmatic
            transaction demarcation in plain JSE without JTA, you are advised to use the Hibernate <code class="literal">Transaction</code> API to hide the underlying transaction system from your code. If you use JTA, use the JTA interfaces to demarcate transactions.
            If you execute in an EJB container that supports CMT, transaction boundaries are defined declaratively and you don't need
            any transaction or session demarcation operations in your code. Refer to <a href="transactions.html" title="&#31532;11&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;">&#31456;&nbsp;11. <i xmlns:xlink="http://www.w3.org/1999/xlink">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;</i></a> for more information and code examples. 
         </p>
         <p><code class="literal">hibernate.current_session_context_class</code> &#35373;&#23450;&#12497;&#12521;&#12513;&#12540;&#12479;&#12399;&#12289; <code class="literal">org.hibernate.context.CurrentSessionContext</code> &#12398;&#12393;&#12398;&#23455;&#35013;&#12434;&#20351;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#19979;&#20301;&#20114;&#25563;&#24615;&#12398;&#12383;&#12417;&#12289;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12364;&#35373;&#23450;&#12373;&#12428;&#12378; <code class="literal">org.hibernate.transaction.TransactionManagerLookup</code> &#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12383;&#22580;&#21512;&#12289; Hibernate&#12399; <code class="literal">org.hibernate.context.JTASessionContext</code> &#12434;&#20351;&#12358;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#36890;&#24120;&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#20516;&#12395;&#12399;&#12289;3&#12388;&#12398;&#23455;&#35013;&#12398;&#20013;&#12363;&#12425;&#20351;&#29992;&#12377;&#12427;&#23455;&#35013;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;&#12434;&#30452;&#25509;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;"jta", "thread", "managed"&#12392;&#12356;&#12358;&#12381;&#12428;&#12382;&#12428;&#12398;&#30465;&#30053;&#21517;&#12418;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="architecture-jca.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="architecture.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="session-configuration.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">2.4. JCA &#12469;&#12509;&#12540;&#12488;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;&#31532;3&#31456; &#35373;&#23450;</td>
            </tr>
         </table>
      </div>
   </body>
</html>