<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;2&#31456; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="tutorial-summary.html" title="1.5. &#35201;&#32004;">
      <link rel="next" href="architecture-states.html" title="2.2. &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#29366;&#24907;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;2&#31456; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="tutorial-summary.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="architecture-states.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="architecture"></a>&#31532;2&#31456; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect1" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="architecture-overview"></a>2.1. &#27010;&#35251;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Hibernate&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12398;&#65288;&#38750;&#24120;&#12395;&#65289;&#39640;&#12356;&#12524;&#12505;&#12523;&#12363;&#12425;&#12398;&#12499;&#12517;&#12540;&#65306; </p>
            <div class="mediaobject" align="center"><img src="images/overview.png" align="middle"></div>
            <p>&#12371;&#12398;&#22259;&#12399;Hibernate&#12364;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#27704;&#32154;&#21270;&#12469;&#12540;&#12499;&#12473; &#65288;&#12392;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12434;&#25552;&#20379;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#35373;&#23450;&#12487;&#12540;&#12479;&#12434;&#20351;&#12358;&#12371;&#12392;&#12434; &#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; </p>
            <p>&#12371;&#12371;&#12391;&#23455;&#34892;&#26178;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12398;&#12424;&#12426;&#35443;&#32048;&#12394;&#12499;&#12517;&#12540;&#12434;&#12362;&#35211;&#12379;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; &#12354;&#12356;&#12395;&#12367;&#12289;Hibernate&#12399;&#26580;&#36575;&#12391;&#12354;&#12426;&#12289;&#12356;&#12429;&#12356;&#12429;&#12394;&#12450;&#12503;&#12525;&#12540;&#12481;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#12371;&#12371;&#12391;&#12399;&#12289;2&#12388;&#12398;&#26997;&#31471;&#12394;&#20363;&#12434;&#12362;&#35211;&#12379;&#12375;&#12414;&#12377;&#12290; &#12300;&#36605;&#12356;&#12301;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#33258;&#21069;&#12398;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#29992;&#24847;&#12375;&#12289;
               &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#33258;&#36523;&#12364;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#26041;&#27861;&#12399;&#12289;Hibernate API&#12398;&#26368;&#23567;&#38480;&#12398;&#12469;&#12502;&#12475;&#12483;&#12488;&#12434;&#20351;&#12356;&#12414;&#12377;&#65306; 
            </p>
            <div class="mediaobject" align="center"><img src="images/lite.png" align="middle"></div>
            <p>&#12300;&#37325;&#12356;&#12301;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#12289;&#12381;&#12398;&#19979;&#12395;&#20301;&#32622;&#12377;&#12427;JDBC&#12420;JTA&#12398;API&#12434; &#21462;&#12426;&#25173;&#12387;&#12390;&#25277;&#35937;&#21270;&#12375;&#12289;&#12381;&#12398;&#35443;&#32048;&#12398;&#38754;&#20498;&#12434;Hibernate&#12395;&#35211;&#12373;&#12379;&#12414;&#12377;&#12290; </p>
            <div class="mediaobject" align="center"><img src="images/full_cream.png" align="middle"></div>
            <p>Heres some definitions of the objects in the diagrams: </p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term">SessionFactory (<code class="literal">org.hibernate.SessionFactory</code>)</span></dt>
                  <dd>
                     <p>1&#12388;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23550;&#12377;&#12427;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12383;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398; &#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12394;&#65288;&#26356;&#26032;&#19981;&#33021;&#12398;&#65289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12290; <code class="literal">Session</code> &#12398;&#12501;&#12449;&#12463;&#12488;&#12522;&#12391;&#12354;&#12426;&#12289; <code class="literal">ConnectionProvider</code> &#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12290; &#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#12375;&#12390;&#12289;&#12503;&#12525;&#12475;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12524;&#12505;&#12523;&#12395;&#12362;&#12356;&#12390;&#12289; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#38291;&#12391;&#20877;&#21033;&#29992;&#21487;&#33021;&#12394;&#12487;&#12540;&#12479;&#12398;&#65288;&#20108;&#27425;&#65289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term">Session (<code class="literal">org.hibernate.Session</code>)</span></dt>
                  <dd>
                     <p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#27704;&#32154;&#12473;&#12488;&#12450;&#12392;&#12398;&#23550;&#35441;&#12434;&#34920;&#12377;&#12289; &#12471;&#12531;&#12464;&#12523;&#12473;&#12524;&#12483;&#12489;&#12391;&#30701;&#21629;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290; JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#12521;&#12483;&#12503;&#12375;&#12414;&#12377;&#12290; <code class="literal">Transaction</code> &#12398;&#12501;&#12449;&#12463;&#12488;&#12522;&#12391;&#12377;&#12290; &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#24517;&#38920;&#12398;&#65288;&#19968;&#27425;&#65289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12464;&#12521;&#12501;&#12434;&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12377;&#12427;&#26178;&#12420;&#12289; &#35672;&#21029;&#23376;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#26908;&#32034;&#12377;&#12427;&#26178;&#12395;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term">Persistent objects &#12392; Collections</span></dt>
                  <dd>
                     <p>&#27704;&#32154;&#21270;&#29366;&#24907;&#12392;&#12499;&#12472;&#12493;&#12473;&#12513;&#12477;&#12483;&#12489;&#12434;&#25345;&#12388;&#12289;&#30701;&#21629;&#12391;&#12471;&#12531;&#12464;&#12523;&#12473;&#12524;&#12483;&#12489;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290; &#12371;&#12428;&#12399;&#36890;&#24120;&#12398;JavaBeans/POJO&#12398;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#29305;&#24500;&#30340;&#12394;&#12371;&#12392;&#12399;&#12289; &#12381;&#12398;&#26178;&#28857;&#12391;&#12398;&#65288;&#12383;&#12384;1&#12388;&#12398;&#65289; <code class="literal">Session</code> &#12392;&#38306;&#36899;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290; <code class="literal">Session</code> &#12364;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12427;&#12392;&#12377;&#12368;&#12395;&#12289; &#12381;&#12428;&#12425;&#12399;&#20999;&#12426;&#38626;&#12373;&#12428;&#12390;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#23652;&#12363;&#12425;&#33258;&#30001;&#12395;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#65288;&#20363;&#12360;&#12400;&#12487;&#12540;&#12479;&#12539;&#12488;&#12521;&#12531;&#12473;&#12501;&#12449;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;&#12289; &#12503;&#12524;&#12476;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531;&#23652;&#12363;&#12425;&#12289;&#12414;&#12383;&#12399;&#12503;&#12524;&#12476;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531;&#23652;&#12408;&#30452;&#25509;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#65289; 
                     </p>
                  </dd>
                  <dt><span class="term">Transient &#12392; detached &#12394; objects &#12392; Collections</span></dt>
                  <dd>
                     <p>&#29694;&#26178;&#28857;&#12391;&#12399; <code class="literal">Session</code> &#12392;&#38306;&#36899;&#12375;&#12390;&#12356;&#12394;&#12356;&#12289; &#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12290; &#12377;&#12391;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20596;&#12391;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#12414;&#12384;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12363;&#12289; &#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12383; <code class="literal">Session</code> &#12391;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#12363;&#12398;&#12393;&#12385;&#12425;&#12363;&#12391;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term">Transaction (<code class="literal">org.hibernate.Transaction</code>)</span></dt>
                  <dd>
                     <p>(&#12458;&#12503;&#12471;&#12519;&#12531;)&#21407;&#23376;&#24615;&#12434;&#25345;&#12388;&#20316;&#26989;&#21336;&#20301;(Unit of Work)&#12434;&#25351;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#20351;&#29992;&#12377;&#12427;&#12289; &#12471;&#12531;&#12464;&#12523;&#12473;&#12524;&#12483;&#12489;&#12391;&#30701;&#21629;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12290; &#19979;&#12395;&#20301;&#32622;&#12377;&#12427;JDBC&#12289;JTA&#12289;CORBA&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#25277;&#35937;&#21270;&#12375;&#12414;&#12377;&#12290;
                        <code class="literal">Session</code> &#12399;&#12289;&#26178;&#12395;&#12399; &#12356;&#12367;&#12388;&#12363;&#12398; <code class="literal">Transaction</code> &#12434;&#12414;&#12383;&#12364;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290; &#12375;&#12363;&#12375;&#12289;&#19979;&#12398;&#23652;&#12398;API&#12434;&#20351;&#12358;&#12395;&#12379;&#12424;&#12289; <code class="literal">Transaction</code> &#12434;&#20351;&#12358;&#12395;&#12379;&#12424;&#12289; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#22659;&#30028;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;&#27770;&#12375;&#12390;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#65281;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term">ConnectionProvider (<code class="literal">org.hibernate.connection.ConnectionProvider</code>)</span></dt>
                  <dd>
                     <p>(&#12458;&#12503;&#12471;&#12519;&#12531;)JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#65288;&#12392;&#12381;&#12398;&#12503;&#12540;&#12523;&#65289;&#12398;&#12501;&#12449;&#12463;&#12488;&#12522;&#12290; &#19979;&#12398;&#23652;&#12395;&#20301;&#32622;&#12377;&#12427; <code class="literal">Datasource</code> &#12420; <code class="literal">DriverManager</code> &#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#25277;&#35937;&#21270;&#12375;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12399;&#20844;&#38283;&#12373;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;&#38283;&#30330;&#32773;&#12364;&#32153;&#25215;&#12414;&#12383;&#12399;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12399;&#21487;&#33021;&#12391;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term">TransactionFactory (<code class="literal">org.hibernate.TransactionFactory</code>)</span></dt>
                  <dd>
                     <p>(&#12458;&#12503;&#12471;&#12519;&#12531;) <code class="literal">Transaction</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12501;&#12449;&#12463;&#12488;&#12522;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12399;&#20844;&#38283;&#12373;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289;&#38283;&#30330;&#32773;&#12364;&#32153;&#25215;&#12414;&#12383;&#12399;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12399;&#21487;&#33021;&#12391;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><span class="emphasis"><em>Extension Interfaces</em></span></span></dt>
                  <dd>
                     <p>Hibernate&#12399;&#12289;&#27704;&#32154;&#23652;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; &#22810;&#12367;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#25313;&#24373;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#35443;&#32048;&#12399;API&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p>
                  </dd>
               </dl>
            </div>
            <p>
                       
            </p>
            <p>&#12300;&#36605;&#12356;&#12301;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#30452;&#25509;JTA&#12420;JDBC&#12392;&#23550;&#35441;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; <code class="literal">Transaction</code> &#12420; <code class="literal">TransactionFactory</code> &#12420; <code class="literal">ConnectionProvider</code> &#12434;&#12496;&#12452;&#12497;&#12473;&#12375;&#12414;&#12377;&#12290; 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="tutorial-summary.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="architecture-states.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">1.5. &#35201;&#32004;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;2.2. &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#29366;&#24907;</td>
            </tr>
         </table>
      </div>
   </body>
</html>