<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;24&#31456; &#12505;&#12473;&#12488;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="misc.html" title="23.4. &#31278;&#12293;&#38609;&#22810;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#20363;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;24&#31456; &#12505;&#12473;&#12488;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="misc.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;</td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="best-practices"></a>&#31532;24&#31456; &#12505;&#12473;&#12488;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;
                  </h2>
               </div>
            </div>
         </div>
         <div class="variablelist">
            <dl>
               <dt><span class="term">&#12463;&#12521;&#12473;&#12399;&#32048;&#12363;&#12356;&#31890;&#24230;&#12391;&#26360;&#12365; <code class="literal">&lt;component&gt;</code> &#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p><code class="literal">street</code>&#65288;&#36890;&#12426;&#65289;, <code class="literal">suburb</code> &#65288;&#37117;&#24066;&#65289;, <code class="literal">state</code>&#65288;&#24030;&#65289;, <code class="literal">postcode</code> &#65288;&#37109;&#20415;&#30058;&#21495;&#65289;&#12434;&#12459;&#12503;&#12475;&#12523;&#21270;&#12377;&#12427; <code class="literal">Address</code>&#65288;&#20303;&#25152;&#65289;&#12463;&#12521;&#12473;&#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290; &#12381;&#12358;&#12377;&#12428;&#12400;&#12467;&#12540;&#12489;&#12364;&#20877;&#21033;&#29992;&#12375;&#12420;&#12377;&#12367;&#12394;&#12426;&#12289;&#12522;&#12501;&#12449;&#12463;&#12479;&#12522;&#12531;&#12464;&#12418;&#31777;&#21336;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">&#27704;&#32154;&#12463;&#12521;&#12473;&#12395;&#12399;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>Hibernate&#12391;&#12399;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12364;&#12289; &#20351;&#29992;&#12377;&#12409;&#12365;&#29702;&#30001;&#12364;&#12383;&#12367;&#12373;&#12435;&#12354;&#12426;&#12414;&#12377;&#12290; &#35672;&#21029;&#23376;&#12399;&#12300;&#20154;&#24037;&#30340;&#12301;&#65288;&#29983;&#25104;&#12373;&#12428;&#12383;&#12289;&#26989;&#21209;&#30340;&#12394;&#24847;&#21619;&#12434;&#25345;&#12383;&#12394;&#12356;&#65289; &#12394;&#12418;&#12398;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290; </p>
               </dd>
               <dt><span class="term">&#33258;&#28982;&#12461;&#12540;&#12434;&#35211;&#12388;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#12377;&#12409;&#12390;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395;&#23550;&#12375;&#12390;&#33258;&#28982;&#12461;&#12540;&#12434;&#35211;&#12388;&#12369;&#12390;&#12289; <code class="literal">&lt;natural-id&gt;</code> &#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; &#33258;&#28982;&#12461;&#12540;&#12434;&#27083;&#25104;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27604;&#36611;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; <code class="literal">equals()</code> &#12392; <code class="literal">hashCode()</code> &#12434;&#23455;&#35013;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">&#12463;&#12521;&#12473;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#12381;&#12428;&#12382;&#12428;&#12398;&#12463;&#12521;&#12473;&#23554;&#29992;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#21336;&#19968;&#12398;&#24040;&#22823;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; <code class="literal">com.eg.Foo</code> &#12463;&#12521;&#12473;&#12394;&#12425; <code class="literal">com/eg/Foo.hbm.xml</code> &#12501;&#12449;&#12452;&#12523;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; &#12371;&#12398;&#12371;&#12392;&#12399;&#12289;&#29305;&#12395;&#12481;&#12540;&#12512;&#12391;&#12398;&#38283;&#30330;&#12395;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">&#12522;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#12289;&#12381;&#12428;&#12425;&#12364;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12377;&#12427;&#12463;&#12521;&#12473;&#12392;&#19968;&#32210;&#12395;&#37197;&#32622;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; </p>
               </dd>
               <dt><span class="term">&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12434;&#22806;&#37096;&#12395;&#32622;&#12367;&#12371;&#12392;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;</span></dt>
               <dd>
                  <p>&#12463;&#12456;&#12522;&#12364;ANSI&#27161;&#28310;&#12391;&#12394;&#12356;SQL&#38306;&#25968;&#12434;&#21628;&#12435;&#12391;&#12356;&#12427;&#12394;&#12425;&#12289;&#12371;&#12428;&#12399;&#12424;&#12356;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;&#12391;&#12377;&#12290; &#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12408;&#22806;&#20986;&#12375;&#12377;&#12428;&#12400;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12509;&#12540;&#12479;&#12502;&#12523;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; </p>
               </dd>
               <dt><span class="term">&#12496;&#12452;&#12531;&#12489;&#22793;&#25968;&#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>JDBC&#12398;&#22580;&#21512;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#12289;&#23450;&#25968;&#12391;&#12394;&#12356;&#20516;&#12399;&#24517;&#12378;"?"&#12391;&#32622;&#12365;&#25563;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290; &#23450;&#25968;&#12391;&#12394;&#12356;&#20516;&#12434;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12463;&#12456;&#12522;&#12391;&#25991;&#23383;&#21015;&#25805;&#20316;&#12434;&#20351;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290; &#21517;&#21069;&#20184;&#12365;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#20351;&#12358;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#12373;&#12425;&#12395;&#33391;&#12356;&#12391;&#12377;&#12290; </p>
               </dd>
               <dt><span class="term">JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#31649;&#29702;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;</span></dt>
               <dd>
                  <p>Hibernate&#12391;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;&#12371;&#12392;&#12364;&#35377;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12371;&#12428;&#12399;&#26368;&#32066;&#25163;&#27573;&#12384;&#12392;&#24605;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#32068;&#12415;&#36796;&#12415;&#12398;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12289; <code class="literal">org.hibernate.connection.ConnectionProvider</code> &#12434;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">&#12459;&#12473;&#12479;&#12512;&#22411;&#12398;&#20351;&#29992;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#12354;&#12427;&#12521;&#12452;&#12502;&#12521;&#12522;&#12363;&#12425;&#25345;&#12387;&#12390;&#12365;&#12383;Java&#22411;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; &#12375;&#12363;&#12375;&#12381;&#12398;&#22411;&#12395;&#12399;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#12450;&#12463;&#12475;&#12469;&#12364;&#12394;&#12356;&#12392;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12399; <code class="literal">org.hibernate.UserType</code> &#12398;&#23455;&#35013;&#12434;&#32771;&#12360;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290; &#12381;&#12358;&#12377;&#12428;&#12400;Hibernate&#22411;&#12392;&#12398;&#23455;&#35013;&#22793;&#25563;&#12434;&#24515;&#37197;&#12379;&#12378;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12467;&#12540;&#12489;&#12434;&#25201;&#12360;&#12414;&#12377;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">&#12508;&#12488;&#12523;&#12493;&#12483;&#12463;&#12434;&#35299;&#28040;&#12377;&#12427;&#12395;&#12399;JDBC&#12434;&#12495;&#12531;&#12489;&#12467;&#12540;&#12489;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#12471;&#12473;&#12486;&#12512;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12463;&#12522;&#12486;&#12451;&#12459;&#12523;&#12394;&#38936;&#22495;&#12391;&#12399;&#12289; &#12354;&#12427;&#31278;&#12398;&#25805;&#20316;&#12395;JDBC&#12434;&#30452;&#25509;&#20351;&#12358;&#12392;&#33391;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290; &#12375;&#12363;&#12375;&#20309;&#12364;&#12508;&#12488;&#12523;&#12493;&#12483;&#12463;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12363; <span class="emphasis"><em>&#12399;&#12387;&#12365;&#12426;&#12377;&#12427;</em></span> &#12414;&#12391;&#12399;&#24453;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12414;&#12383;JDBC&#12434;&#30452;&#25509;&#20351;&#12358;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;&#24517;&#12378;&#12375;&#12418;&#36895;&#12367;&#12394;&#12427;&#12392;&#12399;&#38480;&#12425;&#12394;&#12356;&#12371;&#12392;&#12418;&#29702;&#35299;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; JDBC&#12434;&#30452;&#25509;&#20351;&#12358;&#24517;&#35201;&#12364;&#12354;&#12428;&#12400;&#12289;Hibernate&#12398; <code class="literal">Session</code> &#12434;&#12458;&#12540;&#12503;&#12531;&#12375;&#12390;&#12289; JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12358;&#12392;&#33391;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290; &#20381;&#28982;&#12392;&#12375;&#12390;&#21516;&#12376;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#25126;&#30053;&#12392;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#20351;&#12360;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290; 
                  </p>
               </dd>
               <dt><span class="term"><code class="literal">Session</code> &#12398;&#12501;&#12521;&#12483;&#12471;&#12517;&#12434;&#29702;&#35299;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>Session&#12364;&#27704;&#32154;&#29366;&#24907;&#12434;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#21516;&#26399;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12392;&#12365;&#12393;&#12365;&#12354;&#12426;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12371;&#12428;&#12364;&#12354;&#12414;&#12426;&#12395;&#38971;&#32321;&#12395;&#36215;&#12371;&#12427;&#12424;&#12358;&#12384;&#12392;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12395;&#24433;&#38911;&#12364;&#20986;&#12390;&#12365;&#12414;&#12377;&#12290; &#33258;&#21205;&#12501;&#12521;&#12483;&#12471;&#12517;&#12434;&#28961;&#21177;&#12395;&#12375;&#12383;&#12426;&#12289;&#29305;&#23450;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12463;&#12456;&#12522;&#12420;&#25805;&#20316;&#12398;&#38918;&#30058;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
                     &#19981;&#24517;&#35201;&#12394;&#12501;&#12521;&#12483;&#12471;&#12517;&#12434;&#26368;&#23567;&#38480;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">3&#23652;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12391;&#12399;&#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20351;&#29992;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#12469;&#12540;&#12502;&#12524;&#12483;&#12488; / &#12475;&#12483;&#12471;&#12519;&#12531;&#12499;&#12540;&#12531;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12434;&#20351;&#12358;&#12392;&#12365;&#12289; &#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#23652; / JSP&#23652;&#38291;&#12391;&#12475;&#12483;&#12471;&#12519;&#12531;&#12499;&#12540;&#12531;&#12391;&#12525;&#12540;&#12489;&#12375;&#12383;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12420;&#12426;&#21462;&#12426;&#12391;&#12365;&#12414;&#12377;&#12290; &#12381;&#12398;&#38555;&#12522;&#12463;&#12456;&#12473;&#12488;&#12372;&#12392;&#12395;&#26032;&#12375;&#12356;Session&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12414;&#12383; <code class="literal">Session.merge()</code> &#12420; <code class="literal">Session.saveOrUpdate()</code> &#12434;&#20351;&#12387;&#12390;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#21516;&#26399;&#12373;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">2&#23652;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12391;&#12399;&#38263;&#12356;&#27704;&#32154;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#20351;&#29992;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#26368;&#39640;&#12398;&#12473;&#12465;&#12540;&#12521;&#12499;&#12522;&#12486;&#12451;&#12434;&#24471;&#12427;&#12395;&#12399;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#30701;&#12367;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12375;&#12363;&#12375;&#38263;&#12356;&#38291;&#23455;&#34892;&#12377;&#12427; <span class="emphasis"><em>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;</em></span> &#12398;&#23455;&#35013;&#12364;&#24517;&#35201;&#12394;&#12371;&#12392;&#12399;&#12375;&#12400;&#12375;&#12400;&#12391;&#12377;&#12290; &#12371;&#12428;&#12399;&#12518;&#12540;&#12470;&#12398;&#35222;&#28857;&#12363;&#12425;&#12399;1&#20491;&#12398;&#20316;&#26989;&#21336;&#20301;&#65288;unit of work&#65289;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;/&#12524;&#12473;&#12509;&#12531;&#12473;&#12469;&#12452;&#12463;&#12523;&#12395;&#12414;&#12383;&#12364;&#12426;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#23455;&#35013;&#12395;&#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#12358;&#12398;&#12399;&#19968;&#33324;&#30340;&#12391;&#12377;&#12290;
                     &#12381;&#12358;&#12391;&#12394;&#12369;&#12428;&#12400;&#12289;2&#23652;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12398;&#22580;&#21512;&#12399;&#29305;&#12395;&#36969;&#20999;&#12394;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#20840;&#20307;&#12395;&#23550;&#12375;&#12390; &#21336;&#19968;&#12398;&#12458;&#12540;&#12503;&#12531;&#12394;&#27704;&#32154;&#21270;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#65288;&#12475;&#12483;&#12471;&#12519;&#12531;&#65289;&#12434;&#32173;&#25345;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12381;&#12375;&#12390;&#21336;&#32020;&#12395;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#26368;&#24460;&#12395;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#20999;&#26029;&#12375;&#12289;
                     &#27425;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#26368;&#21021;&#12395;&#20877;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290; &#27770;&#12375;&#12390;&#35079;&#25968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12518;&#12540;&#12473;&#12465;&#12540;&#12473;&#12395;&#28193;&#12387;&#12390; 1&#20491;&#12398;Session&#12434;&#20351;&#12356;&#22238;&#12373;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#12381;&#12358;&#12391;&#12394;&#12369;&#12428;&#12400;&#12289;&#21476;&#12356;&#12487;&#12540;&#12479;&#12391;&#20316;&#26989;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">&#20363;&#22806;&#12434;&#24489;&#24112;&#21487;&#33021;&#12394;&#12418;&#12398;&#12392;&#12375;&#12390;&#25201;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;</span></dt>
               <dd>
                  <p>&#12371;&#12428;&#12399;&#12300;&#12505;&#12473;&#12488;&#12301;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;&#20197;&#19978;&#12398;&#12289;&#24517;&#38920;&#12398;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;&#12391;&#12377;&#12290; &#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12399; <code class="literal">Transaction</code> &#12434;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12375;&#12390;&#12289; <code class="literal">Session</code> &#12434;&#12463;&#12525;&#12540;&#12474;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12381;&#12358;&#12375;&#12394;&#12356;&#12392;Hibernate&#12399;&#12513;&#12514;&#12522;&#12398;&#29366;&#24907;&#12364;&#27704;&#32154;&#29366;&#24907;&#12434;&#27491;&#30906;&#12395;&#34920;&#29694;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12371;&#12398;&#29305;&#21029;&#12394;&#22580;&#21512;&#12392;&#12375;&#12390;&#12289;&#19982;&#12360;&#12425;&#12428;&#12383;&#35672;&#21029;&#23376;&#12434;&#25345;&#12388;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23384;&#22312;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; <code class="literal">Session.load()</code> &#12434;&#20351;&#12358;&#12371;&#12392;&#12399;&#12420;&#12417;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12381;&#12398;&#20195;&#12431;&#12426;&#12395; <code class="literal">Session.get()</code> &#12363;&#12463;&#12456;&#12522;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">&#38306;&#36899;&#12395;&#12399;&#12394;&#12427;&#12409;&#12367;&#36933;&#24310;&#12501;&#12455;&#12483;&#12481;&#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#21363;&#26178;&#12501;&#12455;&#12483;&#12481;&#12399;&#25511;&#12360;&#12417;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; &#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#12399;&#23436;&#20840;&#12395;&#20445;&#25345;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12394;&#12463;&#12521;&#12473;&#12398;&#38306;&#36899;&#12395;&#12399;&#12289; &#12503;&#12525;&#12461;&#12471;&#12392;&#36933;&#24310;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12427;&#12463;&#12521;&#12473;&#12398;&#38306;&#36899;&#12289;&#12388;&#12414;&#12426;&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;&#12498;&#12483;&#12488;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#38750;&#24120;&#12395;&#39640;&#12356;&#38306;&#36899;&#12399;&#12289; <code class="literal">lazy="false"</code> &#12391;&#31309;&#26997;&#30340;&#12394;&#12501;&#12455;&#12483;&#12481;&#12434;&#26126;&#31034;&#30340;&#12395;&#28961;&#21177;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#32080;&#21512;&#12501;&#12455;&#12483;&#12481;&#12364;&#36969;&#20999;&#12394;&#29305;&#23450;&#12398;&#12518;&#12540;&#12473;&#12465;&#12540;&#12473;&#12395;&#12399;&#12289; &#12463;&#12456;&#12522;&#12391; <code class="literal">left join fetch</code> &#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">&#12501;&#12455;&#12483;&#12481;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12487;&#12540;&#12479;&#12395;&#38306;&#12431;&#12427;&#21839;&#38988;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12395;&#12289; <span class="emphasis"><em>&#12499;&#12517;&#12540;&#12398;&#20013;&#12391;&#12458;&#12540;&#12503;&#12531;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#20351;&#12358;(open session in view)</em></span> &#12497;&#12479;&#12540;&#12531;&#12363;&#12289;&#32113;&#21046;&#12373;&#12428;&#12383; <span class="emphasis"><em>&#32068;&#12415;&#31435;&#12390;&#12501;&#12455;&#12540;&#12474;(assembly phase)</em></span> &#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290; </span></dt>
               <dd>
                  <p>Hibernate&#12399; <span class="emphasis"><em>Data Transfer Objects</em></span> (DTO)&#12434;&#26360;&#12367;&#36864;&#23624;&#12394;&#20316;&#26989;&#12363;&#12425;&#38283;&#30330;&#32773;&#12434;&#35299;&#25918;&#12375;&#12414;&#12377;&#12290; &#20253;&#32113;&#30340;&#12394;EJB&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12391;&#12399;DTO&#12399;&#20108;&#12388;&#30446;&#30340;&#12364;&#12354;&#12426;&#12414;&#12377;&#65306; 1&#12388;&#30446;&#12399;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12499;&#12540;&#12531;&#12364;&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#12373;&#12428;&#12394;&#12356;&#21839;&#38988;&#12408;&#12398;&#23550;&#31574;&#12391;&#12377;&#12290; 2&#12388;&#30446;&#12399;&#12289;&#12503;&#12524;&#12476;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531;&#23652;&#12395;&#21046;&#24481;&#12364;&#25147;&#12427;&#21069;&#12395;&#12289; &#12499;&#12517;&#12540;&#12395;&#20351;&#12431;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12364;&#12501;&#12455;&#12483;&#12481;&#12373;&#12428;&#12390;&#12289;DTO&#12395;&#24489;&#20803;&#12373;&#12428;&#12427;&#12424;&#12358;&#12394;&#32068;&#12415;&#31435;&#12390;&#12501;&#12455;&#12540;&#12474;&#12434;&#26263;&#40665;&#30340;&#12395;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;
                     Hibernate&#12391;&#12399;1&#12388;&#30446;&#12398;&#30446;&#30340;&#12364;&#19981;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12499;&#12517;&#12540;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#20966;&#29702;&#12398;&#38291;&#12289;&#27704;&#32154;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#65288;&#12475;&#12483;&#12471;&#12519;&#12531;&#65289;&#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12375;&#12383;&#12414;&#12414;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289; &#32068;&#12415;&#31435;&#12390;&#12501;&#12455;&#12540;&#12474;&#12399;&#12414;&#12384;&#24517;&#35201;&#12391;&#12377;&#65288;&#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20013;&#12398;&#12393;&#12398;&#12487;&#12540;&#12479;&#12364;&#21033;&#29992;&#21487;&#33021;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;
                     &#12503;&#12524;&#12476;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531;&#23652;&#12392;&#21427;&#23494;&#12394;&#21462;&#12426;&#27770;&#12417;&#12434;&#12375;&#12390;&#12356;&#12427;&#12499;&#12472;&#12493;&#12473;&#12513;&#12477;&#12483;&#12489;&#12434;&#32771;&#12360;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12290; &#12371;&#12428;&#12399;Hibernate&#20596;&#12398;&#21839;&#38988;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#20869;&#12391;&#23433;&#20840;&#12395;&#12487;&#12540;&#12479;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12383;&#12417;&#12398;&#22522;&#26412;&#30340;&#12394;&#35201;&#20214;&#12391;&#12377;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">Hibernate&#12363;&#12425;&#12499;&#12472;&#12493;&#12473;&#12525;&#12472;&#12483;&#12463;&#12434;&#25277;&#35937;&#21270;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12391;&#65288;Hibernate&#12398;&#65289;&#12487;&#12540;&#12479;&#12450;&#12463;&#12475;&#12473;&#12467;&#12540;&#12489;&#12434;&#38560;&#34109;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; <span class="emphasis"><em>DAO</em></span> &#12392; <span class="emphasis"><em>Thread Local Session</em></span> &#12497;&#12479;&#12540;&#12531;&#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12414;&#12375;&#12423;&#12358;&#12290; <code class="literal">UserType</code> &#12391;Hibernate&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#12392;&#12289; &#12495;&#12531;&#12489;&#12467;&#12540;&#12489;&#12375;&#12383;JDBC&#12391;&#27704;&#32154;&#21270;&#12377;&#12427;&#12463;&#12521;&#12473;&#12434;&#25345;&#12388;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#65288;&#12371;&#12398;&#12450;&#12489;&#12496;&#12452;&#12473;&#12399;&#12300;&#21313;&#20998;&#22823;&#12365;&#12394;&#12301;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290; &#12486;&#12540;&#12502;&#12523;&#12364;5&#20491;&#12375;&#12363;&#12394;&#12356;&#12424;&#12358;&#12394;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12399;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12379;&#12435;&#12290;&#65289;
                     
                  </p>
               </dd>
               <dt><span class="term">&#29645;&#12375;&#12356;&#38306;&#36899;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#20351;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#12424;&#12356;&#12518;&#12540;&#12473;&#12465;&#12540;&#12473;&#12395;&#26412;&#24403;&#12398;&#22810;&#23550;&#22810;&#38306;&#36899;&#12364;&#12354;&#12427;&#12371;&#12392;&#12399;&#31232;&#65288;&#12414;&#12428;&#65289;&#12391;&#12377;&#12290; &#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12300;&#12522;&#12531;&#12463;&#12486;&#12540;&#12502;&#12523;&#12301;&#12398;&#20184;&#21152;&#30340;&#12394;&#24773;&#22577;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12371;&#12398;&#22580;&#21512;&#12289;&#12522;&#12531;&#12463;&#12463;&#12521;&#12473;&#12395;2&#12388;&#12398;1&#23550;&#22810;&#38306;&#36899;&#12434;&#20351;&#12358;&#26041;&#12364;&#12378;&#12387;&#12392;&#33391;&#12356;&#12391;&#12377;&#12290; &#23455;&#38555;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#38306;&#36899;&#12399;1&#23550;&#22810;&#12392;&#22810;&#23550;1&#12394;&#12398;&#12391;&#12289;
                     &#20182;&#12398;&#12473;&#12479;&#12452;&#12523;&#12398;&#38306;&#36899;&#12434;&#20351;&#12358;&#12392;&#12365;&#12399;&#26412;&#24403;&#12395;&#24517;&#35201;&#12363;&#12393;&#12358;&#12363;&#12434;&#32771;&#12360;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </dd>
               <dt><span class="term">&#12394;&#12427;&#12409;&#12367;&#21452;&#26041;&#21521;&#38306;&#36899;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt>
               <dd>
                  <p>&#21336;&#26041;&#21521;&#38306;&#36899;&#12399;&#21452;&#26041;&#21521;&#12395;&#27604;&#12409;&#12390;&#26908;&#32034;&#12364;&#38627;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290; &#22823;&#12365;&#12394;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289; &#12411;&#12392;&#12435;&#12393;&#12377;&#12409;&#12390;&#12398;&#38306;&#36899;&#12364;&#21452;&#26041;&#21521;&#12395;&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; </p>
               </dd>
            </dl>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="misc.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;</td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">23.4. &#31278;&#12293;&#38609;&#22810;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#20363;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;</td>
            </tr>
         </table>
      </div>
   </body>
</html>