<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;6&#31456; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="mapping-database-object.html" title="5.7. &#35036;&#21161;&#30340;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;">
      <link rel="next" href="collections-mapping.html" title="6.2. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;6&#31456; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="mapping-database-object.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="collections-mapping.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="collections"></a>&#31532;6&#31456; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect1" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="collections-persistent"></a>6.1. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#27704;&#32154;&#21270;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#22411;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;&#12395;&#12399;&#12289; &#12381;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#22411;&#12364;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#22411;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289; </p><pre class="programlisting">public class Product {
    private String serialNumber;
    private Set parts = new HashSet();
    
    public Set getParts() { return parts; }
    void setParts(Set parts) { this.parts = parts; }
    public String getSerialNumber() { return serialNumber; }
    void setSerialNumber(String sn) { serialNumber = sn; }
}</pre><p>&#23455;&#22312;&#12377;&#12427;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12395;&#12399; <code class="literal">java.util.Set</code>&#12289; <code class="literal">java.util.Collection</code>&#12289;<code class="literal">java.util.List</code>&#12289; <code class="literal">java.util.Map</code>&#12289;<code class="literal">java.util.SortedSet</code>&#12289; <code class="literal">java.util.SortedMap</code> &#12394;&#12393;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12414;&#12383;&#12399;&#12289;&#20219;&#24847;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12364;&#20351;&#12360;&#12414;&#12377;&#65281; &#65288;&#12383;&#12384;&#12375;&#12289;&#20219;&#24847;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289; <code class="literal">org.hibernate.usertype.UserCollectionType</code> &#12398;&#23455;&#35013;&#12463;&#12521;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#65289; 
            </p>
            <p><code class="literal">HashSet</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#25345;&#12388;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#12364; &#12393;&#12398;&#12424;&#12358;&#12395;&#21021;&#26399;&#21270;&#12373;&#12428;&#12427;&#12363;&#12395;&#27880;&#30446;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290; &#12371;&#12428;&#12399;&#26032;&#12383;&#12395;&#29983;&#25104;&#12373;&#12428;&#12383;&#65288;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#65289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#22411;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; &#21021;&#26399;&#21270;&#12377;&#12427;&#26368;&#36969;&#12394;&#26041;&#27861;&#12391;&#12377;&#12290; &#65288;&#20363;&#12360;&#12400; <code class="literal">persist()</code> &#12395;&#12424;&#12426;&#65289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27704;&#32154;&#21270;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12289; Hibernate&#12399; <code class="literal">HashSet</code> &#12434;Hibernate&#29420;&#33258;&#12398; <code class="literal">Set</code> &#12398;&#23455;&#35013;&#12463;&#12521;&#12473;&#12395;&#32622;&#12365;&#25563;&#12360;&#12414;&#12377;&#12290; &#12371;&#12398;&#12383;&#12417;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12456;&#12521;&#12540;&#12395;&#12399;&#27880;&#24847;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290; 
            </p><pre class="programlisting">Cat cat = new DomesticCat();
Cat kitten = new DomesticCat();
....
Set kittens = new HashSet();
kittens.add(kitten);
cat.setKittens(kittens);
session.persist(cat);
kittens = cat.getKittens(); // Okay, kittens collection is a Set
(HashSet) cat.getKittens(); // Error!</pre><p>Hibernate&#12395;&#12424;&#12426;&#27880;&#20837;&#12373;&#12428;&#12383;&#27704;&#32154;&#24615;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#22411;&#12395;&#24540;&#12376;&#12390;&#12289; <code class="literal">HashMap</code> &#12420; <code class="literal">HashSet</code>&#12289; <code class="literal">TreeMap</code>&#12289; <code class="literal">TreeSet</code>&#12289; <code class="literal">ArrayList</code> &#12398;&#12424;&#12358;&#12395;&#25391;&#33310;&#12356;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#20516;&#22411;&#12392;&#12375;&#12390;&#26222;&#36890;&#12395;&#25391;&#33310;&#12356;&#12414;&#12377;&#12290; &#27704;&#32154;&#21270;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#21442;&#29031;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#33258;&#21205;&#30340;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12289; &#21442;&#29031;&#12364;&#12394;&#12367;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#33258;&#21205;&#30340;&#12395;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290; &#12418;&#12375;&#12354;&#12427;&#27704;&#32154;&#21270;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#21029;&#12398;&#27704;&#32154;&#21270;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#28193;&#12373;&#12428;&#12383;&#12425;&#12289; &#12381;&#12398;&#35201;&#32032;&#12399;&#29694;&#22312;&#12398;&#12486;&#12540;&#12502;&#12523;&#12363;&#12425;&#21029;&#12398;&#12486;&#12540;&#12502;&#12523;&#12395;&#31227;&#21205;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
               &#65298;&#12388;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#21516;&#12376;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20849;&#26377;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290; &#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12514;&#12487;&#12523;&#12434;&#12505;&#12540;&#12473;&#12395;&#12375;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#22411;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395; null&#20516;&#12434;&#20195;&#20837;&#12375;&#12390;&#12418;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12388;&#12414;&#12426;Hibernate&#12399;&#21442;&#29031;&#20808;&#12398;&#12394;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#31354;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21306;&#21029;&#12375;&#12414;&#12379;&#12435;&#12290;
               
            </p>
            <p>&#12375;&#12363;&#12375;&#12381;&#12428;&#12411;&#12393;&#24515;&#37197;&#12375;&#12394;&#12367;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290; &#26222;&#27573;&#20351;&#12387;&#12390;&#12356;&#12427;Java&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#12289;&#27704;&#32154;&#21270;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#21452;&#26041;&#21521;&#38306;&#36899;&#12398;&#24847;&#21619;&#12434;&#29702;&#35299;&#12377;&#12428;&#12400;&#12424;&#12356;&#12398;&#12391;&#12377;&#65288;&#12371;&#12428;&#12399;&#24460;&#12411;&#12393;&#35500;&#26126;&#12375;&#12414;&#12377;&#65289;&#12290; </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="mapping-database-object.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="collections-mapping.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">5.7. &#35036;&#21161;&#30340;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;6.2. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</td>
            </tr>
         </table>
      </div>
   </body>
</html>