<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>8.2. &#24467;&#23646;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="components.html" title="&#31532;8&#31456; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;">
      <link rel="prev" href="components.html" title="&#31532;8&#31456; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;">
      <link rel="next" href="components-asmapindex.html" title="8.3. Map&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">8.2. &#24467;&#23646;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="components.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;8&#31456; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="components-asmapindex.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="components-incollections"></a>8.2. &#24467;&#23646;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#65288;&#20363;&#12360;&#12400; <code class="literal">Name</code> &#22411;&#12398;&#37197;&#21015;&#65289;&#12290; <code class="literal">&lt;element&gt;</code> &#12479;&#12464;&#12434; <code class="literal">&lt;composite-element&gt;</code> &#12479;&#12464;&#12395;&#21462;&#12426;&#26367;&#12360;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#23459;&#35328;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
         </p><pre class="programlisting">&lt;set name="someNames" table="some_names" lazy="true"&gt;
    &lt;key column="id"/&gt;
    &lt;composite-element class="eg.Name"&gt; &lt;!-- class attribute required --&gt;
        &lt;property name="initial"/&gt;
        &lt;property name="first"/&gt;
        &lt;property name="last"/&gt;
    &lt;/composite-element&gt;
&lt;/set&gt;</pre><p>&#27880;&#24847;: &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398; <code class="literal">Set</code> &#12434;&#23450;&#32681;&#12375;&#12383;&#12394;&#12425;&#12289; <code class="literal">equals()</code> &#12392; <code class="literal">hashCode()</code> &#12434;&#27491;&#12375;&#12367;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12364;&#37325;&#35201;&#12391;&#12377;&#12290; 
         </p>
         <p>&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21547;&#12414;&#12378;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#21547;&#12416;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290; &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#33258;&#36523;&#12364;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#22580;&#21512;&#12399; <code class="literal">&lt;nested-composite-element&gt;</code> &#12434; &#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#33258;&#36523;&#12364;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#25345;&#12388;&#12392;&#12356;&#12358;&#12465;&#12540;&#12473;&#12399;&#12417;&#12387;&#12383;&#12395;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12371;&#12398;&#27573;&#38542;&#12414;&#12391;&#12395;&#12289;one-to-many&#38306;&#36899;&#12398;&#26041;&#12364;&#12424;&#12426;&#36969;&#20999;&#12391;&#12394;&#12356;&#12363;&#12392;&#29087;&#32771;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#12375;&#12390;&#20877;&#24230;&#12514;&#12487;&#12522;&#12531;&#12464;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            &#12375;&#12363;&#12375;&#12371;&#12428;&#12399;Java&#12398;&#12514;&#12487;&#12523;&#12392;&#12375;&#12390;&#12399;&#21516;&#12376;&#12391;&#12377;&#12364;&#12289;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12514;&#12487;&#12523;&#12392;&#27704;&#32154;&#21205;&#20316;&#12399;&#12414;&#12384;&#33509;&#24178;&#30064;&#12394;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
         </p>
         <p>&#12418;&#12375; <code class="literal">&lt;set&gt;</code> &#12434;&#20351;&#29992;&#12377;&#12427;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12364;null&#20516;&#12364;&#21487;&#33021;&#12394; &#23646;&#24615;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;Hibernate&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12392;&#12365;&#12289; &#12524;&#12467;&#12540;&#12489;&#12434;&#35672;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#12381;&#12428;&#12382;&#12428;&#12398;&#12459;&#12521;&#12512;&#12398;&#20516;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;null&#20516;&#12434;&#25345;&#12388;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12379;&#12435;
            &#65288;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12486;&#12540;&#12502;&#12523;&#12395;&#12399;&#21029;&#12398;&#20027;&#12461;&#12540;&#12459;&#12521;&#12512;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#65289;&#12290; &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12395;not-null&#12398;&#23646;&#24615;&#12398;&#12415;&#12434;&#20351;&#29992;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399; <code class="literal">&lt;list&gt;</code>&#12289;<code class="literal">&lt;map&gt;</code>&#12289; <code class="literal">&lt;bag&gt;</code>&#12289;<code class="literal">&lt;idbag&gt;</code> &#12434;&#36984;&#25246;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
         </p>
         <p>&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#29305;&#21029;&#12394;&#12465;&#12540;&#12473;&#12392;&#12375;&#12390;&#12289;&#12493;&#12473;&#12488;&#12373;&#12428;&#12383; <code class="literal">&lt;many-to-one&gt;</code> &#23646;&#24615;&#12434;&#25345;&#12388; &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12463;&#12521;&#12473;&#12434;&#22810;&#23550;&#22810;&#38306;&#36899;&#12486;&#12540;&#12502;&#12523;&#12398; &#20313;&#20998;&#12394;&#12459;&#12521;&#12512;&#12408;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290; &#27425;&#12398;&#20363;&#12399; <code class="literal">Order</code> &#12363;&#12425;&#12289;<code class="literal">Item</code> &#12408;&#12398;&#22810;&#23550;&#22810;&#38306;&#36899;&#12391;&#12377;&#12290; <code class="literal">purchaseDate</code>&#12289;<code class="literal">price</code>&#12289;<code class="literal">quantity</code> &#12399;&#38306;&#36899;&#12398;&#23646;&#24615;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">&lt;class name="eg.Order" .... &gt;
    ....
    &lt;set name="purchasedItems" table="purchase_items" lazy="true"&gt;
        &lt;key column="order_id"&gt;
        &lt;composite-element class="eg.Purchase"&gt;
            &lt;property name="purchaseDate"/&gt;
            &lt;property name="price"/&gt;
            &lt;property name="quantity"/&gt;
            &lt;many-to-one name="item" class="eg.Item"/&gt; &lt;!-- class attribute is optional --&gt;
        &lt;/composite-element&gt;
    &lt;/set&gt;
&lt;/class&gt;</pre><p>&#12418;&#12385;&#12429;&#12435;&#12289;&#21452;&#26041;&#21521;&#38306;&#36899;&#12398;&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12398;&#12383;&#12417;&#12395;&#21453;&#23550;&#20596;&#12363;&#12425;purchase&#12408;&#12398;&#21442;&#29031;&#12434;&#20316;&#12427;&#12371;&#12392;&#12399;&#20986;&#26469;&#12414;&#12379;&#12435;&#12290; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#20516;&#22411;&#12391;&#12354;&#12426;&#12289;&#21442;&#29031;&#12434;&#20849;&#26377;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#19968;&#12388;&#12398; <code class="literal">Purchase</code> &#12399;&#19968;&#12388;&#12398; <code class="literal">Order</code> &#12398;set&#12395;&#23384;&#22312;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289; &#21516;&#26178;&#12395; <code class="literal">Item</code> &#12363;&#12425;&#21442;&#29031;&#12377;&#12427;&#12371;&#12392;&#12399;&#20986;&#26469;&#12414;&#12379;&#12435;&#12290; 
         </p>
         <p>3&#38917;&#38306;&#36899;&#65288;&#12354;&#12427;&#12356;&#12399;4&#38917;&#12394;&#12393;&#65289;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;</p><pre class="programlisting">&lt;class name="eg.Order" .... &gt;
    ....
    &lt;set name="purchasedItems" table="purchase_items" lazy="true"&gt;
        &lt;key column="order_id"&gt;
        &lt;composite-element class="eg.OrderLine"&gt;
            &lt;many-to-one name="purchaseDetails class="eg.Purchase"/&gt;
            &lt;many-to-one name="item" class="eg.Item"/&gt;
        &lt;/composite-element&gt;
    &lt;/set&gt;
&lt;/class&gt;</pre><p>&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#38306;&#36899;&#12392;&#12375;&#12390;&#12289; &#21516;&#12376;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12463;&#12456;&#12522;&#20869;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="components.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="components.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="components-asmapindex.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">&#31532;8&#31456; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;8.3. Map&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</td>
            </tr>
         </table>
      </div>
   </body>
</html>