<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;21&#31456; &#20363;&#65306;&#35242;/&#23376;&#20379;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="toolsetguide.html" title="&#31532;20&#31456; Toolset Guide &#12484;&#12540;&#12523;&#12475;&#12483;&#12488;&#12460;&#12452;&#12489;">
      <link rel="next" href="example-parentchild-bidir.html" title="21.2. &#21452;&#26041;&#21521;&#19968;&#23550;&#22810;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;21&#31456; &#20363;&#65306;&#35242;/&#23376;&#20379;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="toolsetguide.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="example-parentchild-bidir.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="example-parentchild"></a>&#31532;21&#31456; &#20363;&#65306;&#35242;/&#23376;&#20379;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#26032;&#35215;&#12518;&#12540;&#12470;&#12364;Hibernate&#12434;&#20351;&#12387;&#12390;&#12414;&#12378;&#26368;&#21021;&#12395;&#25201;&#12358;&#12514;&#12487;&#12523;&#12398;&#19968;&#12388;&#12395;&#12289;&#35242;&#23376;&#22411;&#12398;&#12514;&#12487;&#12523;&#21270;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12398;&#12514;&#12487;&#12523;&#21270;&#12395;&#12399;&#20108;&#12388;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12364;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;&#12392;&#12426;&#12431;&#12369;&#26032;&#35215;&#12518;&#12540;&#12470;&#12395;&#12392;&#12387;&#12390;&#12289; &#12373;&#12414;&#12374;&#12414;&#12394;&#29702;&#30001;&#12363;&#12425;&#26368;&#12418;&#20415;&#21033;&#12384;&#12392;&#24605;&#12431;&#12428;&#12427;&#12450;&#12503;&#12525;&#12540;&#12481;&#12399;&#12289;<code class="literal">&#35242;</code> &#12363;&#12425; <code class="literal">&#23376;&#20379;</code> &#12408;&#12398; <code class="literal">&lt;one-to-many&gt;</code> &#38306;&#36899;&#12395;&#12424;&#12426; <code class="literal">&#35242;</code> &#12392; <code class="literal">&#23376;&#20379;</code> &#12398;&#20001;&#26041;&#12434;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12463;&#12521;&#12473;&#12392;&#12375;&#12390;&#12514;&#12487;&#12522;&#12531;&#12464;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377; &#65288;&#12418;&#12358;&#19968;&#12388;&#12398;&#26041;&#27861;&#12399;&#12289;<code class="literal">&#23376;&#20379;</code> &#12434; <code class="literal">&lt;composite-element&gt;</code> &#12392;&#12375;&#12390;&#23450;&#32681;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#65289;&#12290; &#12371;&#12428;&#12391;&#65288;Hibernate&#12395;&#12362;&#12369;&#12427;&#65289;&#19968;&#23550;&#22810;&#38306;&#36899;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12364;&#12289;&#36890;&#24120;&#12398;&#35079;&#21512;&#35201;&#32032;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12424;&#12426;&#12418;&#12289; &#35242;&#23376;&#38306;&#20418;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12363;&#12425;&#36960;&#12356;&#12371;&#12392;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290; &#12381;&#12428;&#12391;&#12399;&#35242;&#23376;&#38306;&#20418;&#12434;&#21177;&#29575;&#30340;&#12363;&#12388;&#12456;&#12524;&#12460;&#12531;&#12488;&#12395;&#12514;&#12487;&#12522;&#12531;&#12464;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
            <span class="emphasis"><em>&#12459;&#12473;&#12465;&#12540;&#12489;&#25805;&#20316;&#12434;&#20351;&#12387;&#12383;&#21452;&#26041;&#21521;&#19968;&#23550;&#22810;&#38306;&#36899;</em></span> &#12398;&#25201;&#12356;&#26041;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12414;&#12387;&#12383;&#12367;&#38627;&#12375;&#12356;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; 
         </p>
         <div class="sect1" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="example-parentchild-collections"></a>21.1. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#38306;&#12377;&#12427;&#27880;&#24847;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Hibernate&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#33258;&#36523;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#35542;&#29702;&#30340;&#12394;&#37096;&#20998;&#12392;&#32771;&#12360;&#12425;&#12428;&#12289; &#27770;&#12375;&#12390;&#21253;&#21547;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#33268;&#21629;&#30340;&#12394;&#36949;&#12356;&#12391;&#12377;&#65281; &#12371;&#12428;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#32080;&#26524;&#12395;&#12394;&#12426;&#12414;&#12377;&#65306; </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#21066;&#38500;&#12289;&#12414;&#12383;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12377;&#12427;&#12392;&#12365;&#12289; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12458;&#12540;&#12490;&#12540;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12399;&#12452;&#12531;&#12463;&#12522;&#12513;&#12531;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290; </p>
                  </li>
                  <li>
                     <p>&#12418;&#12375;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#20516;&#22411;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473; &#65288;&#20363;&#12360;&#12400;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#12456;&#12524;&#12513;&#12531;&#12488;)&#12384;&#12387;&#12383;&#12394;&#12425;&#12400;&#12289;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#27704;&#32154;&#30340;&#12391;&#12399;&#12394;&#12367;&#12394;&#12426;&#12289; &#12381;&#12398;&#29366;&#24907;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#23436;&#20840;&#12395;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290; &#21516;&#12376;&#12424;&#12358;&#12395;&#12289;&#20516;&#22411;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#29366;&#24907;&#12399;&#12377;&#12368;&#12395;&#27704;&#32154;&#30340;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
                        
                     </p>
                  </li>
                  <li>
                     <p>&#19968;&#26041;&#12289;&#12418;&#12375;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65288;&#19968;&#23550;&#22810;&#12414;&#12383;&#12399;&#22810;&#23550;&#22810;&#38306;&#36899;)&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12390;&#12418;&#12289; &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12381;&#12428;&#12399;&#21066;&#38500;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#21205;&#20316;&#12399;&#23436;&#20840;&#12395;&#19968;&#36011;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#12377;&#12394;&#12431;&#12385;&#12289;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#20869;&#37096;&#29366;&#24907;&#12434;&#22793;&#26356;&#12375;&#12390;&#12418;&#12289;&#38306;&#36899;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#28040;&#28357;&#12377;&#12409;&#12365;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
                        &#21516;&#27096;&#12395;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12373;&#12428;&#12390;&#12418;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12381;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#27704;&#32154;&#30340;&#12395;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; 
                     </p>
                  </li>
               </ul>
            </div>
            <p>&#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12391;&#12399;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12377;&#12427;&#12392;&#21336;&#12395;&#20108;&#12388;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#38291;&#12398;&#12522;&#12531;&#12463;&#12434;&#20316;&#25104;&#12375;&#12289; &#19968;&#26041;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12392;&#12522;&#12531;&#12463;&#12418;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12377;&#12409;&#12390;&#12398;&#12465;&#12540;&#12473;&#12395;&#12362;&#12356;&#12390;&#38750;&#24120;&#12395;&#36969;&#20999;&#12391;&#12377;&#12290; &#12371;&#12428;&#12364;&#36969;&#20999;&#12391;&#12394;&#12356;&#12398;&#12399;&#35242;/&#23376;&#38306;&#20418;&#12398;&#22580;&#21512;&#12391;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#23376;&#20379;&#12398;&#29983;&#23384;&#12399;&#35242;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12395;&#21046;&#38480;&#12373;&#12428;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
               
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="toolsetguide.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="example-parentchild-bidir.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">&#31532;20&#31456; Toolset Guide &#12484;&#12540;&#12523;&#12475;&#12483;&#12488;&#12460;&#12452;&#12489;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;21.2. &#21452;&#26041;&#21521;&#19968;&#23550;&#22810;</td>
            </tr>
         </table>
      </div>
   </body>
</html>