<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;17&#31456; &#12487;&#12540;&#12479;&#12398;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="querysql-load.html" title="16.4. &#12525;&#12540;&#12489;&#12398;&#12383;&#12417;&#12398;&#12459;&#12473;&#12479;&#12512;SQL">
      <link rel="next" href="xml.html" title="&#31532;18&#31456; XML&#12510;&#12483;&#12500;&#12531;&#12464;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;17&#31456; &#12487;&#12540;&#12479;&#12398;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="querysql-load.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="xml.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="filters"></a>&#31532;17&#31456; &#12487;&#12540;&#12479;&#12398;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate3&#12391;&#12399;&#12300;&#21487;&#35222;&#24615;&#12301;&#12523;&#12540;&#12523;&#12395;&#22522;&#12389;&#12356;&#12390;&#12487;&#12540;&#12479;&#12434;&#25201;&#12358;&#12383;&#12417;&#12398;&#30011;&#26399;&#30340;&#12394;&#26041;&#27861;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; <span class="emphasis"><em>Hibernate filter</em></span> &#12399;&#12464;&#12525;&#12540;&#12496;&#12523;&#12391;&#12289;&#21517;&#21069;&#20184;&#12365;&#12391;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#21270;&#12373;&#12428;&#12383;&#12501;&#12451;&#12523;&#12479;&#12391;&#12377;&#12290; &#12371;&#12428;&#12399;Hibernate&#12475;&#12483;&#12471;&#12519;&#12531;&#12372;&#12392;&#12395;&#26377;&#21177;&#28961;&#21177;&#12434;&#20999;&#12426;&#26367;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290; 
         </p>
         <div class="sect1" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="objectstate-filters"></a>17.1. Hibernate&#12398;&#12501;&#12451;&#12523;&#12479;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Hibernate3&#12399;&#12501;&#12451;&#12523;&#12479;&#12463;&#12521;&#12452;&#12486;&#12522;&#12450;&#12434;&#12354;&#12425;&#12363;&#12376;&#12417;&#23450;&#32681;&#12375;&#12289; &#12371;&#12428;&#12425;&#12398;&#12501;&#12451;&#12523;&#12479;&#12434;&#12463;&#12521;&#12473;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12524;&#12505;&#12523;&#12395;&#21152;&#12360;&#12427;&#27231;&#33021;&#12434;&#21152;&#12360;&#12414;&#12375;&#12383;&#12290; &#12501;&#12451;&#12523;&#12479;&#12463;&#12521;&#12452;&#12486;&#12522;&#12450;&#12399;&#21046;&#32004;&#31680;&#12434;&#23450;&#32681;&#12377;&#12427;&#27231;&#33021;&#12391;&#12377;&#12290; &#12371;&#12428;&#12425;&#12398;&#12501;&#12451;&#12523;&#12479;&#26465;&#20214;&#12399;&#12497;&#12521;&#12513;&#12540;&#12479;&#21270;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#38500;&#12365;&#12289;
               &#12463;&#12521;&#12473;&#12420;&#12373;&#12414;&#12374;&#12414;&#12394;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#35201;&#32032;&#12391;&#21033;&#29992;&#21487;&#33021;&#12394;&#65378;where&#65379;&#21477;&#12395;&#38750;&#24120;&#12395;&#12424;&#12367;&#20284;&#12390;&#12356;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#19982;&#12360;&#12425;&#12428;&#12383;&#12501;&#12451;&#12523;&#12479;&#12434;&#21487;&#33021;&#12395;&#12377;&#12409;&#12365;&#12363;&#12289; &#12381;&#12375;&#12390;&#12381;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#20516;&#12434;&#20309;&#12395;&#12377;&#12409;&#12365;&#12363;&#12434;&#23455;&#34892;&#26178;&#12395;&#27770;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#12501;&#12451;&#12523;&#12479;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12499;&#12517;&#12540;&#12398;&#12424;&#12358;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12391;&#12399;&#12497;&#12521;&#12513;&#12540;&#12479;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;
               
            </p>
            <p>&#12501;&#12451;&#12523;&#12479;&#12434;&#20351;&#12358;&#12383;&#12417;&#12395;&#12399;&#12414;&#12378;&#12289;&#36969;&#20999;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#35201;&#32032;&#12395;&#23450;&#32681;&#12289;&#36861;&#21152;&#12375;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12501;&#12451;&#12523;&#12479;&#12434;&#23450;&#32681;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289; <code class="literal">&lt;hibernate-mapping/&gt;</code> &#35201;&#32032;&#20869;&#12391; <code class="literal">&lt;filter-def/&gt;</code> &#35201;&#32032;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#65306; 
            </p><pre class="programlisting">&lt;filter-def name="myFilter"&gt;
    &lt;filter-param name="myFilterParam" type="string"/&gt;
&lt;/filter-def&gt;</pre><p>&#12381;&#12358;&#12375;&#12390;&#12501;&#12451;&#12523;&#12479;&#12399;&#12463;&#12521;&#12473;&#12408;&#12392;&#32080;&#12403;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;&#65306; </p><pre class="programlisting">&lt;class name="myClass" ...&gt;
    ...
    &lt;filter name="myFilter" condition=":myFilterParam = MY_FILTERED_COLUMN"/&gt;
&lt;/class&gt;</pre><p>&#12414;&#12383;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#65306; </p><pre class="programlisting">&lt;set ...&gt;
    &lt;filter name="myFilter" condition=":myFilterParam = MY_FILTERED_COLUMN"/&gt;
&lt;/set&gt;</pre><p>&#12393;&#12385;&#12425;&#12395;&#23550;&#12375;&#12390;&#12418;(&#12414;&#12383;&#12289;&#12381;&#12428;&#12382;&#12428;&#12434;&#35079;&#25968;)&#21516;&#26178;&#12395;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; </p>
            <p>The methods on <code class="literal">Session</code> are: <code class="literal">enableFilter(String filterName)</code>, <code class="literal">getEnabledFilter(String filterName)</code>, and <code class="literal">disableFilter(String filterName)</code>. By default, filters are <span class="emphasis"><em>not</em></span> enabled for a given session; they must be explcitly enabled through use of the <code class="literal">Session.enableFilter()</code> method, which returns an instance of the <code class="literal">Filter</code> interface. Using the simple filter defined above, this would look like: 
            </p><pre class="programlisting">session.enableFilter("myFilter").setParameter("myFilterParam", "some-value");</pre><p>org.hibernate.Filter&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289; Hibernate&#12398;&#22810;&#12367;&#12395;&#20849;&#36890;&#12375;&#12390;&#12356;&#12427;&#12513;&#12477;&#12483;&#12489;&#36899;&#37782;&#12434;&#35377;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p>
            <p>&#26377;&#21177;&#12394;&#12524;&#12467;&#12540;&#12489;&#12487;&#12540;&#12479;&#12497;&#12479;&#12540;&#12531;&#12434;&#25345;&#12388;&#19968;&#26178;&#12487;&#12540;&#12479;&#12434;&#20351;&#12387;&#12383;&#23436;&#20840;&#12394;&#20363;&#12391;&#12377;&#65306; </p><pre class="programlisting">&lt;filter-def name="effectiveDate"&gt;
    &lt;filter-param name="asOfDate" type="date"/&gt;
&lt;/filter-def&gt;

&lt;class name="Employee" ...&gt;
...
    &lt;many-to-one name="department" column="dept_id" class="Department"/&gt;
    &lt;property name="effectiveStartDate" type="date" column="eff_start_dt"/&gt;
    &lt;property name="effectiveEndDate" type="date" column="eff_end_dt"/&gt;
...
    &lt;!--
        Note that this assumes non-terminal records have an eff_end_dt set to
        a max db date for simplicity-sake
    --&gt;
    &lt;filter name="effectiveDate"
            condition=":asOfDate BETWEEN eff_start_dt and eff_end_dt"/&gt;
&lt;/class&gt;

&lt;class name="Department" ...&gt;
...
    &lt;set name="employees" lazy="true"&gt;
        &lt;key column="dept_id"/&gt;
        &lt;one-to-many class="Employee"/&gt;
        &lt;filter name="effectiveDate"
                condition=":asOfDate BETWEEN eff_start_dt and eff_end_dt"/&gt;
    &lt;/set&gt;
&lt;/class&gt;</pre><p>&#24120;&#12395;&#29694;&#22312;&#12398;&#26377;&#21177;&#12524;&#12467;&#12540;&#12489;&#12434;&#36820;&#21364;&#12377;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; &#21336;&#32020;&#12395;&#12289;&#31038;&#21729;&#12487;&#12540;&#12479;&#12398;&#26908;&#32034;&#12424;&#12426;&#21069;&#12395;&#12475;&#12483;&#12471;&#12519;&#12531;&#19978;&#12398;&#12501;&#12451;&#12523;&#12479;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290; </p><pre class="programlisting">Session session = ...;
session.enableFilter("effectiveDate").setParameter("asOfDate", new Date());
List results = session.createQuery("from Employee as e where e.salary &gt; :targetSalary")
         .setLong("targetSalary", new Long(1000000))
         .list();
</pre><p>&#19978;&#35352;&#12398;HQL&#12391;&#12399;&#12289;&#32080;&#26524;&#12398;&#32102;&#26009;&#12398;&#21046;&#32004;&#12395;&#12388;&#12356;&#12390;&#26126;&#31034;&#30340;&#12395;&#35302;&#12428;&#12383;&#12384;&#12369;&#12391;&#12377;&#12364;&#12289; &#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12501;&#12451;&#12523;&#12479;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;&#12371;&#12398;&#12463;&#12456;&#12522;&#12399;&#32102;&#26009;&#12364;100&#19975;&#12489;&#12523;&#20197;&#19978;&#12398;&#29694;&#24441;&#12398;&#31038;&#21729;&#12384;&#12369;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; </p>
            <p>(HQL&#12363;&#12525;&#12540;&#12489;&#12501;&#12455;&#12483;&#12481;&#12391;&#65289;&#22806;&#37096;&#32080;&#21512;&#12434;&#25345;&#12388;&#12501;&#12451;&#12523;&#12479;&#12434;&#20351;&#12358;&#12388;&#12418;&#12426;&#12394;&#12425;&#12289; &#26465;&#20214;&#24335;&#12398;&#26041;&#21521;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12428;&#12399;&#24038;&#22806;&#37096;&#32080;&#21512;&#12398;&#12383;&#12417;&#12395;&#35373;&#23450;&#12377;&#12427;&#12398;&#12364;&#26368;&#12418;&#23433;&#20840;&#12391;&#12377;&#12290; &#19968;&#33324;&#30340;&#12395;&#12289;&#28436;&#31639;&#23376;&#12398;&#24460;&#12459;&#12521;&#12512;&#21517;&#12395;&#32154;&#12369;&#12390;&#26368;&#21021;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#37197;&#32622;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p>
            <p>translator-credits </p><pre class="programlisting">&lt;filter-def name="myFilter" condition="abc &gt; xyz"&gt;...&lt;/filter-def&gt;
&lt;filter-def name="myOtherFilter"&gt;abc=xyz&lt;/filter-def&gt;</pre><p>This default condition will then be used whenever the filter is attached to something without specifying a condition. Note
               that this means you can give a specific condition as part of the attachment of the filter which overrides the default condition
               in that particular case. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="querysql-load.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="xml.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">16.4. &#12525;&#12540;&#12489;&#12398;&#12383;&#12417;&#12398;&#12459;&#12473;&#12479;&#12512;SQL&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;&#31532;18&#31456; XML&#12510;&#12483;&#12500;&#12531;&#12464;</td>
            </tr>
         </table>
      </div>
   </body>
</html>