<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>5.2. Hibernate&#12398;&#22411;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="mapping.html" title="&#31532;5&#31456; &#22522;&#26412;&#30340;&#12394;O/R&#12510;&#12483;&#12500;&#12531;&#12464;">
      <link rel="prev" href="mapping.html" title="&#31532;5&#31456; &#22522;&#26412;&#30340;&#12394;O/R&#12510;&#12483;&#12500;&#12531;&#12464;">
      <link rel="next" href="mapping-entityname.html" title="5.3. &#65297;&#12388;&#12398;&#12463;&#12521;&#12473;&#12395;&#65297;&#12388;&#20197;&#19978;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">5.2. Hibernate&#12398;&#22411;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="mapping.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;5&#31456; &#22522;&#26412;&#30340;&#12394;O/R&#12510;&#12483;&#12500;&#12531;&#12464;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="mapping-entityname.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="mapping-types"></a>5.2. Hibernate&#12398;&#22411;
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="mapping-types-entitiesvalues"></a>5.2.1. &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#20516;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#27704;&#32154;&#12469;&#12540;&#12499;&#12473;&#12395;&#38306;&#12431;&#12427;&#27096;&#12293;&#12394;Java&#35328;&#35486;&#12524;&#12505;&#12523;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434;&#29702;&#35299;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;2&#12388;&#12398;&#12464;&#12523;&#12540;&#12503;&#12395;&#20998;&#12369;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#65306; </p>
            <p><span class="emphasis"><em> &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;</em></span> &#12399;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#21442;&#29031;&#12434;&#20445;&#25345;&#12377;&#12427;&#12289; &#20182;&#12398;&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#29420;&#31435;&#12375;&#12390;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290; &#21442;&#29031;&#12373;&#12428;&#12394;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12488;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#24615;&#36074;&#12434;&#25345;&#12388;&#36890;&#24120;&#12398;Java&#12514;&#12487;&#12523;&#12392;&#12289; &#12371;&#12428;&#12434;&#27604;&#12409;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#65288;&#35242;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12363;&#12425;&#23376;&#12408;&#12289;&#12475;&#12540;&#12502;&#12392;&#21066;&#38500;&#12364;
               <span class="emphasis"><em>&#12459;&#12473;&#12465;&#12540;&#12489;</em></span> &#12373;&#12428;&#12358;&#12427;&#12371;&#12392;&#12434;&#38500;&#12356;&#12390;&#65289; &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#26126;&#31034;&#30340;&#12395;&#12475;&#12540;&#12502;&#12414;&#12383;&#12399;&#21066;&#38500;&#12373;&#12428;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12371;&#12428;&#12399;&#21040;&#36948;&#21487;&#33021;&#24615;&#12395;&#12424;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#27704;&#32154;&#21270;&#12398;ODMG&#12514;&#12487;&#12523;&#12392;&#12399;&#30064;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; &#22823;&#35215;&#27169;&#12394;&#12471;&#12473;&#12486;&#12512;&#12391;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#26222;&#36890;&#12393;&#12398;&#12424;&#12358;&#12395;&#20351;&#12431;&#12428;&#12427;&#12363;&#12395;&#12424;&#12426;&#23494;&#25509;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;
               &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#24490;&#29872;&#12392;&#21442;&#29031;&#12398;&#20849;&#26377;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290; &#12414;&#12383;&#12381;&#12428;&#12425;&#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#20184;&#12369;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#27704;&#32154;&#29366;&#24907;&#12399;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12420; <span class="emphasis"><em>&#20516;</em></span> &#22411;&#12398; &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12408;&#12398;&#21442;&#29031;&#12363;&#12425;&#27083;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290; &#20516;&#12399;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;(&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#20869;&#37096;&#12391;&#12399;&#12394;&#12367;)&#12289; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12289;&#19981;&#22793;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#12399;&#36949;&#12356;&#12289;&#20516;&#12399;&#65288;&#29305;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#12362;&#12356;&#12390;&#65289;&#12289; &#21040;&#36948;&#21487;&#33021;&#24615;&#12395;&#12424;&#12427;&#27704;&#32154;&#21270;&#12420;&#21066;&#38500;&#12364;
               <span class="emphasis"><em>&#34892;&#12431;&#12428;&#12414;&#12377;</em></span> &#12290; &#20516;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65288;&#12392;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#65289;&#12399;&#12289;&#21253;&#21547;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#19968;&#32210;&#12395;&#27704;&#32154;&#21270;&#12420;&#21066;&#38500;&#12364;&#34892;&#12431;&#12428;&#12427;&#12398;&#12391;&#12289; &#12381;&#12428;&#12425;&#12434;&#29420;&#31435;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#20184;&#12369;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#20516;&#12395;&#12399;&#29420;&#31435;&#12375;&#12383;&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#12394;&#12356;&#12398;&#12391;&#12289; &#35079;&#25968;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#12371;&#12428;&#12434;&#20849;&#26377;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
               
            </p>
            <p>&#12371;&#12428;&#12414;&#12391;&#12300;&#27704;&#32154;&#12463;&#12521;&#12473;&#12301;&#12392;&#12356;&#12358;&#35328;&#33865;&#12434;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#24847;&#21619;&#12391;&#20351;&#12387;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290; &#12371;&#12428;&#12363;&#12425;&#12418;&#12381;&#12358;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290; &#21427;&#23494;&#12395;&#35328;&#12358;&#12392;&#12289;&#27704;&#32154;&#29366;&#24907;&#12434;&#25345;&#12388;&#12518;&#12540;&#12470;&#23450;&#32681;&#12398;&#12463;&#12521;&#12473;&#12398;&#12377;&#12409;&#12390;&#12364; &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; <span class="emphasis"><em>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</em></span> &#12399;&#20516;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#25345;&#12388;&#12518;&#12540;&#12470;&#23450;&#32681;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290; <code class="literal">java.lang.String</code> &#22411;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12418;&#12414;&#12383;&#20516;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290; &#23450;&#32681;&#12377;&#12427;&#12394;&#12425;&#12289;JDK&#12391;&#25552;&#20379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;Java&#12398;&#22411;(&#12463;&#12521;&#12473;)&#12364;&#20516;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#25345;&#12388;&#12392;&#12356;&#12360;&#12414;&#12377;&#12290; &#19968;&#26041;&#12518;&#12540;&#12470;&#23450;&#32681;&#22411;&#12399;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12420;&#20516;&#22411;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12392;&#12392;&#12418;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12414;&#12377;&#12290;
               &#12371;&#12398;&#27770;&#23450;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#32773;&#27425;&#31532;&#12391;&#12377;&#12290; &#12381;&#12398;&#12463;&#12521;&#12473;&#12398;&#65297;&#12388;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12408;&#12398;&#20849;&#26377;&#21442;&#29031;&#12399;&#12289; &#12489;&#12513;&#12452;&#12531;&#12514;&#12487;&#12523;&#20869;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12463;&#12521;&#12473;&#12395;&#23550;&#12377;&#12427;&#33391;&#12356;&#12498;&#12531;&#12488;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#19968;&#26041;&#21512;&#25104;&#38598;&#32004;&#12420;&#38598;&#32004;&#12399;&#12289;&#36890;&#24120;&#20516;&#22411;&#12408;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290; 
            </p>
            <p>&#26412;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#36890;&#12375;&#12390;&#12289;&#20309;&#24230;&#12418;&#12371;&#12398;&#27010;&#24565;&#12434;&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290; </p>
            <p>Java&#22411;&#12398;&#12471;&#12473;&#12486;&#12512;(&#12418;&#12375;&#12367;&#12399;&#38283;&#30330;&#32773;&#12364;&#23450;&#32681;&#12375;&#12383;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#20516;&#22411;)&#12434; SQL/&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#22411;&#12398;&#12471;&#12473;&#12486;&#12512;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12371;&#12392;&#12399;&#38627;&#12375;&#12356;&#12391;&#12377;&#12290; Hibernate&#12399;&#65298;&#12388;&#12398;&#12471;&#12473;&#12486;&#12512;&#12398;&#26550;&#12369;&#27211;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395;&#23550;&#12375;&#12390;&#12399; <code class="literal">&lt;class&gt;</code> &#12420; <code class="literal">&lt;subclass&gt;</code> &#12394;&#12393;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; &#20516;&#22411;&#12395;&#23550;&#12375;&#12390;&#12399; <code class="literal">&lt;property&gt;</code> &#12420; <code class="literal">&lt;component&gt;</code> &#12394;&#12393;&#12434;&#12289;&#36890;&#24120; <code class="literal">type</code> &#12392;&#12392;&#12418;&#12395;&#20351;&#12356;&#12414;&#12377;&#12290; &#12371;&#12398;&#23646;&#24615;&#12398;&#20516;&#12399;Hibernate&#12398; <span class="emphasis"><em>&#12510;&#12483;&#12500;&#12531;&#12464;&#22411;</em></span> &#12398;&#21517;&#21069;&#12391;&#12377;&#12290; Hibernate&#12399;(&#27161;&#28310;JDK&#12398;&#20516;&#22411;&#12395;&#23550;&#12375;&#12390;)&#22810;&#12367;&#12398;&#33258;&#30001;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; &#24460;&#12391;&#35211;&#12427;&#12424;&#12358;&#12395;&#12289;&#33258;&#36523;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#22411;&#12434;&#35352;&#36848;&#12375;&#12289;&#21516;&#27096;&#12395;&#12459;&#12473;&#12479;&#12512;&#12398;&#22793;&#25563;&#25126;&#30053;&#12434;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#38500;&#12367;&#32068;&#12415;&#36796;&#12415;&#12398;Hibernate&#12398;&#22411;&#12399;&#12377;&#12409;&#12390;&#12289;null&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290; </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="mapping-types-basictypes"></a>5.2.2. &#22522;&#26412;&#30340;&#12394;&#22411;
                     </h3>
                  </div>
               </div>
            </div>
            <p>The built-in <span class="emphasis"><em>basic mapping types</em></span> may be roughly categorized into 
            </p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term"><code class="literal">integer, long, short, float, double, character, byte, boolean, yes_no, true_false</code></span></dt>
                  <dd>
                     <p>Java&#12398;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#12420;&#12521;&#12483;&#12497;&#12540;&#12463;&#12521;&#12473;&#12363;&#12425;&#36969;&#20999;&#12394;&#65288;&#12505;&#12531;&#12480;&#12540;&#22266;&#26377;&#12398;&#65289; SQL&#12459;&#12521;&#12512;&#22411;&#12408;&#12398;&#22411;&#12510;&#12483;&#12500;&#12531;&#12464;&#12290; <code class="literal">boolean, yes_no</code> &#12392; <code class="literal">true_false</code> &#12399;&#12289; &#12377;&#12409;&#12390;Java&#12398; <code class="literal">boolean</code> &#12414;&#12383;&#12399; <code class="literal">java.lang.Boolean</code> &#12398;&#20195;&#26367;&#12456;&#12531;&#12467;&#12540;&#12489;&#12391;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">string</code></span></dt>
                  <dd>
                     <p><code class="literal">java.lang.String</code> &#12363;&#12425; <code class="literal">VARCHAR</code> &#65288;&#12414;&#12383;&#12399;Oracle&#12398; <code class="literal">VARCHAR2</code> &#65289;&#12408;&#12398;&#22411;&#12510;&#12483;&#12500;&#12531;&#12464;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">date, time, timestamp</code></span></dt>
                  <dd>
                     <p><code class="literal">java.util.Date</code> &#12392;&#12381;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12363;&#12425;SQL&#22411;&#12398; <code class="literal">DATE</code>, <code class="literal">TIME</code> , <code class="literal">TIMESTAMP</code> &#65288;&#12414;&#12383;&#12399;&#12381;&#12428;&#12425;&#12392;&#31561;&#20385;&#12394;&#12418;&#12398;&#65289; &#12408;&#12398;&#22411;&#12510;&#12483;&#12500;&#12531;&#12464;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">calendar, calendar_date</code></span></dt>
                  <dd>
                     <p><code class="literal">java.util.Calendar</code> &#12363;&#12425;SQL&#22411; &#12398;&#12300; <code class="literal">TIMESTAMP</code> , <code class="literal">DATE</code> (&#12414;&#12383;&#12399;&#12381;&#12428;&#12425;&#12392;&#31561;&#20385;&#12394;&#12418;&#12398;&#65289;&#12408;&#12398;&#22411;&#12510;&#12483;&#12500;&#12531;&#12464;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">big_decimal, big_integer</code></span></dt>
                  <dd>
                     <p><code class="literal">java.math.BigDecimal</code> &#12392; <code class="literal">java.math.BigInteger</code> &#12363;&#12425; <code class="literal">NUMERIC</code>&#65288;&#12414;&#12383;&#12399;Oracle&#12398; <code class="literal">NUMBER</code> &#65289;&#12408;&#12398;&#22411;&#12510;&#12483;&#12500;&#12531;&#12464;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">locale, timezone, currency</code></span></dt>
                  <dd>
                     <p><code class="literal">java.util.Locale</code> , <code class="literal">java.util.TimeZone</code> , <code class="literal">java.util.Currency</code> &#12363;&#12425; <code class="literal">VARCHAR</code> &#65288;&#12414;&#12383;&#12399;Oracle&#12398; <code class="literal">VARCHAR2</code> &#65289;&#12408;&#12398;&#22411;&#12510;&#12483;&#12500;&#12531;&#12464;&#12290; <code class="literal">Locale</code> &#12392; <code class="literal">Currency</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289; &#12381;&#12428;&#12425;&#12398;ISO&#12467;&#12540;&#12489;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290; <code class="literal">TimeZone</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289; &#12381;&#12428;&#12425;&#12398; <code class="literal">ID</code> &#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">class</code></span></dt>
                  <dd>
                     <p><code class="literal">java.lang.Class</code> &#12363;&#12425; <code class="literal">VARCHAR</code> &#65288;&#12414;&#12383;&#12399;Oracle&#12398; <code class="literal">VARCHAR2</code> &#65289;&#12408;&#12398;&#22411;&#12510;&#12483;&#12500;&#12531;&#12464;&#12290; <code class="literal">Class</code> &#12399;&#12381;&#12398;&#23436;&#20840;&#20462;&#39166;&#12373;&#12428;&#12383;&#21517;&#21069;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">binary</code></span></dt>
                  <dd>
                     <p>&#12496;&#12452;&#12488;&#37197;&#21015;&#12399;&#12289;&#36969;&#20999;&#12394;SQL&#12398;&#12496;&#12452;&#12490;&#12522;&#22411;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290; </p>
                  </dd>
                  <dt><span class="term"><code class="literal">text</code></span></dt>
                  <dd>
                     <p>&#38263;&#12356;Java&#25991;&#23383;&#21015;&#12399;&#12289;SQL&#12398; <code class="literal">CLOB</code> &#12414;&#12383;&#12399; <code class="literal">TEXT</code> &#22411;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">serializable</code></span></dt>
                  <dd>
                     <p>&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#21487;&#33021;&#12394;Java&#22411;&#12399;&#12289;&#36969;&#20999;&#12394;SQL&#12398;&#12496;&#12452;&#12490;&#12522;&#22411;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#22522;&#26412;&#22411;&#12391;&#12399;&#12394;&#12356;&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#21487;&#33021;&#12394;Java&#12463;&#12521;&#12473;&#12420; &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#21517;&#21069;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289; Hibernate&#12398;&#22411;&#12434; <code class="literal">serializable</code> &#12392;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">clob, blob</code></span></dt>
                  <dd>
                     <p>JDBC&#12463;&#12521;&#12473; <code class="literal">java.sql.Clob</code> &#12392; <code class="literal">java.sql.Blob</code> &#12395;&#23550;&#12377;&#12427;&#22411;&#12510;&#12483;&#12500;&#12531;&#12464;&#12290; blob&#12420;clob&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#22806;&#12391;&#12399;&#20877;&#21033;&#29992;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#12399;&#19981;&#20415;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290; &#65288;&#12373;&#12425;&#12395;&#12399;&#12489;&#12521;&#12452;&#12496;&#12469;&#12509;&#12540;&#12488;&#12364;&#19968;&#36011;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#65289; 
                     </p>
                  </dd>
                  <dt><span class="term">
                                                    <code class="literal">imm_date, imm_time, imm_timestamp, imm_calendar, imm_calendar_date, imm_serializable, imm_binary</code>
                                                </span></dt>
                  <dd>
                     <p>&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12395;&#21487;&#22793;&#12391;&#12354;&#12427;Java&#12398;&#22411;&#12395;&#23550;&#12377;&#12427;&#22411;&#12510;&#12483;&#12500;&#12531;&#12464;&#12290; Hibernate&#12399;&#19981;&#22793;&#12394;Java&#12398;&#22411;&#12395;&#23550;&#12375;&#12390;&#12399;&#26368;&#36969;&#21270;&#12434;&#34892;&#12356;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12381;&#12428;&#12434;&#19981;&#22793;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#12375;&#12390;&#25201;&#12356;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400; <code class="literal">imm_timestamp</code> &#12392;&#12375;&#12390;&#12510;&#12483;&#12503;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#12289; <code class="literal">Date.setTime()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#22793;&#26356;&#12375;&#12381;&#12398;&#22793;&#26356;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#23550;&#12375;&#12390;&#26032;&#12375;&#12356;(&#21516;&#19968;&#12391;&#12394;&#12356;)&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21106;&#12426;&#24403;&#12390;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; 
                     </p>
                  </dd>
               </dl>
            </div>
            <p>
               
                           
            </p>
            <p>&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12518;&#12491;&#12540;&#12463;&#12394;&#35672;&#21029;&#23376;&#12399;&#12289;<code class="literal">binary</code> , <code class="literal">blob</code> , <code class="literal">clob</code> &#12434;&#38500;&#12367;&#12289;&#12393;&#12435;&#12394;&#22522;&#26412;&#22411;&#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290; &#65288;&#35079;&#21512;&#35672;&#21029;&#23376;&#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;&#20197;&#19979;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#65289; 
            </p>
            <p>&#22522;&#26412;&#30340;&#12394;&#20516;&#22411;&#12395;&#12399;&#12289;<code class="literal">org.hibernate.Hibernate</code> &#12391;&#23450;&#32681;&#12373;&#12428;&#12383; <code class="literal">Type</code> &#23450;&#25968;&#12364;&#12381;&#12428;&#12382;&#12428;&#12354;&#12426;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;<code class="literal">Hibernate.STRING</code> &#12399; <code class="literal">string</code> &#22411;&#12434;&#34920;&#29694;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; 
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="mapping-types-custom"></a>5.2.3. &#12459;&#12473;&#12479;&#12512;&#22411;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#38283;&#30330;&#32773;&#12364;&#29420;&#33258;&#12398;&#20516;&#22411;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;&#27604;&#36611;&#30340;&#31777;&#21336;&#12391;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;<code class="literal">java.lang.BigInteger</code> &#22411;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code class="literal">VARCHAR</code> &#12459;&#12521;&#12512;&#12395;&#27704;&#32154;&#21270;&#12375;&#12383;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290; Hibernate&#12399;&#12371;&#12398;&#12383;&#12417;&#12398;&#32068;&#12415;&#36796;&#12415;&#22411;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290; &#12375;&#12363;&#12375;&#12459;&#12473;&#12479;&#12512;&#22411;&#12399;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#65288;&#12414;&#12383;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;&#65289;&#12434;1&#12388;&#12398;&#12486;&#12540;&#12502;&#12523;&#12459;&#12521;&#12512;&#12395; &#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12398;&#12395;&#21046;&#38480;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12381;&#12398;&#12383;&#12417;&#20363;&#12360;&#12400;&#12289;<code class="literal">java.lang.String</code> &#22411;&#12398; <code class="literal">getName()</code> / <code class="literal">setName()</code> Java&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code class="literal">FIRST_NAME</code> , <code class="literal">INITIAL</code>, <code class="literal">SURNAME</code> &#12459;&#12521;&#12512;&#12395;&#27704;&#32154;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12459;&#12473;&#12479;&#12512;&#22411;&#12434;&#23455;&#35013;&#12377;&#12427;&#12395;&#12399;&#12289;<code class="literal">org.hibernate.UserType</code> &#12414;&#12383;&#12399; <code class="literal">org.hibernate.CompositeUserType</code> &#12434;&#23455;&#35013;&#12375;&#12289; &#22411;&#12398;&#23436;&#20840;&#20462;&#39166;&#12373;&#12428;&#12383;&#21517;&#21069;&#12434;&#20351;&#12387;&#12390;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; &#12393;&#12398;&#12424;&#12358;&#12394;&#31278;&#39006;&#12398;&#12418;&#12398;&#12364;&#21487;&#33021;&#12363;&#12434;&#35519;&#12409;&#12427;&#12395;&#12399;&#12289; <code class="literal">org.hibernate.test.DoubleStringType</code> &#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p><pre class="programlisting">&lt;property name="twoStrings" type="org.hibernate.test.DoubleStringType"&gt;
    &lt;column name="first_string"/&gt;
    &lt;column name="second_string"/&gt;
&lt;/property&gt;</pre><p><code class="literal">&lt;column&gt;</code> &#12479;&#12464;&#12391;&#12289; &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35079;&#25968;&#12398;&#12459;&#12521;&#12512;&#12408;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12427;&#12371;&#12392;&#12395;&#27880;&#30446;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p>
            <p><code class="literal">CompositeUserType</code> , <code class="literal">EnhancedUserType</code> , <code class="literal">UserCollectionType</code> , <code class="literal">UserVersionType</code> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12399;&#12289;&#12424;&#12426;&#29305;&#27530;&#12394;&#20351;&#29992;&#27861;&#12395;&#23550;&#12375;&#12390;&#12398;&#12469;&#12509;&#12540;&#12488;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#20869;&#12391; <code class="literal">UserType</code> &#12408;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#25552;&#20379;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12383;&#12417;&#12395;&#12399;&#12289;<code class="literal">UserType</code> &#12399; <code class="literal">org.hibernate.usertype.ParameterizedType</code> &#12434;&#23455;&#35013;&#12375;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12459;&#12473;&#12479;&#12512;&#22411;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#25552;&#20379;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; &#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#20869;&#12391; <code class="literal">&lt;type&gt;</code> &#35201;&#32032;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">&lt;property name="priority"&gt;
    &lt;type name="com.mycompany.usertypes.DefaultValueIntegerType"&gt;
        &lt;param name="default"&gt;0&lt;/param&gt;
    &lt;/type&gt;
&lt;/property&gt;</pre><p><code class="literal">UserType</code> &#12399;&#12289; &#24341;&#25968;&#12392;&#12375;&#12390;&#28193;&#12373;&#12428;&#12383; <code class="literal">Properties</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#12289; <code class="literal">default</code> &#12391;&#25351;&#23450;&#12375;&#12383;&#12497;&#12521;&#12513;&#12540;&#12479;&#12395;&#23550;&#12377;&#12427;&#20516;&#12434;&#26908;&#32034;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
            <p>&#29305;&#23450;&#12398; <code class="literal">UserType</code> &#12434;&#38971;&#32321;&#12395;&#20351;&#29992;&#12377;&#12427;&#12394;&#12425;&#12400;&#12289;&#30701;&#12356;&#21517;&#21069;&#12434;&#23450;&#32681;&#12377;&#12427;&#12392;&#20415;&#21033;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290; <code class="literal">&lt;typedef&gt;</code> &#35201;&#32032;&#12434;&#20351;&#12387;&#12390;&#12371;&#12398;&#12424;&#12358;&#12394;&#12371;&#12392;&#12364;&#34892;&#12360;&#12414;&#12377;&#12290; Typedefs&#12399;&#12459;&#12473;&#12479;&#12512;&#22411;&#12395;&#21517;&#21069;&#12434;&#21106;&#12426;&#24403;&#12390;&#12414;&#12377;&#12290; &#12381;&#12398;&#22411;&#12364;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#25345;&#12388;&#12394;&#12425;&#12400;&#12289; &#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12522;&#12473;&#12488;&#12434;&#21547;&#12416;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">&lt;typedef class="com.mycompany.usertypes.DefaultValueIntegerType" name="default_zero"&gt;
    &lt;param name="default"&gt;0&lt;/param&gt;
&lt;/typedef&gt;</pre><pre class="programlisting">&lt;property name="priority" type="default_zero"/&gt;</pre><p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#22411;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12289; typedef&#12391;&#25552;&#20379;&#12373;&#12428;&#12383;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#12381;&#12398;&#37117;&#24230;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290; </p>
            <p>Hibernate&#12398;&#24133;&#24195;&#12356;&#32068;&#12415;&#36796;&#12415;&#22411;&#12392;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#23550;&#12377;&#12427;&#12469;&#12509;&#12540;&#12488;&#12399;&#12289; &#12459;&#12473;&#12479;&#12512;&#22411;&#12434;&#12417;&#12387;&#12383;&#12395; <span class="emphasis"><em>&#20351;&#12431;&#12394;&#12356;</em></span> &#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290; &#12381;&#12428;&#12391;&#12418;&#12394;&#12362;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#38971;&#20986;&#12377;&#12427;(&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12391;&#12399;&#12394;&#12356;)&#12463;&#12521;&#12473;&#12395;&#23550;&#12377;&#12427;&#12459;&#12473;&#12479;&#12512;&#22411;&#12398;&#20351;&#29992;&#12399;&#12289; &#12424;&#12356;&#12420;&#12426;&#26041;&#12391;&#12354;&#12427;&#12392;&#12415;&#12394;&#12373;&#12428;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400; <code class="literal">MonetaryAmount</code> &#12463;&#12521;&#12473;&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12375;&#12390;&#31777;&#21336;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289; <code class="literal">CompositeUserType</code> &#12398;&#33391;&#12356;&#20505;&#35036;&#12391;&#12377;&#12290; &#12459;&#12473;&#12479;&#12512;&#22411;&#12434;&#20351;&#29992;&#12377;&#12427;&#21205;&#27231;&#12398;1&#12388;&#12399;&#25277;&#35937;&#21270;&#12391;&#12377;&#12290; &#12459;&#12473;&#12479;&#12512;&#22411;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12289;&#36890;&#36008;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#34920;&#29694;&#12375;&#12424;&#12358;&#12392;&#12418; &#12510;&#12483;&#12500;&#12531;&#12464;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#36215;&#12371;&#12426;&#12358;&#12427;&#22793;&#21270;&#12395;&#23550;&#24540;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="mapping.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="mapping.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="mapping-entityname.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">&#31532;5&#31456; &#22522;&#26412;&#30340;&#12394;O/R&#12510;&#12483;&#12500;&#12531;&#12464;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;5.3. &#65297;&#12388;&#12398;&#12463;&#12521;&#12473;&#12395;&#65297;&#12388;&#20197;&#19978;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</td>
            </tr>
         </table>
      </div>
   </body>
</html>