<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="inheritance-limitations.html" title="9.2. &#21046;&#38480;">
      <link rel="next" href="objectstate-makingpersistent.html" title="10.2. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27704;&#32154;&#29366;&#24907;&#12395;&#12377;&#12427;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="inheritance-limitations.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-makingpersistent.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="objectstate"></a>&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate &#12399;&#23436;&#20840;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12510;&#12483;&#12500;&#12531;&#12464;&#12477;&#12522;&#12517;&#12540;&#12471;&#12519;&#12531;&#12391;&#12354;&#12426;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12398;&#35443;&#32048;&#12434;&#38283;&#30330;&#32773;&#12363;&#12425;&#38560;&#34109;&#12377;&#12427;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <span class="emphasis"><em>&#29366;&#24907;&#31649;&#29702;</em></span> &#12418;&#34892;&#12356;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;JDBC/SQL&#27704;&#32154;&#23652;&#12392;&#21516;&#12376;&#12424;&#12358;&#12394;SQL <code class="literal">&#25991;</code> &#12398;&#31649;&#29702;&#12392;&#12399;&#30064;&#12394;&#12426;&#12289; Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12362;&#12369;&#12427;&#27704;&#32154;&#21270;&#12395;&#23550;&#12377;&#12427;&#12289;&#12392;&#12390;&#12418;&#33258;&#28982;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12398;&#32771;&#12360;&#26041;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; 
         </p>
         <p>&#35328;&#12356;&#12363;&#12360;&#12428;&#12400;&#12289;Hibernate&#12434;&#29992;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#32773;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398; <span class="emphasis"><em>&#29366;&#24907;</em></span> &#12395;&#12388;&#12356;&#12390;&#12399; &#24120;&#12395;&#24847;&#35672;&#12377;&#12409;&#12365;&#12391;&#12354;&#12426;&#12289;SQL&#25991;&#12398;&#23455;&#34892;&#12395;&#12388;&#12356;&#12390;&#12399;&#24517;&#12378;&#12375;&#12418;&#12381;&#12358;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12371;&#12398;&#37096;&#20998;&#12399;&#12289;&#36890;&#24120;&#12289;Hibernate&#12364;&#20966;&#29702;&#12375;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12434;&#12481;&#12517;&#12540;&#12491;&#12531;&#12464;&#12377;&#12427;&#12392;&#12365;&#12395;&#12384;&#12369;&#12289; &#21839;&#38988;&#12395;&#12394;&#12387;&#12390;&#12365;&#12414;&#12377;&#12290; 
         </p>
         <div class="sect1" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="objectstate-overview"></a>10.1. Hibernate&#12395;&#12362;&#12369;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Hibernate&#12399;&#27425;&#12398;&#12424;&#12358;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12434;&#23450;&#32681;&#12375;&#12289;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p><span class="emphasis"><em> &#19968;&#26178;&#30340;(Transient) </em></span> - <code class="literal">new</code> &#28436;&#31639;&#23376;&#12434;&#20351;&#12387;&#12390; &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#12384;&#12369;&#12391;&#12289; Hibernate&#12398; <code class="literal">Session</code> &#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12394;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289; &#19968;&#26178;&#30340;(transient)&#12391;&#12377;&#12290; &#12381;&#12428;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#27704;&#32154;&#30340;&#12394;&#34920;&#29694;&#12434;&#25345;&#12383;&#12378;&#12289;&#35672;&#21029;&#23376;&#12392;&#12394;&#12427;&#20516;&#12399;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290; &#19968;&#26178;&#30340;&#12394;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12381;&#12398;&#21442;&#29031;&#12434;&#12393;&#12371;&#12395;&#12418;&#20445;&#25345;&#12375;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289;
                        &#12460;&#12505;&#12540;&#12472;&#12467;&#12524;&#12463;&#12479;&#12395;&#12424;&#12387;&#12390;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27704;&#32154;&#30340;(persistent)&#12394;&#29366;&#24907;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;Hibernate&#12398; <code class="literal">Session</code> &#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290; &#65288;&#12371;&#12398;&#29366;&#24907;&#36983;&#31227;&#12395;&#24517;&#35201;&#12392;&#12394;&#12427;SQL&#25991;&#12398;&#30330;&#34892;&#12399;&#12289;Hibernate&#12395;&#20219;&#12379;&#12414;&#12375;&#12423;&#12358;&#12290;&#65289; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#27704;&#32154;&#30340;(Persistent)</em></span> - &#27704;&#32154;&#30340;&#12394;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395; &#27704;&#32154;&#30340;&#12394;&#34920;&#29694;&#12434;&#25345;&#12385;&#12289;&#35672;&#21029;&#23376;&#12392;&#12394;&#12427;&#20516;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; &#12381;&#12428;&#12399;&#12289;&#12475;&#12540;&#12502;&#12373;&#12428;&#12383;&#12426;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12426;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;&#12289; &#23450;&#32681;&#19978;&#12399;&#12289; <code class="literal">Session</code> &#12398;&#12473;&#12467;&#12540;&#12503;&#12398;&#20013;&#12395;&#23384;&#22312;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; Hibernate&#12399;&#12289;&#20316;&#26989;&#21336;&#20301;&#65288;Unit of work&#65289;&#12364;&#23436;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289; &#27704;&#32154;&#29366;&#24907;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#21152;&#12360;&#12425;&#12428;&#12383;&#22793;&#26356;&#12434;&#26908;&#20986;&#12375;&#12289; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#21516;&#26399;&#12375;&#12414;&#12377;&#12290; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#19968;&#26178;&#30340;(transient)&#12395;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#38283;&#30330;&#32773;&#12399;&#12289;&#25163;&#20316;&#26989;&#12391;
                        <code class="literal">UPDATE</code> &#25991;&#12420; <code class="literal">DELETE</code> &#25991;&#12434;&#23455;&#34892;&#12375;&#12414;&#12379;&#12435;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#20998;&#38626;(Detached)</em></span> - &#20998;&#38626;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12399;&#12289;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12364;&#12289; &#12381;&#12428;&#12392;&#38306;&#36899;&#20184;&#12356;&#12390;&#12356;&#12383; <code class="literal">Session</code> &#12364;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12390;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290; &#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#21442;&#29031;&#12399;&#12289;&#20381;&#28982;&#12392;&#12375;&#12390;&#26377;&#21177;&#12391;&#12377;&#12290; &#12381;&#12375;&#12390;&#12289;&#12418;&#12385;&#12429;&#12435;&#12289;&#20998;&#38626;&#12373;&#12428;&#12383;&#29366;&#24907;&#12395;&#12354;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#20462;&#27491;&#12377;&#12427;&#12371;&#12392;&#12373;&#12360;&#12391;&#12365;&#12414;&#12377;&#12290; &#20998;&#38626;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#12418;&#12358;&#19968;&#24230;&#27704;&#32154;&#21270;&#12375;&#12383;&#12356;&#65288;&#12381;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#22793;&#26356;&#12434;&#27704;&#32154;&#21270;&#12375;&#12383;&#12356;&#65289;&#12392;&#12365;&#12395;&#12289;
                        &#26032;&#12375;&#12356; <code class="literal">Session</code> &#12395;&#20877;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#27231;&#33021;&#12399;&#12289;&#12518;&#12540;&#12470;&#12364;&#32771;&#12360;&#12427;&#26178;&#38291;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12424;&#12358;&#12394;&#12289;&#38263;&#26399;&#38291;&#12395;&#21450;&#12406;&#20316;&#26989;&#21336;&#20301;&#12395;&#23550;&#12377;&#12427; &#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12514;&#12487;&#12523;&#12434;&#21487;&#33021;&#12395;&#12375;&#12414;&#12377;&#12290; &#25105;&#12293;&#12399;&#12289;&#12371;&#12428;&#12434; <span class="emphasis"><em>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#65288;application transactions&#65289;</em></span> &#12392;&#21628;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290; &#12377;&#12394;&#12431;&#12385;&#12289;&#12518;&#12540;&#12470;&#12363;&#12425;&#35211;&#12383;&#20316;&#26989;&#21336;&#20301;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; 
                     </p>
                  </li>
               </ul>
            </div>
            <p>&#12371;&#12428;&#12363;&#12425;&#12289;&#29366;&#24907;&#12392;&#29366;&#24907;&#36983;&#31227;&#65288;&#12381;&#12375;&#12390;&#12289;&#36983;&#31227;&#12398;&#12365;&#12387;&#12363;&#12369;&#12392;&#12394;&#12427;Hibernate&#12398;&#12513;&#12477;&#12483;&#12489;&#65289;&#12395;&#12388;&#12356;&#12390; &#12289;&#35443;&#32048;&#12395;&#36848;&#12409;&#12414;&#12377;&#12290; </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="inheritance-limitations.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-makingpersistent.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">9.2. &#21046;&#38480;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;10.2. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27704;&#32154;&#29366;&#24907;&#12395;&#12377;&#12427;</td>
            </tr>
         </table>
      </div>
   </body>
</html>