<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>10.3. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="objectstate.html" title="&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;">
      <link rel="prev" href="objectstate-makingpersistent.html" title="10.2. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27704;&#32154;&#29366;&#24907;&#12395;&#12377;&#12427;">
      <link rel="next" href="objectstate-querying.html" title="10.4. &#12463;&#12456;&#12522;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">10.3. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-makingpersistent.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-querying.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="objectstate-loading"></a>10.3. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#35672;&#21029;&#23376;&#12364;&#12354;&#12425;&#12363;&#12376;&#12417;&#20998;&#12363;&#12387;&#12390;&#12356;&#12427;&#12394;&#12425;&#12289; <code class="literal">Session</code> &#12398; <code class="literal">load()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12387;&#12390;&#12289;&#24489;&#20803;&#12391;&#12365;&#12414;&#12377;&#12290; <code class="literal">load()</code> &#12399;&#12289;Class &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#24341;&#25968;&#12395;&#12392;&#12426;&#12289; &#12381;&#12398;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#26032;&#12383;&#12395;&#29983;&#25104;&#12375;&#12289;&#29366;&#24907;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290; &#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#29366;&#24907;&#12399;&#12289;&#27704;&#32154;(persistent)&#29366;&#24907;&#12391;&#12377;&#12290; 
         </p><pre class="programlisting">Cat fritz = (Cat) sess.load(Cat.class, generatedId);</pre><pre class="programlisting">// you need to wrap primitive identifiers
long id = 1234;
DomesticCat pk = (DomesticCat) sess.load( DomesticCat.class, new Long(id) );</pre><p>&#12354;&#12427;&#12356;&#12399;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12289;&#26082;&#23384;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#29366;&#24907;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; </p><pre class="programlisting">Cat cat = new DomesticCat();
// load pk's state into cat
sess.load( cat, new Long(pkId) );
Set kittens = cat.getKittens();</pre><p>DB&#12395;&#35442;&#24403;&#12377;&#12427;&#34892;&#12364;&#28961;&#12356;&#22580;&#21512;&#12289; <code class="literal">load()</code> &#12399;&#22238;&#24489;&#19981;&#21487;&#33021;&#12394;&#20363;&#22806;&#12434; &#25237;&#12370;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; &#12381;&#12398;&#12463;&#12521;&#12473;&#12364;&#12503;&#12525;&#12461;&#12471;&#12434;&#20351;&#12387;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289; <code class="literal">load()</code> &#12399;&#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12461;&#12471;&#12434;&#36820;&#12375;&#12289;&#12503;&#12525;&#12461;&#12471;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#21628;&#12400;&#12428;&#12427;&#12414;&#12391;&#23455;&#38555;&#12395;&#12399; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12414;&#12379;&#12435;&#12290; &#12418;&#12375;&#12289;&#23455;&#38555;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#12525;&#12540;&#12489;&#12379;&#12378;&#12395;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#38306;&#36899;&#12434;&#20316;&#12426;&#12383;&#12356;&#22580;&#21512;&#12289; &#12371;&#12398;&#25391;&#12427;&#33310;&#12356;&#12399;&#12392;&#12390;&#12418;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290; <code class="literal">batch-size</code> &#12364;&#12463;&#12521;&#12473;&#12510;&#12483;&#12500;&#12531;&#12464;&#12395;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#12394;&#12425;&#12400;&#12289; &#35079;&#25968;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#19968;&#25324;&#12391;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290; 
         </p>
         <p>&#35442;&#24403;&#12377;&#12427;&#34892;&#12364;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12434;&#30906;&#20449;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289; <code class="literal">get()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290; &#12381;&#12428;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#12377;&#12368;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12289;&#35442;&#24403;&#12377;&#12427;&#34892;&#12364;&#28961;&#12356;&#22580;&#21512;&#12399;null&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">Cat cat = (Cat) sess.get(Cat.class, id);
if (cat==null) {
    cat = new Cat();
    sess.save(cat, id);
}
return cat;</pre><p><code class="literal">LockMode</code> &#12434;&#20351;&#12360;&#12400;&#12289; <code class="literal">SELECT ... FOR UPDATE</code>&#12392;&#12356;&#12358;SQL&#12434; &#20351;&#12387;&#12390;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#35443;&#32048;&#12394;&#24773;&#22577;&#12399;&#12289;API&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
         </p><pre class="programlisting">Cat cat = (Cat) sess.get(Cat.class, id, LockMode.UPGRADE);</pre><p>&#38306;&#36899;&#12395;&#23550;&#12377;&#12427;&#12459;&#12473;&#12465;&#12540;&#12489;&#26041;&#27861;&#12392;&#12375;&#12390; <code class="literal">lock</code> &#12420; <code class="literal">all</code> &#12434; &#25351;&#23450;&#12375;&#12394;&#12356;&#38480;&#12426;&#12289;&#38306;&#36899;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12420;&#21547;&#12414;&#12428;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399; <code class="literal">FOR UPDATE</code> &#12391;&#24489;&#20803; <span class="emphasis"><em>&#12373;&#12428;&#12394;&#12356;</em></span> &#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; 
         </p>
         <p><code class="literal">refresh()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12289;&#12393;&#12435;&#12394;&#12392;&#12365;&#12391;&#12418;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12420;&#12381;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434; &#12522;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12488;&#12522;&#12460;&#12364;&#12486;&#12540;&#12502;&#12523;&#12434;&#26356;&#26032;&#12375;&#12383;&#38555;&#12395;&#12289; &#12381;&#12398;&#12486;&#12540;&#12502;&#12523;&#12395;&#23550;&#24540;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21516;&#26399;&#12377;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#24441;&#12395;&#31435;&#12385;&#12414;&#12377;&#12290;
            
         </p><pre class="programlisting">sess.save(cat);
sess.flush(); //force the SQL INSERT
sess.refresh(cat); //re-read the state (after the trigger executes)</pre><p>&#22823;&#20999;&#12394;&#21839;&#38988;&#12399;&#12289;&#12356;&#12388;&#12418;&#27425;&#12398;&#28857;&#12395;&#38306;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;&#12381;&#12428;&#12399;&#12289;Hibernate&#12364;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#12289; &#12393;&#12398;&#12367;&#12425;&#12356;&#12398;&#37327;&#12434;&#24489;&#20803;&#12377;&#12427;&#12398;&#12363;&#12392;&#12289;&#12393;&#12398;&#12367;&#12425;&#12356;&#12398;&#25968;&#12398;SQL&#12398; <code class="literal">SELECT</code> &#25991;&#12364;&#20351;&#12431;&#12428;&#12427;&#12398;&#12363;&#12391;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289; <span class="emphasis"><em>&#12501;&#12455;&#12483;&#12481;&#12398;&#25126;&#30053;</em></span> &#12395;&#12424;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="performance.html#performance-fetching" title="19.1. &#12501;&#12455;&#12483;&#12481;&#25126;&#30053;">&#38917;19.1. &#12300;&#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12301;</a> &#12391;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-makingpersistent.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="objectstate.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-querying.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.2. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27704;&#32154;&#29366;&#24907;&#12395;&#12377;&#12427;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;10.4. &#12463;&#12456;&#12522;</td>
            </tr>
         </table>
      </div>
   </body>
</html>