<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>10.4. &#12463;&#12456;&#12522;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="objectstate.html" title="&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;">
      <link rel="prev" href="objectstate-loading.html" title="10.3. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;">
      <link rel="next" href="objectstate-modifying.html" title="10.5. &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20462;&#27491;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">10.4. &#12463;&#12456;&#12522;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-loading.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-modifying.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="objectstate-querying"></a>10.4. &#12463;&#12456;&#12522;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#25506;&#12375;&#12383;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12364;&#20998;&#12363;&#12425;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12463;&#12456;&#12522;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; Hibernate&#12399;&#20351;&#12356;&#12420;&#12377;&#12367;&#12390;&#24375;&#21147;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12398;&#12463;&#12456;&#12522;&#35328;&#35486; (HQL)&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#12424;&#12387;&#12390;&#12463;&#12456;&#12522;&#12364;&#20316;&#25104;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12289;Hibernate&#12399;&#27927;&#32244;&#12373;&#12428;&#12383;Criteria&#12392;Example&#12463;&#12456;&#12522;&#27231;&#33021;(QBC&#12392;QBE&#65289;&#12434;
            &#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;ResultSet&#12434;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#22793;&#25563;&#12377;&#12427;Hibernate&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#27231;&#33021;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12493;&#12452;&#12486;&#12451;&#12502;&#12394;SQL&#12391;&#12463;&#12456;&#12522;&#12434;&#34920;&#29694;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; 
         </p>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="objectstate-querying-executing"></a>10.4.1. &#12463;&#12456;&#12522;&#12398;&#23455;&#34892;
                     </h3>
                  </div>
               </div>
            </div>
            <p>HQL&#12420;&#12493;&#12452;&#12486;&#12451;&#12502;&#12394;SQL&#12463;&#12456;&#12522;&#12399;&#12289; <code class="literal">org.hibernate.Query</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12375;&#12390;&#34920;&#29694;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12399;&#12289;&#12497;&#12521;&#12513;&#12540;&#12479;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12420;ResultSet&#12398;&#12495;&#12531;&#12489;&#12522;&#12531;&#12464;&#12420; &#12463;&#12456;&#12522;&#12398;&#23455;&#34892;&#12434;&#34892;&#12358;&#12513;&#12477;&#12483;&#12489;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#36890;&#24120;&#12289; <code class="literal">Query</code> &#12399;&#12289;&#20197;&#19979;&#12395;&#31034;&#12377;&#12424;&#12358;&#12395;&#12289; &#12381;&#12398;&#26178;&#28857;&#12398; <code class="literal">Session</code> &#12434;&#20351;&#12387;&#12390;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">List cats = session.createQuery(
    "from Cat as cat where cat.birthdate &lt; ?")
    .setDate(0, date)
    .list();

List mothers = session.createQuery(
    "select mother from Cat as cat join cat.mother as mother where cat.name = ?")
    .setString(0, name)
    .list();

List kittens = session.createQuery(
    "from Cat as cat where cat.mother = ?")
    .setEntity(0, pk)
    .list();

Cat mother = (Cat) session.createQuery(
    "select cat.mother from Cat as cat where cat = ?")
    .setEntity(0, izi)
    .uniqueResult();]]

Query mothersWithKittens = (Cat) session.createQuery(
    "select mother from Cat as mother left join fetch mother.kittens");
Set uniqueMothers = new HashSet(mothersWithKittens.list());</pre><p>&#12463;&#12456;&#12522;&#12399;&#12289;&#26222;&#36890;&#12289; <code class="literal">list()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290; &#12463;&#12456;&#12522;&#12398;&#32080;&#26524;&#12399;&#12289;&#12513;&#12514;&#12522;&#19978;&#12395;&#12354;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12377;&#12409;&#12390;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290; &#12463;&#12456;&#12522;&#12395;&#12424;&#12387;&#12390;&#24489;&#20803;&#12373;&#12428;&#12383;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#27704;&#32154;&#29366;&#24907;&#12391;&#12377;&#12290; &#12418;&#12375;&#12289;&#12463;&#12456;&#12522;&#12364;&#12383;&#12387;&#12383;1&#20491;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36820;&#12377;&#12392;&#20998;&#12363;&#12387;&#12390;&#12356;&#12427;&#12394;&#12425;&#12289;
               <code class="literal">uniqueResult()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#25163;&#12387;&#21462;&#12426;&#26089;&#12356;&#26041;&#27861;&#12391;&#12377;&#12290; &#21363;&#26178;&#12501;&#12455;&#12483;&#12481;&#12434;&#21033;&#29992;&#12375;&#12383;&#12463;&#12456;&#12522;&#12398;&#22580;&#21512;&#12289;&#12405;&#12388;&#12358;&#12289;&#24471;&#12425;&#12428;&#12383;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12399;&#12289; &#12523;&#12540;&#12488;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#37325;&#35079;&#12375;&#12390;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377; &#65288;&#12375;&#12363;&#12375;&#12289;&#12523;&#12540;&#12488;&#12364;&#25345;&#12388;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#21021;&#26399;&#21270;(&#12525;&#12540;&#12489;&#65289;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#65289;&#12290; &#12371;&#12398;&#37325;&#35079;&#12399; <code class="literal">Set</code> &#12434;&#20351;&#12387;&#12390;&#21462;&#12426;&#38500;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
            <div class="sect3" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="objectstate-querying-executing-iterate"></a>10.4.1.1. &#32080;&#26524;&#12434;&#12452;&#12486;&#12524;&#12540;&#12488;&#12377;&#12427;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#26178;&#12293;&#12289; <code class="literal">iterate()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12387;&#12390;&#12463;&#12456;&#12522;&#12434;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289; &#12424;&#12426;&#33391;&#12356;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12434;&#24471;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;&#36890;&#24120;&#12289;&#12463;&#12456;&#12522;&#12395;&#12424;&#12387;&#12390;&#24471;&#12425;&#12428;&#12383;&#23455;&#38555;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12289; &#12377;&#12391;&#12395;&#12475;&#12483;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12364;&#26399;&#24453;&#12391;&#12365;&#12427;&#22580;&#21512;&#12384;&#12369;&#12391;&#12377;&#12290; &#12381;&#12428;&#12425;&#12364;&#12289;&#12414;&#12384;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12394;&#12425;&#12289;
                  <code class="literal">iterate()</code> &#12399;&#12289; <code class="literal">list()</code> &#12424;&#12426;&#12418;&#36933;&#12367;&#12289;&#31777;&#21336;&#12394;&#12463;&#12456;&#12522;&#12395;&#23550;&#12375;&#12390;&#12418;&#22810;&#12367;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12450;&#12463;&#12475;&#12473;&#12434; &#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#12450;&#12463;&#12475;&#12473;&#12392;&#12399;&#12289;&#35672;&#21029;&#23376;&#12384;&#12369;&#12434;&#21462;&#24471;&#12377;&#12427;&#12383;&#12417;&#12398;&#26368;&#21021;&#12398;select&#65297;&#22238;&#12392;&#12289; &#23455;&#38555;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21021;&#26399;&#21270;&#12377;&#12427;&#12383;&#12417;&#12395;&#24460;&#12363;&#12425;&#34892;&#12358;n&#22238;&#12398;select&#12398;&#12371;&#12392;&#12391;&#12377;&#12290; 
               </p><pre class="programlisting">// fetch ids
Iterator iter = sess.createQuery("from eg.Qux q order by q.likeliness").iterate();
while ( iter.hasNext() ) {
    Qux qux = (Qux) iter.next();  // fetch the object
    // something we couldnt express in the query
    if ( qux.calculateComplicatedAlgorithm() ) {
        // delete the current instance
        iter.remove();
        // dont need to process the rest
        break;
    }
}</pre></div>
            <div class="sect3" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="objectstate-querying-executing-tuples"></a>10.4.1.2. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#32068;&#65288;tuple&#65289;&#12434;&#36820;&#12377;&#12463;&#12456;&#12522;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>Hibernate&#12398;&#12463;&#12456;&#12522;&#12391;&#12399;&#12289;&#26178;&#12293;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#32068;&#12434;&#36820;&#12377;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12381;&#12398;&#22580;&#21512;&#12399;&#12289;&#21508;&#12479;&#12503;&#12523;&#12399;&#37197;&#21015;&#12392;&#12375;&#12390;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290; </p><pre class="programlisting">Iterator kittensAndMothers = sess.createQuery(
            "select kitten, mother from Cat kitten join kitten.mother mother")
            .list()
            .iterator();

while ( kittensAndMothers.hasNext() ) {
    Object[] tuple = (Object[]) kittensAndMothers.next();
    Cat kitten = (Cat) tuple[0];
    Cat mother = (Cat) tuple[1];
    ....
}</pre></div>
            <div class="sect3" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="objectstate-querying-executing-scalar"></a>10.4.1.3. &#12473;&#12459;&#12521;&#12540;&#12398;&#32080;&#26524;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#12463;&#12456;&#12522;&#12391;&#12399;&#12289; <code class="literal">select</code> &#31680;&#12391;&#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290; SQL&#12398;&#38598;&#21512;&#38306;&#25968;&#12434;&#21628;&#12406;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12503;&#12525;&#12497;&#12486;&#12451;&#12420;&#38598;&#21512;&#38306;&#25968;&#12399;&#12289; &#65288;&#27704;&#32154;&#29366;&#24907;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12391;&#12399;&#12394;&#12367;&#65289;&#12300;&#12473;&#12459;&#12521;&#12540;&#20516;&#12301;&#12391;&#12354;&#12427;&#12392;&#35211;&#12394;&#12373;&#12428;&#12414;&#12377;&#12290; 
               </p><pre class="programlisting">Iterator results = sess.createQuery(
        "select cat.color, min(cat.birthdate), count(cat) from Cat cat " +
        "group by cat.color")
        .list()
        .iterator();

while ( results.hasNext() ) {
    Object[] row = (Object[]) results.next();
    Color type = (Color) row[0];
    Date oldest = (Date) row[1];
    Integer count = (Integer) row[2];
    .....
}</pre></div>
            <div class="sect3" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="objectstate-querying-executing-parameters"></a>10.4.1.4. &#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#12496;&#12452;&#12531;&#12489;
                        </h4>
                     </div>
                  </div>
               </div>
               <p><code class="literal">Query</code> &#12399;&#12289;&#21517;&#21069;&#20184;&#12365;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12420;JDBC&#12473;&#12479;&#12452;&#12523;&#12398; <code class="literal">?</code> &#12497;&#12521;&#12513;&#12540;&#12479;&#12395;&#20516;&#12434;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12383;&#12417;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; <span class="emphasis"><em>JDBC&#12392;&#12399;&#36949;&#12356;&#12289;Hibernate&#12399;&#12497;&#12521;&#12513;&#12540;&#12479;&#12395;&#12476;&#12525;&#12363;&#12425;&#30058;&#21495;&#12434;&#25391;&#12387;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;</em></span> &#21517;&#21069;&#20184;&#12365;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12392;&#12399;&#12289;&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12398;&#12394;&#12363;&#12395;&#12354;&#12427; <code class="literal">:name</code> &#24418;&#24335;&#12398;&#35672;&#21029;&#23376;&#12391;&#12377;&#12290; &#21517;&#21069;&#20184;&#12365;&#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#21033;&#28857;&#12399;&#27425;&#12398;&#36890;&#12426;&#12391;&#12377;&#12290; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc" compact>
                     <li>
                        <p>&#21517;&#21069;&#20184;&#12365;&#12497;&#12521;&#12513;&#12540;&#12479;&#12399;&#12289;&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12395;&#30331;&#22580;&#12377;&#12427;&#38918;&#30058;&#12392;&#28961;&#38306;&#20418;&#12391;&#12377; </p>
                     </li>
                     <li>
                        <p>&#21516;&#12376;&#12463;&#12456;&#12522;&#20869;&#12395;&#35079;&#25968;&#22238;&#30331;&#22580;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377; </p>
                     </li>
                     <li>
                        <p>&#33258;&#20998;&#33258;&#36523;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377; </p>
                     </li>
                  </ul>
               </div><pre class="programlisting">//named parameter (preferred)
Query q = sess.createQuery("from DomesticCat cat where cat.name = :name");
q.setString("name", "Fritz");
Iterator cats = q.iterate();</pre><pre class="programlisting">//positional parameter
Query q = sess.createQuery("from DomesticCat cat where cat.name = ?");
q.setString(0, "Izi");
Iterator cats = q.iterate();</pre><pre class="programlisting">//named parameter list
List names = new ArrayList();
names.add("Izi");
names.add("Fritz");
Query q = sess.createQuery("from DomesticCat cat where cat.name in (:namesList)");
q.setParameterList("namesList", names);
List cats = q.list();</pre></div>
            <div class="sect3" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="objectstate-querying-executing-pagination"></a>10.4.1.5. &#12506;&#12540;&#12472;&#20998;&#12369;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>ResultSet&#12395;&#21046;&#38480;&#65288;&#24489;&#20803;&#12375;&#12383;&#12356;&#26368;&#22823;&#34892;&#25968;&#12420;&#24489;&#20803;&#12375;&#12383;&#12356;&#26368;&#21021;&#12398;&#34892;&#65289;&#12434;&#21152;&#12360;&#12427;&#24517;&#35201;&#12364;&#12354;&#12428;&#12400;&#12289; &#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12289; <code class="literal">Query</code> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290; 
               </p><pre class="programlisting">Query q = sess.createQuery("from DomesticCat cat");
q.setFirstResult(20);
q.setMaxResults(10);
List cats = q.list();</pre><p>&#21046;&#38480;&#20184;&#12365;&#12398;&#12463;&#12456;&#12522;&#12434;DBMS&#12398;&#12493;&#12452;&#12486;&#12451;&#12502;&#12394;SQL&#12395;&#22793;&#25563;&#12377;&#12427;&#26041;&#27861;&#12434;&#12289;Hibernate&#12399;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; </p>
            </div>
            <div class="sect3" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="objectstate-querying-executing-scrolling"></a>10.4.1.6. &#12473;&#12463;&#12525;&#12540;&#12523;&#21487;&#33021;&#12394;&#12452;&#12486;&#12524;&#12540;&#12471;&#12519;&#12531;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>JDBC&#12489;&#12521;&#12452;&#12496;&#12364;&#12473;&#12463;&#12525;&#12540;&#12523;&#21487;&#33021;&#12394; <code class="literal">ResultSet</code> &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289; <code class="literal">Query</code> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#20351;&#12387;&#12390;&#12289; <code class="literal">ScrollableResults</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; &#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12428;&#12434;&#20351;&#12358;&#12392;&#12289;&#12463;&#12456;&#12522;&#12398;&#32080;&#26524;&#12395;&#23550;&#12375;&#12390;&#26580;&#36575;&#12395;&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12391;&#12365;&#12414;&#12377;&#12290; 
               </p><pre class="programlisting">Query q = sess.createQuery("select cat.name, cat from DomesticCat cat " +
                            "order by cat.name");
ScrollableResults cats = q.scroll();
if ( cats.first() ) {

    // find the first name on each page of an alphabetical list of cats by name
    firstNamesOfPages = new ArrayList();
    do {
        String name = cats.getString(0);
        firstNamesOfPages.add(name);
    }
    while ( cats.scroll(PAGE_SIZE) );

    // Now get the first page of cats
    pageOfCats = new ArrayList();
    cats.beforeFirst();
    int i=0;
    while( ( PAGE_SIZE &gt; i++ ) &amp;&amp; cats.next() ) pageOfCats.add( cats.get(1) );

}
cats.close()</pre><p>&#12371;&#12398;&#27231;&#33021;&#12395;&#12399;&#12458;&#12540;&#12503;&#12531;&#29366;&#24907;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12418;&#12375;&#12289;&#12458;&#12501;&#12521;&#12452;&#12531;&#12398;&#12506;&#12540;&#12472;&#20998;&#12369;&#27231;&#33021;&#12364;&#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#12289; <code class="literal">setMaxResult()</code> / <code class="literal">setFirstResult()</code> &#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290; 
               </p>
            </div>
            <div class="sect3" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h4 class="title"><a name="objectstate-querying-executing-named"></a>10.4.1.7. &#21517;&#21069;&#20184;&#12365;&#12463;&#12456;&#12522;&#12398;&#22806;&#20986;&#12375;
                        </h4>
                     </div>
                  </div>
               </div>
               <p>&#12510;&#12483;&#12500;&#12531;&#12464;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12395;&#21517;&#21069;&#20184;&#12365;&#12398;&#12463;&#12456;&#12522;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#65288;&#12510;&#12540;&#12463;&#12450;&#12483;&#12503;&#12392;&#35299;&#37320;&#12373;&#12428;&#12427;&#25991;&#23383;&#12364;&#12463;&#12456;&#12522;&#12395;&#21547;&#12414;&#12428;&#12427;&#12394;&#12425;&#12289; <code class="literal">CDATA</code> &#12475;&#12463;&#12471;&#12519;&#12531;&#12434; &#20351;&#12358;&#12371;&#12392;&#12434;&#24536;&#12428;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;&#65289; 
               </p><pre class="programlisting">&lt;query name="ByNameAndMaximumWeight"&gt;&lt;![CDATA[
    from eg.DomesticCat as cat
        where cat.name = ?
        and cat.weight &gt; ?
] ]&gt;&lt;/query&gt;</pre><p>&#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12392;&#23455;&#34892;&#12399;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290; </p><pre class="programlisting">Query q = sess.getNamedQuery("ByNameAndMaximumWeight");
q.setString(0, name);
q.setInt(1, minWeight);
List cats = q.list();</pre><p>&#23455;&#38555;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12467;&#12540;&#12489;&#12399;&#12289;&#20351;&#12431;&#12428;&#12427;&#12463;&#12456;&#12522;&#35328;&#35486;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; &#12513;&#12479;&#12487;&#12540;&#12479;&#12395;&#12399;&#12289;&#12493;&#12452;&#12486;&#12451;&#12502;SQL&#12463;&#12456;&#12522;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#12414;&#12383;&#12289;&#26082;&#23384;&#12398;&#12463;&#12456;&#12522;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12395;&#31227;&#12377;&#12371;&#12392;&#12391;&#12289; Hibernate&#12395;&#31227;&#34892;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
                  
               </p>
               <p><code class="literal">&lt;hibernate-mapping&gt;</code> &#12398;&#20013;&#12398;&#12463;&#12456;&#12522;&#23450;&#32681;&#12399;&#12289;&#12463;&#12456;&#12522;&#12395;&#23550;&#12377;&#12427; &#12518;&#12491;&#12540;&#12463;&#12394;&#21517;&#21069;&#12364;&#24517;&#35201;&#12394;&#12371;&#12392;&#12395;&#12418;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12381;&#12428;&#12395;&#23550;&#12375;&#12390;&#12289; <code class="literal">&lt;class&gt;</code> &#12398;&#20013;&#12398; &#12463;&#12456;&#12522;&#23450;&#32681;&#12399;&#12289;&#12463;&#12521;&#12473;&#12398;&#23436;&#20840;&#38480;&#23450;&#21517;&#12364;&#21069;&#12395;&#20184;&#12369;&#12425;&#12428;&#12427;&#12398;&#12391;&#12289;&#33258;&#21205;&#30340;&#12395;&#12518;&#12491;&#12540;&#12463;&#12394;&#21517;&#21069;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#20363;&#65306; <code class="literal">eg.Cat.ByNameAndMaximumWeight</code> 
               </p>
            </div>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="objectstate-filtering"></a>10.4.2. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531; <span class="emphasis"><em>&#12501;&#12451;&#12523;&#12479;</em></span> &#12399;&#12289;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#37197;&#21015;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427; &#29305;&#27530;&#12394;&#12479;&#12452;&#12503;&#12398;&#12463;&#12456;&#12522;&#12391;&#12377;&#12290;&#12381;&#12398;&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12391;&#12399;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12381;&#12398;&#26178;&#28857;&#12391;&#12398;&#35201;&#32032;&#12434;&#24847;&#21619;&#12377;&#12427; <code class="literal">this</code> &#12434;&#20351;&#12356;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">Collection blackKittens = session.createFilter(
    pk.getKittens(), 
    "where this.color = ?")
    .setParameter( Color.BLACK, Hibernate.custom(ColorUserType.class) )
    .list()
);</pre><p>&#36820;&#12373;&#12428;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;Bag&#12392;&#12415;&#12394;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#12289;&#12381;&#12428;&#12399;&#12418;&#12392;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12467;&#12500;&#12540;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#20803;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#20462;&#27491;&#12373;&#12428;&#12414;&#12379;&#12435;&#65288;&#12371;&#12428;&#12399;&#12289;"filter"&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#24847;&#21619;&#12392;&#12399;&#30064;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289; &#26399;&#24453;&#12373;&#12428;&#12427;&#21205;&#12365;&#12392;&#12399;&#19968;&#33268;&#12375;&#12390;&#12356;&#12414;&#12377;&#65289;&#12290; </p>
            <p>&#12501;&#12451;&#12523;&#12479;&#12395;&#12399; <code class="literal">from</code> &#31680;&#12364;&#19981;&#35201;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27671;&#12389;&#12367;&#12391;&#12375;&#12423;&#12358;&#65288;&#24517;&#35201;&#12394;&#12425;&#12289;&#25345;&#12388;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12364;&#65289;&#12290; &#12501;&#12451;&#12523;&#12479;&#12399;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;&#33258;&#20307;&#12434;&#36820;&#12375;&#12390;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290; 
            </p><pre class="programlisting">Collection blackKittenMates = session.createFilter(
    pk.getKittens(), 
    "select this.mate where this.color = eg.Color.BLACK.intValue")
    .list();</pre><p>&#12463;&#12456;&#12522;&#12434;&#21547;&#12414;&#12394;&#12356;&#12501;&#12451;&#12523;&#12479;&#12418;&#24441;&#12395;&#31435;&#12385;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;&#38750;&#24120;&#12395;&#22823;&#12365;&#12394;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#37096;&#20998;&#38598;&#21512;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12360;&#12414;&#12377;&#12290; </p><pre class="programlisting">Collection tenKittens = session.createFilter(
    mother.getKittens(), "")
    .setFirstResult(0).setMaxResults(10)
    .list();</pre></div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="objecstate-querying-criteria"></a>10.4.3. &#12463;&#12521;&#12452;&#12486;&#12522;&#12450;&#12398;&#12463;&#12456;&#12522;
                     </h3>
                  </div>
               </div>
            </div>
            <p>HQL&#12399;&#38750;&#24120;&#12395;&#24375;&#21147;&#12391;&#12377;&#12364;&#12289;&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12434;&#20316;&#12427;&#12424;&#12426;&#12418;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12398;API&#12434;&#20351;&#12387;&#12390; &#21205;&#30340;&#12395;&#12463;&#12456;&#12522;&#12434;&#20316;&#12427;&#26041;&#12434;&#22909;&#12416;&#38283;&#30330;&#32773;&#12418;&#12356;&#12414;&#12377;&#12290; &#12371;&#12358;&#12356;&#12387;&#12383;&#22580;&#21512;&#12398;&#12383;&#12417;&#12395;&#12289;Hibernate&#12399;&#30452;&#24863;&#30340;&#12394; <code class="literal">Criteria</code> &#12463;&#12456;&#12522;API&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">Criteria crit = session.createCriteria(Cat.class);
crit.add( Restrictions.eq( "color", eg.Color.BLACK ) );
crit.setMaxResults(10);
List cats = crit.list();</pre><p><code class="literal">Criteria</code> &#12392; <code class="literal">Example</code> API&#12398;&#35443;&#32048;&#12399;&#12289; <a href="querycriteria.html" title="&#31532;15&#31456; Criteria&#12463;&#12456;&#12522;">&#31456;&nbsp;15. <i xmlns:xlink="http://www.w3.org/1999/xlink">Criteria&#12463;&#12456;&#12522;</i></a> &#12395;&#36848;&#12409;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; 
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="objectstate-querying-nativesql"></a>10.4.4. &#12493;&#12452;&#12486;&#12451;&#12502;SQL&#12398;&#12463;&#12456;&#12522;
                     </h3>
                  </div>
               </div>
            </div>
            <p><code class="literal">createSQLQuery()</code> &#12434;&#20351;&#12387;&#12390;&#12289;SQL&#12391;&#12463;&#12456;&#12522;&#12434;&#34920;&#29694;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#12381;&#12375;&#12390;&#12289;Hibernate&#12395;&#12289;ResultSet &#12363;&#12425;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#12414;&#12363;&#12379;&#12414;&#12377;&#12290; <code class="literal">session.connection()</code> &#12434;&#21628;&#12409;&#12400;&#12393;&#12435;&#12394;&#12392;&#12365;&#12391;&#12418;&#12289;&#30452;&#25509;&#12289;JDBC <code class="literal">Connection</code> &#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12365;&#12414;&#12375;&#12423;&#12358;&#12290; &#12418;&#12375;&#12289;Hibernate API&#12434;&#20351;&#12358;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;&#19979;&#35352;&#12398;&#12424;&#12358;&#12395;SQL&#12398;&#21029;&#21517;&#12434;&#25324;&#24359;&#12391;&#12367;&#12367;&#12425;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; 
            </p><pre class="programlisting">List cats = session.createSQLQuery("SELECT {cat.*} FROM CAT {cat} WHERE ROWNUM&lt;10")
    .addEntity("cat", Cat.class)
.list();</pre><pre class="programlisting">List cats = session.createSQLQuery(
    "SELECT {cat}.ID AS {cat.id}, {cat}.SEX AS {cat.sex}, " +
           "{cat}.MATE AS {cat.mate}, {cat}.SUBCLASS AS {cat.class}, ... " +
    "FROM CAT {cat} WHERE ROWNUM&lt;10")
    .addEntity("cat", Cat.class)
.list()</pre><p>SQL&#12463;&#12456;&#12522;&#12399;&#12289;Hibernate&#12463;&#12456;&#12522;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#12289;&#21517;&#21069;&#20184;&#12365;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12392;&#20301;&#32622;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#25345;&#12388;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; Hibernate&#12395;&#12362;&#12369;&#12427;&#12493;&#12452;&#12486;&#12451;&#12502;&#12394;SQL&#12463;&#12456;&#12522;&#12398;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289; <a href="querysql.html" title="&#31532;16&#31456; &#12493;&#12452;&#12486;&#12451;&#12502;SQL">&#31456;&nbsp;16. <i xmlns:xlink="http://www.w3.org/1999/xlink">&#12493;&#12452;&#12486;&#12451;&#12502;SQL</i></a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-loading.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="objectstate.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-modifying.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.3. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;10.5. &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20462;&#27491;</td>
            </tr>
         </table>
      </div>
   </body>
</html>