<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>12.2. &#12452;&#12505;&#12531;&#12488;&#12471;&#12473;&#12486;&#12512;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="events.html" title="&#31532;12&#31456; &#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12392;&#12452;&#12505;&#12531;&#12488;">
      <link rel="prev" href="events.html" title="&#31532;12&#31456; &#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12392;&#12452;&#12505;&#12531;&#12488;">
      <link rel="next" href="objectstate-decl-security.html" title="12.3. Hibernate&#12398;&#23459;&#35328;&#30340;&#12394;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">12.2. &#12452;&#12505;&#12531;&#12488;&#12471;&#12473;&#12486;&#12512;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="events.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;12&#31456; &#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12392;&#12452;&#12505;&#12531;&#12488;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-decl-security.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="objectstate-events"></a>12.2. &#12452;&#12505;&#12531;&#12488;&#12471;&#12473;&#12486;&#12512;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#27704;&#32154;&#21270;&#23652;&#12391;&#29305;&#23450;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#23550;&#24540;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#22580;&#21512;&#12289; Hibernate3&#12398; <span class="emphasis"><em>&#12452;&#12505;&#12531;&#12488;</em></span> &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12434;&#20351;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#12452;&#12505;&#12531;&#12488;&#12471;&#12473;&#12486;&#12512;&#12399;&#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12392;&#19968;&#32210;&#12395;&#20351;&#12358;&#12363;&#12289;&#12414;&#12383;&#12399;&#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12398;&#20195;&#12431;&#12426;&#12392;&#12375;&#12390;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
         </p>
         <p>&#26412;&#36074;&#30340;&#12395; <code class="literal">Session</code> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#12377;&#12409;&#12390;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289; 1&#20491;&#12398;&#12452;&#12505;&#12531;&#12488;&#12392;&#30456;&#20114;&#12395;&#38306;&#36899;&#12375;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400; <code class="literal">LoadEvent</code>&#12289;<code class="literal">FlushEvent</code> &#12394;&#12393;&#12364;&#12354;&#12426;&#12414;&#12377; &#65288;&#23450;&#32681;&#28168;&#12415;&#12398;&#12452;&#12505;&#12531;&#12488;&#22411;&#12398;&#19968;&#35239;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;XML&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12398;DTD&#12420; <code class="literal">org.hibernate.event</code> &#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#35519;&#12409;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12290; &#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#12371;&#12428;&#12425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;1&#12388;&#12363;&#12425;&#20316;&#12425;&#12428;&#12427;&#12392;&#12365;&#12289; Hibernate&#12398; <code class="literal">Session</code> &#12399;&#36969;&#20999;&#12394;&#12452;&#12505;&#12531;&#12488;&#12434;&#29983;&#25104;&#12375;&#12289; &#12381;&#12398;&#12452;&#12505;&#12531;&#12488;&#22411;&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12395;&#28193;&#12375;&#12414;&#12377;&#12290; &#12377;&#12400;&#12425;&#12375;&#12356;&#12371;&#12392;&#12395;&#12289;&#12371;&#12428;&#12425;&#12398;&#12522;&#12473;&#12490;&#12399;&#12381;&#12398;&#12513;&#12477;&#12483;&#12489;&#12392;&#21516;&#12376;&#20966;&#29702;&#12434;&#23455;&#35013;&#12375;&#12414;&#12377;&#12290; &#12392;&#12399;&#12356;&#12360;&#12289;&#12522;&#12473;&#12490;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#19968;&#12388;&#12434;&#33258;&#30001;&#12395;&#12459;&#12473;&#12479;&#12512;&#23455;&#35013;&#12391;&#12365;&#12414;&#12377; &#65288;&#12388;&#12414;&#12426;&#12289;<code class="literal">LoadEvent</code> &#12399;&#30331;&#37682;&#12373;&#12428;&#12383; <code class="literal">LoadEventListener</code> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#23455;&#35013;&#12395;&#12424;&#12426;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#65289;&#12290; &#12381;&#12398;&#22580;&#21512;&#12289;&#12381;&#12398;&#23455;&#35013;&#12395;&#12399; <code class="literal">Session</code> &#12363;&#12425;&#20316;&#12425;&#12428;&#12383;&#12393;&#12398;&#12424;&#12358;&#12394; <code class="literal">load()</code> &#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#12418;&#20966;&#29702;&#12377;&#12427;&#36012;&#20219;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
         </p>
         <p>&#12522;&#12473;&#12490;&#12399;&#20107;&#23455;&#19978;&#12471;&#12531;&#12464;&#12523;&#12488;&#12531;&#12391;&#12354;&#12427;&#12392;&#35211;&#12394;&#12379;&#12414;&#12377;&#12290; &#12388;&#12414;&#12426;&#12522;&#12473;&#12490;&#12399;&#12522;&#12463;&#12456;&#12473;&#12488;&#38291;&#12391;&#20849;&#26377;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289; &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#12392;&#12375;&#12390;&#29366;&#24907;&#12434;&#20445;&#25345;&#12377;&#12427;&#12409;&#12365;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; </p>
         <p>&#12459;&#12473;&#12479;&#12512;&#12522;&#12473;&#12490;&#12399;&#20966;&#29702;&#12375;&#12383;&#12356;&#12452;&#12505;&#12531;&#12488;&#12395;&#12388;&#12356;&#12390;&#36969;&#20999;&#12394;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290; &#20415;&#21033;&#12394;&#22522;&#24213;&#12463;&#12521;&#12473;&#12398;&#12358;&#12385;&#12398;&#19968;&#12388;&#12434;&#32153;&#25215;&#12375;&#12390;&#12418;&#12424;&#12356;&#12391;&#12377; &#65288;&#12414;&#12383;&#12399;Hibernate&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#20351;&#29992;&#12377;&#12427;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12434;&#32153;&#25215;&#12375;&#12390;&#12418;&#12424;&#12356;&#12391;&#12377;&#12290; &#12377;&#12400;&#12425;&#12375;&#12356;&#12371;&#12392;&#12395;&#12289;&#12371;&#12398;&#30446;&#30340;&#12398;&#12383;&#12417;&#12395;&#38750;final&#12392;&#12375;&#12390;&#23459;&#35328;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#65289;&#12290;
            &#12459;&#12473;&#12479;&#12512;&#12522;&#12473;&#12490;&#12399; <code class="literal">Configuration</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#12387;&#12390;&#12503;&#12525;&#12464;&#12521;&#12512;&#12363;&#12425;&#30331;&#37682;&#12377;&#12427;&#12363;&#12289; Hibernate&#12398;XML&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12391;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377; &#65288;&#12503;&#12525;&#12497;&#12486;&#12451;&#12501;&#12449;&#12452;&#12523;&#12391;&#23459;&#35328;&#30340;&#12395;&#35373;&#23450;&#12377;&#12427;&#26041;&#27861;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#65289;&#12290; &#12459;&#12473;&#12479;&#12512;&#12525;&#12540;&#12489;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12398;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">public class MyLoadListener implements LoadEventListener {
    // this is the single method defined by the LoadEventListener interface
    public void onLoad(LoadEvent event, LoadEventListener.LoadType loadType)
            throws HibernateException {
        if ( !MySecurity.isAuthorized( event.getEntityClassName(), event.getEntityId() ) ) {
            throw MySecurityException("Unauthorized access");
        }
    }
}</pre><p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12522;&#12473;&#12490;&#20197;&#22806;&#12398;&#12522;&#12473;&#12490;&#12434;&#20351;&#12358;&#12395;&#12399;&#12289;Hibernate&#12408;&#12398;&#35373;&#23450;&#12418;&#24517;&#35201;&#12391;&#12377;&#65306; </p><pre class="programlisting">&lt;hibernate-configuration&gt;
    &lt;session-factory&gt;
        ...
        &lt;event type="load"&gt;
            &lt;listener class="com.eg.MyLoadListener"/&gt;
            &lt;listener class="org.hibernate.event.def.DefaultLoadEventListener"/&gt;
        &lt;/event&gt;
    &lt;/session-factory&gt;
&lt;/hibernate-configuration&gt;</pre><p>&#12414;&#12383;&#12381;&#12398;&#20182;&#12395;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#30331;&#37682;&#12377;&#12427;&#26041;&#27861;&#12418;&#12354;&#12426;&#12414;&#12377;&#65306; </p><pre class="programlisting">Configuration cfg = new Configuration();
LoadEventListener[] stack = { new MyLoadListener(), new DefaultLoadEventListener() };
cfg.EventListeners().setLoadEventListeners(stack);</pre><p>&#12522;&#12473;&#12490;&#12434;&#23459;&#35328;&#30340;&#12395;&#30331;&#37682;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#12522;&#12473;&#12490;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20849;&#26377;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#35079;&#25968;&#12398; <code class="literal">&lt;listener/&gt;</code> &#35201;&#32032;&#12391;&#21516;&#12376;&#12463;&#12521;&#12473;&#21517;&#12364;&#20351;&#12431;&#12428;&#12427;&#12392;&#12289; &#12381;&#12428;&#12382;&#12428;&#12398;&#21442;&#29031;&#12399;&#12381;&#12398;&#12463;&#12521;&#12473;&#12398;&#21029;&#12293;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#25351;&#12377;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12522;&#12473;&#12490;&#22411;&#12398;&#38291;&#12391;&#12522;&#12473;&#12490;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20849;&#26377;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12428;&#12400;&#12289; &#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#30331;&#37682;&#12377;&#12427;&#26041;&#27861;&#12434;&#25505;&#12425;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; 
         </p>
         <p>&#12394;&#12380;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12375;&#12390;&#12289;&#29305;&#21270;&#12375;&#12383;&#22411;&#12434;&#35373;&#23450;&#26178;&#12395;&#25351;&#23450;&#12377;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#12522;&#12473;&#12490;&#12398;&#23455;&#35013;&#12463;&#12521;&#12473;&#12395;&#12289;&#35079;&#25968;&#12398;&#12452;&#12505;&#12531;&#12488;&#12522;&#12473;&#12490;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290; &#30331;&#37682;&#26178;&#12395;&#36861;&#21152;&#12391;&#22411;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12459;&#12473;&#12479;&#12512;&#12522;&#12473;&#12490;&#12398;on/off&#12434;&#35373;&#23450;&#26178;&#12395;&#31777;&#21336;&#12395;&#20999;&#12426;&#26367;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;
            
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="events.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="events.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-decl-security.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">&#31532;12&#31456; &#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12392;&#12452;&#12505;&#12531;&#12488;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;12.3. Hibernate&#12398;&#23459;&#35328;&#30340;&#12394;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</td>
            </tr>
         </table>
      </div>
   </body>
</html>