<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>10.11. &#36899;&#37782;&#30340;&#12394;&#27704;&#32154;&#21270;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="objectstate.html" title="&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;">
      <link rel="prev" href="objectstate-flushing.html" title="10.10. &#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#12501;&#12521;&#12483;&#12471;&#12517;">
      <link rel="next" href="objectstate-metadata.html" title="10.12. &#12513;&#12479;&#12487;&#12540;&#12479;&#12398;&#20351;&#29992;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">10.11. &#36899;&#37782;&#30340;&#12394;&#27704;&#32154;&#21270;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-flushing.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-metadata.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="objectstate-transitive"></a>10.11. &#36899;&#37782;&#30340;&#12394;&#27704;&#32154;&#21270;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#20491;&#12293;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12475;&#12540;&#12502;&#12375;&#12383;&#12426;&#12289;&#21066;&#38500;&#12375;&#12383;&#12426;&#12289;&#20877;&#36861;&#21152;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12399; &#12363;&#12394;&#12426;&#38754;&#20498;&#12391;&#12377;&#12290;&#29305;&#12395;&#12289;&#38306;&#36899;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;&#12424;&#12358;&#12394;&#22580;&#21512;&#12395;&#12399;&#38555;&#31435;&#12385;&#12414;&#12377;&#12290; &#12424;&#12367;&#12354;&#12427;&#12398;&#12399;&#12289;&#35242;&#23376;&#38306;&#20418;&#12434;&#25201;&#12358;&#12465;&#12540;&#12473;&#12391;&#12377;&#12290; &#20197;&#19979;&#12398;&#20363;&#12434;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290; </p>
         <p>&#12418;&#12375;&#12289;&#35242;&#23376;&#38306;&#20418;&#12398;&#23376;&#12364;&#20516;&#22411;&#12394;&#12425;&#65288;&#20363;&#12360;&#12400;&#12289;&#20303;&#25152;&#12420;&#25991;&#23383;&#21015;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65289;&#12289; &#12381;&#12428;&#12425;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12399;&#35242;&#12395;&#20381;&#23384;&#12375;&#12390;&#12362;&#12426;&#12289;&#20415;&#21033;&#12394;&#29366;&#24907;&#22793;&#21270;&#12398;"&#12459;&#12473;&#12465;&#12540;&#12489;"&#12434;&#20351;&#12358;&#12383;&#12417;&#12395;&#12289; &#36861;&#21152;&#12398;&#20316;&#26989;&#12399;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#35242;&#12364;&#12475;&#12540;&#12502;&#12373;&#12428;&#12383;&#12392;&#12365;&#12289;&#20516;&#22411;&#12398;&#23376;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12418;&#21516;&#12376;&#12424;&#12358;&#12395;&#12475;&#12540;&#12502;&#12373;&#12428;&#12414;&#12377;&#12375;&#12289;
            &#35242;&#12364;&#21066;&#38500;&#12373;&#12428;&#12383;&#12392;&#12365;&#12399;&#12289;&#23376;&#12418;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#20182;&#12398;&#25805;&#20316;&#12418;&#21516;&#12376;&#12391;&#12377;&#12290; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;1&#12388;&#12398;&#23376;&#12434;&#21066;&#38500;&#12377;&#12427;&#12424;&#12358;&#12394;&#25805;&#20316;&#12391;&#12418;&#12358;&#12414;&#12367;&#12356;&#12365;&#12414;&#12377;&#12290; &#12377;&#12394;&#12431;&#12385;&#12289;Hibernate&#12399;&#12371;&#12398;&#21066;&#38500;&#25805;&#20316;&#12434;&#26908;&#20986;&#12377;&#12427;&#12392;&#12289; &#20516;&#22411;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#21442;&#29031;&#12434;&#20849;&#26377;&#12391;&#12365;&#12394;&#12356;&#12398;&#12391;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#12381;&#12398;&#23376;&#20379;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;
            
         </p>
         <p>&#12371;&#12371;&#12391;&#12289;&#35242;&#12392;&#23376;&#12364;&#20516;&#22411;&#12391;&#12394;&#12367;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12391;&#12354;&#12427;&#12392;&#12375;&#12390;&#21516;&#12376;&#12471;&#12490;&#12522;&#12458;&#12434;&#32771;&#12360;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290; &#65288;&#20363;&#12360;&#12400;&#12289;&#12459;&#12486;&#12468;&#12522;&#12540;&#12392;&#21697;&#30446;&#12398;&#38306;&#20418;&#12420;&#35242;&#12392;&#23376;&#12398;&#29483;&#12398;&#38306;&#20418;&#12391;&#12377;&#12290;&#65289; &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#12289;&#12381;&#12428;&#33258;&#36523;&#12364;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12434;&#25345;&#12385;&#12289;&#21442;&#29031;&#12398;&#20849;&#26377;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290; &#65288;&#12381;&#12398;&#12383;&#12417;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;
            &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#33258;&#36523;&#12398;&#21066;&#38500;&#12434;&#24847;&#21619;&#12375;&#12414;&#12379;&#12435;&#12290;&#65289; &#12414;&#12383;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#38306;&#36899;&#12377;&#12427;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408; &#29366;&#24907;&#12434;&#12459;&#12473;&#12465;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; Hibernate&#12399; <span class="emphasis"><em>&#21040;&#36948;&#21487;&#33021;&#24615;&#12395;&#12424;&#12427;&#27704;&#32154;&#21270;</em></span> &#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#23455;&#34892;&#12375;&#12414;&#12379;&#12435;&#12290; 
         </p>
         <p>Hibernate&#12398;Session&#12398;&#22522;&#26412;&#25805;&#20316;&#65288; <code class="literal">persist(), merge(), saveOrUpdate(), delete(), lock(), refresh(), evict(), replicate()</code> &#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#65289;&#12395;&#23550;&#12375;&#12390;&#12289; &#12381;&#12428;&#12382;&#12428;&#12395;&#23550;&#24540;&#12377;&#12427;&#12459;&#12473;&#12465;&#12540;&#12489;&#12473;&#12479;&#12452;&#12523;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12381;&#12428;&#12382;&#12428;&#12398;&#12459;&#12473;&#12465;&#12540;&#12489;&#12473;&#12479;&#12452;&#12523;&#12395;&#12399;&#12289; <code class="literal">create, merge, save-update, delete, lock, refresh, evict, replicate</code> &#12392;&#12356;&#12358;&#21517;&#21069;&#12364;&#12388;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290; &#12418;&#12375;&#12289;&#38306;&#36899;&#12395;&#27839;&#12387;&#12390;&#12459;&#12473;&#12465;&#12540;&#12489;&#12373;&#12379;&#12383;&#12356;&#25805;&#20316;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12395;&#12381;&#12358;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#20363;&#12360;&#12400;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">&lt;one-to-one name="person" cascade="persist"/&gt;</pre><p>&#12459;&#12473;&#12465;&#12540;&#12489;&#12473;&#12479;&#12452;&#12523;&#12399;&#12289;&#32068;&#12415;&#21512;&#12431;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; </p><pre class="programlisting">&lt;one-to-one name="person" cascade="persist,delete,lock"/&gt;</pre><p><span class="emphasis"><em>&#12377;&#12409;&#12390;&#12398;</em></span> &#25805;&#20316;&#12434;&#38306;&#36899;&#12395;&#27839;&#12387;&#12390;&#12459;&#12473;&#12465;&#12540;&#12489;&#12377;&#12427;&#12424;&#12358;&#25351;&#23450;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289; <code class="literal">cascade="all"</code> &#12434;&#20351;&#12356;&#12414;&#12377;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12398; <code class="literal">cascade="none"</code> &#12399;&#12289;&#12393;&#12398;&#25805;&#20316;&#12418;&#12459;&#12473;&#12465;&#12540;&#12489;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290; 
         </p>
         <p>&#29305;&#27530;&#12394;&#12459;&#12473;&#12465;&#12540;&#12489;&#12473;&#12479;&#12452;&#12523; <code class="literal">delete-orphan</code> &#12399;&#12289;&#19968;&#23550;&#22810;&#38306;&#36899;&#12395;&#12384;&#12369; &#36969;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;&#38306;&#36899;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12383;&#23376;&#20379;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12289; <code class="literal">delete()</code> &#25805;&#20316;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290; 
         </p>
         <p>&#12362;&#12377;&#12377;&#12417;&#65306; </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>&#26222;&#36890;&#12289; <code class="literal">&lt;many-to-one&gt;</code> &#12420; <code class="literal">&lt;many-to-many&gt;</code> &#38306;&#36899;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289; &#12459;&#12473;&#12465;&#12540;&#12489;&#12434;&#35373;&#23450;&#12377;&#12427;&#24847;&#21619;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; <code class="literal">&lt;one-to-one&gt;</code> &#12392; <code class="literal">&lt;one-to-many&gt;</code> &#38306;&#36899;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289; &#12459;&#12473;&#12465;&#12540;&#12489;&#12364;&#24441;&#12395;&#31435;&#12388;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p>&#23376;&#20379;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23551;&#21629;&#12364;&#35242;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#23551;&#21629;&#12395;&#21046;&#38480;&#12434;&#21463;&#12369;&#12427;&#12394;&#12425;&#12400;&#12289; <code class="literal">cascade="all,delete-orphan"</code> &#12434;&#25351;&#23450;&#12375;&#12289; &#23376;&#20379;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; <span class="emphasis"><em>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</em></span> &#12395;&#12375;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p>. &#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399;&#12289;&#12459;&#12473;&#12465;&#12540;&#12489;&#12399;&#12411;&#12392;&#12435;&#12393;&#24517;&#35201;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290; &#12375;&#12363;&#12375;&#12289;&#21516;&#12376;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12394;&#12363;&#12391;&#35242;&#12392;&#23376;&#12364;&#19968;&#32210;&#12395;&#21205;&#20316;&#12377;&#12427;&#12371;&#12392;&#12364;&#22810;&#12356;&#12392;&#24605;&#12356;&#12289; &#12356;&#12367;&#12425;&#12363;&#12398;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#25163;&#38291;&#12434;&#30465;&#12365;&#12383;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289; <code class="literal">cascade="persist,merge,save-update"</code> &#12434;&#20351;&#12358;&#12371;&#12392;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290; 
                  </p>
               </li>
            </ul>
         </div>
         <p><code class="literal">cascade="all"</code> &#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12383;&#38306;&#36899;&#65288;&#21336;&#20516;&#38306;&#36899;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65289;&#12399;&#12289; <span class="emphasis"><em>&#35242;&#23376;</em></span> &#12473;&#12479;&#12452;&#12523;&#12398;&#38306;&#36899;&#12392;&#12510;&#12540;&#12463;&#12373;&#12428;&#12414;&#12377;&#12290; &#12381;&#12428;&#12399;&#12289;&#35242;&#12398;&#12475;&#12540;&#12502;/&#26356;&#26032;/&#21066;&#38500;&#12364;&#12289;&#23376;&#12398;&#12475;&#12540;&#12502;/&#26356;&#26032;/&#21066;&#38500;&#12434;&#24341;&#12365;&#36215;&#12371;&#12377;&#38306;&#20418;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290; 
         </p>
         <p>&#12373;&#12425;&#12395;&#12289;&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#35242;&#12364;&#23376;&#12434;&#21336;&#12395;&#21442;&#29031;&#12375;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12289;&#23376;&#12398;&#12475;&#12540;&#12502;/&#26356;&#26032;&#12434;&#24341;&#12365;&#36215;&#12371;&#12375;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#12513;&#12479;&#12501;&#12449;&#12540;&#12399;&#19981;&#23436;&#20840;&#12391;&#12377;&#12290;&#35242;&#12363;&#12425;&#21442;&#29031;&#12373;&#12428;&#12394;&#12367;&#12394;&#12387;&#12383;&#23376;&#12399;&#12289;&#33258;&#21205;&#30340;&#12395;&#21066;&#38500; <span class="emphasis"><em>&#12373;&#12428;&#12414;&#12379;&#12435;</em></span> &#12290; &#12383;&#12384;&#12375;&#12289; <code class="literal">cascade="delete-orphan"</code> &#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12383; <code class="literal">&lt;one-to-many&gt;</code> &#38306;&#36899;&#12434; &#38500;&#12356;&#12390;&#12391;&#12377;&#12290; &#35242;&#23376;&#38306;&#20418;&#12398;&#12459;&#12473;&#12465;&#12540;&#12489;&#25805;&#20316;&#12398;&#27491;&#30906;&#12394;&#24847;&#21619;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>&#35242;&#12364; <code class="literal">persist()</code> &#12395;&#28193;&#12373;&#12428;&#12383;&#12394;&#12425;&#12400;&#12289; &#12377;&#12409;&#12390;&#12398;&#23376;&#12399; <code class="literal">persist()</code> &#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">merge()</code> &#12395;&#28193;&#12373;&#12428;&#12383;&#12394;&#12425;&#12400;&#12289; &#12377;&#12409;&#12390;&#12398;&#23376;&#12399; <code class="literal">merge()</code> &#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p>&#35242;&#12364; <code class="literal">save()</code> &#12289; <code class="literal">update()</code> &#12289; <code class="literal">saveOrUpdate()</code> &#12395;&#28193;&#12373;&#12428;&#12383;&#12394;&#12425;&#12400;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12399; <code class="literal">saveOrUpdate()</code> &#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p>&#19968;&#26178;&#30340;&#12414;&#12383;&#12399;&#20998;&#38626;&#29366;&#24907;&#12398;&#23376;&#12364;&#12289;&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#35242;&#12395;&#21442;&#29031;&#12373;&#12428;&#12383;&#12394;&#12425;&#12400;&#12289; <code class="literal">saveOrUpdate()</code> &#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p>&#35242;&#12364;&#21066;&#38500;&#12373;&#12428;&#12383;&#12394;&#12425;&#12400;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12399;&#12289; <code class="literal">delete()</code> &#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p>&#23376;&#12364;&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#35242;&#12363;&#12425;&#21442;&#29031;&#12373;&#12428;&#12394;&#12367;&#12394;&#12387;&#12383;&#12392;&#12365;&#12399;&#12289; <span class="emphasis"><em>&#29305;&#12395;&#20309;&#12418;&#36215;&#12371;&#12426;&#12414;&#12379;&#12435;</em></span> &#12290; &#12424;&#12387;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#12289;&#26126;&#31034;&#30340;&#12395;&#21066;&#38500;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12383;&#12384;&#12375;&#12289; <code class="literal">cascade="delete-orphan"</code> &#12398;&#22580;&#21512;&#12434;&#38500;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#22580;&#21512;&#12289;&#12300;&#35242;&#12398;&#12394;&#12356;&#12301;&#23376;&#12399;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290; 
                  </p>
               </li>
            </ul>
         </div>
         <p>&#26368;&#24460;&#12395;&#12289;&#25805;&#20316;&#12398;&#12459;&#12473;&#12465;&#12540;&#12489;&#12364;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12464;&#12521;&#12501;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289; <span class="emphasis"><em>&#12467;&#12540;&#12523;&#12375;&#12383;&#26178;</em></span> &#12354;&#12427;&#12356;&#12399;&#12289; <span class="emphasis"><em>flush&#12375;&#12383;&#26178;</em></span> &#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12377;&#12409;&#12390;&#12398;&#25805;&#20316;&#12399;&#12289;&#12381;&#12398;&#25805;&#20316;&#12364;&#23455;&#34892;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289;&#21040;&#36948;&#21487;&#33021;&#12394;&#38306;&#36899;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395;&#23550;&#12375;&#12390; &#12459;&#12473;&#12465;&#12540;&#12489;&#12364;&#21487;&#33021;&#12394;&#12425;&#12459;&#12473;&#12465;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289; <code class="literal">save-upate</code> &#12392; <code class="literal">delete-orphan</code> &#12399;&#12289; <code class="literal">Session</code> &#12364;flush&#12375;&#12390;&#12356;&#12427;&#38291;&#12395;&#12289; &#12377;&#12409;&#12390;&#12398;&#21040;&#36948;&#21487;&#33021;&#12394;&#38306;&#36899;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395;&#20253;&#25773;&#12375;&#12414;&#12377;&#12290; 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-flushing.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="objectstate.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-metadata.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.10. &#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#12501;&#12521;&#12483;&#12471;&#12517;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;10.12. &#12513;&#12479;&#12487;&#12540;&#12479;&#12398;&#20351;&#29992;</td>
            </tr>
         </table>
      </div>
   </body>
</html>