<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>10.6. &#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20462;&#27491;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="objectstate.html" title="&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;">
      <link rel="prev" href="objectstate-modifying.html" title="10.5. &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20462;&#27491;">
      <link rel="next" href="objectstate-saveorupdate.html" title="10.7. &#33258;&#21205;&#30340;&#12394;&#29366;&#24907;&#26908;&#20986;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">10.6. &#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20462;&#27491;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-modifying.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-saveorupdate.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="objectstate-detached"></a>10.6. &#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20462;&#27491;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#22810;&#12367;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#27425;&#12398;&#12371;&#12392;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12381;&#12428;&#12399;&#12289;&#12354;&#12427;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#24489;&#20803;&#12375;&#12289;&#25805;&#20316;&#12377;&#12427;&#12383;&#12417;&#12395;&#12381;&#12428;&#12434;UI&#23652;&#12395;&#36865;&#12426;&#12289; &#12381;&#12398;&#24460;&#12395;&#12289;&#26032;&#12375;&#12356;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#22793;&#26356;&#12434;&#12475;&#12540;&#12502;&#12377;&#12427;&#12392;&#12356;&#12387;&#12383;&#12371;&#12392;&#12391;&#12377;&#12290; &#20006;&#34892;&#24615;&#12398;&#39640;&#12356;&#29872;&#22659;&#12391;&#12289;&#12371;&#12398;&#12479;&#12452;&#12503;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12434;&#20351;&#12358;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;
            "&#26399;&#38291;&#12398;&#38263;&#12356;" &#20316;&#26989;&#21336;&#20301;&#12398;&#38548;&#38626;&#24615;&#12434;&#20445;&#35388;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#12487;&#12540;&#12479;&#12364;&#36890;&#24120;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290; 
         </p>
         <p>Hibernate&#12399;&#12289; <code class="literal">Session.update()</code> &#12420; <code class="literal">Session.merge()</code> &#12513;&#12477;&#12483;&#12489;&#12434; &#20351;&#12387;&#12390;&#12289;&#20998;&#38626;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20877;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12371;&#12398;&#12514;&#12487;&#12523;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">// in the first session
Cat cat = (Cat) firstSession.load(Cat.class, catId);
Cat potentialMate = new Cat();
firstSession.save(potentialMate);

// in a higher layer of the application
cat.setMate(potentialMate);

// later, in a new session
secondSession.update(cat);  // update cat
secondSession.update(mate); // update mate</pre><p>&#35672;&#21029;&#23376;<code class="literal">catId</code> &#12434;&#25345;&#12388; <code class="literal">Cat</code> &#12364;&#12289;&#26082;&#12395; <code class="literal">secondSession</code> &#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12383;&#22580;&#21512;&#12399;&#12289;&#20877;&#36861;&#21152;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#20363;&#22806;&#12364;&#25237;&#12370;&#12425;&#12428;&#12414;&#12377;&#12290; 
         </p>
         <p>&#21516;&#12376;&#35672;&#21029;&#23376;&#12434;&#25345;&#12388;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#26082;&#12395;&#20445;&#25345;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434; &#30906;&#20449;&#12391;&#12365;&#12427;&#12394;&#12425; <code class="literal">update()</code> &#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290; &#12381;&#12375;&#12390;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#29366;&#24907;&#12434;&#32771;&#12360;&#12378;&#12395;&#12289;&#12393;&#12435;&#12394;&#22580;&#21512;&#12391;&#12418;&#22793;&#26356;&#12434;&#12510;&#12540;&#12472;&#12375;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289; <code class="literal">merge()</code> &#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290; &#12377;&#12394;&#12431;&#12385;&#12289;&#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20877;&#36861;&#21152;&#25805;&#20316;&#12364;&#12289;&#26368;&#21021;&#12395;&#23455;&#34892;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#30906;&#23455;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; &#36890;&#24120;&#12399; <code class="literal">update()</code> &#12364;&#26032;&#12375;&#12356;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#12394;&#12363;&#12391;&#26368;&#21021;&#12395;&#21628;&#12400;&#12428;&#12427;&#12513;&#12477;&#12483;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; 
         </p>
         <p>&#20998;&#38626;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#21040;&#36948;&#21487;&#33021;&#12394;&#12289;&#20998;&#38626;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#20491;&#21029;&#12395; <code class="literal">update()</code> &#12377;&#12409;&#12365;&#12391;&#12377;&#12290;&#12381;&#12428;&#12399;&#12289;&#12381;&#12398;&#29366;&#24907;&#12434;&#26356;&#26032;&#12375;&#12383;&#12356;&#22580;&#21512;&#12395; <span class="emphasis"><em>&#38480;&#12426;</em></span> &#12414;&#12377;&#12290; <span class="emphasis"><em>&#36983;&#31227;&#30340;&#12394;&#27704;&#32154;&#21270;</em></span> &#12434;&#20351;&#12360;&#12400;&#12289;&#12418;&#12385;&#12429;&#12435;&#33258;&#21205;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290; <a href="objectstate-transitive.html" title="10.11. &#36899;&#37782;&#30340;&#12394;&#27704;&#32154;&#21270;">&#38917;10.11. &#12300;&#36899;&#37782;&#30340;&#12394;&#27704;&#32154;&#21270;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
         </p>
         <p>&#12513;&#12477;&#12483;&#12489;&#12391;&#12418;&#12414;&#12383;&#12289;&#26032;&#12375;&#12356;&#12475;&#12483;&#12471;&#12519;&#12531;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20877;&#38306;&#36899;&#20184;&#12369;&#12391;&#12365;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;&#20998;&#38626;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#28961;&#20462;&#27491;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; </p><pre class="programlisting">//just reassociate:
sess.lock(fritz, LockMode.NONE);
//do a version check, then reassociate:
sess.lock(izi, LockMode.READ);
//do a version check, using SELECT ... FOR UPDATE, then reassociate:
sess.lock(pk, LockMode.UPGRADE);</pre><p><code class="literal">lock()</code> &#12399;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394; <code class="literal">LockMode</code> &#12392;&#12392;&#12418;&#12395;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#35443;&#32048;&#12399;&#12289;API&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12392;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#20966;&#29702;&#12398;&#31456;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#20877;&#36861;&#21152;&#12398;&#12392;&#12365;&#12395;&#12384;&#12369;&#12289; <code class="literal">lock()</code> &#12364;&#20351;&#12431;&#12428;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; 
         </p>
         <p>&#26399;&#38291;&#12398;&#38263;&#12356;&#20316;&#26989;&#21336;&#20301;&#12398;&#12289;&#12381;&#12398;&#20182;&#12398;&#12514;&#12487;&#12523;&#12399;&#12289;??? &#12391;&#36848;&#12409;&#12390;&#12356;&#12414;&#12377;&#12290; </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-modifying.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="objectstate.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-saveorupdate.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.5. &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20462;&#27491;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;10.7. &#33258;&#21205;&#30340;&#12394;&#29366;&#24907;&#26908;&#20986;</td>
            </tr>
         </table>
      </div>
   </body>
</html>