<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>10.7. &#33258;&#21205;&#30340;&#12394;&#29366;&#24907;&#26908;&#20986;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="objectstate.html" title="&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;">
      <link rel="prev" href="objectstate-detached.html" title="10.6. &#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20462;&#27491;">
      <link rel="next" href="objectstate-deleting.html" title="10.8. &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21066;&#38500;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">10.7. &#33258;&#21205;&#30340;&#12394;&#29366;&#24907;&#26908;&#20986;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-detached.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;10&#31456; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#25201;&#12358;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-deleting.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="objectstate-saveorupdate"></a>10.7. &#33258;&#21205;&#30340;&#12394;&#29366;&#24907;&#26908;&#20986;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate&#12398;&#12518;&#12540;&#12470;&#12399;&#27425;&#12398;2&#12388;&#12398;&#12465;&#12540;&#12473;&#12398;&#12393;&#12385;&#12425;&#12395;&#12418;&#20351;&#12360;&#12427;&#27726;&#29992;&#30340;&#12394;&#12513;&#12477;&#12483;&#12489;&#12434;&#35201;&#27714;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290; &#12381;&#12428;&#12399;&#12289;&#26032;&#12375;&#12356;&#35672;&#21029;&#23376;&#12434;&#29983;&#25104;&#12375;&#12390;&#19968;&#26178;&#30340;&#12394;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12475;&#12540;&#12502;&#12377;&#12427;&#12371;&#12392;&#12392;&#12289; &#12381;&#12398;&#26178;&#28857;&#12398;&#35672;&#21029;&#23376;&#12392;&#38306;&#36899;&#12389;&#12356;&#12390;&#12356;&#12427;&#20998;&#38626;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#26356;&#26032;/&#20877;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12398;&#12391;&#12365;&#12427;&#12513;&#12477;&#12483;&#12489;&#12391;&#12377;&#12290;
            <code class="literal">saveOrUpdate()</code> &#12399;&#12371;&#12398;&#12424;&#12358;&#12394;&#27231;&#33021;&#12434;&#23455;&#29694;&#12375;&#12383;&#12513;&#12477;&#12483;&#12489;&#12391;&#12377;&#12290; 
         </p><pre class="programlisting">// in the first session
Cat cat = (Cat) firstSession.load(Cat.class, catID);

// in a higher tier of the application
Cat mate = new Cat();
cat.setMate(mate);

// later, in a new session
secondSession.saveOrUpdate(cat);   // update existing state (cat has a non-null id)
secondSession.saveOrUpdate(mate);  // save the new instance (mate has a null id)</pre><p><code class="literal">saveOrUpdate()</code> &#12398;&#20351;&#29992;&#26041;&#27861;&#12392;&#24847;&#21619;&#12399;&#12289; &#26032;&#12375;&#12356;&#12518;&#12540;&#12470;&#12395;&#12392;&#12387;&#12390;&#28151;&#20081;&#12434;&#25307;&#12367;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290; &#12414;&#12378;&#31532;&#19968;&#12395;&#12289;&#12354;&#12427;&#12475;&#12483;&#12471;&#12519;&#12531;&#12391;&#20351;&#29992;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21029;&#12398;&#26032;&#12375;&#12356;&#12475;&#12483;&#12471;&#12519;&#12531;&#12391;&#20351;&#12362;&#12358;&#12392;&#12375;&#12394;&#12356;&#38480;&#12426;&#12289; <code class="literal">update()</code> &#12420; <code class="literal">saveOrUpdate()</code> &#12420; <code class="literal">merge()</code> &#12434;&#20351;&#12358;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20840;&#20307;&#12434;&#36890;&#12376;&#12390;&#12289;&#12371;&#12428;&#12425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20840;&#12367;&#20351;&#12431;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290; 
         </p>
         <p>&#36890;&#24120;&#12289; <code class="literal">update()</code> &#12420; <code class="literal">saveOrUpdate()</code> &#12399;&#27425;&#12398;&#12471;&#12490;&#12522;&#12458;&#12391; &#20351;&#12431;&#12428;&#12414;&#12377;&#12290; 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#26368;&#21021;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;UI&#23652;&#12395;&#36865;&#12425;&#12428;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#22793;&#26356;&#12364;&#21152;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12499;&#12472;&#12493;&#12473;&#12525;&#12472;&#12483;&#12463;&#23652;&#12395;&#36865;&#12425;&#12428;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;2&#30058;&#30446;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12391; <code class="literal">update()</code> &#12434;&#21628;&#12406;&#12371;&#12392;&#12391;&#12289;&#12371;&#12428;&#12425;&#12398;&#22793;&#26356;&#12434;&#27704;&#32154;&#21270;&#12375;&#12414;&#12377;&#12290; 
                  </p>
               </li>
            </ul>
         </div>
         <p><code class="literal">saveOrUpdate()</code> &#12399;&#20197;&#19979;&#12398;&#12371;&#12392;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290; 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12371;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12391;&#12289;&#12377;&#12391;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;&#20309;&#12418;&#12375;&#12414;&#12379;&#12435;&#12290; </p>
               </li>
               <li>
                  <p>&#12381;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12395;&#38306;&#36899;&#12389;&#12356;&#12390;&#12356;&#12427;&#21029;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21516;&#12376;&#35672;&#21029;&#23376;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12394;&#12425;&#12289; &#20363;&#22806;&#12434;&#25237;&#12370;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12364;&#20516;&#12434;&#25345;&#12383;&#12394;&#12356;&#12394;&#12425;&#12400;&#12289; <code class="literal">save()</code> &#12375;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12364;&#20516;&#12434;&#25345;&#12385;&#12289;&#12381;&#12398;&#20516;&#12364;&#26032;&#12383;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12383;&#12417;&#12398;&#20516;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289; &#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; <code class="literal">save()</code> &#12375;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#65288; <code class="literal">&lt;version&gt;</code> &#12420; <code class="literal">&lt;timestamp&gt;</code> &#12395;&#12424;&#12387;&#12390;&#65289; &#12496;&#12540;&#12472;&#12519;&#12531;&#12389;&#12369;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#20516;&#12434;&#25345;&#12385;&#12289; &#12381;&#12398;&#20516;&#12364;&#26032;&#12375;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12383;&#12417;&#12398;&#20516;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289; &#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; <code class="literal">save()</code> &#12375;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p>&#12381;&#12358;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; <code class="literal">update()</code> &#12375;&#12414;&#12377;&#12290; 
                  </p>
               </li>
            </ul>
         </div>
         <p>&#12381;&#12375;&#12390;&#12289; <code class="literal">merge()</code> &#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12392;&#12390;&#12418;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290; 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>&#21516;&#12376;&#35672;&#21029;&#23376;&#12434;&#25345;&#12388;&#27704;&#32154;&#21270;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12381;&#12398;&#26178;&#28857;&#12391;&#12475;&#12483;&#12471;&#12519;&#12531;&#12392;&#38306;&#36899;&#20184;&#12356;&#12390;&#12356;&#12427;&#12394;&#12425;&#12400;&#12289; &#24341;&#25968;&#12391;&#21463;&#12369;&#21462;&#12387;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12434;&#27704;&#32154;&#21270;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>&#27704;&#32154;&#21270;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12381;&#12398;&#26178;&#28857;&#12391;&#12475;&#12483;&#12471;&#12519;&#12531;&#12395;&#38306;&#36899;&#20184;&#12356;&#12390;&#12356;&#12394;&#12356;&#12394;&#12425;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#12381;&#12428;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;&#12289;&#26032;&#12375;&#12356;&#27704;&#32154;&#21270;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>&#27704;&#32154;&#21270;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>&#24341;&#25968;&#12392;&#12375;&#12390;&#19982;&#12360;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12475;&#12483;&#12471;&#12519;&#12531;&#12392;&#38306;&#36899;&#12434;&#25345;&#12385;&#12414;&#12379;&#12435;&#12290; &#12381;&#12428;&#12399;&#12289;&#20998;&#38626;&#29366;&#24907;&#12398;&#12414;&#12414;&#12391;&#12377;&#12290; </p>
               </li>
            </ul>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-detached.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="objectstate.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-deleting.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.6. &#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20462;&#27491;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;10.8. &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21066;&#38500;</td>
            </tr>
         </table>
      </div>
   </body>
</html>