<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>19.4. &#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="performance.html" title="&#31532;19&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;">
      <link rel="prev" href="performance-sessioncache.html" title="19.3. &#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#31649;&#29702;">
      <link rel="next" href="performance-collections.html" title="19.5. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#29702;&#35299;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">19.4. &#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="performance-sessioncache.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;19&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="performance-collections.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="performance-querycache"></a>19.4. &#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#12463;&#12456;&#12522;&#12398;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12418;&#12461;&#12515;&#12483;&#12471;&#12517;&#20986;&#26469;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#21516;&#12376;&#12497;&#12521;&#12513;&#12540;&#12479;&#12391;&#20309;&#24230;&#12418;&#23455;&#34892;&#12373;&#12428;&#12427; &#12463;&#12456;&#12522;&#12395;&#23550;&#12375;&#12390;&#12398;&#12415;&#26377;&#29992;&#12391;&#12377;&#12290;&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20351;&#12358;&#12395;&#12399;&#12289;&#12414;&#12378;&#35373;&#23450;&#12391;&#26377;&#21177;&#12395;&#12375;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; </p><pre class="programlisting">hibernate.cache.use_query_cache true</pre><p>&#12371;&#12398;&#35373;&#23450;&#12399;&#26032;&#12383;&#12395;&#20108;&#12388;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#38936;&#22495;&#12398;&#20316;&#25104;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;&#19968;&#12388;&#12399;&#12463;&#12456;&#12522;&#12398;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12398; &#12461;&#12515;&#12483;&#12471;&#12517;&#65288; <code class="literal">org.hibernate.cache.StandardQueryCache</code> &#65289;&#12434;&#20445;&#25345;&#12375;&#12289; &#12418;&#12358;1&#12388;&#12399;&#12463;&#12456;&#12522;&#21487;&#33021;&#12394;&#12486;&#12540;&#12502;&#12523;&#12408;&#12398;&#26368;&#26032;&#12398;&#26356;&#26032;&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503; &#65288; <code class="literal">org.hibernate.cache.UpdateTimestampsCache</code> &#65289;&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290; &#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12398;&#23455;&#38555;&#12398;&#35201;&#32032;&#12398;&#29366;&#24907;&#12399;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12394;&#12356;&#12371;&#12392;&#12395; &#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12461;&#12515;&#12483;&#12471;&#12517;&#12377;&#12427;&#12398;&#12399;&#35672;&#21029;&#23376;&#12398;&#20516;&#12392;&#12289;&#20516;&#22411;&#12398;&#32080;&#26524;&#12398;&#12415;&#12391;&#12377;&#12290; &#12381;&#12398;&#12383;&#12417;&#12289;&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399;&#24120;&#12395;&#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12392;&#19968;&#32210;&#12395;&#20351;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290; 
         </p>
         <p>&#12411;&#12392;&#12435;&#12393;&#12398;&#12463;&#12456;&#12522;&#12399;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#24681;&#24693;&#12434;&#21463;&#12369;&#12394;&#12356;&#12398;&#12391;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12463;&#12456;&#12522;&#12399;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289; <code class="literal">Query.setCacheable(true)</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12381;&#12358;&#12377;&#12428;&#12400;&#12463;&#12456;&#12522;&#12364;&#26082;&#23384;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#32080;&#26524;&#12434;&#25506;&#12375;&#12289;&#12463;&#12456;&#12522;&#23455;&#34892;&#26178;&#12395;&#12381;&#12398;&#32080;&#26524;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#36861;&#21152;&#12377;&#12427; &#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; 
         </p>
         <p>&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#30772;&#26820;&#12509;&#12522;&#12471;&#12540;&#12434;&#32048;&#12363;&#12367;&#21046;&#24481;&#12375;&#12383;&#12356;&#12392;&#12365;&#12399;&#12289; <code class="literal">Query.setCacheRegion()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#29305;&#23450;&#12398;&#12463;&#12456;&#12522;&#12395;&#23550;&#12377;&#12427;&#12461;&#12515;&#12483;&#12471;&#12517;&#38936;&#22495;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">List blogs = sess.createQuery("from Blog blog where blog.blogger = :blogger")
    .setEntity("blogger", blogger)
    .setMaxResults(15)
    .setCacheable(true)
    .setCacheRegion("frontpages")
    .list();</pre><p>&#12463;&#12456;&#12522;&#12364;&#33258;&#36523;&#12398;&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#38936;&#22495;&#12398;&#12522;&#12501;&#12524;&#12483;&#12471;&#12517;&#12434;&#24375;&#21046;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12394;&#12425;&#12289; <code class="literal">Query.setCacheMode(CacheMode.REFRESH)</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399; &#20803;&#12392;&#12394;&#12427;&#12487;&#12540;&#12479;&#12364;&#21029;&#12398;&#12503;&#12525;&#12475;&#12473;&#12395;&#12424;&#12387;&#12390;&#26356;&#26032;&#12373;&#12428;&#12383;&#12426;&#65288;&#12377;&#12394;&#12431;&#12385;Hibernate&#12434;&#36890;&#12376;&#12390;&#26356;&#26032;&#12373;&#12428;&#12394;&#12356;&#65289;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#29305;&#23450;&#12398;&#12463;&#12456;&#12522;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12434;&#36984;&#25246;&#12375;&#12390;&#12522;&#12501;&#12524;&#12483;&#12471;&#12517;&#12373;&#12379;&#12427;&#22580;&#21512;&#12395;&#29305;&#12395;&#26377;&#29992;&#12391;&#12377;&#12290; &#12373;&#12425;&#12395;&#26377;&#29992;&#12394;&#12418;&#12358;&#19968;&#12388;&#12398;&#26041;&#27861;&#12399;&#12289;
            <code class="literal">SessionFactory.evictQueries()</code> &#12395;&#12424;&#12387;&#12390;&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#38936;&#22495;&#12434;&#28040;&#21435;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290; 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="performance-sessioncache.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="performance.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="performance-collections.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">19.3. &#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#31649;&#29702;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;19.5. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#29702;&#35299;</td>
            </tr>
         </table>
      </div>
   </body>
</html>