<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>19.5. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#29702;&#35299;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="performance.html" title="&#31532;19&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;">
      <link rel="prev" href="performance-querycache.html" title="19.4. &#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;">
      <link rel="next" href="performance-monitoring.html" title="19.6. &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">19.5. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#29702;&#35299;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="performance-querycache.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;19&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="performance-monitoring.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="performance-collections"></a>19.5. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#29702;&#35299;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35441;&#38988;&#12395;&#12399;&#12377;&#12391;&#12395;&#22810;&#12367;&#12398;&#26178;&#38291;&#12434;&#20351;&#12356;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#31680;&#12391;&#12399; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#23455;&#34892;&#26178;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#25391;&#33310;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#12398;&#35441;&#38988;&#12434;2&#12289;3&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290; </p>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="performance-collections-taxonomy"></a>19.5.1. &#20998;&#39006;
                     </h3>
                  </div>
               </div>
            </div>
            <p>Hibernate&#12399;3&#12388;&#12398;&#22522;&#26412;&#30340;&#12394;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#31278;&#39006;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;</p>
                  </li>
                  <li>
                     <p>&#19968;&#23550;&#22810;&#38306;&#36899;</p>
                  </li>
                  <li>
                     <p>&#22810;&#23550;&#22810;&#38306;&#36899;</p>
                  </li>
               </ul>
            </div>
            <p>&#12371;&#12398;&#20998;&#39006;&#12399;&#12373;&#12414;&#12374;&#12414;&#12394;&#12486;&#12540;&#12502;&#12523;&#12420;&#22806;&#37096;&#12461;&#12540;&#38306;&#36899;&#12434;&#21306;&#21029;&#12375;&#12414;&#12377;&#12364;&#12289;&#31169;&#12383;&#12385;&#12364;&#30693;&#12427;&#24517;&#35201;&#12398;&#12354;&#12427; &#38306;&#36899;&#12514;&#12487;&#12523;&#12395;&#12388;&#12356;&#12390;&#12411;&#12392;&#12435;&#12393;&#12394;&#12395;&#12418;&#25945;&#12360;&#12390;&#12367;&#12428;&#12414;&#12379;&#12435;&#12290;&#38306;&#36899;&#27083;&#36896;&#12420;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#29305;&#24500;&#12434; &#23436;&#20840;&#12395;&#29702;&#35299;&#12377;&#12427;&#12395;&#12399;&#12289;Hibernate&#12364;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#34892;&#12434;&#26356;&#26032;&#12289;&#21066;&#38500;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12358;&#20027;&#12461;&#12540;&#12398;
               &#27083;&#36896;&#12418;&#12414;&#12383;&#32771;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#20197;&#19979;&#12398;&#20998;&#39006;&#12434;&#25552;&#31034;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20184;&#12365;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;</p>
                  </li>
                  <li>
                     <p>set</p>
                  </li>
                  <li>
                     <p>bag</p>
                  </li>
               </ul>
            </div>
            <p>&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20184;&#12365;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65288;map&#12289;list&#12289;&#37197;&#21015;&#65289;&#12399; <code class="literal">&lt;key&gt;</code> &#12392; <code class="literal">&lt;index&gt;</code> &#12459;&#12521;&#12512;&#12363;&#12425;&#12394;&#12427;&#20027;&#12461;&#12540;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12399; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#26356;&#26032;&#12399;&#38750;&#24120;&#12395;&#21177;&#29575;&#30340;&#12391;&#12377;&#12290;&#20027;&#12461;&#12540;&#12399;&#26377;&#29992;&#12394;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12395;&#12394;&#12426;&#12289;Hibernate&#12364; &#29305;&#23450;&#12398;&#34892;&#12434;&#26356;&#26032;&#12414;&#12383;&#12399;&#21066;&#38500;&#12377;&#12427;&#12392;&#12365;&#12395;&#12289;&#12381;&#12398;&#34892;&#12434;&#21177;&#29575;&#30340;&#12395;&#35211;&#12388;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
            <p>Sets have a primary key consisting of <code class="literal">&lt;key&gt;</code> and element columns. This may be less efficient for some types of collection element, particularly composite elements or
               large text or binary fields; the database may not be able to index a complex primary key as efficiently. On the other hand,
               for one to many or many to many associations, particularly in the case of synthetic identifiers, it is likely to be just as
               efficient. (Side-note: if you want <code class="literal">SchemaExport</code> to actually create the primary key of a <code class="literal">&lt;set&gt;</code> for you, you must declare all columns as <code class="literal">not-null="true"</code>.) 
            </p>
            <p><code class="literal">&lt;idbag&gt;</code> &#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#20195;&#29702;&#12461;&#12540;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417; &#26356;&#26032;&#12399;&#24120;&#12395;&#38750;&#24120;&#12395;&#21177;&#29575;&#30340;&#12391;&#12377;&#12290;&#20107;&#23455;&#19978;&#12289;&#12371;&#12428;&#12399;&#26368;&#21892;&#12398;&#12465;&#12540;&#12473;&#12391;&#12377;&#12290; 
            </p>
            <p>bag&#12399;&#26368;&#24746;&#12398;&#12465;&#12540;&#12473;&#12391;&#12377;&#12290;bag&#12399;&#35201;&#32032;&#12398;&#20516;&#12398;&#37325;&#35079;&#12364;&#21487;&#33021;&#12391;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12459;&#12521;&#12512;&#12434;&#25345;&#12383;&#12394;&#12356;&#12383;&#12417;&#12289; &#20027;&#12461;&#12540;&#12399;&#23450;&#32681;&#12373;&#12428;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;Hibernate&#12395;&#12399;&#37325;&#35079;&#12375;&#12383;&#34892;&#12434;&#21306;&#21029;&#12377;&#12427;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; Hibernate&#12399;&#12371;&#12398;&#21839;&#38988;&#12398;&#35299;&#27770;&#12398;&#12383;&#12417;&#12395;&#12289;&#22793;&#26356;&#12364;&#12354;&#12387;&#12383;&#12392;&#12365;&#12395;&#12399;&#24120;&#12395;&#23436;&#20840;&#12394;&#21066;&#38500;
               &#65288;&#19968;&#12388;&#12398; <code class="literal">DELETE</code> &#12395;&#12424;&#12427;&#65289;&#12434;&#34892;&#12356;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#20877;&#20316;&#25104;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#38750;&#24120;&#12395;&#38750;&#21177;&#29575;&#30340;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290; 
            </p>
            <p>1&#23550;&#22810;&#38306;&#36899;&#12391;&#12399;&#12289;&#12300;&#20027;&#12461;&#12540;&#12301;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12486;&#12540;&#12502;&#12523;&#12398;&#29289;&#29702;&#30340;&#12394; &#20027;&#12461;&#12540;&#12391;&#12399;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12375;&#12363;&#12375;&#12371;&#12398;&#22580;&#21512;&#12391;&#12373;&#12360;&#12289;&#19978;&#35352;&#12398;&#20998;&#39006;&#12399;&#12414;&#12384;&#26377;&#29992;&#12391;&#12377;&#12290; &#65288;Hibernate&#12364;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#20491;&#12293;&#12398;&#34892;&#12434;&#12393;&#12358;&#12420;&#12387;&#12390;&#12300;&#35211;&#12388;&#12369;&#12427;&#12363;&#12301;&#12434;&#34920;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#65289;
               
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="performance-collections-mostefficientupdate"></a>19.5.2. &#26356;&#26032;&#12395;&#12418;&#12387;&#12392;&#12418;&#21177;&#29575;&#30340;&#12394;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531; list&#12289;map&#12289;idbag&#12289;set
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#19978;&#12391;&#12398;&#35696;&#35542;&#12363;&#12425;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20184;&#12365;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#65288;&#26222;&#36890;&#12398;&#65289;set&#12399;&#35201;&#32032;&#12398;&#36861;&#21152;&#12289;&#21066;&#38500;&#12289; &#26356;&#26032;&#12391;&#12418;&#12387;&#12392;&#12418;&#21177;&#29575;&#30340;&#12394;&#25805;&#20316;&#12364;&#20986;&#26469;&#12427;&#12371;&#12392;&#12399;&#26126;&#12425;&#12363;&#12391;&#12377;&#12290; </p>
            <p>&#12411;&#12412;&#38291;&#36949;&#12356;&#12394;&#12367;&#12289;&#22810;&#23550;&#22810;&#38306;&#36899;&#12420;&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12362;&#12356;&#12390;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20184;&#12365;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364; set&#12424;&#12426;&#12418;&#20778;&#12428;&#12390;&#12356;&#12427;&#28857;&#12364;&#19968;&#12388;&#20197;&#19978;&#12354;&#12426;&#12414;&#12377;&#12290; <code class="literal">Set</code> &#12399;&#12381;&#12398; &#27083;&#36896;&#12398;&#12383;&#12417;&#12395;&#12289;Hibernate&#12399;&#35201;&#32032;&#12364;&#12300;&#22793;&#26356;&#12301;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#34892;&#12434;&#27770;&#12375;&#12390; <code class="literal">UPDATE</code> &#12375;&#12414;&#12379;&#12435;&#12290; <code class="literal">Set</code> &#12408;&#12398;&#22793;&#26356;&#12399;&#24120;&#12395;&#65288;&#20491;&#12293;&#12398;&#34892;&#12398;&#65289;<code class="literal">INSERT</code> &#12392; <code class="literal">DELETE</code> &#12395;&#12424;&#12387;&#12390;&#34892;&#12356;&#12414;&#12377;&#12290;&#32368;&#12426;&#36820;&#12375;&#12414;&#12377;&#12364;&#12289;&#12371;&#12428;&#12399;&#19968;&#23550;&#22810;&#38306;&#36899;&#12395;&#12399; &#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12379;&#12435;&#12290; 
            </p>
            <p>&#37197;&#21015;&#12399;&#36933;&#24310;&#20966;&#29702;&#12364;&#12391;&#12365;&#12394;&#12356;&#12392;&#12356;&#12358;&#27770;&#12414;&#12426;&#12394;&#12398;&#12391;&#12289;&#32080;&#35542;&#12392;&#12375;&#12390;&#12289;list&#12289;map&#12289;idbag&#12364;&#12418;&#12387;&#12392;&#12418; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#33391;&#12356;&#65288;inverse&#12391;&#12399;&#12394;&#12356;&#65289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12479;&#12452;&#12503;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;set&#12418; &#12381;&#12428;&#12411;&#12393;&#36949;&#12356;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;Hibernate&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;set&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12418;&#12387;&#12392;&#12418;
               &#20849;&#36890;&#12398;&#31278;&#39006;&#12392;&#12375;&#12390;&#26399;&#24453;&#12373;&#12428;&#12414;&#12377;&#12290;set&#12398;&#34920;&#29694;&#12399;&#38306;&#36899;&#12514;&#12487;&#12523;&#12391;&#12399;&#12418;&#12387;&#12392;&#12418;&#33258;&#28982;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290; 
            </p>
            <p>&#12375;&#12363;&#12375;&#12289;&#12424;&#12367;&#12487;&#12470;&#12452;&#12531;&#12373;&#12428;&#12383;Hibernate&#12398;&#12489;&#12513;&#12452;&#12531;&#12514;&#12487;&#12523;&#12391;&#12399;&#12289;&#36890;&#24120;&#12418;&#12387;&#12392;&#12418;&#22810;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399; &#20107;&#23455;&#19978; <code class="literal">inverse="true"</code> &#12434;&#25351;&#23450;&#12375;&#12383;1&#23550;&#22810;&#38306;&#36899;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#38306;&#36899;&#12391;&#12399;&#12289; &#26356;&#26032;&#12399;&#22810;&#23550;&#19968;&#12398;&#38306;&#36899;&#31471;&#12391;&#25201;&#12431;&#12428;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#26356;&#26032;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#21839;&#38988;&#12399;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12379;&#12435;&#12290; 
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="performance-collections-mostefficentinverse"></a>19.5.3. inverse&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12418;&#12387;&#12392;&#12418;&#26368;&#36969;&#12394;bag&#12392;list
                     </h3>
                  </div>
               </div>
            </div>
            <p>bag&#12434;&#35211;&#25918;&#12375;&#12390;&#12375;&#12414;&#12358;&#21069;&#12395;&#12289;bag&#65288;&#12381;&#12375;&#12390;list&#12418;&#65289;&#12364;set&#12424;&#12426;&#12418;&#12378;&#12387;&#12392;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#33391;&#12356;&#29305;&#21029;&#12394;&#12465;&#12540;&#12473;&#12434; &#32057;&#20171;&#12375;&#12414;&#12377;&#12290; <code class="literal">inverse="true"</code> &#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65288;&#19968;&#33324;&#30340;&#12394;1&#23550;&#22810;&#38306;&#36899;&#12398;&#20351;&#12356;&#26041;&#12394;&#12393;&#65289;&#12391;&#12289; bag&#12398;&#35201;&#32032;&#12434;&#21021;&#26399;&#21270;&#65288;&#12501;&#12455;&#12483;&#12481;&#65289;&#12377;&#12427;&#24517;&#35201;&#12394;&#12367;bag&#12420;list&#12395;&#35201;&#32032;&#12434;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#65281; &#12371;&#12428;&#12399; <code class="literal">Collection.add()</code> &#12420; <code class="literal">Collection.addAll()</code> &#12399;bag&#12420; <code class="literal">List</code> &#12391;&#12399;&#24120;&#12395;true&#12434;&#36820;&#12373;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377; &#65288; <code class="literal">Set</code> &#12392;&#12399;&#30064;&#12394;&#12426;&#12414;&#12377;&#65289;&#12290; &#12371;&#12428;&#12399;&#20197;&#19979;&#12398;&#20849;&#36890;&#20966;&#29702;&#12434;&#12424;&#12426;&#36895;&#12367;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">Parent p = (Parent) sess.load(Parent.class, id);
Child c = new Child();
c.setParent(p);
p.getChildren().add(c);  //no need to fetch the collection!
sess.flush();</pre></div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="performance-collections-oneshotdelete"></a>19.5.4. &#19968;&#25324;&#21066;&#38500;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#26178;&#12293;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;&#12434;&#19968;&#12388;&#19968;&#12388;&#21066;&#38500;&#12377;&#12427;&#12371;&#12392;&#12399;&#26997;&#12417;&#12390;&#38750;&#21177;&#29575;&#30340;&#12395;&#12394;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; Hibernate&#12399;&#24858;&#12363;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391;&#12289;&#26032;&#12375;&#12356;&#31354;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#22580;&#21512;&#65288; <code class="literal">list.clear()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12383;&#22580;&#21512;&#12394;&#12393;&#65289;&#12391;&#12399;&#12371;&#12428;&#12434;&#12377;&#12409;&#12365;&#12391;&#12394;&#12356;&#12371;&#12392;&#12434;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;Hibernate&#12399; <code class="literal">DELETE</code> &#12434;&#19968;&#22238;&#30330;&#34892;&#12375;&#12390;&#12289;&#12381;&#12428;&#12391;&#12377;&#12409;&#12390;&#32066;&#12431;&#12426;&#12414;&#12377;&#65281; 
            </p>
            <p>&#12469;&#12452;&#12474;20&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#19968;&#12388;&#12398;&#35201;&#32032;&#12434;&#36861;&#21152;&#12375;&#12289;&#12381;&#12428;&#12363;&#12425;&#20108;&#12388;&#12398;&#35201;&#32032;&#12434;&#21066;&#38500;&#12377;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290; Hibernate&#12399;&#19968;&#12388;&#12398; <code class="literal">INSERT</code> &#25991;&#12392;&#20108;&#12388;&#12398; <code class="literal">DELETE</code> &#25991;&#12434;&#30330;&#34892;&#12375;&#12414;&#12377; &#65288;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;bag&#12391;&#12394;&#12369;&#12428;&#12400;&#65289;&#12290;&#12371;&#12428;&#12399;&#30906;&#12363;&#12395;&#26395;&#12414;&#12375;&#12356;&#21205;&#20316;&#12391;&#12377;&#12290; 
            </p>
            <p>&#12375;&#12363;&#12375;&#12289;18&#20491;&#12398;&#35201;&#32032;&#12434;&#21066;&#38500;&#12375;&#12390;2&#12388;&#12434;&#27531;&#12375;&#12289;&#12381;&#12428;&#12363;&#12425;3&#12388;&#26032;&#12375;&#12356;&#35201;&#32032;&#12434;&#36861;&#21152;&#12377;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12392;&#12365;&#20108;&#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>18&#34892;&#12434;&#19968;&#12388;&#19968;&#12388;&#21066;&#38500;&#12375;&#12390;&#12289;3&#34892;&#12434;&#36861;&#21152;&#12377;&#12427;</p>
                  </li>
                  <li>
                     <p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#20840;&#20307;&#12434;&#21066;&#38500;&#65288; <code class="literal">DELETE</code> &#12398;SQL&#12434;&#19968;&#22238;&#65289;&#12375;&#12289;&#12381;&#12375;&#12390;5&#12388;&#12398;&#35201;&#32032;&#12377;&#12409;&#12390;&#12434; &#65288;&#19968;&#12388;&#12378;&#12388;&#65289;&#36861;&#21152;&#12377;&#12427;
                     </p>
                  </li>
               </ul>
            </div>
            <p>Hibernate&#12399;&#12371;&#12398;&#22580;&#21512;&#12395;2&#30058;&#30446;&#12398;&#26041;&#27861;&#12364;&#12424;&#12426;&#36895;&#12356;&#12384;&#12429;&#12358;&#12392;&#12431;&#12363;&#12427;&#12411;&#12393;&#36066;&#12367;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#65288;&#12381;&#12375;&#12390;Hibernate&#12364;&#12371;&#12398;&#12424;&#12358;&#12395;&#36066;&#12356;&#12371;&#12392;&#12418;&#26395;&#12414;&#12375;&#12367;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#25391;&#12427;&#33310;&#12356;&#12399; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12488;&#12522;&#12460;&#12394;&#12393;&#12434;&#28151;&#20081;&#12373;&#12379;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#65289; </p>
            <p>&#24184;&#12356;&#12395;&#12418;&#12289;&#20803;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#25448;&#12390;&#65288;&#12388;&#12414;&#12426;&#21442;&#29031;&#12434;&#12420;&#12417;&#12390;&#65289;&#12289;&#29694;&#22312;&#12398;&#35201;&#32032;&#12434;&#12377;&#12409;&#12390;&#25345;&#12388;&#26032;&#12375;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398; &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36820;&#12377;&#12371;&#12392;&#12391;&#12289;&#12356;&#12388;&#12391;&#12418;&#12371;&#12398;&#25391;&#12427;&#33310;&#12356;&#65288;2&#30058;&#30446;&#12398;&#25126;&#30053;&#65289;&#12434;&#24375;&#21046;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; &#26178;&#12395;&#12371;&#12428;&#12399;&#12392;&#12390;&#12418;&#20415;&#21033;&#12391;&#24375;&#21147;&#12391;&#12377;&#12290; </p>
            <p>&#12418;&#12385;&#12429;&#12435;&#12289;&#19968;&#25324;&#21066;&#38500;&#12399; <code class="literal">inverse="true"</code> &#12434;&#25351;&#23450;&#12375;&#12383;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12399;&#34892;&#12356;&#12414;&#12379;&#12435;&#12290; 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="performance-querycache.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="performance.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="performance-monitoring.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">19.4. &#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;19.6. &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;</td>
            </tr>
         </table>
      </div>
   </body>
</html>