<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;19&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="xml-manipulation.html" title="18.3. XML&#12487;&#12540;&#12479;&#12434;&#25201;&#12358;">
      <link rel="next" href="performance-cache.html" title="19.2. &#31532;2&#12524;&#12505;&#12523;&#12461;&#12515;&#12483;&#12471;&#12517;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;19&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="xml-manipulation.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="performance-cache.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="performance"></a>&#31532;19&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect1" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="performance-fetching"></a>19.1. &#12501;&#12455;&#12483;&#12481;&#25126;&#30053;
                     </h2>
                  </div>
               </div>
            </div>
            <p><span class="emphasis"><em>&#12501;&#12455;&#12483;&#12481;&#25126;&#30053;</em></span> &#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#38306;&#36899;&#12434;&#12490;&#12499;&#12466;&#12540;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427; &#12392;&#12365;&#12395;&#12289;Hibernate&#12364;&#38306;&#36899;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#24489;&#20803;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12377;&#12427;&#25126;&#30053;&#12391;&#12377;&#12290;&#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12399;O/R&#12510;&#12483;&#12500;&#12531;&#12464;&#12398; &#12513;&#12479;&#12487;&#12540;&#12479;&#12395;&#23459;&#35328;&#12377;&#12427;&#12363;&#12289;&#29305;&#23450;&#12398;HQL&#12289; <code class="literal">Criteria</code> &#12463;&#12456;&#12522;&#12391;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>Hibernate3&#12399;&#27425;&#12395;&#31034;&#12377;&#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p><span class="emphasis"><em>&#32080;&#21512;&#12501;&#12455;&#12483;&#12481;</em></span> - Hibernate&#12399; <code class="literal">OUTER JOIN</code> &#12434;&#20351;&#12387;&#12390;&#12289; &#38306;&#36899;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#65297;&#12388;&#12398; <code class="literal">SELECT</code> &#12391;&#24489;&#20803;&#12375;&#12414;&#12377;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#12475;&#12524;&#12463;&#12488;&#12501;&#12455;&#12483;&#12481;</em></span> - 2&#22238;&#30446;&#12398; <code class="literal">SELECT</code> &#12391;&#38306;&#36899;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#24489;&#20803;&#12375;&#12414;&#12377;&#12290; <code class="literal">lazy="false"</code> &#12391;&#26126;&#31034;&#30340;&#12395;&#36933;&#24310;&#12501;&#12455;&#12483;&#12481;&#12434;&#28961;&#21177;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;&#12371;&#12398;2&#22238;&#30446;&#12398;select&#12399;&#23455;&#38555;&#12395; &#38306;&#36899;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12383;&#12392;&#12365;&#12398;&#12415;&#23455;&#34892;&#12373;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#12469;&#12502;&#12475;&#12524;&#12463;&#12488;&#12501;&#12455;&#12483;&#12481;</em></span> - 2&#22238;&#30446;&#12398; <code class="literal">SELECT</code> &#12391;&#12289;&#30452;&#21069;&#12398;&#12463;&#12456;&#12522;&#12420;&#12501;&#12455;&#12483;&#12481;&#12391;&#24489;&#20803;&#12375;&#12383;&#12377;&#12409;&#12390;&#12398;&#35201;&#32032;&#12395;&#38306;&#36899;&#12377;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434; &#24489;&#20803;&#12375;&#12414;&#12377;&#12290; <code class="literal">lazy="false"</code> &#12391;&#26126;&#31034;&#30340;&#12395;&#36933;&#24310;&#12501;&#12455;&#12483;&#12481;&#12434;&#28961;&#21177;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;&#12371;&#12398;2&#22238;&#30446;&#12398;select&#12399;&#23455;&#38555;&#12395; &#38306;&#36899;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12383;&#12392;&#12365;&#12398;&#12415;&#23455;&#34892;&#12373;&#12428;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#12496;&#12483;&#12481;&#12501;&#12455;&#12483;&#12481;</em></span> - &#12475;&#12524;&#12463;&#12488;&#12501;&#12455;&#12483;&#12481;&#12398;&#12383;&#12417;&#12398;&#26368;&#36969;&#21270;&#12373;&#12428;&#12383;&#25126;&#30053; - Hibernate&#12399;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#19968;&#32676;&#12434;1&#22238;&#12398; <code class="literal">SELECT</code> &#12391;&#24489;&#20803;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#20027;&#12461;&#12540;&#12420;&#22806;&#37096;&#12461;&#12540;&#12398;&#12522;&#12473;&#12488;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12395; &#12395;&#12424;&#12426;&#34892;&#12356;&#12414;&#12377;&#12290; 
                     </p>
                  </li>
               </ul>
            </div>
            <p>Hibernate&#12399;&#27425;&#12395;&#31034;&#12377;&#25126;&#30053;&#12392;&#12418;&#21306;&#21029;&#12434;&#12375;&#12414;&#12377;&#12290; </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p><span class="emphasis"><em>&#21363;&#26178;&#12501;&#12455;&#12483;&#12481;</em></span> - &#25152;&#26377;&#32773;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289; &#38306;&#36899;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#21363;&#26178;&#12395;&#12501;&#12455;&#12483;&#12481;&#12373;&#12428;&#12414;&#12377;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#36933;&#24310;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12501;&#12455;&#12483;&#12481;</em></span> - &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395; &#23550;&#12375;&#12390;&#25805;&#20316;&#12434;&#34892;&#12387;&#12383;&#12392;&#12365;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#12501;&#12455;&#12483;&#12481;&#12375;&#12414;&#12377;&#12290; (&#12371;&#12428;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12391;&#12377;) 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>"&#29305;&#21029;&#12394;&#36933;&#24310;"&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12501;&#12455;&#12483;&#12481;</em></span> - &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032; &#65297;&#12388;&#65297;&#12388;&#12364;&#29420;&#31435;&#12375;&#12390;&#12289;&#24517;&#35201;&#12394;&#12392;&#12365;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#21462;&#24471;&#12373;&#12428;&#12414;&#12377;&#12290; Hibernate&#12399;&#24517;&#35201;&#12394;&#12356;&#12394;&#12425;&#12400;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#20840;&#20307;&#12434;&#12513;&#12514;&#12522;&#12395;&#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#12371;&#12392;&#12399; &#36991;&#12369;&#12414;&#12377;&#65288;&#12392;&#12390;&#12418;&#22823;&#12365;&#12394;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36969;&#12375;&#12390;&#12356;&#12414;&#12377;&#65289;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#12503;&#12525;&#12461;&#12471;&#12501;&#12455;&#12483;&#12481;</em></span> - &#21336;&#19968;&#20516;&#38306;&#36899;&#12399;&#12289;&#35672;&#21029;&#23376;&#12398;getter&#20197;&#22806;&#12398; &#12513;&#12477;&#12483;&#12489;&#12364;&#38306;&#36899;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12501;&#12455;&#12483;&#12481;&#12373;&#12428;&#12414;&#12377;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>"&#12503;&#12525;&#12461;&#12471;&#12394;&#12375;"&#12501;&#12455;&#12483;&#12481;</em></span> - &#21336;&#19968;&#20516;&#38306;&#36899;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#12395; &#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12501;&#12455;&#12483;&#12481;&#12373;&#12428;&#12414;&#12377;&#12290;&#12503;&#12525;&#12461;&#12471;&#12501;&#12455;&#12483;&#12481;&#12392;&#27604;&#36611;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#26041;&#27861;&#12399; &#36933;&#24310;&#12398;&#24230;&#21512;&#12356;&#12364;&#23569;&#12394;&#12356;&#65288;&#38306;&#36899;&#12399;&#35672;&#21029;&#23376;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12383;&#12384;&#12369;&#12391;&#12418;&#12501;&#12455;&#12483;&#12481;&#12373;&#12428;&#12414;&#12377;&#65289; &#12391;&#12377;&#12364;&#12289;&#12424;&#12426;&#36879;&#36942;&#30340;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12503;&#12525;&#12461;&#12471;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#35211;&#12379;&#12414;&#12377;&#12290;
                        &#12371;&#12398;&#26041;&#27861;&#12399;&#12499;&#12523;&#12489;&#26178;&#12398;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#32068;&#12415;&#36796;&#12415;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12289;&#20351;&#12358;&#22580;&#38754;&#12399;&#12414;&#12428;&#12391;&#12377;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#36933;&#24310;&#23646;&#24615;&#12501;&#12455;&#12483;&#12481;</em></span> - &#23646;&#24615;&#12420;&#21336;&#19968;&#20516;&#38306;&#36899;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12383; &#12392;&#12365;&#12395;&#12501;&#12455;&#12483;&#12481;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#26041;&#27861;&#12399;&#12499;&#12523;&#12489;&#26178;&#12398;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#32068;&#12415;&#36796;&#12415;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12289; &#20351;&#12358;&#22580;&#38754;&#12399;&#12414;&#12428;&#12391;&#12377;&#12290; 
                     </p>
                  </li>
               </ul>
            </div>
            <p>&#20108;&#12388;&#12398;&#30452;&#34892;&#12377;&#12427;&#27010;&#24565;&#12364;&#12354;&#12426;&#12414;&#12377;: <span class="emphasis"><em>&#12356;&#12388;</em></span> &#38306;&#36899;&#12434;&#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#12363;&#12289; &#12381;&#12375;&#12390;&#12289; <span class="emphasis"><em>&#12393;&#12358;&#12420;&#12387;&#12390;</em></span> &#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#12363;&#65288;&#12393;&#12435;&#12394;SQL&#12434;&#20351;&#12387;&#12390;&#65289;&#12290; &#12371;&#12428;&#12425;&#12434;&#28151;&#21516;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#65281; <code class="literal">fetch</code> &#12399;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12481;&#12517;&#12540;&#12491;&#12531;&#12464;&#12395;&#20351;&#12356;&#12414;&#12377;&#12290; <code class="literal">lazy</code> &#12399;&#12354;&#12427;&#12463;&#12521;&#12473;&#12398;&#20998;&#38626;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12358;&#12385;&#12289;&#12393;&#12398;&#12487;&#12540;&#12479;&#12434;&#24120;&#12395; &#20351;&#29992;&#21487;&#33021;&#12395;&#12377;&#12427;&#12363;&#12398;&#21462;&#12426;&#27770;&#12417;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-lazy"></a>19.1.1. &#36933;&#24310;&#38306;&#36899;&#12398;&#20685;&#12365;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;Hibernate3&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12399;&#36933;&#24310;&#12475;&#12524;&#12463;&#12488;&#12501;&#12455;&#12483;&#12481;&#12434;&#20351;&#12356;&#12289; &#21336;&#19968;&#20516;&#38306;&#36899;&#12395;&#12399;&#36933;&#24310;&#12503;&#12525;&#12461;&#12471;&#12501;&#12455;&#12483;&#12481;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#21205;&#20316;&#12399;&#12411;&#12412;&#12377;&#12409;&#12390;&#12398; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12411;&#12412;&#12377;&#12409;&#12390;&#12398;&#38306;&#36899;&#12391;&#24847;&#21619;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; </p>
               <p><span class="emphasis"><em>&#27880;:</em></span><code class="literal">hibernate.default_batch_fetch_size</code> &#12434;&#12475;&#12483;&#12488;&#12375;&#12383;&#12392;&#12365;&#12399;&#12289;Hibernate&#12399; &#36933;&#24310;&#12501;&#12455;&#12483;&#12481;&#12398;&#12383;&#12417;&#12398;&#12496;&#12483;&#12481;&#12501;&#12455;&#12483;&#12481;&#26368;&#36969;&#21270;&#12434;&#20351;&#12358;&#12391;&#12375;&#12423;&#12358; &#65288;&#12371;&#12398;&#26368;&#36969;&#21270;&#12399;&#12424;&#12426;&#32048;&#12363;&#12356;&#12524;&#12505;&#12523;&#12391;&#26377;&#21177;&#12395;&#12377;&#12427;&#12371;&#12392;&#12418;&#20986;&#26469;&#12414;&#12377;&#65289;&#12290; 
               </p>
               <p>&#12375;&#12363;&#12375;&#12289;&#36933;&#24310;&#12501;&#12455;&#12483;&#12481;&#12399;&#30693;&#12387;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#19968;&#12388;&#12398;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; Hibernate&#12398;session&#12434;&#12458;&#12540;&#12503;&#12531;&#12375;&#12390;&#12356;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#22806;&#12363;&#12425;&#36933;&#24310;&#38306;&#36899;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12392;&#12289; &#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;&#20363;&#65306; </p><pre class="programlisting">s = sessions.openSession();
Transaction tx = s.beginTransaction();
            
User u = (User) s.createQuery("from User u where u.name=:userName")
    .setString("userName", userName).uniqueResult();
Map permissions = u.getPermissions();

tx.commit();
s.close();

Integer accessLevel = (Integer) permissions.get("accounts");  // Error!</pre><p><code class="literal">Session</code> &#12364;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12383;&#12392;&#12365;&#12289;permissions&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399; &#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12383;&#12417;&#12289;&#12371;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#33258;&#36523;&#12398;&#29366;&#24907;&#12434;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; <span class="emphasis"><em>Hibernate&#12399;&#20999;&#12426;&#38626;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#36933;&#24310;&#21021;&#26399;&#21270;&#12399;&#12469;&#12509;&#12540;&#12488; &#12375;&#12390;&#12356;&#12414;&#12379;&#12435;</em></span> &#12290;&#20462;&#27491;&#26041;&#27861;&#12392;&#12375;&#12390;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#35501;&#12415;&#36796;&#12415;&#12434;&#34892;&#12358;&#12467;&#12540;&#12489;&#12434; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#30452;&#21069;&#12395;&#31227;&#21205;&#12373;&#12379;&#12414;&#12377;&#12290; 
               </p>
               <p>&#19968;&#26041;&#12391;&#12289; <code class="literal">lazy="false"</code> &#12434;&#38306;&#36899;&#12510;&#12483;&#12500;&#12531;&#12464;&#12395;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289; &#36933;&#24310;&#20966;&#29702;&#12434;&#12375;&#12394;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#38306;&#36899;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#36933;&#24310;&#21021;&#26399;&#21270;&#12399;&#12411;&#12412;&#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#38306;&#36899;&#12391;&#20351;&#12431;&#12428;&#12427;&#12371;&#12392;&#12434; &#24847;&#22259;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12418;&#12375;&#12354;&#12394;&#12383;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12514;&#12487;&#12523;&#12398;&#20013;&#12395;&#36933;&#24310;&#20966;&#29702;&#12434;&#12375;&#12394;&#12356;&#38306;&#36899;&#12434;
                  &#22810;&#12367;&#23450;&#32681;&#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;Hibernate&#12399;&#26368;&#32066;&#30340;&#12395;&#12399;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#27598;&#12395; &#12411;&#12412;&#23436;&#20840;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#12513;&#12514;&#12522;&#12398;&#20013;&#12395;&#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#65281; 
               </p>
               <p>&#20182;&#26041;&#12391;&#12399;&#12289;&#29305;&#23450;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#12362;&#12356;&#12390;&#12475;&#12524;&#12463;&#12488;&#12501;&#12455;&#12483;&#12481;&#12398;&#20195;&#12431;&#12426;&#12395; &#32080;&#21512;&#12501;&#12455;&#12483;&#12481;&#65288;&#24403;&#28982;&#12371;&#12428;&#12399;&#36933;&#24310;&#20966;&#29702;&#12391;&#12399;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#65289;&#12434;&#36984;&#25246;&#12375;&#12383;&#12356;&#12371;&#12392;&#12364; &#26178;&#12293;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12363;&#12425;&#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#26041;&#27861;&#12434;&#12362;&#35211;&#12379;&#12375;&#12414;&#12377;&#12290; Hibernate3&#12391;&#12399;&#12289;&#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12434;&#36984;&#25246;&#12377;&#12427;&#20181;&#32068;&#12415;&#12399;&#21336;&#19968;&#20516;&#38306;&#36899;&#12392;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12391;
                  &#22793;&#12431;&#12426;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-custom"></a>19.1.2. &#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12398;&#12481;&#12517;&#12540;&#12491;&#12531;&#12464;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#12475;&#12524;&#12463;&#12488;&#12501;&#12455;&#12483;&#12481;&#65288;&#12487;&#12501;&#12457;&#12523;&#12488;&#65289;&#12399;N+1&#12475;&#12524;&#12463;&#12488;&#21839;&#38988;&#12392;&#12356;&#12358;&#22823;&#12365;&#12394;&#24369;&#28857;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289; &#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12391;&#32080;&#21512;&#12501;&#12455;&#12483;&#12481;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; </p><pre class="programlisting">&lt;set name="permissions" 
            fetch="join"&gt;
    &lt;key column="userId"/&gt;
    &lt;one-to-many class="Permission"/&gt;
&lt;/set</pre><pre class="programlisting">&lt;many-to-one name="mother" class="Cat" fetch="join"/&gt;</pre><p>&#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12391;&#23450;&#32681;&#12375;&#12383; <code class="literal">&#12501;&#12455;&#12483;&#12481;</code> &#25126;&#30053;&#12399;&#27425;&#12398;&#12418;&#12398;&#12395;&#24433;&#38911;&#12375;&#12414;&#12377;&#12290; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p><code class="literal">get()</code> &#12420; <code class="literal">load()</code> &#12395;&#12424;&#12427;&#24489;&#20803; 
                        </p>
                     </li>
                     <li>
                        <p>&#38306;&#36899;&#12395;&#12490;&#12499;&#12466;&#12540;&#12488;&#12375;&#12383;&#12392;&#12365;&#12395;&#30330;&#29983;&#12377;&#12427;&#26263;&#40665;&#30340;&#12394;&#24489;&#20803; </p>
                     </li>
                     <li>
                        <p><code class="literal">Criteria</code> &#12463;&#12456;&#12522; 
                        </p>
                     </li>
                     <li>
                        <p><code class="literal">&#12469;&#12502;&#12475;&#12524;&#12463;&#12488;</code> &#12501;&#12455;&#12483;&#12481;&#12434;&#20351;&#12358;HQL&#12463;&#12456;&#12522; 
                        </p>
                     </li>
                  </ul>
               </div>
               <p>&#12383;&#12392;&#12360;&#12393;&#12435;&#12394;&#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12434;&#20351;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#36933;&#24310;&#12391;&#12399;&#12394;&#12356;&#12464;&#12521;&#12501;&#12399;&#12513;&#12514;&#12522;&#12395;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#12371;&#12392;&#12364; &#20445;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#29305;&#23450;&#12398;HQL&#12463;&#12456;&#12522;&#12434;&#23455;&#34892;&#12377;&#12427;&#12383;&#12417;&#12395;&#12356;&#12367;&#12388;&#12363;&#12398;SELECT&#25991;&#12364;&#21363;&#26178;&#23455;&#34892;&#12373;&#12428;&#12427; &#12371;&#12392;&#12364;&#12354;&#12427;&#12398;&#12391;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p>
               <p>&#36890;&#24120;&#12399;&#12289;&#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12391;&#12501;&#12455;&#12483;&#12481;&#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12399;&#34892;&#12356;&#12414;&#12379;&#12435;&#12290; &#20195;&#12431;&#12426;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12398;&#12414;&#12414;&#12395;&#12375;&#12390;&#12362;&#12356;&#12390;&#12289;HQL&#12391; <code class="literal">left join fetch</code> &#12434; &#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#29305;&#23450;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#21205;&#20316;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;Hibernate&#12395;&#21021;&#22238;&#12398;&#12475;&#12524;&#12463;&#12488;&#12391;&#22806;&#37096;&#32080;&#21512;&#12434;&#20351;&#12387;&#12390;&#38306;&#36899;&#12434;&#20808;&#12395;&#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; <code class="literal">Criteria</code> &#12463;&#12456;&#12522;&#12398;API&#12391;&#12399;&#12289; <code class="literal">setFetchMode(FetchMode.JOIN)</code> &#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; 
               </p>
               <p>&#12418;&#12375; <code class="literal">get()</code> &#12420; <code class="literal">load()</code> &#12391;&#20351;&#12431;&#12428;&#12427; &#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12434;&#22793;&#12360;&#12383;&#12356;&#12392;&#24863;&#12376;&#12383;&#12392;&#12365;&#12395;&#12399;&#12289;&#21336;&#32020;&#12395; <code class="literal">Criteria</code> &#12463;&#12456;&#12522;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#20363;&#65306; 
               </p><pre class="programlisting">User user = (User) session.createCriteria(User.class)
                .setFetchMode("permissions", FetchMode.JOIN)
                .add( Restrictions.idEq(userId) )
                .uniqueResult();</pre><p>&#65288;&#12371;&#12428;&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;ORM&#12477;&#12522;&#12517;&#12540;&#12471;&#12519;&#12531;&#12364;"fetch plan"&#12392;&#21628;&#12435;&#12391;&#12356;&#12427;&#12418;&#12398;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;&#65289; </p>
               <p>N+1&#12475;&#12524;&#12463;&#12488;&#21839;&#38988;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12398;&#12414;&#12387;&#12383;&#12367;&#36949;&#12358;&#26041;&#27861;&#12399;&#12289;&#31532;2&#12524;&#12505;&#12523;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-proxies"></a>19.1.3. &#21336;&#19968;&#31471;&#38306;&#36899;&#12503;&#12525;&#12461;&#12471;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#36933;&#24310;&#12501;&#12455;&#12483;&#12481;&#12399;&#12289;Hibernate&#33258;&#36523;&#12398;&#23455;&#35013;&#12395;&#12424;&#12427;&#27704;&#32154;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12387;&#12390; &#23455;&#29694;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#21336;&#19968;&#31471;&#38306;&#36899;&#12395;&#12362;&#12369;&#12427;&#36933;&#24310;&#20966;&#29702;&#12391;&#12399;&#12289;&#36949;&#12358;&#20181;&#32068;&#12415;&#12364; &#24517;&#35201;&#12391;&#12377;&#12290;&#23550;&#35937;&#12398;&#38306;&#36899;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#12503;&#12525;&#12461;&#12471;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;Hibernate&#12399;
                  &#65288;&#12377;&#12400;&#12425;&#12375;&#12356;CGLIB&#12521;&#12452;&#12502;&#12521;&#12522;&#12395;&#12424;&#12427;&#65289;&#23455;&#34892;&#26178;&#12398;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#25313;&#24373;&#12434; &#20351;&#12387;&#12390;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#36933;&#24310;&#21021;&#26399;&#21270;&#12503;&#12525;&#12461;&#12471;&#12434;&#23455;&#29694;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; 
               </p>
               <p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;Hibernate3&#12399;&#65288;&#38283;&#22987;&#26178;&#12395;&#65289;&#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12461;&#12471;&#12434;&#29983;&#25104;&#12375;&#12289; &#12381;&#12428;&#12425;&#12434;&#20351;&#12387;&#12390;&#12289; <code class="literal">many-to-one</code> &#12420; <code class="literal">one-to-one</code> &#38306;&#36899;&#12398; &#36933;&#24310;&#12501;&#12455;&#12483;&#12481;&#12434;&#21487;&#33021;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; 
               </p>
               <p>&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12391; <code class="literal">proxy</code> &#23646;&#24615;&#12395;&#12424;&#12387;&#12390;&#12289;&#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12461;&#12471;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12392;&#12375;&#12390; &#20351;&#12358;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23459;&#35328;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;Hibernate&#12399;&#12381;&#12398;&#12463;&#12521;&#12473;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290; <span class="emphasis"><em>&#12503;&#12525;&#12461;&#12471;&#12463;&#12521;&#12473;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#12497;&#12483;&#12465;&#12540;&#12472;&#21487;&#35222;&#12391;&#12487;&#12501;&#12457;&#12523;&#12488;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12434;&#23455;&#35013;&#12375;&#12394;&#12369;&#12428;&#12400; &#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12395;&#12371;&#12398;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12434;&#25512;&#22888;&#12375;&#12414;&#12377;&#65281;</em></span> 
               </p>
               <p>&#12509;&#12522;&#12514;&#12540;&#12501;&#12451;&#12474;&#12512;&#12398;&#12463;&#12521;&#12473;&#12395;&#23550;&#12375;&#12390;&#12371;&#12398;&#26041;&#27861;&#12434;&#36969;&#29992;&#12377;&#12427;&#12392;&#12365;&#12395;&#12356;&#12367;&#12388;&#12363;&#32771;&#24942;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#20363;&#65306; </p><pre class="programlisting">&lt;class name="Cat" proxy="Cat"&gt;
    ......
    &lt;subclass name="DomesticCat"&gt;
        .....
    &lt;/subclass&gt;
&lt;/class&gt;</pre><p>&#31532;&#19968;&#12395;&#12289; <code class="literal">Cat</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399; <code class="literal">DomesticCat</code> &#12395;&#12461;&#12515;&#12473;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12383;&#12392;&#12360;&#22522;&#12392;&#12394;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364; <code class="literal">DomesticCat</code> &#12391;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12391;&#12377;&#12290; 
               </p><pre class="programlisting">Cat cat = (Cat) session.load(Cat.class, id);  // instantiate a proxy (does not hit the db)
if ( cat.isDomesticCat() ) {                  // hit the db to initialize the proxy
    DomesticCat dc = (DomesticCat) cat;       // Error!
    ....
}</pre><p>&#31532;&#20108;&#12395;&#12289;&#12503;&#12525;&#12461;&#12471;&#12398; <code class="literal">==</code> &#12399;&#25104;&#31435;&#12375;&#12394;&#12356;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
               </p><pre class="programlisting">Cat cat = (Cat) session.load(Cat.class, id);            // instantiate a Cat proxy
DomesticCat dc = 
        (DomesticCat) session.load(DomesticCat.class, id);  // acquire new DomesticCat proxy!
System.out.println(cat==dc);                            // false</pre><p>&#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12399;&#35211;&#12363;&#12369;&#12411;&#12393;&#24746;&#12356;&#29366;&#27841;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12383;&#12392;&#12360;&#30064;&#12394;&#12387;&#12383;&#12503;&#12525;&#12461;&#12471;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398; &#20108;&#12388;&#12398;&#21442;&#29031;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#22522;&#12392;&#12394;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#21516;&#12376;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; </p><pre class="programlisting">cat.setWeight(11.0);  // hit the db to initialize the proxy
System.out.println( dc.getWeight() );  // 11.0</pre><p>&#31532;&#19977;&#12395;&#12289; <code class="literal">final</code> &#12463;&#12521;&#12473;&#12420; <code class="literal">final</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#25345;&#12388;&#12463;&#12521;&#12473;&#12395; CGLIB&#12503;&#12525;&#12461;&#12471;&#12434;&#20351;&#12360;&#12414;&#12379;&#12435;&#12290; 
               </p>
               <p>&#26368;&#24460;&#12395;&#12289;&#12418;&#12375;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#26178;(&#20363;&#12360;&#12400;&#12289;&#21021;&#26399;&#21270;&#20966;&#29702;&#12420;&#12487;&#12501;&#12457;&#12523;&#12488;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12398;&#20013;&#12391;) &#12395;&#12394;&#12435;&#12425;&#12363;&#12398;&#12522;&#12477;&#12540;&#12473;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12394;&#12425;&#12289;&#12381;&#12398;&#12522;&#12477;&#12540;&#12473;&#12418;&#12414;&#12383;&#12503;&#12525;&#12461;&#12471;&#12434;&#36890;&#12375;&#12390;&#21462;&#24471;&#12373;&#12428;&#12414;&#12377;&#12290; &#23455;&#38555;&#12395;&#12399;&#12289;&#12503;&#12525;&#12461;&#12471;&#12463;&#12521;&#12473;&#12399;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290;
                  
               </p>
               <p>&#12371;&#12428;&#12425;&#12398;&#21839;&#38988;&#12399;Java&#12398;&#21336;&#19968;&#32153;&#25215;&#12514;&#12487;&#12523;&#12398;&#21407;&#29702;&#19978;&#12398;&#21046;&#38480;&#12398;&#12383;&#12417;&#12391;&#12377;&#12290;&#12418;&#12375;&#12371;&#12428;&#12425;&#12398;&#21839;&#38988;&#12434;&#36991;&#12369;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289; &#12499;&#12472;&#12493;&#12473;&#12513;&#12477;&#12483;&#12489;&#12434;&#23459;&#35328;&#12375;&#12383;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#12381;&#12428;&#12382;&#12428;&#27704;&#32154;&#12463;&#12521;&#12473;&#12391;&#23455;&#35013;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12391;&#12371;&#12428;&#12425;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#65306;
                  
               </p><pre class="programlisting">&lt;class name="CatImpl" proxy="Cat"&gt;
    ......
    &lt;subclass name="DomesticCatImpl" proxy="DomesticCat"&gt;
        .....
    &lt;/subclass&gt;
&lt;/class&gt;</pre><p><code class="literal">CatImpl</code> &#12399; <code class="literal">Cat</code> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#12398;&#12395;&#23550;&#12375;&#12289; <code class="literal">DomesticCatImpl</code> &#12399; <code class="literal">DomesticCat</code> &#12434;&#23455;&#35013;&#12375;&#12414;&#12377;&#12290; &#12377;&#12427;&#12392;&#12289; <code class="literal">load()</code> &#12420; <code class="literal">iterate()</code> &#12399;&#12289; <code class="literal">Cat</code> &#12420; <code class="literal">DomesticCat</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12503;&#12525;&#12461;&#12471;&#12434; &#36820;&#12375;&#12414;&#12377;&#12290;&#65288; <code class="literal">list()</code> &#12399;&#36890;&#24120;&#12399;&#12503;&#12525;&#12461;&#12471;&#12434;&#36820;&#12373;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#65289; 
               </p><pre class="programlisting">Cat cat = (Cat) session.load(CatImpl.class, catid);
Iterator iter = session.createQuery("from CatImpl as cat where cat.name='fritz'").iterate();
Cat fritz = (Cat) iter.next();</pre><p>&#38306;&#36899;&#12418;&#36933;&#24310;&#21021;&#26399;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <code class="literal">Cat</code> &#22411;&#12391;&#23459;&#35328;&#12375;&#12394;&#12369;&#12428;&#12400; &#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290; <code class="literal">CatImpl</code> &#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; 
               </p>
               <p>&#12503;&#12525;&#12461;&#12471;&#12398;&#21021;&#26399;&#21270;&#12434; <span class="emphasis"><em>&#24517;&#35201;&#12392;&#12375;&#12394;&#12356;</em></span> &#25805;&#20316;&#12418;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc" compact>
                     <li>
                        <p><code class="literal">equals()</code> &#65288;&#27704;&#32154;&#12463;&#12521;&#12473;&#12364; <code class="literal">equals()</code> &#12434; &#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12394;&#12356;&#12392;&#12365;&#65289; 
                        </p>
                     </li>
                     <li>
                        <p><code class="literal">hashCode()</code> &#65288;&#27704;&#32154;&#12463;&#12521;&#12473;&#12364; <code class="literal">hashCode()</code> &#12434; &#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12394;&#12356;&#12392;&#12365;&#65289; 
                        </p>
                     </li>
                     <li>
                        <p>&#35672;&#21029;&#23376;&#12398;getter&#12513;&#12477;&#12483;&#12489; </p>
                     </li>
                  </ul>
               </div>
               <p>Hibernate&#12399; <code class="literal">equals()</code> &#12420; <code class="literal">hashCode()</code> &#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12383; &#27704;&#32154;&#12463;&#12521;&#12473;&#12434;&#26908;&#20986;&#12375;&#12414;&#12377;&#12290; 
               </p>
               <p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398; <code class="literal">lazy="proxy"</code> &#12398;&#20195;&#12431;&#12426;&#12395;&#12289; <code class="literal">lazy="no-proxy"</code> &#12434; &#36984;&#12435;&#12384;&#12371;&#12392;&#12391;&#12289;&#22411;&#22793;&#25563;&#12395;&#38306;&#36899;&#12377;&#12427;&#21839;&#38988;&#12434;&#22238;&#36991;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;&#12499;&#12523;&#12489;&#26178;&#12398;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#32068;&#12415;&#36796;&#12415;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12289;&#12393;&#12398;&#12424;&#12358;&#12394;&#25805;&#20316;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289; &#12383;&#12384;&#12385;&#12395;&#12503;&#12525;&#12461;&#12471;&#12398;&#21021;&#26399;&#21270;&#12434;&#34892;&#12358;&#12371;&#12392;&#12395;&#12394;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-initialization"></a>19.1.4. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#12503;&#12525;&#12461;&#12471;&#12398;&#21021;&#26399;&#21270;
                        </h3>
                     </div>
                  </div>
               </div>
               <p><code class="literal">LazyInitializationException</code> &#12399;&#12289; <code class="literal">Session</code> &#12398;&#12473;&#12467;&#12540;&#12503;&#22806;&#12363;&#12425; &#21021;&#26399;&#21270;&#12375;&#12390;&#12356;&#12394;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#12503;&#12525;&#12461;&#12471;&#12395;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289;Hibernate&#12395;&#12424;&#12387;&#12390;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290; &#12377;&#12394;&#12431;&#12385;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#12503;&#12525;&#12461;&#12471;&#12408;&#12398;&#21442;&#29031;&#12434;&#25345;&#12388;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#20998;&#38626;&#12373;&#12428;&#12383;&#29366;&#24907;&#12398;&#26178;&#12391;&#12377;&#12290; 
               </p>
               <p><code class="literal">Session</code> &#12434;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#21069;&#12395;&#12503;&#12525;&#12461;&#12471;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#21021;&#26399;&#21270;&#12434;&#30906;&#23455;&#12395; &#34892;&#12356;&#12383;&#12356;&#12392;&#12365;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12418;&#12385;&#12429;&#12435;&#12289; <code class="literal">cat.getSex()</code> &#12420; <code class="literal">cat.getKittens().size()</code> &#12394;&#12393;&#12434;&#24120;&#12395;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12391;&#21021;&#26399;&#21270;&#12434;&#24375;&#21046;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12371;&#12428;&#12399;&#12467;&#12540;&#12489;&#12434;&#35501;&#12416;&#20154;&#12434;&#28151;&#20081;&#12373;&#12379;&#12289;&#27726;&#29992;&#30340;&#12394;&#12467;&#12540;&#12489;&#12392;&#12356;&#12358;&#28857;&#12363;&#12425;&#12418;&#19981;&#20415;&#12391;&#12377;&#12290; 
               </p>
               <p>static&#12513;&#12477;&#12483;&#12489;&#12398; <code class="literal">Hibernate.initialize()</code> &#12420; <code class="literal">Hibernate.isInitialized()</code> &#12399;&#36933;&#24310;&#21021;&#26399;&#21270;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#12503;&#12525;&#12461;&#12471;&#12434;&#25201;&#12358;&#12392;&#12365;&#12395;&#20415;&#21033;&#12394;&#26041;&#27861;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; <code class="literal">Hibernate.initialize(cat)</code> &#12399;&#12289; <code class="literal">Session</code> &#12364;&#12458;&#12540;&#12503;&#12531;&#12375;&#12390;&#12356;&#12427;&#38480;&#12426;&#12399; <code class="literal">cat</code> &#12503;&#12525;&#12461;&#12471;&#12434;&#24375;&#21046;&#30340;&#12395;&#21021;&#26399;&#21270;&#12375;&#12414;&#12377;&#12290; <code class="literal">Hibernate.initialize( cat.getKittens() )</code> &#12399;kittens&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#21516;&#27096;&#12398; &#21177;&#26524;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
               </p>
               <p>&#21029;&#12398;&#36984;&#25246;&#32930;&#12392;&#12375;&#12390;&#12289;&#24517;&#35201;&#12394;&#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#12503;&#12525;&#12461;&#12471;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12414;&#12391; <code class="literal">Session</code> &#12434;&#12458;&#12540;&#12503;&#12531;&#12395;&#12375;&#12390;&#12362;&#12367;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12356;&#12367;&#12388;&#12363;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12391;&#12399;&#12289;&#29305;&#12395;Hibernate&#12395;&#12424;&#12427;&#12487;&#12540;&#12479;&#12450;&#12463;&#12475;&#12473;&#12434;&#34892;&#12358;&#12467;&#12540;&#12489;&#12392;&#12289;&#12381;&#12428;&#12434;&#20351;&#12358; &#12467;&#12540;&#12489;&#12364;&#30064;&#12394;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12524;&#12452;&#12516;&#12540;&#12420;&#12289;&#29289;&#29702;&#30340;&#12395;&#30064;&#12394;&#12427;&#12503;&#12525;&#12475;&#12483;&#12469;&#12398;&#12392;&#12365;&#12395;&#12399;&#12289; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#21021;&#26399;&#21270;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;
                  <code class="literal">Session</code> &#12364;&#12458;&#12540;&#12503;&#12531;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434; &#20445;&#35388;&#12377;&#12427;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#21839;&#38988;&#12395;&#23550;&#12375;&#12390;&#12399;2&#12388;&#12398;&#22522;&#26412;&#30340;&#12394;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>Web&#12505;&#12540;&#12473;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289; &#12499;&#12517;&#12540;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12364;&#23436;&#20102;&#12375;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#32066;&#12431;&#12427;&#19968;&#30058;&#26368;&#24460;&#12391; <code class="literal">Session</code> &#12434;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12501;&#12451;&#12523;&#12479;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#65288; <span class="emphasis"><em>Open Session in View</em></span> &#12497;&#12479;&#12540;&#12531;&#12391;&#12377;&#65289;&#12290;&#12418;&#12385;&#12429;&#12435;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#22522;&#30436;&#12398;&#20363;&#22806;&#20966;&#29702;&#12398;&#27491;&#30906;&#24615;&#12364;&#38750;&#24120;&#12395;&#37325;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12499;&#12517;&#12540;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#20013;&#12395;&#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12391;&#12373;&#12360;&#12289;&#12518;&#12540;&#12470;&#12395;&#20966;&#29702;&#12364;&#25147;&#12427;&#21069;&#12395; <code class="literal">Session</code> &#12398;&#12463;&#12525;&#12540;&#12474;&#12392;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#32066;&#20102;&#12434;&#34892;&#12358; &#12371;&#12392;&#12364;&#19981;&#21487;&#27424;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; Hibernate&#12398;Wiki&#12395;&#36617;&#12387;&#12390;&#12356;&#12427;"Open Session in View"&#12497;&#12479;&#12540;&#12531;&#12398;&#20363;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>&#12499;&#12472;&#12493;&#12473;&#23652;&#12364;&#20998;&#38626;&#12375;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12499;&#12472;&#12493;&#12473;&#12525;&#12472;&#12483;&#12463;&#12399; Web&#23652;&#12391;&#24517;&#35201;&#12395;&#12394;&#12427;&#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20107;&#21069;&#12395;"&#28310;&#20633;"&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#29305;&#23450;&#12398;&#12518;&#12540;&#12473;&#12465;&#12540;&#12473;&#12391;&#24517;&#35201;&#12392;&#12394;&#12427;&#12503;&#12524;&#12476;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531;/Web&#23652;&#12395;&#23550;&#12375;&#12289; &#12499;&#12472;&#12493;&#12473;&#23652;&#12364;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12434;&#12525;&#12540;&#12489;&#12375;&#12289;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12434;&#21021;&#26399;&#21270;&#12375;&#12390;&#36820;&#12377;&#12409;&#12365;&#12392;
                           &#12356;&#12358;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#36890;&#24120;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;Web&#23652;&#12391;&#24517;&#35201;&#12394;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531; &#12381;&#12428;&#12382;&#12428;&#12395;&#23550;&#12375;&#12390; <code class="literal">Hibernate.initialize()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12363; &#65288;&#12371;&#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#21069;&#12395;&#34892;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#65289;&#12289; Hibernate&#12463;&#12456;&#12522;&#12398; <code class="literal">FETCH</code> &#31680;&#12420; <code class="literal">Criteria</code> &#12398; <code class="literal">FetchMode.JOIN</code> &#12434;&#20351;&#12387;&#12390;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20808;&#12395;&#24489;&#20803;&#12375;&#12414;&#12377;&#12290; &#26222;&#36890;&#12399; <span class="emphasis"><em>Session Facade</em></span> &#12497;&#12479;&#12540;&#12531;&#12398;&#20195;&#12431;&#12426;&#12395; <span class="emphasis"><em>Command</em></span> &#12497;&#12479;&#12540;&#12531;&#12434;&#25505;&#29992;&#12377;&#12427;&#12411;&#12358;&#12364;&#12424;&#12426;&#31777;&#21336;&#12391;&#12377;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>&#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65288;&#12418;&#12375;&#12367;&#12399;&#20182;&#12398;&#12503;&#12525;&#12461;&#12471;&#65289;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#21069;&#12395;&#12289; <code class="literal">merge()</code> &#12420; <code class="literal">lock()</code> &#12434;&#20351;&#12387;&#12390;&#26032;&#12375;&#12356; <code class="literal">Session</code> &#12395;&#20197;&#21069;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12418;&#20986;&#26469;&#12414;&#12377;&#12290; &#12450;&#12489;&#12507;&#12483;&#12463;&#12394;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#23566;&#20837;&#12375;&#12383;&#12398;&#12391;&#12289;Hibernate&#12399; &#12371;&#12428;&#12434;&#33258;&#21205;&#30340;&#12395;&#34892;&#12431;&#12378;&#12289; <span class="emphasis"><em>&#34892;&#12358;&#12409;&#12365;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;</em></span> &#65281; 
                        </p>
                     </li>
                  </ul>
               </div>
               <p>&#22823;&#12365;&#12394;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21021;&#26399;&#21270;&#12375;&#12383;&#12367;&#12399;&#12394;&#12356;&#12364;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12398;&#12394;&#12435;&#12425;&#12363;&#12398;&#24773;&#22577;&#65288;&#12469;&#12452;&#12474;&#12398;&#12424;&#12358;&#12394;&#65289; &#12420;&#12487;&#12540;&#12479;&#12398;&#12469;&#12502;&#12475;&#12483;&#12488;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; </p>
               <p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12501;&#12451;&#12523;&#12479;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12289;&#21021;&#26399;&#21270;&#12379;&#12378;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12469;&#12452;&#12474;&#12434;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; </p><pre class="programlisting">( (Integer) s.createFilter( collection, "select count(*)" ).list().get(0) ).intValue()</pre><p><code class="literal">createFilter()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#20840;&#20307;&#12434;&#21021;&#26399;&#21270;&#12377;&#12427;&#24517;&#35201;&#12394;&#12375;&#12395;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398; &#12469;&#12502;&#12475;&#12483;&#12488;&#12434;&#24489;&#20803;&#12377;&#12427;&#12383;&#12417;&#12395;&#21177;&#26524;&#30340;&#12395;&#20351;&#12360;&#12414;&#12377;&#12290; 
               </p><pre class="programlisting">s.createFilter( lazyCollection, "").setFirstResult(0).setMaxResults(10).list();</pre></div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-batch"></a>19.1.5. &#12496;&#12483;&#12481;&#12501;&#12455;&#12483;&#12481;&#12398;&#20351;&#29992;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Hibernate&#12399;&#12496;&#12483;&#12481;&#12501;&#12455;&#12483;&#12481;&#12434;&#21177;&#29575;&#30340;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#19968;&#12388;&#12398;&#12503;&#12525;&#12461;&#12471;&#65288;&#12418;&#12375;&#12367;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65289;&#12364;&#12450;&#12463;&#12475;&#12473; &#12373;&#12428;&#12427;&#12392;&#12289;Hibernate&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#21021;&#26399;&#21270;&#12375;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12461;&#12471;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#12501;&#12455;&#12483;&#12481;&#12399; &#36933;&#24310;&#12475;&#12524;&#12463;&#12488;&#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12395;&#23550;&#12377;&#12427;&#26368;&#36969;&#21270;&#12391;&#12377;&#12290;&#12496;&#12483;&#12481;&#12501;&#12455;&#12483;&#12481;&#12398;&#35519;&#25972;&#12395;&#12399;&#65298;&#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                  &#12463;&#12521;&#12473;&#12524;&#12505;&#12523;&#12392;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12524;&#12505;&#12523;&#12391;&#12377;&#12290; 
               </p>
               <p>&#12463;&#12521;&#12473;&#12289;&#35201;&#32032;&#12398;&#12496;&#12483;&#12481;&#12501;&#12455;&#12483;&#12481;&#12399;&#29702;&#35299;&#12364;&#31777;&#21336;&#12391;&#12377;&#12290;&#23455;&#34892;&#26178;&#12398;&#27425;&#12398;&#22580;&#38754;&#12434;&#24819;&#20687;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; <code class="literal">Session</code> &#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;25&#20491;&#12398; <code class="literal">Cat</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12375;&#12289; &#12381;&#12428;&#12382;&#12428;&#12398; <code class="literal">Cat</code> &#12399; <code class="literal">owner</code> &#12391;&#12354;&#12427; <code class="literal">Person</code> &#12408;&#12398;&#38306;&#36899;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290; <code class="literal">Person</code> &#12463;&#12521;&#12473;&#12399; <code class="literal">lazy="true"</code> &#12398;&#12503;&#12525;&#12461;&#12471;&#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; &#12418;&#12375;&#20170;&#12377;&#12409;&#12390;&#12398;Cat&#12395;&#23550;&#12375;&#12390;&#32368;&#12426;&#36820;&#12375; <code class="literal">getOwner()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12392;&#12289;Hibernate&#12399; &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;25&#22238;&#12398; <code class="literal">SELECT</code> &#12434;&#23455;&#34892;&#12375;&#12289;owner&#12503;&#12525;&#12461;&#12471;&#12398;&#24489;&#20803;&#12434;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434; <code class="literal">Person</code> &#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398; <code class="literal">batch-size</code> &#12398;&#25351;&#23450;&#12391;&#35519;&#25972;&#12391;&#12365;&#12414;&#12377;&#12290; 
               </p><pre class="programlisting">&lt;class name="Person" batch-size="10"&gt;...&lt;/class&gt;</pre><p>Hibernate&#12399;&#12463;&#12456;&#12522;&#12434;&#65299;&#22238;&#12384;&#12369;&#12434;&#23455;&#34892;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12497;&#12479;&#12540;&#12531;&#12399;10, 10, 5&#12391;&#12377;&#12290; </p>
               <p>You may also enable batch fetching of collections. For example, if each <code class="literal">Person</code> has a lazy collection of <code class="literal">Cat</code>s, and 10 persons are currently loaded in the <code class="literal">Session</code>, iterating through all persons will generate 10 <code class="literal">SELECT</code>s, one for every call to <code class="literal">getCats()</code>. If you enable batch fetching for the <code class="literal">cats</code> collection in the mapping of <code class="literal">Person</code>, Hibernate can pre-fetch collections: 
               </p><pre class="programlisting">&lt;class name="Person"&gt;
    &lt;set name="cats" batch-size="3"&gt;
        ...
    &lt;/set&gt;
&lt;/class&gt;</pre><p><code class="literal">batch-size</code> &#12364;3&#12394;&#12398;&#12391;&#12289;Hibernate&#12399;4&#22238;&#12398; <code class="literal">SELECT</code> &#12391;3&#20491;&#12289;3&#20491;&#12289;3&#20491;&#12289;1&#20491;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#32368;&#12426;&#36820;&#12377;&#12392;&#12289;&#23646;&#24615;&#12398;&#20516;&#12399;&#29305;&#23450;&#12398; <code class="literal">Session</code> &#12398;&#20013;&#12398;&#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#26399;&#24453;&#25968;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290; 
               </p>
               <p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12496;&#12483;&#12481;&#12501;&#12455;&#12483;&#12481;&#12399;&#12450;&#12452;&#12486;&#12512;&#12398;&#12493;&#12473;&#12488;&#12375;&#12383;&#12484;&#12522;&#12540;&#12289; &#12377;&#12394;&#12431;&#12385;&#12289;&#20195;&#34920;&#30340;&#12394;&#37096;&#21697;&#34920;&#12398;&#12497;&#12479;&#12540;&#12531;&#12364; &#12354;&#12427;&#22580;&#21512;&#12395;&#29305;&#12395;&#26377;&#29992;&#12391;&#12377;&#12290;&#65288;&#12375;&#12363;&#12375;&#12289;&#35501;&#12415;&#36796;&#12415;&#12364;&#22810;&#12356;&#12484;&#12522;&#12540;&#12391;&#12399; <span class="emphasis"><em>&#12493;&#12473;&#12488;&#12375;&#12383;set</em></span> &#12420; <span class="emphasis"><em>&#20855;&#20307;&#21270;&#12375;&#12383;&#12497;&#12473;</em></span> &#12364;&#12424;&#12426;&#12424;&#12356;&#36984;&#25246;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#65289; 
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-subselect"></a>19.1.6. &#12469;&#12502;&#12475;&#12524;&#12463;&#12488;&#12501;&#12455;&#12483;&#12481;&#12398;&#20351;&#29992;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#19968;&#12388;&#12398;&#36933;&#24310;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#21336;&#19968;&#20516;&#12503;&#12525;&#12461;&#12471;&#12364;&#12501;&#12455;&#12483;&#12481;&#12373;&#12428;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12394;&#12356;&#12392;&#12365;&#12289;Hibernate&#12399; &#12381;&#12428;&#12425;&#12377;&#12409;&#12390;&#12434;&#12525;&#12540;&#12489;&#12375;&#12289;&#12469;&#12502;&#12475;&#12524;&#12463;&#12488;&#12398;&#12458;&#12522;&#12472;&#12490;&#12523;&#12463;&#12456;&#12522;&#12364;&#20877;&#24230;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399; &#12496;&#12483;&#12481;&#12501;&#12455;&#12483;&#12481;&#12392;&#21516;&#12376;&#26041;&#27861;&#12391;&#21205;&#12365;&#12289;&#23569;&#12375;&#12378;&#12388;&#12398;&#12525;&#12540;&#12489;&#12399;&#34892;&#12356;&#12414;&#12379;&#12435;&#12290; </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-lazyproperties"></a>19.1.7. &#36933;&#24310;&#12503;&#12525;&#12497;&#12486;&#12451;&#12501;&#12455;&#12483;&#12481;&#12398;&#20351;&#29992;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Hibernate3&#12399;&#12503;&#12525;&#12497;&#12486;&#12451;&#12372;&#12392;&#12398;&#36933;&#24310;&#12501;&#12455;&#12483;&#12481;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#26368;&#36969;&#21270;&#25163;&#27861;&#12399; <span class="emphasis"><em>&#12464;&#12523;&#12540;&#12503;&#12398;&#12501;&#12455;&#12483;&#12481;</em></span> &#12392;&#12375;&#12390;&#12418;&#30693;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12411;&#12392;&#12435;&#12393; &#35201;&#26395;&#12363;&#12425;&#20986;&#12383;&#27231;&#33021;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#23455;&#38555;&#12395;&#12399;&#21015;&#35501;&#12415;&#36796;&#12415;&#12398;&#26368;&#36969;&#21270;&#12424;&#12426;&#12418;&#12289; &#34892;&#35501;&#12415;&#36796;&#12415;&#12398;&#26368;&#36969;&#21270;&#12364;&#38750;&#24120;&#12395;&#37325;&#35201;&#12391;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;&#12463;&#12521;&#12473;&#12398;&#12356;&#12367;&#12388;&#12363;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12384;&#12369;&#12434;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12399;&#12289;&#26082;&#23384;&#12398;&#12486;&#12540;&#12502;&#12523;&#12364;&#20309;&#30334;&#12418;&#12398;&#21015;&#12434;&#25345;&#12385;&#12289;
                  &#12487;&#12540;&#12479;&#12514;&#12487;&#12523;&#12434;&#25913;&#21892;&#12391;&#12365;&#12394;&#12356;&#12394;&#12393;&#12398;&#26997;&#31471;&#12394;&#22580;&#21512;&#12395;&#12399;&#26377;&#29992;&#12391;&#12377;&#12290; 
               </p>
               <p>&#36933;&#24310;&#12503;&#12525;&#12497;&#12486;&#12451;&#35501;&#12415;&#36796;&#12415;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#23550;&#35937;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391; <code class="literal">lazy</code> &#23646;&#24615;&#12434;&#12475;&#12483;&#12488;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
               </p><pre class="programlisting">&lt;class name="Document"&gt;
       &lt;id name="id"&gt;
        &lt;generator class="native"/&gt;
    &lt;/id&gt;
    &lt;property name="name" not-null="true" length="50"/&gt;
    &lt;property name="summary" not-null="true" length="200" lazy="true"/&gt;
    &lt;property name="text" not-null="true" length="2000" lazy="true"/&gt;
&lt;/class&gt;</pre><p>&#36933;&#24310;&#12503;&#12525;&#12497;&#12486;&#12451;&#35501;&#12415;&#36796;&#12415;&#12399;&#12499;&#12523;&#12489;&#26178;&#12398;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#32068;&#12415;&#36796;&#12415;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#65281;&#12418;&#12375; &#27704;&#32154;&#12463;&#12521;&#12473;&#12395;&#32068;&#12415;&#36796;&#12415;&#12364;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12394;&#12425;&#12289;Hibernate&#12399;&#40665;&#12387;&#12390;&#36933;&#24310;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35373;&#23450;&#12434;&#28961;&#35222;&#12375;&#12390;&#12289; &#21363;&#26178;&#12501;&#12455;&#12483;&#12481;&#12395;&#25147;&#12375;&#12414;&#12377;&#12290; </p>
               <p>&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#32068;&#12415;&#36796;&#12415;&#12399;&#20197;&#19979;&#12398;Ant&#12479;&#12473;&#12463;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p><pre class="programlisting">&lt;target name="instrument" depends="compile"&gt;
    &lt;taskdef name="instrument" classname="org.hibernate.tool.instrument.InstrumentTask"&gt;
        &lt;classpath path="${jar.path}"/&gt;
        &lt;classpath path="${classes.dir}"/&gt;
        &lt;classpath refid="lib.class.path"/&gt;
    &lt;/taskdef&gt;

    &lt;instrument verbose="true"&gt;
        &lt;fileset dir="${testclasses.dir}/org/hibernate/auction/model"&gt;
            &lt;include name="*.class"/&gt;
        &lt;/fileset&gt;
    &lt;/instrument&gt;
&lt;/target&gt;</pre><p>A different (better?) way to avoid unnecessary column reads, at least for read-only transactions is to use the projection
                  features of HQL or Criteria queries. This avoids the need for buildtime bytecode processing and is certainly a preferred solution.
                  
               </p>
               <p>HQL&#12391; <code class="literal">fetch all properties</code> &#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12289;&#26222;&#36890;&#12393;&#12362;&#12426;&#12398; &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21363;&#26178;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12434;&#24375;&#21046;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; 
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="xml-manipulation.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="performance-cache.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">18.3. XML&#12487;&#12540;&#12479;&#12434;&#25201;&#12358;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;19.2. &#31532;2&#12524;&#12505;&#12523;&#12461;&#12515;&#12483;&#12471;&#12517;</td>
            </tr>
         </table>
      </div>
   </body>
</html>