<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>19.3. &#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#31649;&#29702;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="performance.html" title="&#31532;19&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;">
      <link rel="prev" href="performance-cache.html" title="19.2. &#31532;2&#12524;&#12505;&#12523;&#12461;&#12515;&#12483;&#12471;&#12517;">
      <link rel="next" href="performance-querycache.html" title="19.4. &#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">19.3. &#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#31649;&#29702;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="performance-cache.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;19&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="performance-querycache.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="performance-sessioncache"></a>19.3. &#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#31649;&#29702;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; <code class="literal">save()</code> &#12289; <code class="literal">update()</code> &#12289; <code class="literal">saveOrUpdate()</code> &#12395;&#28193;&#12377;&#12392;&#12365;&#12289;&#12381;&#12375;&#12390; <code class="literal">load()</code> &#12289; <code class="literal">get()</code> &#12289; <code class="literal">list()</code> &#12289; <code class="literal">iterate()</code> &#12289; <code class="literal">scroll()</code> &#12434;&#20351;&#12387;&#12390;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#24489;&#20803;&#12377;&#12427;&#12392;&#12365;&#12395;&#12399;&#24120;&#12395;&#12289; &#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399; <code class="literal">Session</code> &#12398;&#20869;&#37096;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290; 
         </p>
         <p>&#27425;&#12395; <code class="literal">flush()</code> &#12364;&#21628;&#12400;&#12428;&#12427;&#12392;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#21516;&#26399;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290; &#12418;&#12375;&#12371;&#12398;&#21516;&#26399;&#12364;&#36215;&#12371;&#12427;&#12371;&#12392;&#12434;&#26395;&#12414;&#12394;&#12356;&#12392;&#12365;&#12420;&#12289;&#33192;&#22823;&#12394;&#25968;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20966;&#29702;&#12375;&#12390;&#12356;&#12390;&#12513;&#12514;&#12522;&#12434;&#21177;&#29575;&#30340;&#12395; &#25201;&#12358;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12365;&#12399;&#12289; <code class="literal">evict()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12387;&#12390;&#19968;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21066;&#38500;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">ScrollableResult cats = sess.createQuery("from Cat as cat").scroll(); //a huge result set
while ( cats.next() ) {
    Cat cat = (Cat) cats.get(0);
    doSomethingWithACat(cat);
    sess.evict(cat);
}</pre><p><code class="literal">Session</code> &#12399;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12475;&#12483;&#12471;&#12519;&#12531;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#21547;&#12414;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#26029;&#12377;&#12427;&#12383;&#12417;&#12398; <code class="literal">contains()</code> &#12513;&#12477;&#12483;&#12489;&#12418;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; 
         </p>
         <p>&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12475;&#12483;&#12471;&#12519;&#12531;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425;&#23436;&#20840;&#12395;&#21462;&#12426;&#38500;&#12367;&#12395;&#12399;&#12289;<code class="literal">Session.clear()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
         </p>
         <p>&#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#12383;&#12417;&#12395;&#12289; <code class="literal">SessionFactory</code> &#12395;&#12399; &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12463;&#12521;&#12473;&#20840;&#20307;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#20840;&#20307;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425; &#21066;&#38500;&#12377;&#12427;&#12383;&#12417;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#12381;&#12428;&#12382;&#12428;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">sessionFactory.evict(Cat.class, catId); //evict a particular Cat
sessionFactory.evict(Cat.class);  //evict all Cats
sessionFactory.evictCollection("Cat.kittens", catId); //evict a particular collection of kittens
sessionFactory.evictCollection("Cat.kittens"); //evict all kitten collections</pre><p><code class="literal">CacheMode</code> &#12399;&#29305;&#23450;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12392;&#12393;&#12398;&#12424;&#12358;&#12395;&#30456;&#20114;&#20316;&#29992;&#12377;&#12427;&#12363;&#12434; &#25351;&#23450;&#12375;&#12414;&#12377;&#12290; 
         </p>
         <div class="itemizedlist">
            <ul type="disc">
               <li>
                  <p><code class="literal">CacheMode.NORMAL</code> - &#12450;&#12452;&#12486;&#12512;&#12398;&#35501;&#12415;&#36796;&#12415;&#12392;&#26360;&#12365;&#36796;&#12415;&#12391;&#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20351;&#12356;&#12414;&#12377; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">CacheMode.GET</code> - &#35501;&#12415;&#36796;&#12415;&#12399;&#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425;&#34892;&#12356;&#12414;&#12377;&#12364;&#12289;&#12487;&#12540;&#12479;&#12434; &#26356;&#26032;&#12375;&#12383;&#22580;&#21512;&#12434;&#38500;&#12356;&#12390;&#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#26360;&#12365;&#36796;&#12415;&#12434;&#12375;&#12414;&#12379;&#12435;&#12290; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">CacheMode.PUT</code> - &#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#12450;&#12452;&#12486;&#12512;&#12434;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12364;&#12289;&#35501;&#12415;&#36796;&#12415;&#12395;&#12399; &#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20351;&#12356;&#12414;&#12379;&#12435;&#12290; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">CacheMode.REFRESH</code> - &#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#12450;&#12452;&#12486;&#12512;&#12434;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12364;&#12289;&#35501;&#12415;&#36796;&#12415;&#12395;&#12399; &#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20351;&#12431;&#12378;&#12289; <code class="literal">hibernate.cache.use_minimal_puts</code> &#12398;&#24433;&#38911;&#12434;&#21463;&#12369;&#12378;&#12395;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#35501;&#12415;&#36796;&#12416;&#12377;&#12409;&#12390;&#12398;&#12450;&#12452;&#12486;&#12512;&#12398;&#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#24375;&#21046;&#30340;&#12395;&#12522;&#12501;&#12524;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;&#12290; 
                  </p>
               </li>
            </ul>
         </div>
         <p>&#20108;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#20869;&#23481;&#12420;&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#38936;&#22495;&#12434;&#35211;&#12427;&#12383;&#12417;&#12395;&#12289; <code class="literal">Statistics</code> API&#12434; &#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
         </p><pre class="programlisting">Map cacheEntries = sessionFactory.getStatistics()
        .getSecondLevelCacheStatistics(regionName)
        .getEntries();</pre><p>&#32113;&#35336;&#24773;&#22577;&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12289;&#12373;&#12425;&#12395;&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#12375;&#12390;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12456;&#12531;&#12488;&#12522;&#12434; &#20154;&#12364;&#12424;&#12426;&#29702;&#35299;&#21487;&#33021;&#12394;&#24418;&#24335;&#12391;&#20445;&#25345;&#12377;&#12427;&#12371;&#12392;&#12434;Hibernate&#12395;&#24375;&#21046;&#12375;&#12414;&#12377;&#12290; </p><pre class="programlisting">hibernate.generate_statistics true
hibernate.cache.use_structured_entries true</pre></div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="performance-cache.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="performance.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="performance-querycache.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">19.2. &#31532;2&#12524;&#12505;&#12523;&#12461;&#12515;&#12483;&#12471;&#12517;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;19.4. &#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;</td>
            </tr>
         </table>
      </div>
   </body>
</html>