<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;4&#31456; &#27704;&#32154;&#12463;&#12521;&#12473;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="configuration-j2ee.html" title="3.8. J2EE&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12540;&#12496;&#12392;&#12398;&#32113;&#21512;">
      <link rel="next" href="persistent-classes-inheritance.html" title="4.2. &#32153;&#25215;&#12398;&#23455;&#35013;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;4&#31456; &#27704;&#32154;&#12463;&#12521;&#12473;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="configuration-j2ee.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="persistent-classes-inheritance.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="persistent-classes"></a>&#31532;4&#31456; &#27704;&#32154;&#12463;&#12521;&#12473;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#27704;&#32154;&#12463;&#12521;&#12473;&#12399;&#12499;&#12472;&#12493;&#12473;&#19978;&#12398;&#21839;&#38988;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#65288;&#20363;&#12360;&#12400;&#12289;E&#12467;&#12510;&#12540;&#12473;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#39015;&#23458;&#12420;&#27880;&#25991;&#65289; &#12434;&#23455;&#35013;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290; &#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#27704;&#32154;&#29366;&#24907;&#12391;&#12354;&#12427;&#12392;&#35211;&#12394;&#12373;&#12428;&#12427;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#36870;&#12395;&#19968;&#26178;&#30340;&#65288;transient&#65289;&#12391;&#12354;&#12387;&#12383;&#12426;&#12289;&#20998;&#38626;&#29366;&#24907;&#65288;detached&#65289;&#12391;&#12354;&#12387;&#12383;&#12426;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
            
         </p>
         <p>Plain Old Java Object (POJO)&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12514;&#12487;&#12523;&#12392;&#12375;&#12390;&#12418;&#30693;&#12425;&#12428;&#12427; &#12356;&#12367;&#12388;&#12363;&#12398;&#21336;&#32020;&#12394;&#12523;&#12540;&#12523;&#12395;&#24467;&#12358;&#12394;&#12425;&#12289;Hibernate&#12399;&#26368;&#12418;&#12424;&#12367;&#20685;&#12365;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12371;&#12428;&#12425;&#12398;&#12523;&#12540;&#12523;&#12399;&#38627;&#12375;&#12356;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#23455;&#38555;Hibernate3&#12399;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#24615;&#36074;&#12395;&#12411;&#12392;&#12435;&#12393;&#20309;&#12398;&#21069;&#25552;&#12418;&#32622;&#12356;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
            &#12489;&#12513;&#12452;&#12531;&#12514;&#12487;&#12523;&#12399;&#20182;&#12398;&#26041;&#27861;&#12391;&#34920;&#29694;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400; <code class="literal">Map</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12484;&#12522;&#12540;&#12434;&#20351;&#12358;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
         </p>
         <div class="sect1" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="persistent-classes-pojo"></a>4.1. &#21336;&#32020;&#12394;POJO&#12398;&#20363;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#12411;&#12392;&#12435;&#12393;&#12398;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12399;&#12493;&#12467;&#31185;&#12398;&#21205;&#29289;&#12434;&#34920;&#29694;&#12377;&#12427;&#27704;&#32154;&#12463;&#12521;&#12473;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290; </p><pre class="programlisting">package eg;
import java.util.Set;
import java.util.Date;

public class Cat {
    private Long id; // identifier

    private Date birthdate;
    private Color color;
    private char sex;
    private float weight;
    private int litterId;

    private Cat mother;
    private Set kittens = new HashSet();

    private void setId(Long id) {
        this.id=id;
    }
    public Long getId() {
        return id;
    }

    void setBirthdate(Date date) {
        birthdate = date;
    }
    public Date getBirthdate() {
        return birthdate;
    }

    void setWeight(float weight) {
        this.weight = weight;
    }
    public float getWeight() {
        return weight;
    }

    public Color getColor() {
        return color;
    }
    void setColor(Color color) {
        this.color = color;
    }

    void setSex(char sex) {
        this.sex=sex;
    }
    public char getSex() {
        return sex;
    }

    void setLitterId(int id) {
        this.litterId = id;
    }
    public int getLitterId() {
        return litterId;
    }

    void setMother(Cat mother) {
        this.mother = mother;
    }
    public Cat getMother() {
        return mother;
    }
    void setKittens(Set kittens) {
        this.kittens = kittens;
    }
    public Set getKittens() {
        return kittens;
    }
    
    // addKitten not needed by Hibernate
    public void addKitten(Cat kitten) {
            kitten.setMother(this);
        kitten.setLitterId( kittens.size() ); 
        kittens.add(kitten);
    }
}</pre><p>&#24467;&#12358;&#12409;&#12365;4&#12388;&#12398;&#12523;&#12540;&#12523;&#12364;&#12354;&#12426;&#12414;&#12377;&#65306; </p>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="persistent-classes-pojo-constructor"></a>4.1.1. &#24341;&#25968;&#12398;&#12394;&#12356;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12434;&#23455;&#35013;&#12377;&#12427;
                        </h3>
                     </div>
                  </div>
               </div>
               <p><code class="literal">Cat</code> &#12395;&#12399;&#24341;&#25968;&#12398;&#12394;&#12356;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; Hibernate&#12364; <code class="literal">Constructor.newInstance()</code> &#12434;&#20351;&#12387;&#12390;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398; &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12434;&#34892;&#12360;&#12427;&#12424;&#12358;&#12395;&#12289;&#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12395;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479; &#65288;public&#12391;&#12394;&#12367;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#65289;&#12364;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; Hibernate&#12398;&#23455;&#34892;&#26178;&#12503;&#12525;&#12461;&#12471;&#29983;&#25104;&#12398;&#12383;&#12417;&#12395;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418; <span class="emphasis"><em>package</em></span> &#12398;&#21487;&#35222;&#24615;&#12434;&#25345;&#12388;&#12487;&#12501;&#12457;&#12523;&#12488;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12434;&#24375;&#12367;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="persistent-classes-pojo-identifier"></a>4.1.2. &#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#29992;&#24847;&#12377;&#12427;&#65288;&#12458;&#12503;&#12471;&#12519;&#12531;&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p><code class="literal">Cat</code> &#12395;&#12399; <code class="literal">id</code> &#12392;&#12356;&#12358;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12486;&#12540;&#12502;&#12523;&#12398;&#20027;&#12461;&#12540;&#12459;&#12521;&#12512;&#12408;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12399;&#20309;&#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12375;&#12289;&#22411;&#12399;&#12393;&#12398;&#12424;&#12358;&#12394;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#22411;&#12391;&#12418;&#12289; &#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#12398;&#12300;&#12521;&#12483;&#12497;&#12540;&#12301;&#22411;&#12391;&#12418;&#12289;<code class="literal">java.lang.String</code> &#12420; <code class="literal">java.util.Date</code> &#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290; &#65288;&#12418;&#12375;&#12524;&#12460;&#12471;&#12540;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12486;&#12540;&#12502;&#12523;&#12364;&#35079;&#21512;&#12461;&#12540;&#12434;&#25345;&#12388;&#12394;&#12425;&#12400;&#12289; &#20170;&#36848;&#12409;&#12383;&#12424;&#12358;&#12394;&#22411;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12388;&#12518;&#12540;&#12470;&#23450;&#32681;&#12398;&#12463;&#12521;&#12473;&#12434;&#20351;&#12358;&#12371;&#12392;&#12373;&#12360;&#21487;&#33021;&#12391;&#12377;&#12290; &#24460;&#12391;&#35079;&#21512;&#35672;&#21029;&#23376;&#12398;&#31680;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#65289; 
               </p>
               <p>&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#21427;&#23494;&#12395;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290; &#12371;&#12428;&#12434;&#30465;&#30053;&#12375;&#12390;&#12289;Hibernate&#12395;&#20869;&#37096;&#30340;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12434;&#36861;&#36321;&#12373;&#12379;&#12427;&#12371;&#12392;&#12399;&#21487;&#33021;&#12391;&#12377;&#12290; &#12375;&#12363;&#12375;&#12362;&#12377;&#12377;&#12417;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290; </p>
               <p>&#23455;&#38555;&#12395;&#12289;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23459;&#35328;&#12377;&#12427;&#12463;&#12521;&#12473;&#12384;&#12369;&#12364;&#21033;&#29992;&#21487;&#33021;&#12394;&#27231;&#33021;&#12364;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#65306; </p>
               <div class="itemizedlist">
                  <ul type="disc" compact>
                     <li>
                        <p>Transitive reattachment for detached objects (cascade update or cascade merge) - see <a href="objectstate-transitive.html" title="10.11. &#36899;&#37782;&#30340;&#12394;&#27704;&#32154;&#21270;">&#38917;10.11. &#12300;&#36899;&#37782;&#30340;&#12394;&#27704;&#32154;&#21270;&#12301;</a> 
                        </p>
                     </li>
                     <li>
                        <p>
                                                   <code class="literal">Session.saveOrUpdate()</code>
                                               
                        </p>
                     </li>
                     <li>
                        <p>
                                                   <code class="literal">Session.merge()</code>
                                               
                        </p>
                     </li>
                  </ul>
               </div>
               <p>&#27704;&#32154;&#12463;&#12521;&#12473;&#12395;&#12399;&#12289;&#19968;&#36011;&#12375;&#12383;&#21517;&#21069;&#12398;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290; &#12373;&#12425;&#12395;null&#20516;&#12434;&#21462;&#12428;&#12427;(&#12388;&#12414;&#12426;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#12391;&#12399;&#12394;&#12356;)&#22411;&#12434;&#20351;&#12387;&#12383;&#26041;&#12364;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290; </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="persistent-classes-pojo-final"></a>4.1.3. final&#12463;&#12521;&#12473;&#12395;&#12375;&#12394;&#12356;&#65288;&#12458;&#12503;&#12471;&#12519;&#12531;&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Hibernate&#12398;&#20013;&#24515;&#30340;&#12394;&#29305;&#24500;&#12391;&#12354;&#12427; <span class="emphasis"><em>&#12503;&#12525;&#12461;&#12471;</em></span> &#12399;&#12289; &#27704;&#32154;&#12463;&#12521;&#12473;&#12364;final&#12391;&#12394;&#12356;&#12371;&#12392;&#12289;&#12414;&#12383;&#12399;&#12513;&#12477;&#12483;&#12489;&#12434;&#20840;&#37096;public&#12391;&#23459;&#35328;&#12375;&#12390;&#12356;&#12427; &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12364;&#23455;&#35013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; 
               </p>
               <p>Hibernate&#12391;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12375;&#12390;&#12356;&#12394;&#12356; <code class="literal">final</code> &#12463;&#12521;&#12473;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289; &#36933;&#24310;&#38306;&#36899;&#12501;&#12455;&#12483;&#12481;&#12395;&#23550;&#12375;&#12390;&#12503;&#12525;&#12461;&#12471;&#12434;&#20351;&#12358;&#12371;&#12392;&#12399;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12481;&#12517;&#12540;&#12491;&#12531;&#12464;&#12408;&#12398;&#36984;&#25246;&#32930;&#12434;&#29421;&#12417;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; 
               </p>
               <p>final&#12391;&#12399;&#12394;&#12356;&#12463;&#12521;&#12473;&#12391; <code class="literal">public final</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12418;&#36991;&#12369;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290; <code class="literal">public final</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#25345;&#12388;&#12463;&#12521;&#12473;&#12434;&#20351;&#12356;&#12383;&#12369;&#12428;&#12400;&#12289; <code class="literal">lazy="false"</code> &#12392;&#35373;&#23450;&#12375;&#12390;&#26126;&#31034;&#30340;&#12395;&#12503;&#12525;&#12461;&#12471;&#12434;&#28961;&#21177;&#12395;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="persistent-classes-pojo-accessors"></a>4.1.4. &#27704;&#32154;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#23550;&#12377;&#12427;&#12450;&#12463;&#12475;&#12469;&#12392;&#12511;&#12517;&#12540;&#12486;&#12540;&#12479;&#12434;&#23450;&#32681;&#12377;&#12427;&#65288;&#12458;&#12503;&#12471;&#12519;&#12531;&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p><code class="literal">Cat</code> &#12391;&#12399;&#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#23550;&#12375;&#12390;&#12450;&#12463;&#12475;&#12469;&#12513;&#12477;&#12483;&#12489;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#20182;&#12398;&#22810;&#12367;&#12398;ORM&#12484;&#12540;&#12523;&#12399;&#12289;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#12434;&#30452;&#25509;&#27704;&#32154;&#21270;&#12375;&#12414;&#12377;&#12290; &#31169;&#12383;&#12385;&#12399;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12473;&#12461;&#12540;&#12510;&#12392;&#12463;&#12521;&#12473;&#12398;&#20869;&#37096;&#27083;&#36896;&#12434;&#20998;&#38626;&#12377;&#12427;&#26041;&#12364;&#33391;&#12356;&#12392;&#20449;&#12376;&#12390;&#12356;&#12414;&#12377;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;Hibernate&#12399;JavaBean&#12473;&#12479;&#12452;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27704;&#32154;&#21270;&#12375;&#12289;
                  <code class="literal">getFoo</code>, <code class="literal">isFoo</code>, <code class="literal">setFoo</code> &#24418;&#24335;&#12398;&#12513;&#12477;&#12483;&#12489;&#21517;&#12434;&#35469;&#35672;&#12375;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#24517;&#35201;&#12394;&#12425;&#12289;&#29305;&#23450;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#23550;&#12375;&#12390;&#12289;&#30452;&#25509;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12450;&#12463;&#12475;&#12473;&#12395;&#20999;&#12426;&#26367;&#12360;&#12427;&#12371;&#12392;&#12399;&#21487;&#33021;&#12391;&#12377;&#12290; 
               </p>
               <p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;public&#12391;&#23459;&#35328;&#12377;&#12427;&#24517;&#35201;&#12399; <span class="emphasis"><em>&#12354;&#12426;&#12414;&#12379;&#12435;</em></span> &#12290; Hibernate&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12289;<code class="literal">protected</code> &#12418;&#12375;&#12367;&#12399; <code class="literal">private</code> &#12398;get / set&#12398;&#12506;&#12450;&#12434;&#25345;&#12388;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="configuration-j2ee.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="persistent-classes-inheritance.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">3.8. J2EE&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12540;&#12496;&#12392;&#12398;&#32113;&#21512;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;4.2. &#32153;&#25215;&#12398;&#23455;&#35013;</td>
            </tr>
         </table>
      </div>
   </body>
</html>