<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>4.3. equals() &#12392; hashCode() &#12398;&#23455;&#35013;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="persistent-classes.html" title="&#31532;4&#31456; &#27704;&#32154;&#12463;&#12521;&#12473;">
      <link rel="prev" href="persistent-classes-inheritance.html" title="4.2. &#32153;&#25215;&#12398;&#23455;&#35013;">
      <link rel="next" href="persistent-classes-dynamicmodels.html" title="4.4. &#21205;&#30340;&#12514;&#12487;&#12523;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">4.3. <code class="literal">equals()</code> &#12392; <code class="literal">hashCode()</code> &#12398;&#23455;&#35013;
               </th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="persistent-classes-inheritance.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;4&#31456; &#27704;&#32154;&#12463;&#12521;&#12473;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="persistent-classes-dynamicmodels.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="persistent-classes-equalshashcode"></a>4.3. <code class="literal">equals()</code> &#12392; <code class="literal">hashCode()</code> &#12398;&#23455;&#35013;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#20197;&#19979;&#12398;&#26465;&#20214;&#12398;&#22580;&#21512;&#12289; <code class="literal">equals()</code> &#12392; <code class="literal">hashCode()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12289; 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434; <code class="literal">Set</code> &#12395;&#32622;&#12367;&#22580;&#21512;&#12290; &#65288;&#12371;&#12428;&#12399;&#22810;&#20516;&#12398;&#38306;&#36899;&#12434;&#34920;&#29694;&#12377;&#12427;&#12362;&#12377;&#12377;&#12417;&#12398;&#26041;&#27861;&#12391;&#12377;&#65289; <span class="emphasis"><em>&#12381;&#12375;&#12390;&#21516;&#26178;&#12395;</em></span> 
                  </p>
               </li>
               <li>
                  <p>&#20998;&#38626;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12475;&#12483;&#12471;&#12519;&#12531;&#12408;&#20877;&#36861;&#21152;&#12377;&#12427;&#22580;&#21512;&#12290; </p>
               </li>
            </ul>
         </div>
         <p>Hibernate&#12399;&#12289;&#27704;&#32154;ID&#65288;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#34892;&#65289;&#12392;&#12289;&#29305;&#23450;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12473;&#12467;&#12540;&#12503;&#20869;&#12395; &#38480;&#23450;&#12391;&#12377;&#12364;JavaID&#12392;&#12364;&#31561;&#20385;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12375;&#12414;&#12377;&#12290; &#12391;&#12377;&#12363;&#12425;&#30064;&#12394;&#12427;&#12475;&#12483;&#12471;&#12519;&#12531;&#12391;&#26908;&#32034;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12427;&#22580;&#21512;&#12289; <code class="literal">Set</code> &#12395;&#24847;&#21619;&#12398;&#12354;&#12427;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#25345;&#12383;&#12379;&#12424;&#12358;&#12392;&#24605;&#12387;&#12390;&#12356;&#12427;&#12394;&#12425; &#12377;&#12368;&#12395;<code class="literal">equals()</code> &#12392; <code class="literal">hashCode()</code> &#12434;&#23455;&#35013;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; 
         </p>
         <p>&#26368;&#12418;&#26126;&#30333;&#12394;&#26041;&#27861;&#12399;&#12289;&#20001;&#26041;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12398;&#20516;&#12398;&#27604;&#36611;&#12395;&#12424;&#12387;&#12390; <code class="literal">equals()</code>&#12392; <code class="literal">hashCode()</code> &#12434;&#23455;&#35013;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#12290; &#20516;&#12364;&#21516;&#12376;&#12394;&#12425;&#12289;&#20001;&#32773;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#21516;&#12376;&#34892;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12383;&#12417;&#31561;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290; &#65288;&#20001;&#32773;&#12364; <code class="literal">Set</code> &#12395;&#36861;&#21152;&#12373;&#12428;&#12390;&#12418;&#12289; <code class="literal">Set</code> &#12395;&#12399;1&#20491;&#12398;&#35201;&#32032;&#12375;&#12363;&#12394;&#12356;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#65289; &#27531;&#24565;&#12394;&#12371;&#12392;&#12395;&#12289;&#29983;&#25104;&#12373;&#12428;&#12383;&#35672;&#21029;&#23376;&#12395;&#12399;&#12371;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; Hibernate&#12399;&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#35672;&#21029;&#23376;&#12398;&#20516;&#12434;&#20195;&#20837;&#12377;&#12427;&#12384;&#12369;&#12391;&#12354;&#12426;&#12289; &#26032;&#12375;&#12367;&#20316;&#25104;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12393;&#12398;&#12424;&#12358;&#12394;&#35672;&#21029;&#23376;&#12398;&#20516;&#12418;&#25345;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
            &#12373;&#12425;&#12395;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12475;&#12540;&#12502;&#12373;&#12428;&#12390;&#12362;&#12425;&#12378;&#12289;&#29694;&#22312; <code class="literal">Set</code> &#12398;&#20013;&#12395;&#12354;&#12428;&#12400;&#12289; &#12475;&#12540;&#12502;&#12377;&#12427;&#12392;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#35672;&#21029;&#23376;&#12398;&#20516;&#12434;&#20195;&#20837;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12418;&#12375; <code class="literal">equals()</code> &#12392; <code class="literal">hashCode()</code> &#12364;&#35672;&#21029;&#23376;&#12398;&#20516;&#12395;&#22522;&#12389;&#12356;&#12390;&#12356;&#12427;&#12394;&#12425;&#12289; &#12495;&#12483;&#12471;&#12517;&#12467;&#12540;&#12489;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12392; <code class="literal">Set</code> &#12398;&#35215;&#32004;&#12364;&#30772;&#12425;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12398;&#23436;&#20840;&#12394;&#35696;&#35542;&#12399;&#12289;Hibernate&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12428;&#12399;Hibernate&#12398;&#21839;&#38988;&#12391;&#12399;&#12394;&#12367;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21516;&#19968;&#24615;&#12392;&#31561;&#20385;&#24615;&#12395;&#12388;&#12356;&#12390;&#12398;&#12289; &#36890;&#24120;&#12398;Java&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            
         </p>
         <p><span class="emphasis"><em>&#12499;&#12472;&#12493;&#12473;&#12461;&#12540;&#12398;&#31561;&#20385;&#24615;</em></span> &#12434;&#20351;&#12387;&#12390;&#12289; <code class="literal">equals()</code> &#12392; <code class="literal">hashCode()</code> &#12434;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290; &#12499;&#12472;&#12493;&#12473;&#12461;&#12540;&#12398;&#31561;&#20385;&#24615;&#12392;&#12399;&#12289;<code class="literal">equals()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#12289;&#12499;&#12472;&#12493;&#12473;&#12461;&#12540;&#12289; &#12388;&#12414;&#12426;&#29694;&#23455;&#12398;&#19990;&#30028;&#12395;&#12362;&#12356;&#12390;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#29305;&#23450;&#12377;&#12427;&#12461;&#12540;&#65288;<span class="emphasis"><em>&#33258;&#28982;</em></span> &#20505;&#35036;&#12461;&#12540;&#65289; &#12434;&#24418;&#25104;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12384;&#12369;&#12434;&#27604;&#36611;&#12377;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">public class Cat {

    ...
    public boolean equals(Object other) {
        if (this == other) return true;
        if ( !(other instanceof Cat) ) return false;

        final Cat cat = (Cat) other;

        if ( !cat.getLitterId().equals( getLitterId() ) ) return false;
        if ( !cat.getMother().equals( getMother() ) ) return false;

        return true;
    }

    public int hashCode() {
        int result;
        result = getMother().hashCode();
        result = 29 * result + getLitterId();
        return result;
    }

}</pre><p>&#12499;&#12472;&#12493;&#12473;&#12461;&#12540;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#20027;&#12461;&#12540;&#20505;&#35036;&#12411;&#12393;&#23433;&#23450;&#12391;&#12354;&#12427;&#24517;&#35201;&#12399;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356; &#65288;<a href="transactions.html#transactions-basics-identity" title="11.1.3. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#35672;&#21029;&#23376;&#12434;&#32771;&#12360;&#12427;">&#38917;11.1.3. &#12300;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#35672;&#21029;&#23376;&#12434;&#32771;&#12360;&#12427;&#12301;</a> &#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12290; &#26356;&#26032;&#19981;&#21487;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12420;&#12518;&#12491;&#12540;&#12463;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#36890;&#24120;&#12499;&#12472;&#12493;&#12473;&#12461;&#12540;&#12398;&#12424;&#12356;&#20505;&#35036;&#12391;&#12377;&#12290; 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="persistent-classes-inheritance.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="persistent-classes.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="persistent-classes-dynamicmodels.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">4.2. &#32153;&#25215;&#12398;&#23455;&#35013;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;4.4. &#21205;&#30340;&#12514;&#12487;&#12523;</td>
            </tr>
         </table>
      </div>
   </body>
</html>