<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#21069;&#26360;&#12365;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="next" href="tutorial.html" title="&#31532;1&#31456; Hibernate&#12398;&#23566;&#20837;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#21069;&#26360;&#12365;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="index.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="tutorial.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="preface" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="preface"></a>&#21069;&#26360;&#12365;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#20170;&#26085;&#12398;&#20225;&#26989;&#29872;&#22659;&#12395;&#12362;&#12356;&#12390;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#38306;&#12431;&#12427;&#20316;&#26989;&#12399; &#29033;&#38609;&#12391;&#33192;&#22823;&#12394;&#26178;&#38291;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290; Hibernate&#12399;Java&#29872;&#22659;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12510;&#12483;&#12500;&#12531;&#12464;&#12484;&#12540;&#12523;&#12391;&#12377;&#12290; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12510;&#12483;&#12500;&#12531;&#12464;&#65288;ORM&#65289;&#12392;&#12399;&#12289;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12514;&#12487;&#12523;&#12363;&#12425;SQL&#12505;&#12540;&#12473;&#12473;&#12461;&#12540;&#12510;&#12398;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12487;&#12540;&#12479;&#12514;&#12487;&#12523;&#12408;&#12392;&#12289; &#12487;&#12540;&#12479;&#34920;&#29694;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#65288;&#23550;&#24540;&#20184;&#12369;&#12427;&#65289;&#25216;&#34899;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290; 
         </p>
         <p>Hibernate&#12399;Java&#12463;&#12521;&#12473;&#12363;&#12425;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12486;&#12540;&#12502;&#12523;&#12408;&#65288;&#12381;&#12375;&#12390;Java&#12487;&#12540;&#12479;&#22411;&#12363;&#12425;SQL&#12487;&#12540;&#12479;&#22411;&#12408;&#65289; &#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#20966;&#29702;&#12377;&#12427;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;&#12487;&#12540;&#12479;&#12398;&#12463;&#12456;&#12522;&#12392;&#24489;&#20803;&#12398;&#20181;&#32068;&#12415;&#12418;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12362;&#12363;&#12370;&#12391;SQL&#12392;JDBC&#12434;&#20351;&#12387;&#12383;&#25163;&#20316;&#26989;&#12391;&#12398;&#12487;&#12540;&#12479;&#20966;&#29702;&#12395;&#36027;&#12420;&#12373;&#12428;&#12390;&#12356;&#12383;&#38283;&#30330;&#26178;&#38291;&#12434;&#22823;&#24133;&#12395;&#21066;&#28187;&#12391;&#12365;&#12414;&#12377;&#12290;
            
         </p>
         <p>Hibernate&#12398;&#26368;&#32066;&#30446;&#27161;&#12399;&#12289;&#12487;&#12540;&#12479;&#12398;&#27704;&#32154;&#21270;&#12395;&#38306;&#12431;&#12427;&#19968;&#33324;&#30340;&#12394;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20316;&#26989;&#12398;95&#65285;&#12363;&#12425;&#38283;&#30330;&#32773;&#12434;&#35299;&#25918;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290; Hibernate&#12399;&#12499;&#12472;&#12493;&#12473;&#12525;&#12472;&#12483;&#12463;&#12398;&#23455;&#35013;&#12395;&#12473;&#12488;&#12450;&#12489;&#12503;&#12525;&#12471;&#12540;&#12472;&#12515;&#12434;&#20351;&#12358; &#12487;&#12540;&#12479;&#20013;&#24515;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12398;&#12505;&#12473;&#12488;&#12477;&#12522;&#12517;&#12540;&#12471;&#12519;&#12531;&#12391;&#12354;&#12427;&#12395;&#30041;&#12414;&#12426;&#12414;&#12379;&#12435;&#12290;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12489;&#12513;&#12452;&#12531;&#12514;&#12487;&#12523;&#12392;Java&#12505;&#12540;&#12473;&#12398;&#20013;&#38291;&#23652;&#12391;&#12398;&#12499;&#12472;&#12493;&#12473;&#12525;&#12472;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;&#26368;&#12418;&#24441;&#12395;&#31435;&#12385;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;Hibernate&#12399;&#12505;&#12531;&#12480;&#22266;&#26377;&#12398;SQL&#12467;&#12540;&#12489;&#12434;&#21066;&#28187;&#12414;&#12383;&#12399;&#12459;&#12503;&#12475;&#12523;&#21270;&#12375;&#12383;&#12426;&#12289; &#34920;&#24418;&#24335;&#12363;&#12425;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12464;&#12521;&#12501;&#12408;&#12392;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12434;&#22793;&#25563;&#12377;&#12427;&#12394;&#12393;&#12398;&#12289;
            &#19968;&#33324;&#30340;&#12394;&#12479;&#12473;&#12463;&#12395;&#12418;&#24441;&#31435;&#12388;&#12391;&#12375;&#12423;&#12358;&#12290; 
         </p>
         <p>Hibernate&#12420;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12510;&#12483;&#12500;&#12531;&#12464;&#12289; &#12373;&#12425;&#12395;&#12399;Java&#12364;&#21021;&#12417;&#12390;&#12398;&#26041;&#12399;&#12289;&#20197;&#19979;&#12398;&#12473;&#12486;&#12483;&#12503;&#12395;&#24467;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#65306; </p>
         <div class="orderedlist">
            <ol type="1">
               <li>
                  <p><a href="tutorial.html" title="&#31532;1&#31456; Hibernate&#12398;&#23566;&#20837;">&#31456;&nbsp;1. <i xmlns:xlink="http://www.w3.org/1999/xlink">Hibernate&#12398;&#23566;&#20837;</i></a> &#12434;&#35501;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#27573;&#38542;&#30340;&#12395;&#35299;&#35500;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290; &#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12399;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398; <code class="literal">doc/reference/tutorial</code> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p><a href="architecture.html" title="&#31532;2&#31456; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;">&#31456;&nbsp;2. <i xmlns:xlink="http://www.w3.org/1999/xlink">&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;</i></a> &#12434;&#35501;&#12435;&#12391;&#12289;Hibernate&#12364;&#21033;&#29992;&#21487;&#33021;&#12394;&#29872;&#22659;&#12434;&#29702;&#35299;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </li>
               <li>
                  <p>Hibernate&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398; <code class="literal">eg/</code> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#31777;&#21336;&#12394;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12540;&#12531;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; JDBC&#12489;&#12521;&#12452;&#12496;&#12434; <code class="literal">lib/</code> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12467;&#12500;&#12540;&#12375;&#12390;&#12289; &#33258;&#20998;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#21512;&#12358;&#27491;&#12375;&#12356;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12424;&#12358;&#12395; <code class="literal">etc/hibernate.properties</code> &#12434;&#32232;&#38598;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12363;&#12425;&#12289;&#12467;&#12510;&#12531;&#12489;&#12503;&#12525;&#12531;&#12503;&#12488;&#12391; <code class="literal">ant eg</code> &#12392;&#12479;&#12452;&#12503;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65288;Ant&#12434;&#20351;&#12356;&#12414;&#12377;&#65289;&#12290; &#12414;&#12383;Windows&#29872;&#22659;&#12391;&#12399; <code class="literal">build eg</code> &#12392;&#12479;&#12452;&#12503;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </li>
               <li>
                  <p>&#12371;&#12398;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#31532;&#19968;&#12398;&#24773;&#22577;&#28304;&#12392;&#12375;&#12390;&#21033;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35373;&#35336;&#12395;&#12388;&#12356;&#12390;&#12398;&#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#12420;&#27573;&#38542;&#30340;&#12394;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12434;&#25506;&#12375;&#12390;&#12356;&#12427;&#12394;&#12425;&#12289; <span class="emphasis"><em>Java Persistence with Hibernate</em></span>&#65288;http://www.manning.com/bauer2&#65289; &#12434;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290; &#12414;&#12383;http://caveatemptor.hibernate.org&#12363;&#12425; Java Persistence with Hibernate&#12398;&#20363;&#38988;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;
                     
                  </p>
               </li>
               <li>
                  <p>FAQ&#12399;Hibernate&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12398;&#12487;&#12514;&#12289;&#20363;&#12289;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12399;Hibernate&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#12522;&#12531;&#12463;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; </p>
               </li>
               <li>
                  <p>Hibernate&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12456;&#12522;&#12450;&#12399;&#12289;&#12487;&#12470;&#12452;&#12531;&#12497;&#12479;&#12540;&#12531;&#12420;&#12373;&#12414;&#12374;&#12414;&#12394;&#32113;&#21512;&#12477;&#12522;&#12517;&#12540;&#12471;&#12519;&#12531; &#65288;Tomcat, JBoss AS, Struts, EJB, &#31561;&#65289;&#12395;&#12388;&#12356;&#12390;&#12398;&#12424;&#12356;&#24773;&#22577;&#28304;&#12391;&#12377;&#12290; </p>
               </li>
            </ol>
         </div>
         <p>&#36074;&#21839;&#12364;&#12354;&#12428;&#12400;Hibernate&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#12518;&#12540;&#12470;&#12501;&#12457;&#12540;&#12521;&#12512;&#12434;&#27963;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12414;&#12383;&#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12392;&#12501;&#12451;&#12540;&#12481;&#12515;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12383;&#12417;JIRA&#35506;&#38988;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; Hibernate&#12398;&#38283;&#30330;&#12395;&#33288;&#21619;&#12364;&#12354;&#12428;&#12400;&#12289;&#38283;&#30330;&#32773;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            &#12371;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#12354;&#12394;&#12383;&#12398;&#22269;&#12398;&#35328;&#33865;&#12395;&#32763;&#35379;&#12375;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289; &#38283;&#30330;&#32773;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#31169;&#12383;&#12385;&#12395;&#12467;&#12531;&#12479;&#12463;&#12488;&#12434;&#21462;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
         </p>
         <p>&#21830;&#29992;&#38283;&#30330;&#12398;&#12469;&#12509;&#12540;&#12488;&#12289;&#35069;&#21697;&#12398;&#12469;&#12509;&#12540;&#12488;&#12289;Hibernate&#12398;&#12488;&#12524;&#12540;&#12491;&#12531;&#12464;&#12399;JBoss Inc.&#12364;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377; &#65288;http://www.hibernate.org/SupportTraining/&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12290; Hibernate&#12399;Professional
            Open Source&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12289; &#12381;&#12375;&#12390;JBoss Enterprise Middleware System&#65288;JEMS&#65289;&#12503;&#12525;&#12480;&#12463;&#12488;&#12473;&#12452;&#12540;&#12488;&#12398;&#12463;&#12522;&#12486;&#12451;&#12459;&#12523;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12391;&#12377;&#12290; 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="index.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="tutorial.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">HIBERNATE - Relational Persistence for Idiomatic Java&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;&#31532;1&#31456; Hibernate&#12398;&#23566;&#20837;</td>
            </tr>
         </table>
      </div>
   </body>
</html>