<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>14.9. where&#31680;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="queryhql.html" title="&#31532;14&#31456; HQL: The Hibernate Query Language">
      <link rel="prev" href="queryhql-polymorphism.html" title="14.8. &#12509;&#12522;&#12514;&#12540;&#12501;&#12451;&#12483;&#12463;&#12394;&#12463;&#12456;&#12522;">
      <link rel="next" href="queryhql-expressions.html" title="14.10. Expressions &#24335;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">14.9. where&#31680;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="queryhql-polymorphism.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;14&#31456; HQL: The Hibernate Query Language</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="queryhql-expressions.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="queryhql-where"></a>14.9. where&#31680;
                  </h2>
               </div>
            </div>
         </div>
         <p><code class="literal">where</code> &#31680;&#12399;&#36820;&#12373;&#12428;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12473;&#12488;&#12434;&#32094;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#12418;&#12375;&#21029;&#21517;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;&#21517;&#21069;&#12391;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21442;&#29031;&#12375;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">from Cat where name='Fritz'</pre><p>&#12418;&#12375;&#21029;&#21517;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#20462;&#39166;&#21517;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; </p><pre class="programlisting">from Cat as cat where cat.name='Fritz'</pre><p>&#21517;&#21069;&#12364;'Fritz'&#12392;&#12356;&#12358; <code class="literal">Cat</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">select foo
from Foo foo, Bar bar
where foo.startDate = bar.date</pre><p>&#19978;&#12398;HQL&#12399;&#12289;<code class="literal">Foo</code> &#12398; <code class="literal">startDate</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#31561;&#12375;&#12356; <code class="literal">date</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12387;&#12383; <code class="literal">bar</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#12289; &#12377;&#12409;&#12390;&#12398; <code class="literal">Foo</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; &#12467;&#12531;&#12497;&#12454;&#12531;&#12489;&#12497;&#12473;&#24335;&#65288;&#20363;&#12360;&#12400;&#12300;cat.mate.name&#12301;&#65289;&#12399; <code class="literal">where</code> &#31680;&#12434;&#38750;&#24120;&#12395;&#24375;&#21147;&#12395;&#12375;&#12414;&#12377;&#12290;&#27880;&#30446;&#65306; 
         </p><pre class="programlisting">from Cat cat where cat.mate.name is not null</pre><p>&#12371;&#12398;&#12463;&#12456;&#12522;&#12399;&#12486;&#12540;&#12502;&#12523;&#32080;&#21512;&#65288;&#20869;&#37096;&#32080;&#21512;&#65289;&#12434;&#25345;&#12388;SQL&#12463;&#12456;&#12522;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290; &#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#26360;&#12367;&#12392;&#12289; </p><pre class="programlisting">from Foo foo
where foo.bar.baz.customer.address.city is not null</pre><p>&#12418;&#12375;&#19978;&#12398;&#12463;&#12456;&#12522;&#12434;&#35352;&#36848;&#12375;&#12383;&#12425;&#12463;&#12456;&#12522;&#20869;&#12395;4&#12388;&#12398;&#12486;&#12540;&#12502;&#12523;&#32080;&#21512;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;SQL&#12463;&#12456;&#12522;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290; </p>
         <p><code class="literal">=</code> &#28436;&#31639;&#23376;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12384;&#12369;&#12391;&#12394;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27604;&#36611;&#12377;&#12427;&#12383;&#12417;&#12395;&#12418;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;&#65306; 
         </p><pre class="programlisting">from Cat cat, Cat rival where cat.mate = rival.mate</pre><pre class="programlisting">select cat, mate
from Cat cat, Cat mate
where cat.mate = mate</pre><p><code class="literal">id</code> (&#23567;&#25991;&#23383;)&#12399;&#29305;&#21029;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#12354;&#12426;&#12289; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12518;&#12491;&#12540;&#12463;&#12394;&#35672;&#21029;&#23376;&#12434;&#21442;&#29031;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;(&#12373;&#12425;&#12395;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;) 
         </p><pre class="programlisting">from Cat as cat where cat.id = 123

from Cat as cat where cat.mate.id = 69</pre><p>2&#30058;&#30446;&#12398;&#12463;&#12456;&#12522;&#12399;&#21177;&#29575;&#30340;&#12391;&#12377;&#12290;&#12486;&#12540;&#12502;&#12523;&#32080;&#21512;&#12364;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#65281; </p>
         <p>&#12414;&#12383;&#35079;&#21512;&#35672;&#21029;&#23376;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12418;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391; <code class="literal">Person</code> &#12364; <code class="literal">country</code> &#12392; <code class="literal">medicareNumber</code> &#12363;&#12425;&#12394;&#12427;&#35079;&#21512;&#35672;&#21029;&#23376;&#12434;&#25345;&#12388;&#12392;&#20206;&#23450;&#12375;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">from bank.Person person
where person.id.country = 'AU'
    and person.id.medicareNumber = 123456</pre><pre class="programlisting">from bank.Account account
where account.owner.id.country = 'AU'
    and account.owner.id.medicareNumber = 123456</pre><p>&#12418;&#12358;&#19968;&#24230;&#35328;&#12356;&#12414;&#12377;&#12364;&#12289;2&#30058;&#30446;&#12398;&#12463;&#12456;&#12522;&#12395;&#12399;&#12486;&#12540;&#12502;&#12523;&#32080;&#21512;&#12364;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; </p>
         <p>&#21516;&#27096;&#12395; <code class="literal">class</code> &#12399;&#29305;&#21029;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#12354;&#12426;&#12289; &#12509;&#12522;&#12514;&#12540;&#12501;&#12451;&#12483;&#12463;&#12394;&#27704;&#32154;&#21270;&#12395;&#12362;&#12369;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;discriminator&#20516;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12414;&#12377;&#12290; where&#31680;&#12395;&#22475;&#12417;&#36796;&#12414;&#12428;&#12383;Java&#12398;&#12463;&#12521;&#12473;&#21517;&#12399;&#12381;&#12398;discriminator&#20516;&#12395;&#22793;&#25563;&#12373;&#12428;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">from Cat cat where cat.class = DomesticCat</pre><p>&#12414;&#12383;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12420;&#35079;&#21512;&#12518;&#12540;&#12470;&#22411;(&#12414;&#12383;&#12381;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12394;&#12393;)&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12418;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#27770;&#12375;&#12390;&#65288;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#12399;&#12394;&#12367;&#65289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#22411;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#32066;&#20102;&#12377;&#12427;&#12497;&#12473;&#24335;&#12434;&#20351;&#12431;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#20363;&#12360;&#12400;&#12418;&#12375; <code class="literal">store.owner</code> &#12364; <code class="literal">address</code> &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#25345;&#12388;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12394;&#12425;&#12400;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#32080;&#26524;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290; 
         </p>
         <p>"any"&#22411;&#12399;&#29305;&#21029;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#12354;&#12427; <code class="literal">id</code> &#12392; <code class="literal">class</code> &#12434;&#25345;&#12385;&#12289; &#20197;&#19979;&#12398;&#26041;&#27861;&#12391;&#32080;&#21512;&#12434;&#34920;&#29694;&#12377;&#12427;&#12371;&#12392;&#12434;&#21487;&#33021;&#12395;&#12375;&#12414;&#12377;(<code class="literal">AuditLog.item</code> &#12399; <code class="literal">&lt;any&gt;</code> &#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#12377;)&#12290; 
         </p><pre class="programlisting">from AuditLog log, Payment payment
where log.item.class = 'Payment' and log.item.id = payment.id</pre><p><code class="literal">log.item.class</code> &#12392; <code class="literal">payment.class</code> &#12364; &#19978;&#35352;&#12398;&#12463;&#12456;&#12522;&#20013;&#12391;&#20840;&#12367;&#30064;&#12394;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12459;&#12521;&#12512;&#12398;&#20516;&#12434;&#21442;&#29031;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="queryhql-polymorphism.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="queryhql.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="queryhql-expressions.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">14.8. &#12509;&#12522;&#12514;&#12540;&#12501;&#12451;&#12483;&#12463;&#12394;&#12463;&#12456;&#12522;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;14.10. Expressions &#24335;</td>
            </tr>
         </table>
      </div>
   </body>
</html>