<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;16&#31456; &#12493;&#12452;&#12486;&#12451;&#12502;SQL</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="query-criteria-naturalid.html" title="15.9. &#33258;&#28982;&#35672;&#21029;&#23376;&#12395;&#12424;&#12427;&#12463;&#12456;&#12522;">
      <link rel="next" href="querysql-namedqueries.html" title="16.2. &#21517;&#21069;&#20184;&#12365;SQL&#12463;&#12456;&#12522;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;16&#31456; &#12493;&#12452;&#12486;&#12451;&#12502;SQL</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="query-criteria-naturalid.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="querysql-namedqueries.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="querysql"></a>&#31532;16&#31456; &#12493;&#12452;&#12486;&#12451;&#12502;SQL
                  </h2>
               </div>
            </div>
         </div>
         <p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12493;&#12452;&#12486;&#12451;&#12502;SQL&#26041;&#35328;&#12434;&#20351;&#12387;&#12390;&#12463;&#12456;&#12522;&#12434;&#34920;&#29694;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#12463;&#12456;&#12522;&#12498;&#12531;&#12488;&#12420;Oracle&#12398; <code class="literal">CONNECT</code> &#12461;&#12540;&#12527;&#12540;&#12489;&#12398;&#12424;&#12358;&#12395;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#29420;&#33258;&#12398;&#27231;&#33021;&#12434;&#21033;&#29992;&#12375;&#12383;&#12356;&#12392;&#12365;&#12395;&#20351;&#12360;&#12414;&#12377;&#12290; SQL/JDBC&#12434;&#30452;&#25509;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;Hibernate&#12408;&#12398;&#31227;&#34892;&#12418;&#23481;&#26131;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
         </p>
         <p>Hibernate3&#12391;&#12399;&#12289;&#29983;&#25104;&#12289;&#26356;&#26032;&#12289;&#21066;&#38500;&#12289;&#35501;&#12415;&#36796;&#12415;&#20966;&#29702;&#12398;&#12424;&#12358;&#12394;&#12377;&#12409;&#12390;&#12398; SQL&#65288;&#12473;&#12488;&#12450;&#12489;&#12503;&#12525;&#12471;&#12540;&#12472;&#12515;&#12434;&#21547;&#12416;&#65289;&#12434;&#25163;&#26360;&#12365;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
         <div class="sect1" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="querysql-creating"></a>16.1. <code class="literal">SQLQuery</code> &#12398;&#20351;&#29992;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#12493;&#12452;&#12486;&#12451;&#12502;&#12394;SQL&#12463;&#12456;&#12522;&#12398;&#23455;&#34892;&#12399; <code class="literal">SQLQuery</code> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#36890;&#12375;&#12390;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290; <code class="literal">SQLQuery</code> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12399; <code class="literal">Session.createSQLQuery()</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;API&#12434;&#20351;&#12387;&#12390;&#21839;&#12356;&#21512;&#12431;&#12379;&#12377;&#12427;&#26041;&#27861;&#12434;&#20197;&#19979;&#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
            </p>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13065"></a>16.1.1. &#12473;&#12459;&#12521;&#12540;&#12398;&#12463;&#12456;&#12522;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#26368;&#12418;&#22522;&#26412;&#30340;&#12394;SQL&#12463;&#12456;&#12522;&#12399;&#12473;&#12459;&#12521;&#12540;&#65288;&#20516;&#65289;&#12398;&#12522;&#12473;&#12488;&#12434;&#24471;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;</p><pre class="programlisting">sess.createSQLQuery("SELECT * FROM CATS").list();
sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE FROM CATS").list();
</pre><p>&#12371;&#12428;&#12425;&#12399;&#12393;&#12385;&#12425;&#12418;&#12289;CATS&#12486;&#12540;&#12502;&#12523;&#12398;&#21508;&#12459;&#12521;&#12512;&#12398;&#12473;&#12459;&#12521;&#12540;&#20516;&#12434;&#21547;&#12416; Object&#37197;&#21015;&#65288;Object[]&#65289;&#12398;&#12522;&#12473;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; &#36820;&#12377;&#12473;&#12459;&#12521;&#12540;&#20516;&#12398;&#23455;&#38555;&#12398;&#38918;&#30058;&#12392;&#22411;&#12434;&#25512;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; Hibernate&#12399;ResultSetMetadata&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
               <p><code class="literal">ResultSetMetadata</code> &#12434;&#20351;&#29992;&#12377;&#12427;&#12458;&#12540;&#12496;&#12540;&#12504;&#12483;&#12489;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12289; &#12418;&#12375;&#12367;&#12399;&#21336;&#12395;&#20309;&#12364;&#36820;&#12373;&#12428;&#12427;&#12363;&#26126;&#30906;&#12395;&#12377;&#12427;&#12383;&#12417;&#12289;<code class="literal">addScalar()</code> &#12434;&#20351;&#12360;&#12414;&#12377;&#12290;
               </p><pre class="programlisting">sess.createSQLQuery("SELECT * FROM CATS")
 .addScalar("ID", Hibernate.LONG)
 .addScalar("NAME", Hibernate.STRING)
 .addScalar("BIRTHDATE", Hibernate.DATE)
</pre><p>&#12371;&#12398;&#12463;&#12456;&#12522;&#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12434;&#19979;&#35352;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>SQL&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;</p>
                     </li>
                     <li>
                        <p>&#36820;&#12373;&#12428;&#12427;&#12459;&#12521;&#12512;&#12392;&#22411;</p>
                     </li>
                  </ul>
               </div>
               <p>This will still return Object arrays, but now it will not use <code class="literal">ResultSetMetadata</code> but will instead explicitly get the ID, NAME and BIRTHDATE column as respectively a Long, String and a Short from the underlying
                  resultset. This also means that only these three columns will be returned, even though the query is using <code class="literal">*</code> and could return more than the three listed columns.
               </p>
               <p>&#12473;&#12459;&#12521;&#12540;&#12398;&#22411;&#24773;&#22577;&#12434;&#30465;&#12367;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p><pre class="programlisting">sess.createSQLQuery("SELECT * FROM CATS")
 .addScalar("ID", Hibernate.LONG)
 .addScalar("NAME")
 .addScalar("BIRTHDATE")
</pre><p>&#12371;&#12428;&#12399;&#26412;&#36074;&#30340;&#12395;&#21069;&#12392;&#21516;&#12376;&#12463;&#12456;&#12522;&#12391;&#12377;&#12364;&#12289;&#12289; NAME &#12392; BIRTHDATE &#12398;&#22411;&#12434;&#27770;&#12417;&#12427;&#12383;&#12417;&#12395; <code class="literal">ResultSetMetaData</code> &#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#19968;&#26041;&#12289;ID &#12398;&#22411;&#12399;&#26126;&#31034;&#30340;&#12395;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
               </p>
               <p>ResultSetMetaData &#12363;&#12425;&#36820;&#12373;&#12428;&#12427; java.sql.Types &#12434; Hibernate &#12398;&#22411;&#12395; &#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;Dialect &#12364;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290; &#26126;&#31034;&#12373;&#12428;&#12383;&#22411;&#12364;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12363;&#12289;&#32080;&#26524;&#12398;&#22411;&#12364;&#26399;&#24453;&#12375;&#12383;&#12418;&#12398;&#12392;&#30064;&#12394;&#12427;&#22580;&#21512;&#12289;
                  Dialect &#12398; <code class="literal">registerHibernateType</code> &#12434;&#21628;&#12403;&#20986;&#12375;&#12289; &#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12391;&#12365;&#12414;&#12377;&#12290;
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13114"></a>16.1.2. &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12463;&#12456;&#12522;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#12371;&#12371;&#12414;&#12391;&#12398;&#12463;&#12456;&#12522;&#12399;&#12289;&#12377;&#12409;&#12390;&#12473;&#12459;&#12521;&#12540;&#20516;&#12434;&#36820;&#12377;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290; &#22522;&#26412;&#30340;&#12395;&#12289;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12363;&#12425;&#12300;&#26410;&#21152;&#24037;&#12301;&#12398;&#20516;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; &#20197;&#38477;&#12391;&#12399;&#12289;<code class="literal">addEntity()</code> &#12395;&#12424;&#12426;&#12289;&#12493;&#12452;&#12486;&#12451;&#12502;SQL&#12463;&#12456;&#12522;&#12363;&#12425; &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21462;&#24471;&#12377;&#12427;&#26041;&#27861;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
               </p><pre class="programlisting">sess.createSQLQuery("SELECT * FROM CATS").addEntity(Cat.class);
sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE FROM CATS").addEntity(Cat.class);
</pre><p>&#12371;&#12398;&#12463;&#12456;&#12522;&#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12434;&#19979;&#35352;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>SQL&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;</p>
                     </li>
                     <li>
                        <p>&#12463;&#12456;&#12522;&#12364;&#36820;&#12377;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;SQL&#12486;&#12540;&#12502;&#12523;&#12398;&#21029;&#21517;</p>
                     </li>
                  </ul>
               </div>
               <p>Cat&#12364;ID, NAME, BIRTHDATE&#12398;&#12459;&#12521;&#12512;&#12434;&#20351;&#12387;&#12390;&#12463;&#12521;&#12473;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12427;&#22580;&#21512;&#12289; &#19978;&#35352;&#12398;&#12463;&#12456;&#12522;&#12399;&#12393;&#12385;&#12425;&#12418;&#12289;&#35201;&#32032;&#12364;Cat&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12391;&#12354;&#12427;&#12522;&#12473;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p>
               <p>&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#21029;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395; <code class="literal">&#22810;&#23550;&#19968;</code> &#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289; &#12493;&#12452;&#12486;&#12451;&#12502;&#12463;&#12456;&#12522;&#12434;&#23455;&#34892;&#12377;&#12427;&#38555;&#12395;&#12289;&#12371;&#12398;&#21029;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#36820;&#12377;&#12371;&#12392;&#12418;&#35201;&#27714;&#12375;&#12414;&#12377;&#12290; &#12373;&#12418;&#12394;&#12369;&#12428;&#12400;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#22266;&#26377;&#12398;&#12300;column not found(&#12459;&#12521;&#12512;&#12364;&#35211;&#12388;&#12363;&#12426;&#12414;&#12379;&#12435;)&#12301;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290; * &#34920;&#35352;&#12434;&#20351;&#29992;&#12375;&#12383;&#38555;&#12399;&#12289;&#36861;&#21152;&#12398;&#12459;&#12521;&#12512;&#12364;&#33258;&#21205;&#30340;&#12395;&#36820;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;
                  &#27425;&#12398;&#20363;&#12398;&#12424;&#12358;&#12395;&#12289;<code class="literal">Dog</code> &#12395; <code class="literal">&#22810;&#23550;&#19968;</code> &#12391;&#12354;&#12427;&#12371;&#12392;&#12434; &#26126;&#31034;&#12377;&#12427;&#12371;&#12392;&#12434;&#31169;&#12383;&#12385;&#12399;&#22909;&#12415;&#12414;&#12377;&#12290;
               </p><pre class="programlisting">sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE, DOG_ID FROM CATS").addEntity(Cat.class);
</pre><p>&#12371;&#12428;&#12395;&#12424;&#12426; cat.getDog() &#12364;&#27491;&#12375;&#12367;&#27231;&#33021;&#12375;&#12414;&#12377;&#12290;</p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13150"></a>16.1.3. &#38306;&#36899;&#12392;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#25805;&#20316;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#12503;&#12525;&#12461;&#12471;&#12434;&#21021;&#26399;&#21270;&#12377;&#12427;&#12383;&#12417;&#12398;&#20313;&#20998;&#12394;&#20966;&#29702;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12289; <code class="literal">Dog</code> &#12398;&#20013;&#12391;&#21363;&#26178;&#32080;&#21512;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399; <code class="literal">addJoin()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#12424;&#12426;&#34892;&#12356;&#12414;&#12377;&#12290; &#38306;&#36899;&#12418;&#12375;&#12367;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#32080;&#21512;&#12391;&#12365;&#12414;&#12377;&#12290;
               </p><pre class="programlisting">sess.createSQLQuery("SELECT c.ID, NAME, BIRTHDATE, DOG_ID, D_ID, D_NAME FROM CATS c, DOGS d WHERE c.DOG_ID = d.D_ID")
 .addEntity("cat", Cat.class)
 .addJoin("cat.dog");
</pre><p>&#12371;&#12398;&#20363;&#12398;&#20013;&#12391;&#12289;&#36820;&#12373;&#12428;&#12427; <code class="literal">Cat</code> &#12399;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12408;&#12398;&#20313;&#20998;&#20966;&#29702;&#12394;&#12375;&#12391;&#12289; &#23436;&#20840;&#12395;&#21021;&#26399;&#21270;&#12373;&#12428;&#12383; <code class="literal">dog</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290; &#32080;&#21512;&#23550;&#35937;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12408;&#12398;&#12497;&#12473;&#12434;&#25351;&#23450;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12289; &#21029;&#21517;&#65288;&#12300;cat&#12301;&#65289;&#12434;&#36861;&#21152;&#12375;&#12383;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#21363;&#26178;&#32080;&#21512;&#12418;&#21516;&#12376;&#12424;&#12358;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290; &#12383;&#12392;&#12360;&#12400;&#12289;<code class="literal">Cat</code> &#12364;&#19968;&#23550;&#22810;&#12391; <code class="literal">Dog</code> &#12434;&#25345;&#12387;&#12390;&#12356;&#12383;&#22580;&#21512;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
               </p><pre class="programlisting">sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE, D_ID, D_NAME, CAT_ID FROM CATS c, DOGS d WHERE c.ID = d.CAT_ID")
 .addEntity("cat", Cat.class)
 .addJoin("cat.dogs");
</pre><p>&#29694;&#22312;&#12398;&#12392;&#12371;&#12429;&#12289; Hibernate&#12391;&#20351;&#12356;&#12420;&#12377;&#12367;&#12377;&#12427;&#12383;&#12417;&#12398;SQL&#12463;&#12456;&#12522;&#12398;&#25313;&#24373;&#12394;&#12375;&#12395;&#12289; &#12493;&#12452;&#12486;&#12451;&#12502;&#12463;&#12456;&#12522;&#12391;&#20309;&#12363;&#12434;&#21487;&#33021;&#12395;&#12377;&#12427;&#38480;&#30028;&#12395;&#26469;&#12390;&#12356;&#12414;&#12377;&#12290; &#21516;&#12376;&#22411;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#35079;&#25968;&#36820;&#12377;&#38555;&#12420;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21029;&#21517;&#12420;&#21015;&#21517;&#12391;&#21313;&#20998;&#12391;&#12399;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289; &#21839;&#38988;&#12399;&#36215;&#12371;&#12426;&#22987;&#12417;&#12414;&#12377;&#12290;
                  
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13181"></a>16.1.4. &#35079;&#25968;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#21462;&#24471;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#12371;&#12371;&#12414;&#12391;&#12399;&#12289;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12398;&#12459;&#12521;&#12512;&#21517;&#12399;&#12289; &#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12459;&#12521;&#12512;&#21517;&#12392;&#21516;&#12376;&#12391;&#12354;&#12427;&#12392;&#20206;&#23450;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290; &#35079;&#25968;&#12398;&#12486;&#12540;&#12502;&#12523;&#12364;&#21516;&#12376;&#12459;&#12521;&#12512;&#21517;&#12434;&#25345;&#12388;&#22580;&#21512;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289; &#35079;&#25968;&#12486;&#12540;&#12502;&#12523;&#12434;&#32080;&#21512;&#12377;&#12427;SQL&#12463;&#12456;&#12522;&#12391;&#21839;&#38988;&#12392;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
               <p>&#19979;&#35352;&#12398;&#12424;&#12358;&#12394;&#65288;&#22833;&#25943;&#12375;&#12381;&#12358;&#12394;&#65289;&#12463;&#12456;&#12522;&#12391;&#12399;&#12289; &#12459;&#12521;&#12512;&#21029;&#21517;&#12452;&#12531;&#12472;&#12455;&#12463;&#12471;&#12519;&#12531;&#65288;column alias injection&#65289;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;</p><pre class="programlisting">sess.createSQLQuery("SELECT c.*, m.*  FROM CATS c, CATS m WHERE c.MOTHER_ID = c.ID")
 .addEntity("cat", Cat.class)
 .addEntity("mother", Cat.class)
</pre><p>The intention for this query is to return two Cat instances per row, a cat and its mother. This will fail since there is a
                  conflict of names since they are mapped to the same column names and on some databases the returned column aliases will most
                  likely be on the form "c.ID", "c.NAME", etc. which are not equal to the columns specified in the mappings ("ID" and "NAME").
               </p>
               <p>&#19979;&#35352;&#12398;&#24418;&#24335;&#12399;&#12289;&#12459;&#12521;&#12512;&#21517;&#12364;&#37325;&#35079;&#12375;&#12390;&#12418;&#22823;&#19976;&#22827;&#12391;&#12377;&#12290;</p><pre class="programlisting">sess.createSQLQuery("SELECT {cat.*}, {mother.*}  FROM CATS c, CATS m WHERE c.MOTHER_ID = c.ID")
 .addEntity("cat", Cat.class)
 .addEntity("mother", Cat.class)
</pre><p>&#12371;&#12398;&#12463;&#12456;&#12522;&#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12434;&#19979;&#35352;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>SQL&#12463;&#12456;&#12522;&#25991;&#23383;&#21015; &#65288;Hibernate&#12364;&#12459;&#12521;&#12512;&#12398;&#21029;&#21517;&#12434;&#25407;&#20837;&#12377;&#12427;&#12383;&#12417;&#12398;&#12503;&#12524;&#12540;&#12473;&#12507;&#12523;&#12480;&#12434;&#21547;&#12416;&#65289;</p>
                     </li>
                     <li>
                        <p>&#12463;&#12456;&#12522;&#12395;&#12424;&#12387;&#12390;&#36820;&#12373;&#12428;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;</p>
                     </li>
                  </ul>
               </div>
               <p>The {cat.*} and {mother.*} notation used above is a shorthand for "all properties". Alternatively, you may list the columns
                  explicitly, but even in this case we let Hibernate inject the SQL column aliases for each property. The placeholder for a
                  column alias is just the property name qualified by the table alias. In the following example, we retrieve Cats and their
                  mothers from a different table (cat_log) to the one declared in the mapping metadata. Notice that we may even use the property
                  aliases in the where clause if we like.
               </p><pre class="programlisting">String sql = "SELECT ID as {c.id}, NAME as {c.name}, " + 
         "BIRTHDATE as {c.birthDate}, MOTHER_ID as {c.mother}, {mother.*} " +
         "FROM CAT_LOG c, CAT_LOG m WHERE {c.mother} = c.ID";

List loggedCats = sess.createSQLQuery(sql)
        .addEntity("cat", Cat.class)
        .addEntity("mother", Cat.class).list()
</pre><div class="sect3" lang="ja-JP">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="querysql-aliasreferences"></a>16.1.4.1. &#21029;&#21517;&#12392;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>&#22810;&#12367;&#12398;&#22580;&#21512;&#12289;&#19978;&#35352;&#12398;&#12424;&#12358;&#12394;&#21029;&#21517;&#12452;&#12531;&#12472;&#12455;&#12463;&#12471;&#12519;&#12531;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290; &#12383;&#12384;&#12375;&#12289;&#35079;&#21512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12289;&#32153;&#25215;&#35672;&#21029;&#23376;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12394;&#12393;&#12398;&#12424;&#12358;&#12394; &#12424;&#12426;&#35079;&#38609;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#12392;&#38306;&#36899;&#12377;&#12427;&#12463;&#12456;&#12522;&#12364;&#12394;&#12369;&#12428;&#12400;&#12391;&#12377;&#12290; &#12354;&#12427;&#29305;&#23450;&#12398;&#21029;&#21517;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;Hibernate&#12399;&#36969;&#20999;&#12394;&#21029;&#21517;&#12434;&#25407;&#20837;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
                  <p>&#21029;&#21517;&#12452;&#12531;&#12472;&#12455;&#12463;&#12471;&#12519;&#12531;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12427;&#12418;&#12398;&#12434;&#19979;&#34920;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290; &#27880;&#24847;&#65306;&#19979;&#34920;&#12398;&#21029;&#21517;&#12399;&#19968;&#20363;&#12391;&#12377;&#12290; &#12381;&#12428;&#12382;&#12428;&#12398;&#21029;&#21517;&#12399;&#19968;&#24847;&#12391;&#12354;&#12426;&#12289;&#20351;&#29992;&#12377;&#12427;&#38555;&#12395;&#12399;&#12362;&#12381;&#12425;&#12367;&#30064;&#12394;&#12427;&#21517;&#21069;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;</p>
                  <div class="table"><a name="aliasinjection-summary"></a><p class="title"><b>&#34920; 16.1. &#21029;&#21517;&#12395;&#25407;&#20837;&#12377;&#12427;&#21517;&#21069;</b></p>
                     <div class="table-contents">
                        <table summary="&#21029;&#21517;&#12395;&#25407;&#20837;&#12377;&#12427;&#21517;&#21069;" border="1">
                           <colgroup>
                              <col>
                              <col>
                              <col>
                           </colgroup>
                           <thead>
                              <tr>
                                 <th>&#35500;&#26126;</th>
                                 <th>&#27083;&#25991;</th>
                                 <th>&#20363;</th>
                              </tr>
                           </thead>
                           <tbody>
                              <tr>
                                 <td>&#21336;&#32020;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;</td>
                                 <td><code class="literal">{[aliasname].[propertyname]}</code></td>
                                 <td><code class="literal">A_NAME as {item.name}</code></td>
                              </tr>
                              <tr>
                                 <td>&#35079;&#21512;&#12503;&#12525;&#12497;&#12486;&#12451;</td>
                                 <td><code class="literal">{[aliasname].[componentname].[propertyname]}</code></td>
                                 <td><code class="literal">CURRENCY as {item.amount.currency}, VALUE as {item.amount.value}</code></td>
                              </tr>
                              <tr>
                                 <td>&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12463;&#12521;&#12473;&#12434;&#35672;&#21029;&#12377;&#12427;&#20516;</td>
                                 <td><code class="literal">{[aliasname].class}</code></td>
                                 <td><code class="literal">DISC as {item.class}</code></td>
                              </tr>
                              <tr>
                                 <td>&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#20840;&#12503;&#12525;&#12497;&#12486;&#12451;</td>
                                 <td><code class="literal">{[aliasname].*}</code></td>
                                 <td><code class="literal">{item.*}</code></td>
                              </tr>
                              <tr>
                                 <td>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12461;&#12540;</td>
                                 <td><code class="literal">{[aliasname].key}</code></td>
                                 <td><code class="literal">ORGID as {coll.key}</code></td>
                              </tr>
                              <tr>
                                 <td>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;ID</td>
                                 <td><code class="literal">{[aliasname].id}</code></td>
                                 <td><code class="literal">EMPID as {coll.id}</code></td>
                              </tr>
                              <tr>
                                 <td>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;</td>
                                 <td><code class="literal">{[aliasname].element}</code></td>
                                 <td><code class="literal">XID as {coll.element}</code></td>
                              </tr>
                              <tr>
                                 <td>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</td>
                                 <td><code class="literal">{[aliasname].element.[propertyname]}</code></td>
                                 <td><code class="literal">NAME as {coll.element.name}</code></td>
                              </tr>
                              <tr>
                                 <td>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;&#12398;&#20840;&#12503;&#12525;&#12497;&#12486;&#12451;</td>
                                 <td><code class="literal">{[aliasname].element.*}</code></td>
                                 <td><code class="literal">{coll.element.*}</code></td>
                              </tr>
                              <tr>
                                 <td>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#20840;&#12503;&#12525;&#12497;&#12486;&#12451;</td>
                                 <td><code class="literal">{[aliasname].*}</code></td>
                                 <td><code class="literal">{coll.*}</code></td>
                              </tr>
                           </tbody>
                        </table>
                     </div>
                  </div><br class="table-break"></div>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13322"></a>16.1.5. &#31649;&#29702;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#21462;&#24471;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#12493;&#12452;&#12486;&#12451;&#12502;SQL&#12463;&#12456;&#12522;&#12395; ResultTransformer &#12434;&#36969;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#19979;&#35352;&#12398;&#12424;&#12358;&#12395;&#12289;&#20363;&#12360;&#12400;&#12289;&#31649;&#29702;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;</p><pre class="programlisting">sess.createSQLQuery("SELECT NAME, BIRTHDATE FROM CATS")
        .setResultTransformer(Transformers.aliasToBean(CatDTO.class))</pre><p>&#12371;&#12398;&#12463;&#12456;&#12522;&#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12418;&#12398;&#12434;&#19979;&#35352;&#12395;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>SQL&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;</p>
                     </li>
                     <li>
                        <p>&#32080;&#26524;&#12434;&#22793;&#25563;&#12375;&#12383;&#12418;&#12398;</p>
                     </li>
                  </ul>
               </div>
               <p>&#19978;&#35352;&#12398;&#12463;&#12456;&#12522;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12375;&#12289;NAME &#12392; BIRTHDATE &#12398;&#20516;&#12434; &#23550;&#24540;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12418;&#12375;&#12367;&#12399;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25407;&#20837;&#12375;&#12383; <code class="literal">CatDTO</code> &#12398;&#12522;&#12473;&#12488;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13343"></a>16.1.6. &#32153;&#25215;&#12398;&#21046;&#24481;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#32153;&#25215;&#12398;&#19968;&#37096;&#12392;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12383;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#21839;&#12356;&#21512;&#12431;&#12379;&#12427;&#12493;&#12452;&#12486;&#12451;&#12502;SQL&#12463;&#12456;&#12522;&#12399;&#12289; &#12505;&#12540;&#12473;&#12398;&#12463;&#12521;&#12473;&#12392;&#12381;&#12398;&#12377;&#12409;&#12390;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12377;&#12409;&#12390;&#12434;&#21547;&#12414;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13348"></a>16.1.7. &#12497;&#12521;&#12513;&#12540;&#12479;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#12493;&#12452;&#12486;&#12451;&#12502;SQL&#12463;&#12456;&#12522;&#12399;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12289; &#21517;&#21069;&#20184;&#12365;&#12497;&#12521;&#12513;&#12540;&#12479;&#65288;:name&#65289;&#12392;&#21516;&#27096;&#12395;&#20301;&#32622;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;</p><pre class="programlisting">Query query = sess.createSQLQuery("SELECT * FROM CATS WHERE NAME like ?").addEntity(Cat.class);
List pusList = query.setString(0, "Pus%").list();
     
query = sess.createSQLQuery("SELECT * FROM CATS WHERE NAME like :name").addEntity(Cat.class);
List pusList = query.setString("name", "Pus%").list();          </pre></div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="query-criteria-naturalid.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="querysql-namedqueries.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">15.9. &#33258;&#28982;&#35672;&#21029;&#23376;&#12395;&#12424;&#12427;&#12463;&#12456;&#12522;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;16.2. &#21517;&#21069;&#20184;&#12365;SQL&#12463;&#12456;&#12522;</td>
            </tr>
         </table>
      </div>
   </body>
</html>