<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>14.3. &#38306;&#36899;&#12392;&#32080;&#21512;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="queryhql.html" title="&#31532;14&#31456; HQL: The Hibernate Query Language">
      <link rel="prev" href="queryhql-from.html" title="14.2. from&#31680;">
      <link rel="next" href="queryhql-joins-forms.html" title="14.4. &#32080;&#21512;&#27083;&#25991;&#12398;&#24418;&#24335;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">14.3. &#38306;&#36899;&#12392;&#32080;&#21512;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="queryhql-from.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;14&#31456; HQL: The Hibernate Query Language</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="queryhql-joins-forms.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="queryhql-joins"></a>14.3. &#38306;&#36899;&#12392;&#32080;&#21512;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#38306;&#36899;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12354;&#12427;&#12356;&#12399;&#20516;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;&#12395;&#12418;&#12289;<code class="literal">&#32080;&#21512;</code> &#12434;&#20351;&#12387;&#12390;&#21029;&#21517;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">from Cat as cat
    inner join cat.mate as mate
    left outer join cat.kittens as kitten</pre><pre class="programlisting">from Cat as cat left join cat.mate.kittens as kittens</pre><pre class="programlisting">from Formula form full join form.parameter param</pre><p>&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427;&#32080;&#21512;&#12398;&#12479;&#12452;&#12503;&#12399;ANSI SQL&#12392;&#21516;&#12376;&#12391;&#12377;&#12290; </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>
                                         <code class="literal">inner join</code>
                                     
                  </p>
               </li>
               <li>
                  <p>
                                         <code class="literal">left outer join</code>
                                     
                  </p>
               </li>
               <li>
                  <p>
                                         <code class="literal">right outer join</code>
                                     
                  </p>
               </li>
               <li>
                  <p><code class="literal">full join</code> (&#12383;&#12356;&#12390;&#12356;&#12398;&#22580;&#21512;&#20351;&#12356;&#12389;&#12425;&#12356;) 
                  </p>
               </li>
            </ul>
         </div>
         <p><code class="literal">inner join</code>&#12289;<code class="literal">left outer join</code>&#12289;<code class="literal">right outer join</code>&#12395;&#12399;&#30465;&#30053;&#24418;&#12434;&#20351;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">from Cat as cat
    join cat.mate as mate
    left join cat.kittens as kitten</pre><p>HQL&#12398; <code class="literal">with</code> &#12461;&#12540;&#12527;&#12540;&#12489;&#12434;&#20351;&#12358;&#12392;&#12289;&#32080;&#21512;&#26465;&#20214;&#12434;&#20184;&#12369;&#21152;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">from Cat as cat
    left join cat.kittens as kitten
        with kitten.bodyWeight &gt; 10.0</pre><p>&#21152;&#12360;&#12390;&#12289;&#12300;&#12501;&#12455;&#12483;&#12481;&#12301;&#32080;&#21512;&#12399;&#38306;&#36899;&#12420;&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#35242;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#19968;&#32210;&#12395;1&#24230;&#12398;select&#21477;&#12391;&#21021;&#26399;&#21270;&#12375;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#29305;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#22580;&#21512;&#12395;&#26377;&#29992;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#23455;&#36074;&#19978;&#12289;&#38306;&#36899;&#12392;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12377;&#12427;&#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12501;&#12449;&#12452;&#12523;&#12398;&#22806;&#37096;&#32080;&#21512;&#12392;lazy&#21021;&#26399;&#21270;&#12398;&#23450;&#32681;&#12434;&#19978;&#26360;&#12365;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
            <a href="performance.html#performance-fetching" title="19.1. &#12501;&#12455;&#12483;&#12481;&#25126;&#30053;">&#38917;19.1. &#12300;&#12501;&#12455;&#12483;&#12481;&#25126;&#30053;&#12301;</a> &#12395;&#12424;&#12426;&#22810;&#12367;&#12398;&#24773;&#22577;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">from Cat as cat
    inner join fetch cat.mate
    left join fetch cat.kittens</pre><p>&#32080;&#21512;&#12395;&#12424;&#12427;&#12501;&#12455;&#12483;&#12481;&#12399;&#38306;&#36899;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; <code class="literal">where</code> &#31680;(&#12414;&#12383;&#12399;&#20182;&#12398;&#12393;&#12435;&#12394;&#31680;&#12391;&#12418;) &#12391;&#20351;&#12431;&#12428;&#12390;&#12399;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12289;&#36890;&#24120;&#21029;&#21517;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#38306;&#36899;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#21839;&#12356;&#21512;&#12431;&#12379;&#32080;&#26524;&#12392;&#12375;&#12390; &#30452;&#25509;&#36820;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#20195;&#12431;&#12426;&#12395;&#35242;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36890;&#12375;&#12390;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20877;&#24112;&#30340;&#12395;&#32080;&#21512;&#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#12289;&#21029;&#21517;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
            
         </p><pre class="programlisting">from Cat as cat
    inner join fetch cat.mate
    left join fetch cat.kittens child
    left join fetch child.kittens</pre><p><code class="literal">fetch</code> &#27083;&#25991;&#12399; <code class="literal">iterate()</code> &#12434;&#20351;&#12387;&#12383;&#12463;&#12456;&#12522;&#21628;&#12403;&#20986;&#12375;&#12391;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356; &#65288;&#19968;&#26041;&#12391; <code class="literal">scroll()</code> &#12399;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#65289;&#12290; &#12414;&#12383;&#12289;&#12371;&#12428;&#12425;&#12398;&#25805;&#20316;&#12399;&#32080;&#26524;&#12398;&#34892;&#12395;&#22522;&#12389;&#12356;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289; <code class="literal">fetch</code> &#12399; <code class="literal">setMaxResults()</code> &#12420; <code class="literal">setFirstResult()</code> &#12392;&#19968;&#32210;&#12395;&#20351;&#29992;&#12377;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#36890;&#24120;eager&#12394;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12501;&#12455;&#12483;&#12481;&#12434;&#12377;&#12427;&#12392;&#37325;&#35079;&#12364;&#20986;&#12390;&#12375;&#12414;&#12358;&#12383;&#12417;&#12289;&#12354;&#12394;&#12383;&#12364;&#26399;&#24453;&#12377;&#12427;&#12424;&#12358;&#12394;&#34892;&#25968;&#12395;&#12399;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12377;&#12290; &#12381;&#12375;&#12390;&#12414;&#12383; <code class="literal">fetch</code> &#12399;&#12289;&#12450;&#12489;&#12507;&#12483;&#12463;&#12394; <code class="literal">with</code> &#26465;&#20214;&#12434; &#19968;&#32210;&#12395;&#20351;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#19968;&#12388;&#12398;&#12463;&#12456;&#12522;&#12391;&#35079;&#25968;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#32080;&#21512;&#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#30452;&#31309;&#12434;&#20316;&#25104;&#12391;&#12365;&#12427;&#12398;&#12391;&#12289;&#12371;&#12398;&#22580;&#21512;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12414;&#12383;&#12289;&#35079;&#25968;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12377;&#12427;&#32080;&#21512;&#12501;&#12455;&#12483;&#12481;&#12399;bag&#12510;&#12483;&#12500;&#12531;&#12464;&#12395;&#23550;&#12375;&#12390;&#20104;&#26399;&#12379;&#12396;&#32080;&#26524;&#12434;&#12418;&#12383;&#12425;&#12377;&#12371;&#12392;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;
            &#12371;&#12398;&#22580;&#21512;&#12398;&#12463;&#12456;&#12522;&#12398;&#20316;&#25104;&#12395;&#12399;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#26368;&#24460;&#12395; <code class="literal">&#20840;&#22806;&#37096;&#32080;&#21512;&#12395;&#12424;&#12427;&#12501;&#12455;&#12483;&#12481;</code> &#12392; <code class="literal">&#21491;&#22806;&#37096;&#32080;&#21512;&#12395;&#12424;&#12427;&#12501;&#12455;&#12483;&#12481;</code> &#12399;&#26377;&#29992;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
         </p>
         <p>&#12418;&#12375;&#12503;&#12525;&#12497;&#12486;&#12451;&#12524;&#12505;&#12523;&#12398;&#36933;&#24310;&#12501;&#12455;&#12483;&#12481;&#12434;&#20351;&#12358;&#22580;&#21512;&#65288;&#20869;&#37096;&#30340;&#12395;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#20966;&#29702;&#12434;&#12377;&#12427;&#22580;&#21512;&#65289;&#12289; <code class="literal">fetch all properties</code> &#12434;&#20351;&#12358;&#12371;&#12392;&#12391; Hibernate&#12395;&#36933;&#24310;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36895;&#12420;&#12363;&#12395;&#65288;&#26368;&#21021;&#12398;&#12463;&#12456;&#12522;&#12391;&#65289;&#12501;&#12455;&#12483;&#12481;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
         </p><pre class="programlisting">from Document fetch all properties order by name</pre><pre class="programlisting">from Document doc fetch all properties where lower(doc.name) like '%cats%'</pre></div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="queryhql-from.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="queryhql.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="queryhql-joins-forms.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">14.2. from&#31680;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;14.4. &#32080;&#21512;&#27083;&#25991;&#12398;&#24418;&#24335;</td>
            </tr>
         </table>
      </div>
   </body>
</html>