<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>11.3. &#27005;&#35251;&#30340;&#21516;&#26178;&#23455;&#34892;&#21046;&#24481;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="transactions.html" title="&#31532;11&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;">
      <link rel="prev" href="transactions-demarcation.html" title="11.2. &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#22659;&#30028;">
      <link rel="next" href="transactions-locking.html" title="11.4. &#24754;&#35251;&#30340;&#12525;&#12483;&#12463;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">11.3. &#27005;&#35251;&#30340;&#21516;&#26178;&#23455;&#34892;&#21046;&#24481;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="transactions-demarcation.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;11&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="transactions-locking.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="transactions-optimistic"></a>11.3. &#27005;&#35251;&#30340;&#21516;&#26178;&#23455;&#34892;&#21046;&#24481;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#39640;&#12356;&#20006;&#21015;&#24615;&#12392;&#39640;&#12356;&#12473;&#12465;&#12540;&#12521;&#12499;&#12522;&#12486;&#12451;&#12398;&#20001;&#26041;&#12434;&#23455;&#29694;&#12377;&#12427;&#12450;&#12503;&#12525;&#12540;&#12481;&#12399;&#12289; &#12496;&#12540;&#12472;&#12519;&#12491;&#12531;&#12464;&#12434;&#20351;&#12387;&#12383;&#27005;&#35251;&#30340;&#21516;&#26178;&#23455;&#34892;&#21046;&#24481;&#12398;&#12415;&#12391;&#12377;&#12290; &#26356;&#26032;&#12398;&#34909;&#31361;&#12434;&#35211;&#12388;&#12369;&#12427;&#12383;&#12417;&#12395;&#65288;&#12362;&#12424;&#12403;&#12289;&#26356;&#26032;&#12364;&#22833;&#12431;&#12428;&#12427;&#12398;&#12434;&#38450;&#12368;&#12383;&#12417;&#12395;&#65289;&#12289; &#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12418;&#12375;&#12367;&#12399;&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503;&#12434;&#20351;&#12387;&#12390;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;
            Hibernate&#12399;&#12289;&#27005;&#35251;&#30340;&#21516;&#26178;&#23455;&#34892;&#12434;&#34892;&#12358;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12383;&#12417;&#12398; &#12450;&#12503;&#12525;&#12540;&#12481;&#12434;&#65299;&#12388;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; &#31169;&#12383;&#12385;&#12364;&#35211;&#12379;&#12427;&#12518;&#12540;&#12473;&#12465;&#12540;&#12473;&#12399;&#12289;&#38263;&#12356;&#23550;&#35441;&#12434;&#25345;&#12385;&#12414;&#12377;&#12364;&#12289; &#12496;&#12540;&#12472;&#12519;&#12531;&#12481;&#12455;&#12483;&#12463;&#12399;&#12414;&#12384;&#65297;&#12388;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#20013;&#12391;&#26356;&#26032;&#12434;&#22833;&#12358;&#12371;&#12392;&#12434;&#38450;&#12368;
            &#21033;&#28857;&#12418;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; 
         </p>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="transactions-optimistic-manual"></a>11.3.1. &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#12481;&#12455;&#12483;&#12463;
                     </h3>
                  </div>
               </div>
            </div>
            <p>Hibernate&#12395;&#12411;&#12392;&#12435;&#12393;&#21161;&#12369;&#12390;&#12418;&#12425;&#12431;&#12378;&#12395;&#23455;&#35013;&#12377;&#12427;&#12465;&#12540;&#12473;&#12391;&#12377;&#12290; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12398;&#12420;&#12426;&#21462;&#12426;&#12399;&#12289;&#12381;&#12428;&#12382;&#12428;&#26032;&#12375;&#12356; <code class="literal">Session</code> &#12398;&#20013;&#12391;&#36215;&#12371;&#12426;&#12414;&#12377;&#12290; &#38283;&#30330;&#32773;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#24615;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#25805;&#20316;&#12377;&#12427;&#21069;&#12395;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#20877;&#35501;&#12415;&#36796;&#12415;&#12377;&#12427;&#36012;&#21209;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12391;&#12399;&#12289;&#23550;&#35441;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#20998;&#38626;&#12434;&#23432;&#12427;&#12383;&#12417;&#12395;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#33258;&#36523;&#12364;&#12496;&#12540;&#12472;&#12519;&#12531;&#12481;&#12455;&#12483;&#12463;&#12434;&#34892;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
               &#12371;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12450;&#12463;&#12475;&#12473;&#12398;&#20013;&#12391;&#12399;&#12289;&#26368;&#12418;&#38750;&#21177;&#29575;&#12391;&#12377;&#12290; &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;EJB&#12392;&#26368;&#12418;&#20284;&#12390;&#12356;&#12427;&#12450;&#12503;&#12525;&#12540;&#12481;&#12391;&#12377;&#12290; 
            </p><pre class="programlisting">// foo is an instance loaded by a previous Session
session = factory.openSession();
Transaction t = session.beginTransaction();

int oldVersion = foo.getVersion();
session.load( foo, foo.getKey() ); // load the current state
if ( oldVersion != foo.getVersion() ) throw new StaleObjectStateException();
foo.setProperty("bar");

t.commit();
session.close();</pre><p><code class="literal">&lt;version&gt;</code> &#12434;&#20351;&#12387;&#12390;&#12289;<code class="literal">version</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290; Hibernate&#12399;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#12480;&#12540;&#12486;&#12451;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#12501;&#12521;&#12483;&#12471;&#12517;&#12375;&#12289; &#12381;&#12398;&#38291;&#12395; <code class="literal">version</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#33258;&#21205;&#30340;&#12395;&#12452;&#12531;&#12463;&#12522;&#12513;&#12531;&#12488;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12418;&#12385;&#12429;&#12435;&#12289;&#12487;&#12540;&#12479;&#12398;&#20006;&#21015;&#24615;&#12364;&#20302;&#12356;&#29872;&#22659;&#12391;&#36939;&#29992;&#12375;&#12390;&#12362;&#12426;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#12481;&#12455;&#12483;&#12463;&#12364;&#19981;&#35201;&#12394;&#12425;&#12289; &#12371;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12434;&#20351;&#12356;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#12481;&#12455;&#12483;&#12463;&#12434;&#12473;&#12461;&#12483;&#12503;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290; &#12381;&#12398;&#22580;&#21512;&#12399;&#12289;&#38263;&#12356;&#23550;&#35441;&#12395;&#12399;&#12289; <span class="emphasis"><em>&#12300;&#26368;&#24460;&#12395;&#12467;&#12511;&#12483;&#12488;&#12375;&#12383;&#12418;&#12398;&#12364;&#21213;&#12388;&#12301;</em></span> &#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#25126;&#30053;&#12391;&#12375;&#12423;&#12358;&#12290; &#12371;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;&#28151;&#20081;&#12373;&#12379;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12371;&#12392;&#12434; &#24515;&#12395;&#30041;&#12417;&#12390;&#32622;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12381;&#12428;&#12399;&#12289;&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12420;&#31478;&#21512;&#12375;&#12383;&#22793;&#26356;&#12434;&#12510;&#12540;&#12472;&#12377;&#12427;&#27231;&#20250;&#12364; &#12394;&#12356;&#12414;&#12414;&#12289;&#26356;&#26032;&#12434;&#22833;&#12358;&#32076;&#39443;&#12434;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290; 
            </p>
            <p>Clearly, manual version checking is only feasible in very trivial circumstances and not practical for most applications. Often
               not only single instances, but complete graphs of modified objects have to be checked. Hibernate offers automatic version
               checking with either an extended <code class="literal">Session</code> or detached instances as the design paradigm. 
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="transactions-optimistic-longsession"></a>11.3.2. &#25313;&#24373;&#12475;&#12483;&#12471;&#12519;&#12531;&#12392;&#33258;&#21205;&#12496;&#12540;&#12472;&#12519;&#12491;&#12531;&#12464;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#65297;&#12388;&#12398; <code class="literal">Session</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12381;&#12398;&#27704;&#32154;&#24615;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289; <span class="emphasis"><em>session-per-conversation</em></span> &#12392;&#12375;&#12390;&#30693;&#12425;&#12428;&#12427;&#12289; &#23550;&#35441;&#20840;&#20307;&#12391;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290; Hibernate&#12399;&#12501;&#12521;&#12483;&#12471;&#12517;&#12377;&#12427;&#38555;&#12395;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290; &#21516;&#26178;&#12395;&#20462;&#27491;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#26908;&#20986;&#12377;&#12427;&#12392;&#12289;&#20363;&#22806;&#12434;&#25237;&#12370;&#12414;&#12377;&#12290; &#12371;&#12398;&#20363;&#22806;&#12434;&#12461;&#12515;&#12483;&#12481;&#12375;&#12390;&#25201;&#12358;&#12398;&#12399;&#12289;&#38283;&#30330;&#32773;&#12398;&#36012;&#20219;&#12391;&#12377; &#65288;&#19968;&#33324;&#30340;&#12394;&#36984;&#25246;&#32930;&#12399;&#12289;&#22793;&#26356;&#12434;&#12510;&#12540;&#12472;&#12377;&#12427;&#12363;&#21476;&#12367;&#12394;&#12356;&#12487;&#12540;&#12479;&#12391;&#12499;&#12472;&#12493;&#12473;&#23550;&#35441;&#12434;
               &#20877;&#12473;&#12479;&#12540;&#12488;&#12377;&#12427;&#27231;&#20250;&#12434;&#12518;&#12540;&#12470;&#12540;&#12395;&#25552;&#20379;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#65289;&#12290; 
            </p>
            <p>&#12518;&#12540;&#12470;&#12540;&#12398;&#23550;&#35441;&#12434;&#24453;&#12387;&#12390;&#12356;&#12427;&#12392;&#12365;&#12399;&#12289; <code class="literal">Session</code> &#12434;&#22522;&#30990;&#12392;&#12394;&#12427;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#20999;&#12426;&#38626;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12450;&#12463;&#12475;&#12473;&#12398;&#20013;&#12391;&#12399;&#12289;&#26368;&#12418;&#21177;&#29575;&#30340;&#12391;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#12481;&#12455;&#12483;&#12463;&#12420;&#20998;&#38626;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20877;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392; &#12395;&#38306;&#24515;&#12434;&#25345;&#12388;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;&#12354;&#12425;&#12422;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#20013;&#12391;
               &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20877;&#35501;&#12415;&#36796;&#12415;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; 
            </p><pre class="programlisting">// foo is an instance loaded earlier by the old session
Transaction t = session.beginTransaction(); // Obtain a new JDBC connection, start transaction

foo.setProperty("bar");

session.flush();    // Only for last transaction in conversation
t.commit();         // Also return JDBC connection
session.close();    // Only for last transaction in conversation</pre><p><code class="literal">foo</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#33258;&#20998;&#12434;&#12525;&#12540;&#12489;&#12375;&#12383; <code class="literal">Session</code> &#12434;&#12414;&#12384;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; &#21476;&#12356;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#19978;&#12391;&#26032;&#12375;&#12356;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#38283;&#22987;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289; &#26032;&#12375;&#12356;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#21462;&#24471;&#12375;&#12289;&#12381;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#20877;&#38283;&#12373;&#12428;&#12414;&#12377;&#12290; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289; &#12475;&#12483;&#12471;&#12519;&#12531;&#12363;&#12425;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#20999;&#26029;&#12375;&#12289;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#12503;&#12540;&#12523;&#12395;&#36820;&#12375;&#12414;&#12377;&#12290;
               &#20877;&#25509;&#32154;&#12375;&#12383;&#24460;&#12289;&#26356;&#26032;&#12375;&#12390;&#12356;&#12394;&#12356;&#12487;&#12540;&#12479;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12481;&#12455;&#12483;&#12463;&#12434;&#24375;&#21046;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; &#20182;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#26356;&#26032;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#38306;&#12375;&#12390;&#12289; <code class="literal">LockMode.READ</code> &#12434;&#12388;&#12369;&#12390; <code class="literal">Session.lock()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#26356;&#26032;&#12375;&#12390; <span class="emphasis"><em>&#12356;&#12427;</em></span> &#12487;&#12540;&#12479;&#12434;&#12525;&#12483;&#12463;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#36890;&#24120;&#12289;&#25313;&#24373; <code class="literal">Session</code> &#12395; <code class="literal">FlushMode.MANUAL</code> &#12434;&#12475;&#12483;&#12488;&#12375;&#12414;&#12377;&#12290; &#26368;&#24460;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#21608;&#26399;&#12391;&#12398;&#12415;&#12289; &#23550;&#35441;&#12398;&#20013;&#12391;&#22793;&#26356;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12434;&#23455;&#38555;&#12395;&#27704;&#32154;&#21270;&#12373;&#12379;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290; &#12422;&#12360;&#12395;&#12289;&#26368;&#24460;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12415; <code class="literal">flush()</code> &#12458;&#12506;&#12524;&#12540;&#12471;&#12519;&#12531;&#12434;&#21547;&#12415;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#12289;&#23550;&#35441;&#12434;&#32066;&#12431;&#12425;&#12379;&#12427;&#12383;&#12417;&#12395;&#12289; &#12475;&#12483;&#12471;&#12519;&#12531;&#12418; <code class="literal">close()</code> &#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12518;&#12540;&#12470;&#12540;&#12364;&#32771;&#24942;&#20013;&#12395;&#12289;&#26684;&#32013;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12367;&#12425;&#12356; <code class="literal">Session</code> &#12364;&#22823;&#12365;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289;&#12371;&#12398;&#12497;&#12479;&#12540;&#12531;&#12399;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;<code class="literal">HttpSession</code> &#12399;&#21487;&#33021;&#12394;&#38480;&#12426;&#23567;&#12373;&#12367;&#20445;&#12388;&#12409;&#12365;&#12391;&#12377;&#12290; <code class="literal">Session</code> &#12399;&#65288;&#24375;&#21046;&#30340;&#12395;&#65289;&#65297;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#12391;&#12418;&#12354;&#12426;&#12289; &#12525;&#12540;&#12489;&#12375;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12377;&#12409;&#12390;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290; &#12362;&#12381;&#12425;&#12367;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#65295;&#12524;&#12473;&#12509;&#12531;&#12473;&#12398;&#12469;&#12452;&#12463;&#12523;&#12364;&#25968;&#22238;&#12391;&#12354;&#12428;&#12400;&#12289;&#12371;&#12398;&#25126;&#30053;&#12364;&#20351;&#12360;&#12414;&#12377;&#12290; &#65297;&#12388;&#12398;&#23550;&#35441;&#12398;&#12383;&#12417;&#12384;&#12369;&#12395; <code class="literal">Session</code> &#12434;&#20351;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290; &#12394;&#12380;&#12394;&#12425;&#12289;&#12377;&#12368;&#12395;&#26032;&#39854;&#12391;&#12394;&#12356;&#12487;&#12540;&#12479;&#12434;&#25345;&#12388;&#12383;&#12417;&#12391;&#12377;&#12290; 
            </p>
            <p>&#65288;Hibernate&#12398;&#20197;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;&#26126;&#31034;&#30340;&#12394; <code class="literal">Session</code> &#12398; &#20999;&#26029;&#12392;&#20877;&#25509;&#32154;&#12364;&#24517;&#35201;&#12384;&#12387;&#12383;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12428;&#12425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#38750;&#25512;&#22888;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290; &#12394;&#12380;&#12394;&#12425;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#38283;&#22987;&#12392;&#32066;&#20102;&#12399;&#21516;&#12376;&#21177;&#26524;&#12364;&#12354;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;&#65289; 
            </p>
            <p>&#20999;&#26029;&#12375;&#12383; <code class="literal">Session</code> &#12434;&#27704;&#32154;&#21270;&#23652;&#12398;&#36817;&#12367;&#12391;&#20445;&#25345;&#12377;&#12409;&#12365;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395; &#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#35328;&#12356;&#25563;&#12360;&#12427;&#12392;&#12289;&#65299;&#23652;&#29872;&#22659;&#12398;&#20013;&#12391; <code class="literal">Session</code> &#12434;&#20445;&#25345;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; EJB&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; <code class="literal">HttpSession</code> &#12395;&#26684;&#32013;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;Web&#23652;&#12395;&#36578;&#36865;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356; &#65288;&#21029;&#12398;&#23652;&#12408;&#12398;&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#12418;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#65289;&#12290; 
            </p>
            <p>&#25313;&#24373;&#12475;&#12483;&#12471;&#12519;&#12531;&#12497;&#12479;&#12540;&#12531;&#65288;&#12418;&#12375;&#12367;&#12399;&#12289;<span class="emphasis"><em>session-per-conversation</em></span>&#65289;&#12399;&#12289; &#33258;&#21205;&#30340;&#12394;&#12459;&#12524;&#12531;&#12488;&#12475;&#12483;&#12471;&#12519;&#12531;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#31649;&#29702;&#12434;&#23455;&#26045;&#12377;&#12427;&#12424;&#12426;&#38627;&#12375;&#12356;&#12290; &#12371;&#12398;&#12383;&#12417;&#12395;&#12289;&#12354;&#12394;&#12383;&#12399; <code class="literal">CurrentSessionContext</code> &#12398;&#23455;&#35013;&#12434;&#20379;&#32102;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; Hibernate Wiki&#12395;&#12354;&#12427;&#20363;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="transactions-optimistic-detached"></a>11.3.3. &#12487;&#12479;&#12483;&#12481;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#33258;&#21205;&#12496;&#12540;&#12472;&#12519;&#12491;&#12531;&#12464;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#26032;&#12375;&#12356; <code class="literal">Session</code>&#12395;&#12424;&#12426;&#12289;&#27704;&#32154;&#21270;&#12473;&#12488;&#12450;&#65288;&#35379;&#27880;&#65306;&#65316;&#65314;&#65289;&#12392;&#12398;&#23550;&#35441;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290; &#12414;&#12383;&#19968;&#26041;&#12289;&#21516;&#12376;&#27704;&#32154;&#24615;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12398;&#23550;&#35441;&#12372;&#12392;&#12395;&#20877;&#21033;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#20803;&#12293;&#12399;&#20182;&#12398; <code class="literal">Session</code> &#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12289; &#12487;&#12479;&#12483;&#12481;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#29366;&#24907;&#12434;&#25805;&#20316;&#12375;&#12414;&#12377;&#12290; &#12381;&#12375;&#12390;&#12289;<code class="literal">Session.update()</code> &#12418;&#12375;&#12367;&#12399;&#12289;<code class="literal">Session.saveOrUpdate()</code>&#12289; <code class="literal">Session.merge()</code> &#12434;&#20351;&#12387;&#12390;&#12289;&#12381;&#12428;&#12425;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20877;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">// foo is an instance loaded by a previous Session
foo.setProperty("bar");
session = factory.openSession();
Transaction t = session.beginTransaction();
session.saveOrUpdate(foo); // Use merge() if "foo" might have been loaded already
t.commit();
session.close();</pre><p>Again, Hibernate will check instance versions during flush, throwing an exception if conflicting updates occurred. </p>
            <p>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#20462;&#27491;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#20449;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289; <code class="literal">update()</code> &#12398;&#20195;&#12431;&#12426;&#12395;&#12289;<code class="literal">LockMode.READ</code> &#12434;&#20351;&#12387;&#12390;&#12289; <code class="literal">lock()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377; &#65288;&#12377;&#12409;&#12390;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#36802;&#22238;&#12375;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#12481;&#12455;&#12483;&#12463;&#12434;&#23455;&#26045;&#12375;&#12414;&#12377;&#65289;&#12290; 
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="transactions-optimistic-customizing"></a>11.3.4. &#33258;&#21205;&#12496;&#12540;&#12472;&#12519;&#12491;&#12531;&#12464;&#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#12510;&#12483;&#12500;&#12531;&#12464;&#12398; <code class="literal">optimistic-lock</code> &#23646;&#24615;&#12395; <code class="literal">false</code> &#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#29305;&#23450;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12383;&#12417;&#12395; &#33258;&#21205;&#12496;&#12540;&#12472;&#12519;&#12531;&#12452;&#12531;&#12463;&#12522;&#12513;&#12531;&#12488;&#12434;&#28961;&#21177;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290; &#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12480;&#12540;&#12486;&#12451;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12452;&#12531;&#12463;&#12522;&#12513;&#12531;&#12488;&#12375;&#12414;&#12379;&#12435;&#12290; 
            </p>
            <p>Legacy database schemas are often static and can't be modified. Or, other applications might also access the same database
               and don't know how to handle version numbers or even timestamps. In both cases, versioning can't rely on a particular column
               in a table. To force a version check without a version or timestamp property mapping, with a comparison of the state of all
               fields in a row, turn on <code class="literal">optimistic-lock="all"</code> in the <code class="literal">&lt;class&gt;</code> mapping. Note that this conceptually only works if Hibernate can compare the old and new state, i.e. if you use a single
               long <code class="literal">Session</code> and not session-per-request-with-detached-objects. 
            </p>
            <p>&#12392;&#12365;&#12393;&#12365;&#12289;&#34892;&#12431;&#12428;&#12383;&#22793;&#26356;&#12364;&#37325;&#12394;&#12425;&#12394;&#12356;&#38480;&#12426;&#12289;&#21516;&#26178;&#12395;&#34892;&#12431;&#12428;&#12383;&#22793;&#26356;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; <code class="literal">&lt;class&gt;</code> &#12510;&#12483;&#12500;&#12531;&#12464;&#12395; <code class="literal">optimistic-lock="dirty"</code> &#12434;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;&#12501;&#12521;&#12483;&#12471;&#12517;&#12377;&#12427;&#38555;&#12395;&#12289;Hibernate&#12399;&#12480;&#12540;&#12486;&#12451;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#12415;&#12434;&#27604;&#36611;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>In both cases, with dedicated version/timestamp columns or with full/dirty field comparison, Hibernate uses a single <code class="literal">UPDATE</code> statement (with an appropriate <code class="literal">WHERE</code> clause) per entity to execute the version check and update the information. If you use transitive persistence to cascade
               reattachment to associated entities, Hibernate might execute unnecessary updates. This is usually not a problem, but <span class="emphasis"><em>on update</em></span> triggers in the database might be executed even when no changes have been made to detached instances. You can customize this
               behavior by setting <code class="literal">select-before-update="true"</code> in the <code class="literal">&lt;class&gt;</code> mapping, forcing Hibernate to <code class="literal">SELECT</code> the instance to ensure that changes did actually occur, before updating the row. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="transactions-demarcation.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="transactions.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="transactions-locking.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">11.2. &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#22659;&#30028;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;11.4. &#24754;&#35251;&#30340;&#12525;&#12483;&#12463;</td>
            </tr>
         </table>
      </div>
   </body>
</html>