<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>11.5. &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#38283;&#25918;&#12514;&#12540;&#12489;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="transactions.html" title="&#31532;11&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;">
      <link rel="prev" href="transactions-locking.html" title="11.4. &#24754;&#35251;&#30340;&#12525;&#12483;&#12463;">
      <link rel="next" href="events.html" title="&#31532;12&#31456; &#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12392;&#12452;&#12505;&#12531;&#12488;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">11.5. &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#38283;&#25918;&#12514;&#12540;&#12489;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="transactions-locking.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;11&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="events.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="transactions-connection-release"></a>11.5. &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#38283;&#25918;&#12514;&#12540;&#12489;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate&#12398;&#12524;&#12460;&#12471;&#12540;&#65288;2.x&#65289;&#12398;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#31649;&#29702;&#12395;&#38306;&#12377;&#12427;&#25391;&#12427;&#33310;&#12356;&#12399;&#12289; &#26368;&#21021;&#12395;&#24517;&#35201;&#12392;&#12375;&#12383;&#38555;&#12395; <code class="literal">Session</code> &#12364;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#24471;&#12427;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12375;&#12383;&#12290; &#12381;&#12375;&#12390;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#38281;&#12376;&#12425;&#12428;&#12427;&#12414;&#12391;&#12289;&#12381;&#12398;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#20445;&#25345;&#12375;&#12414;&#12375;&#12383;&#12290; Hibernate 3.x&#12399;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12395;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#21046;&#24481;&#12377;&#12427;&#12363;&#12434;&#20253;&#12360;&#12427; &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#38283;&#25918;&#12514;&#12540;&#12489;&#12392;&#12356;&#12358;&#27010;&#24565;&#12434;&#23566;&#20837;&#12375;&#12414;&#12375;&#12383;&#12290;
            &#20197;&#38477;&#12398;&#35696;&#35542;&#12399;&#12289;&#27083;&#25104;&#12373;&#12428;&#12383; <code class="literal">ConnectionProvider</code> &#12434;&#36890;&#12375;&#12390;&#25552;&#20379;&#12373;&#12428;&#12427; &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12395;&#36969;&#20999;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#30064;&#12394;&#12427;&#38283;&#25918;&#12514;&#12540;&#12489;&#12399;&#12289;<code class="literal">org.hibernate.ConnectionReleaseMode</code> &#12395; &#21015;&#25369;&#12373;&#12428;&#12383;&#20516;&#12395;&#12424;&#12426;&#30906;&#35469;&#12373;&#12428;&#12414;&#12377;&#12290; 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p><code class="literal">ON_CLOSE</code> - is essentially the legacy behavior described above. The Hibernate session obtains a connection when it first needs to perform
                     some JDBC access and holds unto that connection until the session is closed. 
                  </p>
               </li>
               <li>
                  <p><code class="literal">AFTER_TRANSACTION</code> - <code class="literal">org.hibernate.Transaction</code> &#12364;&#23436;&#20102;&#12375;&#12383;&#24460;&#12289; &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#38283;&#25918;&#12375;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">AFTER_STATEMENT</code> &#65288;&#31309;&#26997;&#30340;&#12394;&#38283;&#25918;&#12392;&#12418;&#21628;&#12400;&#12428;&#12427;&#65289; - &#12377;&#12409;&#12390;&#12398;&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12364;&#12381;&#12428;&#12382;&#12428;&#23455;&#34892;&#12373;&#12428;&#12383;&#24460;&#12289;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12364;&#38283;&#25918;&#12373;&#12428;&#12414;&#12377;&#12290; &#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12364;&#12475;&#12483;&#12471;&#12519;&#12531;&#12395;&#38306;&#36899;&#12377;&#12427;&#12522;&#12477;&#12540;&#12473;&#12434;&#38283;&#12356;&#12383;&#12414;&#12414;&#12395;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289; &#12371;&#12398;&#31309;&#26997;&#30340;&#12394;&#38283;&#25918;&#12399;&#12473;&#12461;&#12483;&#12503;&#12373;&#12428;&#12414;&#12377;&#12290; &#20170;&#12398;&#12392;&#12371;&#12429;&#12289;&#12371;&#12428;&#12364;&#36215;&#12371;&#12427;&#12398;&#12399;
                     <code class="literal">org.hibernate.ScrollableResults</code> &#12364;&#20351;&#12431;&#12428;&#12427;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290; 
                  </p>
               </li>
            </ul>
         </div>
         <p>&#12467;&#12531;&#12501;&#12451;&#12464;&#12524;&#12540;&#12471;&#12519;&#12531;&#12497;&#12521;&#12513;&#12540;&#12479;&#12398; <code class="literal">hibernate.connection.release_mode</code> &#12399;&#12289;&#20351;&#29992;&#12377;&#12427;&#38283;&#25918;&#12514;&#12540;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12356;&#12414;&#12377;&#12290; &#25351;&#23450;&#12391;&#12365;&#12427;&#20516;&#12399;&#27425;&#12398;&#36890;&#12426;&#12391;&#12377;&#12290; 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p><code class="literal">auto</code> &#65288;&#12487;&#12501;&#12457;&#12523;&#12488;&#65289; - &#12371;&#12428;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392; <code class="literal">org.hibernate.transaction.TransactionFactory.getDefaultReleaseMode()</code> &#12513;&#12477;&#12483;&#12489;&#12395;&#12424;&#12387;&#12390;&#36820;&#12373;&#12428;&#12427;&#38283;&#25918;&#12514;&#12540;&#12489;&#12395;&#22996;&#35698;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289; JTATransactionFactory&#12395;&#12399;ConnectionReleaseMode.AFTER_STATEMENT&#12434;&#36820;&#12375;&#12289; JDBCTransactionFactory&#12395;&#12399;ConnectionReleaseMode.AFTER_TRANSACTION&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;
                     &#12371;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434;&#22793;&#12360;&#12390;&#12358;&#12414;&#12367;&#12356;&#12387;&#12383;&#35430;&#12375;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12381;&#12428;&#12399;&#12289;&#12371;&#12398;&#35373;&#23450;&#20516;&#12364;&#21407;&#22240;&#12391;&#36215;&#12371;&#12427;&#38556;&#23475;&#12399;&#12289; &#12518;&#12540;&#12470;&#12467;&#12540;&#12489;&#12398;&#20013;&#12391;&#12496;&#12464;&#12420;&#38291;&#36949;&#12387;&#12383;&#26465;&#20214;&#12395;&#12394;&#12426;&#12420;&#12377;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">on_close</code> - ConnectionReleaseMode.ON_CLOSE&#12434;&#20351;&#12356;&#12414;&#12377;&#12290; &#12371;&#12398;&#35373;&#23450;&#12399;&#24460;&#26041;&#20114;&#25563;&#12398;&#12383;&#12417;&#12395;&#27531;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#20351;&#12431;&#12394;&#12356;&#12371;&#12392;&#12434;&#24375;&#12367;&#21223;&#12417;&#12414;&#12377;&#12290; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">after_transaction</code> - ConnectionReleaseMode.AFTER_TRANSACTION&#12434;&#20351;&#12356;&#12414;&#12377;&#12290; &#12371;&#12398;&#35373;&#23450;&#12399;JTA&#29872;&#22659;&#12398;&#20013;&#12391;&#12399;&#20351;&#12358;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; ConnectionReleaseMode.AFTER_TRANSACTION&#12434;&#25351;&#23450;&#12375;&#12289;&#33258;&#21205;&#12467;&#12511;&#12483;&#12488;&#12514;&#12540;&#12489;&#12398;&#20013;&#12391;&#12399;&#12289;
                     &#38283;&#25918;&#12514;&#12540;&#12489;&#12364;AFTER_STATEMENT&#12391;&#12354;&#12427;&#12363;&#12398;&#12424;&#12358;&#12395;&#12289;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12399;&#38283;&#25918;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                  </p>
               </li>
               <li>
                  <p><code class="literal">after_statement</code> - ConnectionReleaseMode.AFTER_STATEMENT&#12434;&#20351;&#12356;&#12414;&#12377;&#12290; &#12373;&#12425;&#12395;&#12289;&#35373;&#23450;&#12373;&#12428;&#12383; <code class="literal">ConnectionProvider</code> &#12399;&#12289; &#12371;&#12398;&#35373;&#23450; (<code class="literal">supportsAggressiveRelease()</code>) &#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363; &#12434;&#35519;&#12409;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; &#12418;&#12375;&#12381;&#12358;&#12391;&#12394;&#12356;&#22580;&#21512;&#12289;&#38283;&#25918;&#12514;&#12540;&#12489;&#12399;ConnectionReleaseMode.AFTER_TRANSACTION &#12395;&#12522;&#12475;&#12483;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#35373;&#23450;&#12399;&#27425;&#12398;&#29872;&#22659;&#12391;&#12398;&#12415;&#23433;&#20840;&#12391;&#12377;&#12290; &#12381;&#12428;&#12399;&#12289;<code class="literal">ConnectionProvider.getConnection()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12383;&#12403;&#12395; &#22522;&#30436;&#12392;&#12394;&#12427;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12364;&#21516;&#12376;&#12418;&#12398;&#12434;&#21462;&#24471;&#12391;&#12365;&#12427;&#12363;&#12289; &#21516;&#12376;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12364;&#24471;&#12425;&#12428;&#12427;&#12371;&#12392;&#12364;&#21839;&#38988;&#12392;&#12394;&#12425;&#12394;&#12356;&#33258;&#21205;&#12467;&#12511;&#12483;&#12488;&#29872;&#22659;&#12398;&#20013;&#12391;&#12377;&#12290; 
                  </p>
               </li>
            </ul>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="transactions-locking.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="transactions.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="events.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">11.4. &#24754;&#35251;&#30340;&#12525;&#12483;&#12463;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;&#31532;12&#31456; &#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12392;&#12452;&#12505;&#12531;&#12488;</td>
            </tr>
         </table>
      </div>
   </body>
</html>