<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;11&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="prev" href="objectstate-metadata.html" title="10.12. &#12513;&#12479;&#12487;&#12540;&#12479;&#12398;&#20351;&#29992;">
      <link rel="next" href="transactions-demarcation.html" title="11.2. &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#22659;&#30028;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;11&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-metadata.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="transactions-demarcation.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="transactions"></a>&#31532;11&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate&#12392;&#21516;&#26178;&#23455;&#34892;&#21046;&#24481;&#12395;&#12388;&#12356;&#12390;&#26368;&#12418;&#37325;&#35201;&#12394;&#28857;&#12399;&#12289;&#23481;&#26131;&#12395;&#29702;&#35299;&#12391;&#12365;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290; Hibernate&#12399;&#26032;&#12383;&#12394;&#12525;&#12483;&#12463;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434;&#36861;&#21152;&#12375;&#12390;&#12362;&#12425;&#12378;&#12289;&#30452;&#25509;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12392;JTA&#12522;&#12477;&#12540;&#12473;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; JDBC&#12289;ANSI&#12289;&#12362;&#12424;&#12403;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#65288;DBMS&#65289;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#20998;&#38626;&#12398;&#20181;&#27096;&#12434;
            &#23569;&#12375;&#26178;&#38291;&#12434;&#12363;&#12369;&#12390;&#21193;&#24375;&#12377;&#12427;&#12371;&#12392;&#12434;&#24375;&#12367;&#25512;&#22888;&#12375;&#12414;&#12377;&#12290; 
         </p>
         <p>Hibernate&#12399;&#12513;&#12514;&#12522;&#20869;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12483;&#12463;&#12375;&#12414;&#12379;&#12435;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#20998;&#38626;&#12524;&#12505;&#12523;&#12391; &#23450;&#32681;&#12375;&#12383;&#25391;&#12427;&#33310;&#12356;&#12434;&#26399;&#24453;&#12391;&#12365;&#12414;&#12377;&#12290; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12473;&#12467;&#12540;&#12503;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12391;&#12418;&#12354;&#12427; <code class="literal">Session</code> &#12398;&#12362;&#38512;&#12391;&#12289; &#35672;&#21029;&#23376;&#12420;&#12463;&#12456;&#12522;&#12395;&#12424;&#12426;&#26908;&#32034;&#12375;&#12383;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#12522;&#12500;&#12540;&#12479;&#12502;&#12523;&#12522;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377; &#65288;&#12473;&#12459;&#12521;&#12540;&#20516;&#12434;&#36820;&#12377;&#12424;&#12358;&#12394;&#12524;&#12509;&#12540;&#12488;&#12463;&#12456;&#12522;&#12399;&#36949;&#12356;&#12414;&#12377;&#65289;&#12290; 
         </p>
         <p>&#12496;&#12540;&#12472;&#12519;&#12491;&#12531;&#12464;&#12395;&#12424;&#12427;&#33258;&#21205;&#30340;&#12394;&#27005;&#35251;&#30340;&#21516;&#26178;&#23455;&#34892;&#21046;&#24481;&#12395;&#21152;&#12360;&#12390;&#12289; <code class="literal">SELECT FOR UPDATE</code> &#25991;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289; &#34892;&#12434;&#24754;&#35251;&#30340;&#12525;&#12483;&#12463;&#12377;&#12427;&#12383;&#12417;&#12398;&#65288;&#12510;&#12452;&#12490;&#12540;&#12394;&#65289;API&#12418;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290; &#27005;&#35251;&#30340;&#21516;&#26178;&#23455;&#34892;&#21046;&#24481;&#12392;&#12371;&#12398;API&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12371;&#12398;&#31456;&#12398;&#24460;&#12398;&#12411;&#12358;&#12391;&#35696;&#35542;&#12375;&#12414;&#12377;&#12290; 
         </p>
         <p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12420;&#38263;&#12356;&#23550;&#35441;&#65288;conversation&#12289;&#12525;&#12531;&#12464;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#65289;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289; <code class="literal">Configuration</code>&#12289;<code class="literal">SessionFactory</code>&#12289;&#12362;&#12424;&#12403; <code class="literal">Session</code> &#12392;&#12356;&#12358;&#31890;&#24230;&#12391;Hibernate&#12364;&#34892;&#12358;&#21516;&#26178;&#23455;&#34892;&#21046;&#24481;&#12398;&#35696;&#35542;&#12434;&#22987;&#12417;&#12414;&#12377;&#12290; 
         </p>
         <div class="sect1" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="transactions-basics"></a>11.1. session&#12473;&#12467;&#12540;&#12503;&#12392;transaction&#12473;&#12467;&#12540;&#12503;
                     </h2>
                  </div>
               </div>
            </div>
            <p><code class="literal">SessionFactory</code> &#12399;&#29983;&#25104;&#12377;&#12427;&#12371;&#12392;&#12364;&#39640;&#20385;&#12391;&#12289; &#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290; &#12424;&#12387;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12377;&#12409;&#12390;&#12398;&#12473;&#12524;&#12483;&#12489;&#12391;&#20849;&#26377;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290; &#36890;&#24120;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36215;&#21205;&#26178;&#12395;&#12289; <code class="literal">Configuration</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#65297;&#24230;&#12384;&#12369;&#29983;&#25104;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p><code class="literal">Session</code> &#12399;&#39640;&#20385;&#12391;&#12399;&#12394;&#12367;&#12289;&#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12424;&#12387;&#12390;&#12289;&#65297;&#12388;&#12398;&#35201;&#27714;&#12420;&#65297;&#12388;&#12398;&#23550;&#35441;&#12289;&#65297;&#12388;&#12398;&#20316;&#26989;&#21336;&#20301;&#65288;unit of work&#65289;&#12395;&#23550;&#12375;&#12390;&#65297;&#24230;&#12384;&#12369;&#20351;&#12356;&#12289; &#12381;&#12398;&#24460;&#12391;&#25448;&#12390;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290; <code class="literal">Session</code> &#12399;&#24517;&#35201;&#12395;&#12394;&#12427;&#12414;&#12391;&#12289; JDBC <code class="literal">Connection</code>&#65288;&#12418;&#12375;&#12367;&#12399; <code class="literal">DataSource</code>&#65289;&#12434;&#29554;&#24471;&#12375;&#12414;&#12379;&#12435;&#12290; &#12422;&#12360;&#12395;&#12289;&#23455;&#38555;&#12395;&#20351;&#29992;&#12377;&#12427;&#12392;&#12365;&#12414;&#12391;&#12522;&#12477;&#12540;&#12473;&#12434;&#28040;&#36027;&#12375;&#12414;&#12379;&#12435;&#12290; 
            </p>
            <p>&#12371;&#12398;&#29366;&#27841;&#12434;&#23436;&#20102;&#12373;&#12379;&#12427;&#12383;&#12417;&#12395;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12418;&#32771;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20869;&#12398;&#12525;&#12483;&#12463;&#12398;&#31478;&#21512;&#12434;&#23569;&#12394;&#12367;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#21487;&#33021;&#12394;&#38480;&#12426;&#30701;&#12367;&#12377;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290; &#38263;&#12356;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#39640;&#12356;&#20006;&#21015;&#23455;&#34892;&#24615;&#12434;&#38459;&#23475;&#12375;&#12414;&#12377;&#12290;
               &#12422;&#12360;&#12395;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#32771;&#12360;&#12390;&#12356;&#12427;&#38291;&#65288;&#20316;&#26989;&#21336;&#20301;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#65289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434; &#38283;&#12356;&#12383;&#12414;&#12414;&#12395;&#12377;&#12427;&#12398;&#12399;&#12289;&#12383;&#12356;&#12390;&#12356;&#12398;&#22580;&#21512;&#12424;&#12356;&#35373;&#35336;&#12392;&#12399;&#12356;&#12360;&#12414;&#12379;&#12435;&#12290; 
            </p>
            <p>&#20316;&#26989;&#21336;&#20301;&#12392;&#12356;&#12358;&#12473;&#12467;&#12540;&#12503;&#12392;&#12399;&#20309;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#65297;&#12388;&#12398;Hibernate <code class="literal">Session</code> &#12399;&#12289; &#12356;&#12367;&#12388;&#12363;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12414;&#12383;&#12364;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#12414;&#12383;&#12399;&#12289;&#12473;&#12467;&#12540;&#12503;&#12392;&#19968;&#23550;&#19968;&#12398;&#38306;&#20418;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#12356;&#12388; <code class="literal">Session</code> &#12434;&#38283;&#12365;&#12289;&#38281;&#12376;&#12427;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#12381;&#12375;&#12390;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#22659;&#30028;&#12434;&#12393;&#12398;&#12424;&#12358;&#12395;&#20998;&#12369;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; 
            </p>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-uow"></a>11.1.1. &#20316;&#26989;&#21336;&#20301;&#65288;Unit of work&#65289;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#65297;&#12388;&#30446;&#12399;&#12289;<span class="emphasis"><em>session-per-operation</em></span> &#12450;&#12531;&#12481;&#12497;&#12479;&#12540;&#12531;&#12434;&#20351;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290; &#12377;&#12394;&#12431;&#12385;&#12289;&#65297;&#12388;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#20013;&#12391;&#12289;&#21336;&#32020;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21628;&#12403;&#20986;&#12375;&#12398;&#12383;&#12403;&#12395; <code class="literal">Session</code> &#12434;&#38283;&#12356;&#12390;&#12289;&#38281;&#12376;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#65281; &#12418;&#12385;&#12429;&#12435;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12418;&#21516;&#27096;&#12391;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20013;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21628;&#12403;&#20986;&#12375;&#12399;&#12289; &#35336;&#30011;&#12373;&#12428;&#12383;&#12471;&#12540;&#12465;&#12531;&#12473;&#65288;planned sequence&#65289;&#12434;&#20351;&#12356;&#12289; &#12450;&#12488;&#12511;&#12483;&#12463;&#12394;&#20316;&#26989;&#21336;&#20301;&#12395;&#20998;&#39006;&#12373;&#12428;&#12414;&#12377;&#12290;
                  &#65288;&#65297;&#12388;&#12398;SQL&#25991;&#12372;&#12392;&#12395;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;&#33258;&#21205;&#12467;&#12511;&#12483;&#12488;&#12364;&#12289; &#20351;&#12431;&#12428;&#12394;&#12356;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12418;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#33258;&#21205;&#12467;&#12511;&#12483;&#12488;&#12399;&#12289;SQL&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12450;&#12489;&#12507;&#12483;&#12463;&#12394;&#20316;&#26989;&#12434;&#12377;&#12427;&#38555;&#12395;&#20351;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290; Hibernate&#12399;&#30452;&#12385;&#12395;&#33258;&#21205;&#12467;&#12511;&#12483;&#12488;&#12514;&#12540;&#12489;&#12434;&#28961;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;
                  &#12418;&#12375;&#12367;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12540;&#12496;&#12540;&#12364;&#28961;&#21177;&#21270;&#12377;&#12427;&#12371;&#12392;&#12434;&#26399;&#24453;&#12375;&#12414;&#12377;&#12290;&#65289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12398;&#12377;&#12409;&#12390;&#12398;&#36890;&#20449;&#12399;&#12289;&#12487;&#12540;&#12479;&#12398;&#35501;&#12415;&#36796;&#12415;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289;&#26360;&#12365;&#36796;&#12415;&#12391;&#12354;&#12387;&#12390;&#12418;&#12289; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#20013;&#12391;&#34892;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
                  &#35500;&#26126;&#12377;&#12427;&#12392;&#12289;&#12487;&#12540;&#12479;&#35501;&#12415;&#36796;&#12415;&#12395;&#23550;&#12375;&#12390;&#12289;&#33258;&#21205;&#12467;&#12511;&#12483;&#12488;&#12399;&#36991;&#12369;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290; &#12394;&#12380;&#12394;&#12425;&#12289;&#22810;&#25968;&#12398;&#23567;&#12373;&#12394;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#26126;&#30906;&#12395;&#23450;&#32681;&#12373;&#12428;&#12383;&#65297;&#12388;&#12398;&#20316;&#26989;&#21336;&#20301;&#12392;&#27604;&#12409;&#12390;&#12289; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#12424;&#12367;&#12394;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#24460;&#32773;&#12399;&#20445;&#23432;&#24615;&#12420;&#25313;&#24373;&#24615;&#12418;&#12424;&#12426;&#12377;&#12368;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; 
               </p>
               <p>The most common pattern in a multi-user client/server application is <span class="emphasis"><em>session-per-request</em></span>. In this model, a request from the client is sent to the server (where the Hibernate persistence layer runs), a new Hibernate
                  <code class="literal">Session</code> is opened, and all database operations are executed in this unit of work. Once the work has been completed (and the response
                  for the client has been prepared), the session is flushed and closed. You would also use a single database transaction to
                  serve the clients request, starting and committing it when you open and close the <code class="literal">Session</code>. The relationship between the two is one-to-one and this model is a perfect fit for many applications. 
               </p>
               <p>The challenge lies in the implementation. Hibernate provides built-in management of the "current session" to simplify this
                  pattern. All you have to do is start a transaction when a server request has to be processed, and end the transaction before
                  the response is sent to the client. You can do this in any way you like, common solutions are <code class="literal">ServletFilter</code>, AOP interceptor with a pointcut on the service methods, or a proxy/interception container. An EJB container is a standardized
                  way to implement cross-cutting aspects such as transaction demarcation on EJB session beans, declaratively with CMT. If you
                  decide to use programmatic transaction demarcation, prefer the Hibernate <code class="literal">Transaction</code> API shown later in this chapter, for ease of use and code portability. 
               </p>
               <p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12467;&#12540;&#12489;&#12399;&#12289;&#24517;&#35201;&#12394;&#12392;&#12365;&#12395;&#12393;&#12371;&#12391;&#12418;&#12289;&#20309;&#22238;&#12391;&#12418;&#12289; &#21336;&#12395; <code class="literal">sessionFactory.getCurrentSession()</code> &#12434;&#21628;&#12403;&#20986;&#12377;&#12384;&#12369;&#12391; &#12300;&#29694;&#22312;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290; &#29694;&#22312;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12408;&#12398; <code class="literal">&#12475;&#12483;&#12471;&#12519;&#12531;</code> &#12434;&#24120;&#12395;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290; &#12522;&#12477;&#12540;&#12473;&#12539;&#12525;&#12540;&#12459;&#12523;&#12394;&#29872;&#22659;&#12289;&#12418;&#12375;&#12367;&#12399;JTA&#29872;&#22659;&#12434;&#27083;&#25104;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435; &#65288;<a href="architecture-current-session.html" title="2.5. &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;">&#38917;2.5. &#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#19978;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12290; 
               </p>
               <p>&#12392;&#12365;&#12393;&#12365;&#12289;&#12300;&#12499;&#12517;&#12540;&#12434;&#25551;&#30011;&#12377;&#12427;&#12301;&#12414;&#12391; <code class="literal">&#12475;&#12483;&#12471;&#12519;&#12531;</code> &#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12473;&#12467;&#12540;&#12503;&#12434;&#25313;&#24373;&#12377;&#12427;&#12392;&#20415;&#21033;&#12394;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;&#35201;&#27714;&#12398;&#20966;&#29702;&#12392;&#25551;&#30011;&#12398;&#12501;&#12455;&#12540;&#12474;&#12434;&#20998;&#12369;&#12390;&#12356;&#12427; &#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12362;&#12356;&#12390;&#29305;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290; &#29420;&#33258;&#12398;&#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12434;&#23455;&#35013;&#12377;&#12428;&#12400;&#12289; &#12499;&#12517;&#12540;&#12434;&#25551;&#30011;&#12377;&#12427;&#12414;&#12391;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#25313;&#24373;&#12377;&#12427;&#12398;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290;
                  &#12375;&#12363;&#12375;&#12289;&#12467;&#12531;&#12486;&#12490;&#31649;&#29702;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;EJB&#12395;&#38972;&#12427;&#22580;&#21512;&#12399;&#12289;&#31777;&#21336;&#12395;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12394;&#12380;&#12394;&#12425;&#12289;&#12499;&#12517;&#12540;&#12398;&#25551;&#30011;&#12434;&#38283;&#22987;&#12377;&#12427;&#21069;&#12395;&#12289;EJB&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#12522;&#12479;&#12540;&#12531;&#12375;&#12383;&#38555;&#12395;&#12289; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#23436;&#20102;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290; &#12371;&#12398; <span class="emphasis"><em>Open Session in View</em></span> &#12497;&#12479;&#12540;&#12531;&#12395;&#38306;&#36899;&#12377;&#12427;&#12498;&#12531;&#12488;&#12392;&#20363;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289; Hibernate&#12398;Web&#12469;&#12452;&#12488;&#12420;&#12501;&#12457;&#12540;&#12521;&#12512;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-apptx"></a>11.1.2. &#38263;&#12356;&#23550;&#35441;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>session-per-request&#12497;&#12479;&#12540;&#12531;&#12399;&#12289;&#20316;&#26989;&#21336;&#20301;&#12434;&#35373;&#35336;&#12377;&#12427;&#38555;&#12395;&#24441;&#31435;&#12388;&#32771;&#12360;&#12392;&#12356;&#12358;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#22810;&#12367;&#12398;&#12499;&#12472;&#12493;&#12473;&#12503;&#12525;&#12475;&#12473;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12392;&#12398;&#19968;&#36899;&#12398;&#30456;&#20114;&#20316;&#29992;&#20840;&#20307;&#12434;&#35201;&#27714;&#12375;&#12414;&#12377;&#12290; &#12381;&#12398;&#30456;&#20114;&#20316;&#29992;&#12395;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12450;&#12463;&#12475;&#12473;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290; Web&#12392;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;
                  &#12518;&#12540;&#12470;&#12392;&#12398;&#30456;&#20114;&#20316;&#29992;&#12395;&#12414;&#12391;&#28193;&#12427;&#12371;&#12392;&#12399;&#35377;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#27425;&#12398;&#20363;&#12434;&#12424;&#12367;&#32771;&#12360;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>&#12480;&#12452;&#12450;&#12525;&#12464;&#12398;&#26368;&#21021;&#12398;&#30011;&#38754;&#12364;&#38283;&#12365;&#12289;&#20491;&#12293;&#12398; <code class="literal">Session</code> &#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#20013;&#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#12518;&#12540;&#12470;&#12540;&#12395;&#35211;&#12379;&#12414;&#12377;&#12290; &#12518;&#12540;&#12470;&#12540;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#33258;&#30001;&#12395;&#20462;&#27491;&#12391;&#12365;&#12414;&#12377;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>5&#20998;&#24460;&#12395;&#12518;&#12540;&#12470;&#12540;&#12399;&#12300;Save&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#20462;&#27491;&#12364;&#27704;&#32154;&#21270;&#12373;&#12428;&#12427;&#12398;&#12434;&#26399;&#24453;&#12375;&#12414;&#12377;&#12290; &#12414;&#12383;&#12289;&#12371;&#12398;&#24773;&#22577;&#12434;&#32232;&#38598;&#12375;&#12383;&#12398;&#12399;&#33258;&#20998;&#65297;&#20154;&#12384;&#12369;&#12391;&#12289; &#20462;&#27491;&#12398;&#12467;&#12531;&#12501;&#12522;&#12463;&#12488;&#12399;&#30330;&#29983;&#12375;&#12394;&#12356;&#12392;&#26399;&#24453;&#12375;&#12414;&#12377;&#12290; </p>
                     </li>
                  </ul>
               </div>
               <p>&#12371;&#12398;&#20316;&#26989;&#21336;&#20301;&#12434;&#65288;&#12518;&#12540;&#12470;&#12540;&#12398;&#35222;&#28857;&#12391;&#65289;&#38263;&#26399;&#12398; <span class="emphasis"><em>&#23550;&#35441;</em></span> &#65288;&#12418;&#12375;&#12367;&#12399;&#12289;<span class="emphasis"><em>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;</em></span> &#65289;&#12392;&#21628;&#12403;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12371;&#12428;&#12434;&#23455;&#35013;&#12377;&#12427;&#26041;&#27861;&#12399;&#12383;&#12367;&#12373;&#12435;&#12354;&#12426;&#12414;&#12377;&#12290; 
               </p>
               <p>&#26368;&#21021;&#12395;&#24605;&#12356;&#12388;&#12367;&#23455;&#35013;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#32771;&#12360;&#12390;&#12356;&#12427;&#38291;&#12289;<code class="literal">Session</code> &#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#38283;&#12356;&#12383;&#12414;&#12414;&#12395;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290; &#21516;&#26178;&#12395;&#20462;&#27491;&#12373;&#12428;&#12378;&#12289;&#20998;&#38626;&#12392;&#21407;&#23376;&#24615;&#12364;&#20445;&#35388;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20869;&#12398;&#12525;&#12483;&#12463;&#12399;&#20445;&#25345;&#12375;&#12383;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290; &#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12428;&#12399;&#12450;&#12531;&#12481;&#12497;&#12479;&#12540;&#12531;&#12391;&#12377;&#12290; &#12394;&#12380;&#12394;&#12425;&#12289;&#12525;&#12483;&#12463;&#12398;&#31478;&#21512;&#12364;&#30330;&#29983;&#12377;&#12427;&#12392;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#21516;&#26178;&#12518;&#12540;&#12470;&#12540;&#25968;&#12395;&#24540;&#12376;&#12390;&#12473;&#12465;&#12540;&#12523;&#12450;&#12483;&#12503;&#12391;&#12365;&#12394;&#12367;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
                  
               </p>
               <p>Clearly, we have to use several database transactions to implement the conversation. In this case, maintaining isolation of
                  business processes becomes the partial responsibility of the application tier. A single conversation usually spans several
                  database transactions. It will be atomic if only one of these database transactions (the last one) stores the updated data,
                  all others simply read data (e.g. in a wizard-style dialog spanning several request/response cycles). This is easier to implement
                  than it might sound, especially if you use Hibernate's features: 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p><span class="emphasis"><em>Automatic Versioning</em></span> - Hibernate can do automatic optimistic concurrency control for you, it can automatically detect if a concurrent modification
                           occurred during user think time. Usually we only check at the end of the conversation. 
                        </p>
                     </li>
                     <li>
                        <p><span class="emphasis"><em>&#20998;&#38626;&#65288;Detached&#65289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</em></span> - &#12377;&#12391;&#12395;&#35696;&#35542;&#12375;&#12383; <span class="emphasis"><em>session-per-request</em></span> &#12497;&#12479;&#12540;&#12531;&#12434;&#20351;&#12358;&#12392;&#27770;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289; &#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#12518;&#12540;&#12470;&#12364;&#32771;&#12360;&#12390;&#12356;&#12427;&#38291;&#12399;&#12289; &#12475;&#12483;&#12471;&#12519;&#12531;&#12363;&#12425;&#20998;&#38626;&#12373;&#12428;&#12383;&#29366;&#24907;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12475;&#12483;&#12471;&#12519;&#12531;&#12395;&#20877;&#36861;&#21152;&#12375;&#12289;&#20462;&#27491;&#12434;&#27704;&#32154;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12428;&#12434; <span class="emphasis"><em>session-per-request-with-detached-objects</em></span> &#12497;&#12479;&#12540;&#12531;&#12392;&#21628;&#12403;&#12414;&#12377;&#12290; &#33258;&#21205;&#12496;&#12540;&#12472;&#12519;&#12491;&#12531;&#12464;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12289;&#21516;&#26178;&#12395;&#34892;&#12431;&#12428;&#12427;&#20462;&#27491;&#12434;&#20998;&#38626;&#12391;&#12365;&#12414;&#12377;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p><span class="emphasis"><em>Extended (or Long) Session</em></span> - The Hibernate <code class="literal">Session</code> may be disconnected from the underlying JDBC connection after the database transaction has been committed, and reconnected
                           when a new client request occurs. This pattern is known as <span class="emphasis"><em>session-per-conversation</em></span> and makes even reattachment unnecessary. Automatic versioning is used to isolate concurrent modifications and the <code class="literal">Session</code> is usually not allowed to be flushed automatically, but explicitly. 
                        </p>
                     </li>
                  </ul>
               </div>
               <p><span class="emphasis"><em>session-per-request-with-detached-objects</em></span> &#12392; <span class="emphasis"><em>session-per-conversation</em></span> &#12398;&#65298;&#12388;&#12399;&#12289; &#21033;&#28857;&#12392;&#27424;&#28857;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; &#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12371;&#12398;&#31456;&#12398;&#24460;&#12398;&#12411;&#12358;&#12391;&#12289;&#27005;&#35251;&#30340;&#21516;&#26178;&#23455;&#34892;&#21046;&#24481;&#12398;&#25991;&#33032;&#12398;&#20013;&#12391;&#35696;&#35542;&#12375;&#12414;&#12377;&#12290; 
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-identity"></a>11.1.3. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#35672;&#21029;&#23376;&#12434;&#32771;&#12360;&#12427;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#65298;&#12388;&#12398;&#30064;&#12394;&#12427; <code class="literal">Session</code> &#12363;&#12425; &#21516;&#12376;&#27704;&#32154;&#29366;&#24907;&#12395;&#21516;&#26178;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;&#65298;&#12388;&#12398; <code class="literal">Session</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364; &#27704;&#32154;&#24615;&#12463;&#12521;&#12473;&#12398;&#65297;&#12388;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20849;&#26377;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290; &#12422;&#12360;&#12395;&#12289;&#35672;&#21029;&#23376;&#12395;&#12399;&#65298;&#12388;&#12398;&#30064;&#12394;&#12427;&#27010;&#24565;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; 
               </p>
               <div class="variablelist">
                  <dl>
                     <dt><span class="term">&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35672;&#21029;&#23376;</span></dt>
                     <dd>
                        <p>
                                                       <code class="literal">foo.getId().equals( bar.getId() )</code>
                                                   
                        </p>
                     </dd>
                     <dt><span class="term">JVM&#35672;&#21029;&#23376;</span></dt>
                     <dd>
                        <p>
                                                       <code class="literal">foo==bar</code>
                                                   
                        </p>
                     </dd>
                  </dl>
               </div>
               <p>Then for objects attached to a <span class="emphasis"><em>particular</em></span> <code class="literal">Session</code> (i.e. in the scope of a <code class="literal">Session</code>) the two notions are equivalent, and JVM identity for database identity is guaranteed by Hibernate. However, while the application
                  might concurrently access the "same" (persistent identity) business object in two different sessions, the two instances will
                  actually be "different" (JVM identity). Conflicts are resolved using (automatic versioning) at flush/commit time, using an
                  optimistic approach. 
               </p>
               <p>&#12371;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12391;&#12399;&#12289;Hibernate&#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#21516;&#26178;&#23455;&#34892;&#12395;&#12388;&#12356;&#12390;&#12398;&#24515;&#37197;&#12364;&#27531;&#12426;&#12414;&#12377;&#12290; &#19968;&#26041;&#12391;&#12289;&#26368;&#39640;&#12398;&#12473;&#12465;&#12540;&#12521;&#12499;&#12522;&#12486;&#12451;&#12364;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290; &#12394;&#12380;&#12394;&#12425;&#12289;&#65297;&#12473;&#12524;&#12483;&#12489;&#12398;&#20316;&#26989;&#21336;&#20301;&#12398;&#20013;&#12391;&#19968;&#24847;&#24615;&#12364;&#20445;&#35388;&#12373;&#12428;&#12428;&#12400;&#12289; &#39640;&#20385;&#12394;&#12525;&#12483;&#12463;&#12420;&#21516;&#26399;&#21270;&#12364;&#19981;&#35201;&#12395;&#12394;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290; <code class="literal">Session</code> &#12372;&#12392;&#12395;&#65297;&#12388;&#12398;&#12473;&#12524;&#12483;&#12489;&#12434;&#36028;&#12426;&#20184;&#12369;&#12427;&#38480;&#12426;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12499;&#12472;&#12493;&#12473;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;synchronize&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; <code class="literal">Session</code> &#20869;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27604;&#36611;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; <code class="literal">==</code> &#12434;&#23433;&#20840;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; 
               </p>
               <p>&#12369;&#12428;&#12393;&#12418;&#12289;<code class="literal">Session</code> &#12398;&#22806;&#12391; <code class="literal">==</code> &#12434;&#20351;&#12358;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#20104;&#26399;&#12375;&#12394;&#12356;&#32080;&#26524;&#12395;&#36973;&#36935;&#12375;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#20104;&#26399;&#12375;&#12394;&#12356;&#22580;&#25152;&#12391;&#36215;&#12371;&#12426;&#12360;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#12289;&#65298;&#12388;&#12398;&#20998;&#38626;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21516;&#12376; <code class="literal">Set</code> &#12395; put&#12375;&#12383;&#12392;&#12365;&#12394;&#12393;&#12391;&#12377;&#12290; &#20001;&#26041;&#12392;&#12418;&#21516;&#12376;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35672;&#21029;&#23376;&#12434;&#25345;&#12385;&#12414;&#12377;&#65288;&#12377;&#12394;&#12431;&#12385;&#12289;&#21516;&#12376;&#34892;&#12434;&#34920;&#12375;&#12414;&#12377;&#65289;&#12290; &#12375;&#12363;&#12375;&#12289;&#20998;&#38626;&#29366;&#24907;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;JVM&#35672;&#21029;&#23376;&#12399;&#24403;&#28982;&#20445;&#35388;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; &#38283;&#30330;&#32773;&#12399;&#12289;&#27704;&#32154;&#24615;&#12463;&#12521;&#12473;&#12398; <code class="literal">equals()</code> &#12392; <code class="literal">hashCode()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#31561;&#20385;&#24615;&#12398;&#27010;&#24565;&#12434;&#23455;&#35013;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290; &#35686;&#21578;&#12364;&#65297;&#12388;&#12354;&#12426;&#12414;&#12377;&#12290;&#31561;&#20385;&#24615;&#12398;&#23455;&#35013;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35672;&#21029;&#23376;&#12434;&#20351;&#12431;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; &#12518;&#12491;&#12540;&#12463;&#12394;&#65288;&#26222;&#36890;&#12399;&#19981;&#22793;&#12398;&#65289;&#23646;&#24615;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12391;&#12354;&#12427;&#12499;&#12472;&#12493;&#12473;&#12461;&#12540;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12418;&#12375;&#12289;&#19968;&#26178;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35672;&#21029;&#23376;&#12364;&#22793;&#12431;&#12426;&#12414;&#12377;&#12290;
                  &#19968;&#26178;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#65288;&#36890;&#24120;&#20998;&#38626;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#20849;&#12395;&#65289; <code class="literal">Set</code> &#12395;&#20445;&#25345;&#12377;&#12427;&#22580;&#21512;&#12289;&#12495;&#12483;&#12471;&#12517;&#12467;&#12540;&#12489;&#12364;&#22793;&#12431;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289;<code class="literal">Set</code> &#12398;&#22865;&#32004;&#12434;&#30772;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; &#12499;&#12472;&#12493;&#12473;&#12461;&#12540;&#12398;&#12383;&#12417;&#12398;&#23646;&#24615;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#20027;&#12461;&#12540;&#12411;&#12393;&#23433;&#23450;&#12377;&#12409;&#12365;&#12391;&#12399;&#12394;&#12356;&#12391;&#12377;&#12290; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21516;&#12376; <code class="literal">Set</code> &#12398;&#20013;&#12395;&#12356;&#12427;&#38291;&#12384;&#12369;&#12289;&#23433;&#23450;&#12434;&#20445;&#35388;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290; &#12371;&#12398;&#21839;&#38988;&#12398;&#12424;&#12426;&#24505;&#24213;&#30340;&#12394;&#35696;&#35542;&#12399;&#12289;Hibernate&#12398;Web&#12469;&#12452;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12414;&#12383;&#12289;&#12371;&#12428;&#12399;Hibernate&#12398;&#21839;&#38988;&#12391;&#12399;&#12394;&#12367;&#12289;&#21336;&#12395;Java&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12420;&#31561;&#20385;&#24615;&#12434; &#12393;&#12398;&#12424;&#12358;&#12395;&#23455;&#35013;&#12377;&#12409;&#12365;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
                  
               </p>
            </div>
            <div class="sect2" lang="ja-JP">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-issues"></a>11.1.4. &#19968;&#33324;&#30340;&#12394;&#21839;&#38988;
                        </h3>
                     </div>
                  </div>
               </div>
               <p><span class="emphasis"><em>session-per-user-session</em></span> &#12392; <span class="emphasis"><em>session-per-application</em></span> &#12450;&#12531;&#12481;&#12497;&#12479;&#12540;&#12531; &#12399;&#20351;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#65288;&#12418;&#12385;&#12429;&#12435;&#12289;&#12414;&#12428;&#12395;&#20363;&#22806;&#12364;&#12354;&#12426;&#12414;&#12377;&#65289;&#12290; &#27880;&#24847;&#65306;&#19979;&#35352;&#12398;&#21839;&#38988;&#12398;&#12356;&#12367;&#12388;&#12363;&#12399;&#12289;&#25512;&#22888;&#12373;&#12428;&#12427;&#12497;&#12479;&#12540;&#12531;&#12392;&#12375;&#12390;&#12418;&#20986;&#29694;&#12375;&#12414;&#12377;&#12290; &#35373;&#35336;&#12434;&#27770;&#23450;&#12377;&#12427;&#21069;&#12395;&#12289;&#35023;&#12398;&#24847;&#21619;&#12434;&#29702;&#35299;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p><code class="literal">Session</code> &#12399;&#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; HTTP&#12522;&#12463;&#12456;&#12473;&#12488;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12289;Swing&#12527;&#12540;&#12459;&#12540;&#12398;&#12424;&#12358;&#12395;&#12289; &#21516;&#26178;&#23455;&#34892;&#12364;&#21487;&#33021;&#12394;&#12418;&#12398;&#12364; <code class="literal">Session</code> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20849;&#26377;&#12377;&#12427;&#12392;&#12289; &#31478;&#21512;&#29366;&#24907;&#12434;&#24341;&#12365;&#36215;&#12371;&#12375;&#12414;&#12377;&#12290; &#65288;&#24460;&#12391;&#35696;&#35542;&#12377;&#12427;&#65289;<code class="literal">HttpSession</code> &#12398;&#20013;&#12391; Hibernate <code class="literal">Session</code> &#12434;&#20445;&#25345;&#12377;&#12427;&#22580;&#21512;&#12289; HttpSession&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#21516;&#26399;&#21270;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#24942;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290; &#12373;&#12418;&#12394;&#12369;&#12428;&#12400;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#21313;&#20998;&#26089;&#12367;&#12522;&#12525;&#12540;&#12489;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289; &#21516;&#26178;&#12395;&#36208;&#12427;&#65298;&#12388;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#20013;&#12391;&#12289;&#21516;&#12376; <code class="literal">Session</code> &#12364;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p>Hibernate&#12364;&#20363;&#22806;&#12434;&#25237;&#12370;&#12383;&#22580;&#21512;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12375;&#12289; &#30452;&#12385;&#12395; <code class="literal">Session</code> &#12434;&#38281;&#12376;&#12427;&#12409;&#12365;&#12391;&#12377;&#65288;&#35443;&#32048;&#12434;&#24460;&#12391;&#35696;&#35542;&#12375;&#12414;&#12377;&#65289;&#12290; <code class="literal">Session</code> &#12364;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#32080;&#12403;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20572;&#27490;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12375;&#12390;&#12418;&#12289;&#12499;&#12472;&#12493;&#12473;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#38283;&#22987;&#12375;&#12383;&#12392;&#12365;&#12398;&#29366;&#24907;&#12395;&#25147;&#12426;&#12414;&#12379;&#12435;&#12290; &#12371;&#12428;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#29366;&#24907;&#12392;&#12499;&#12472;&#12493;&#12473;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#21516;&#26399;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
                           &#36890;&#24120;&#12371;&#12428;&#12399;&#21839;&#38988;&#12395;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12394;&#12380;&#12394;&#12425;&#12289;&#20363;&#22806;&#12399;&#22238;&#24489;&#12391;&#12365;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290; &#12392;&#12395;&#12363;&#12367;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12375;&#12383;&#24460;&#12395;&#12420;&#12426;&#30452;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290; 
                        </p>
                     </li>
                     <li>
                        <p><code class="literal">Session</code> &#12399;&#27704;&#32154;&#65288;persistent&#65289;&#29366;&#24907;&#12398;&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; &#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;&#65288;Hibernate&#12399;&#30435;&#35222;&#12375;&#12289;&#12480;&#12540;&#12486;&#12451;&#29366;&#24907;&#12363;&#12481;&#12455;&#12483;&#12463;&#12375;&#12414;&#12377;&#65289;&#12290; &#12371;&#12428;&#12399;&#12289;&#38263;&#12356;&#38291;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#38283;&#12356;&#12383;&#12414;&#12414;&#12395;&#12377;&#12427;&#12363;&#12289; &#38750;&#24120;&#12395;&#22810;&#12367;&#12398;&#12487;&#12540;&#12479;&#12434;&#12525;&#12540;&#12489;&#12375;&#32154;&#12369;&#12427;&#12363;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289; OutOfMemoryException&#12364;&#30330;&#29983;&#12377;&#12427;&#12414;&#12391;&#28961;&#38480;&#12395;&#22823;&#12365;&#12367;&#12394;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
                           &#35299;&#27770;&#31574;&#12398;&#65297;&#12388;&#12399;&#12289;<code class="literal">Session</code> &#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#31649;&#29702;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; <code class="literal">clear()</code> &#12363; <code class="literal">evict()</code> &#12434;&#21628;&#12406;&#12371;&#12392;&#12391;&#12377;&#12290; &#12375;&#12363;&#12375;&#12289;&#22823;&#12365;&#12394;&#12487;&#12540;&#12479;&#12434;&#20966;&#29702;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289; &#12383;&#12406;&#12435;&#12473;&#12488;&#12450;&#12489;&#12503;&#12525;&#12471;&#12540;&#12472;&#12515;&#12434;&#32771;&#24942;&#12377;&#12427;&#12409;&#12365;&#12391;&#12375;&#12423;&#12358;&#12290; &#12356;&#12367;&#12388;&#12363;&#12398;&#35299;&#27770;&#31574;&#12399;&#12289;<a href="batch.html" title="&#31532;13&#31456; &atilde;&#131;&#144;&atilde;&#131;&#131;&atilde;&#131;&#129;&aring;&#135;&brvbar;&ccedil;&#144;&#134;">&#31456;&nbsp;13. <i xmlns:xlink="http://www.w3.org/1999/xlink">&atilde;&#131;&#144;&atilde;&#131;&#131;&atilde;&#131;&#129;&aring;&#135;&brvbar;&ccedil;&#144;&#134;</i></a> &#12391;&#32057;&#20171;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; &#12518;&#12540;&#12470;&#12540;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#38291;&#12289;<code class="literal">Session</code> &#12434;&#38283;&#12356;&#12383;&#12414;&#12414;&#12395;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12289; &#12487;&#12540;&#12479;&#12364;&#26032;&#39854;&#12391;&#12394;&#12367;&#12394;&#12427;&#30906;&#29575;&#12364;&#39640;&#12367;&#12394;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290; 
                        </p>
                     </li>
                  </ul>
               </div>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-metadata.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="transactions-demarcation.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.12. &#12513;&#12479;&#12487;&#12540;&#12479;&#12398;&#20351;&#29992;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;11.2. &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#22659;&#30028;</td>
            </tr>
         </table>
      </div>
   </body>
</html>