<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>1.2. &#12497;&#12540;&#12488;1 - &#21021;&#12417;&#12390;&#12398;Hibernate&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="tutorial.html" title="&#31532;1&#31456; Hibernate&#12398;&#23566;&#20837;">
      <link rel="prev" href="tutorial.html" title="&#31532;1&#31456; Hibernate&#12398;&#23566;&#20837;">
      <link rel="next" href="tutorial-associations.html" title="1.3. &#12497;&#12540;&#12488;2 - &#38306;&#36899;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">1.2. &#12497;&#12540;&#12488;1 - &#21021;&#12417;&#12390;&#12398;Hibernate&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="tutorial.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;1&#31456; Hibernate&#12398;&#23566;&#20837;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="tutorial-associations.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="tutorial-firstapp"></a>1.2. &#12497;&#12540;&#12488;1 - &#21021;&#12417;&#12390;&#12398;Hibernate&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;
                  </h2>
               </div>
            </div>
         </div>
         <p>Let's assume we need a small database application that can store events we want to attend, and information about the host(s)
            of these events. We will use an in-memory, Java database named HSQLDB to avoid describing installation/setup of any particular
            database servers. Feel free to tweak this tutorial to use whatever database you feel comfortable using. 
         </p>
         <p>The first thing we need to do is set up our development environment, and specifically to setup all the required dependencies
            to Hibernate as well as other libraries. Hibernate is built using Maven which amongst other features provides <code class="literal">dependecy management</code>; moreover it provides <span class="emphasis"><em>transitive</em></span> <code class="literal">dependecy management</code> which simply means that to use Hibernate we can simply define our dependency on Hibernate, Hibernate itself defines the dependencies
            it needs which then become transitive dependencies of our project. 
         </p><pre class="programlisting">.
&lt;project xmlns="http://maven.apache.org/POM/4.0.0"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
         xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd"&gt;

    ...

    &lt;dependencies&gt;
        &lt;dependency&gt;
            &lt;groupId
&gt;${groupId}&lt;/groupId&gt;
            &lt;artifactId
&gt;hibernate-core&lt;/artifactId&gt;
        &lt;/dependency&gt;

        &lt;!-- Because this is a web app, we also have a dependency on the servlet api. --&gt;
        &lt;dependency&gt;
            &lt;groupId
&gt;javax.servlet&lt;/groupId&gt;
            &lt;artifactId
&gt;servlet-api&lt;/artifactId&gt;
        &lt;/dependency&gt;
    &lt;/dependencies&gt;

&lt;/project
&gt;</pre><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;">
            <h3 class="title">&#27880;&#24847;</h3>
            <p>Essentially we are describing here the <code class="filename">/tutorials/web/pom.xml</code> file. See the <a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://maven.org" target="_top">Maven</a> site for more information. 
            </p>
         </div>
         <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;">
            <h3 class="title">&#12486;&#12451;&#12483;&#12503;</h3>
            <p>While not strictly necessary, most IDEs have integration with Maven to read these POM files and automatically set up a project
               for you which can save lots of time and effort. 
            </p>
         </div>
         <p>&#27425;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#26684;&#32013;&#12377;&#12427;&#12452;&#12505;&#12531;&#12488;&#12434;&#34920;&#12377;&#12463;&#12521;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290; </p>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-firstclass"></a>1.2.1. &#26368;&#21021;&#12398;&#12463;&#12521;&#12473;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#26368;&#21021;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12399;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12356;&#12367;&#12388;&#12363;&#25345;&#12388;&#12471;&#12531;&#12503;&#12523;&#12394;JavaBean&#12391;&#12377;&#65306; </p><pre class="programlisting">package org.hibernate.tutorial.domain;

import java.util.Date;

public class Event {
    private Long id;

    private String title;
    private Date date;

    public Event() {}

    public Long getId() {
        return id;
    }

    private void setId(Long id) {
        this.id = id;
    }

    public Date getDate() {
        return date;
    }

    public void setDate(Date date) {
        this.date = date;
    }

    public String getTitle() {
        return title;
    }

    public void setTitle(String title) {
        this.title = title;
    }
}</pre><p>&#12372;&#35239;&#12398;&#12392;&#12362;&#12426;&#12289;&#12371;&#12398;&#12463;&#12521;&#12473;&#12399;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;private&#12398;&#21487;&#35222;&#24615;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12398;&#12392;&#21516;&#26178;&#12395;&#12289; JavaBean&#27161;&#28310;&#12398;&#12466;&#12483;&#12479;&#12540;&#12289;&#12475;&#12483;&#12479;&#12540;&#12513;&#12477;&#12483;&#12489;&#12398;&#21629;&#21517;&#35215;&#32004;&#12395;&#24467;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; &#12371;&#12398;&#12424;&#12358;&#12394;&#35373;&#35336;&#12399;&#25512;&#22888;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#24517;&#38920;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12450;&#12463;&#12475;&#12469;&#12513;&#12477;&#12483;&#12489;&#12434;&#35373;&#12369;&#12427;&#12398;&#12399;&#12522;&#12501;&#12449;&#12463;&#12479;&#12522;&#12531;&#12464;&#12434;&#32771;&#12360;&#12383;&#38929;&#20581;&#24615;&#12398;&#12383;&#12417;&#12391;&#12289;
               Hibernate&#12399;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#30452;&#25509;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290; &#24341;&#25968;&#12398;&#12394;&#12356;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12399;&#12289;&#12522;&#12501;&#12524;&#12463;&#12471;&#12519;&#12531;&#12391;&#12371;&#12398;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12383;&#12417;&#12395; &#24517;&#35201;&#12391;&#12377;&#12290; 
            </p>
            <p><code class="literal">id</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12354;&#12427;&#29305;&#23450;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#23550;&#12377;&#12427;&#12518;&#12491;&#12540;&#12463;&#12394;&#35672;&#21029;&#23376;&#12398;&#20516;&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290; Hibernate&#12398;&#23436;&#20840;&#12394;&#27231;&#33021;&#12434;&#20351;&#12356;&#12383;&#12369;&#12428;&#12400;&#12289;&#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12463;&#12521;&#12473; &#65288;&#12381;&#12428;&#12411;&#12393;&#37325;&#35201;&#12391;&#12399;&#12394;&#12356;&#20381;&#23384;&#12463;&#12521;&#12473;&#12392;&#12356;&#12358;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#65289; &#12395;&#12371;&#12398;&#12424;&#12358;&#12394;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
               &#20107;&#23455;&#19978;&#12411;&#12392;&#12435;&#12393;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#65288;&#29305;&#12395;web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#65289;&#12391;&#12399;&#12289; &#35672;&#21029;&#23376;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21306;&#21029;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;&#12371;&#12428;&#12399;&#21046;&#38480;&#12392;&#12356;&#12358;&#12424;&#12426;&#12418;&#29305;&#24500;&#12391;&#12354;&#12427;&#12392;&#32771;&#12360;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290; &#12375;&#12363;&#12375;&#36890;&#24120;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;ID&#12434;&#25805;&#20316;&#12377;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290; &#12381;&#12398;&#12383;&#12417;&#12475;&#12483;&#12479;&#12540;&#12513;&#12477;&#12483;&#12489;&#12399;private&#12395;&#12377;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
               Hibernate&#12384;&#12369;&#12364;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12475;&#12540;&#12502;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#35672;&#21029;&#23376;&#12408;&#20516;&#12434;&#20195;&#20837;&#12375;&#12414;&#12377;&#12290; Hibernate&#12364;&#65288;public, private, protected&#65289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#30452;&#25509;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12398;&#12392;&#21516;&#27096;&#12395;&#12289; public, private, protected&#12398;&#12450;&#12463;&#12475;&#12469;&#12513;&#12477;&#12483;&#12489;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12431;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
               &#36984;&#25246;&#12399;&#12354;&#12394;&#12383;&#12395;&#20219;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#12354;&#12394;&#12383;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#35373;&#35336;&#12395;&#21512;&#12431;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
            <p>&#24341;&#25968;&#12398;&#12394;&#12356;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12399;&#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12395;&#24517;&#38920;&#12391;&#12377;&#12290; &#12371;&#12428;&#12399;Hibernate&#12364;Java&#12398;&#12522;&#12501;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12387;&#12390;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20316;&#25104;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12383;&#12417;&#12391;&#12377;&#12290; &#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12434;private&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#21487;&#33021;&#12391;&#12377;&#12364;&#12289; &#23455;&#34892;&#26178;&#12398;&#12503;&#12525;&#12461;&#12471;&#29983;&#25104;&#12392;&#12289;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#25805;&#20316;&#12394;&#12375;&#12398;&#21177;&#29575;&#30340;&#12394;&#12487;&#12540;&#12479;&#12398;&#25277;&#20986;&#12395;&#12399;&#12289;
               package&#21487;&#35222;&#24615;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290; 
            </p>
            <p>&#38283;&#30330;&#12501;&#12457;&#12523;&#12480;&#12398; <code class="literal">src</code> &#12392;&#12356;&#12358;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#36969;&#20999;&#12394;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#12289; &#12371;&#12398;Java&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12434;&#37197;&#32622;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12398;&#26178;&#28857;&#12391;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#65306; 
            </p><pre class="programlisting">.
+lib
  &lt;Hibernate and third-party libraries&gt;
+src
  +events
    Event.java</pre><p>&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;&#12391;&#12399;&#12289;Hibernate&#12395;&#12371;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#24773;&#22577;&#12434;&#25945;&#12360;&#12414;&#12377;&#12290; </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-mapping"></a>1.2.2. &#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;
                     </h3>
                  </div>
               </div>
            </div>
            <p>Hibernate&#12399;&#12289;&#12393;&#12398;&#12424;&#12358;&#12395;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12375;&#26684;&#32013;&#12377;&#12428;&#12400;&#12424;&#12356;&#12363;&#12434;&#30693;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12371;&#12391;Hibernate&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12364;&#30331;&#22580;&#12375;&#12414;&#12377;&#12290; &#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20869;&#12398;&#12393;&#12398;&#12486;&#12540;&#12502;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12363;&#12289;
               &#12381;&#12398;&#12486;&#12540;&#12502;&#12523;&#12398;&#12393;&#12398;&#12459;&#12521;&#12512;&#12434;&#20351;&#12358;&#12409;&#12365;&#12363;&#12434;&#12289;Hibernate&#12395;&#25945;&#12360;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12398;&#22522;&#26412;&#30340;&#12394;&#27083;&#36896;&#12399;&#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#65306; </p><pre class="programlisting">&lt;?xml version="1.0"?&gt;
&lt;!DOCTYPE hibernate-mapping PUBLIC
        "-//Hibernate/Hibernate Mapping DTD 3.0//EN"
        "http://hibernate.sourceforge.net/hibernate-mapping-3.0.dtd"&gt;

&lt;hibernate-mapping&gt;
[...]
&lt;/hibernate-mapping&gt;</pre><p>Hibernate DTD&#12364;&#38750;&#24120;&#12395;&#27927;&#32244;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27880;&#30446;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12398;DTD&#12399;&#12289;&#12456;&#12487;&#12451;&#12479;&#12420;IDE&#12391;&#12398;XML&#12510;&#12483;&#12500;&#12531;&#12464;&#35201;&#32032;&#12392;&#23646;&#24615;&#12398;&#12458;&#12540;&#12488;&#12467;&#12531;&#12503;&#12522;&#12540;&#12471;&#12519;&#12531;&#27231;&#33021;&#12395;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12414;&#12383;DTD&#12501;&#12449;&#12452;&#12523;&#12434;&#12486;&#12461;&#12473;&#12488;&#12456;&#12487;&#12451;&#12479;&#12391;&#38283;&#12369;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12392;&#12356;&#12358;&#12398;&#12418;&#12289;&#12377;&#12409;&#12390;&#12398;&#35201;&#32032;&#12392;&#23646;&#24615;&#12434;&#27010;&#35251;&#12375;&#12289;
               &#12467;&#12513;&#12531;&#12488;&#12420;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#20516;&#12434;&#35211;&#12427;&#12395;&#12399;&#19968;&#30058;&#31777;&#21336;&#12394;&#26041;&#27861;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290; Hibernate&#12399;&#12289;web&#12363;&#12425;DTD&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12379;&#12378;&#12395;&#12289; &#12414;&#12378;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;&#12363;&#12425;&#12371;&#12428;&#12434;&#25506;&#12375;&#20986;&#12381;&#12358;&#12392;&#12377;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; DTD&#12501;&#12449;&#12452;&#12523;&#12399;Hibernate&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;
               <code class="literal">src/</code> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12392;&#21516;&#27096;&#12289;<code class="literal">hibernate3.jar</code> &#12395;&#12418;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; 
            </p>
            <p>&#20197;&#38477;&#12398;&#20363;&#12391;&#12399;&#12467;&#12540;&#12489;&#12434;&#30701;&#12367;&#12377;&#12427;&#12383;&#12417;&#12395;DTD&#23459;&#35328;&#12434;&#30465;&#30053;&#12375;&#12414;&#12377;&#12290; &#24403;&#28982;&#12391;&#12377;&#12364;&#12371;&#12428;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; </p>
            <p>2&#12388;&#12398; <code class="literal">hibernate-mapping</code> &#12479;&#12464;&#12398;&#38291;&#12395; <code class="literal">class</code> &#35201;&#32032;&#12434;&#21547;&#12417;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12463;&#12521;&#12473;&#65288;&#24565;&#12434;&#25276;&#12375;&#12414;&#12377;&#12364;&#12289; &#12501;&#12449;&#12540;&#12473;&#12488;&#12463;&#12521;&#12473;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12391;&#12399;&#12394;&#12356;&#20381;&#23384;&#12463;&#12521;&#12473;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#24460;&#12411;&#12393;&#30331;&#22580;&#12375;&#12414;&#12377;&#65289; &#12399;SQL&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20869;&#12398;&#12486;&#12540;&#12502;&#12523;&#12408;&#12398;&#12371;&#12398;&#12424;&#12358;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">&lt;hibernate-mapping&gt;

    &lt;class name="events.Event" table="EVENTS"&gt;

    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>&#12371;&#12428;&#12414;&#12391;&#31169;&#12383;&#12385;&#12399;&#12289;<code class="literal">Event</code> &#12463;&#12521;&#12473;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; <code class="literal">EVENTS</code> &#12486;&#12540;&#12502;&#12523;&#12395;&#23550;&#12375;&#12390;&#12289;&#12393;&#12398;&#12424;&#12358;&#12395;&#27704;&#32154;&#21270;&#12375;&#12383;&#12426;&#12525;&#12540;&#12489;&#12375;&#12383;&#12426;&#12377;&#12427;&#12398;&#12363;&#12434; Hibernate&#12395;&#25945;&#12360;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;&#12381;&#12375;&#12390;&#20491;&#12293;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12486;&#12540;&#12502;&#12523;&#12398;&#34892;&#12392;&#12375;&#12390;&#34920;&#29694;&#12373;&#12428;&#12414;&#12377;&#12290; &#12381;&#12428;&#12391;&#12399;&#24341;&#12365;&#32154;&#12365;&#12486;&#12540;&#12502;&#12523;&#12398;&#20027;&#12461;&#12540;&#12395;&#23550;&#12377;&#12427;&#12518;&#12491;&#12540;&#12463;&#12394;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
               &#12373;&#12425;&#12395;&#12289;&#12371;&#12398;&#35672;&#21029;&#23376;&#12398;&#25201;&#12356;&#12395;&#27671;&#12434;&#20351;&#12356;&#12383;&#12367;&#12394;&#12363;&#12387;&#12383;&#12398;&#12392;&#21516;&#27096;&#12395;&#12289; &#20195;&#29702;&#12398;&#20027;&#12461;&#12540;&#12459;&#12521;&#12512;&#12395;&#23550;&#12377;&#12427;Hibernate&#12398;&#35672;&#21029;&#23376;&#29983;&#25104;&#25126;&#30053;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">&lt;hibernate-mapping&gt;

    &lt;class name="events.Event" table="EVENTS"&gt;
        &lt;id name="id" column="EVENT_ID"&gt;
            &lt;generator class="native"/&gt;
        &lt;/id&gt;
    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>The <code class="literal">id</code> element is the declaration of the identifier property, <code class="literal">name="id"</code> declares the name of the Java property - Hibernate will use the getter and setter methods to access the property. The column
               attribute tells Hibernate which column of the <code class="literal">EVENTS</code> table we use for this primary key. The nested <code class="literal">generator</code> element specifies the identifier generation strategy, in this case we used <code class="literal">native</code>, which picks the best strategy depending on the configured database (dialect). Hibernate supports database generated, globally
               unique, as well as application assigned identifiers (or any strategy you have written an extension for). 
            </p>
            <p>&#26368;&#24460;&#12395;&#12463;&#12521;&#12473;&#12398;&#27704;&#32154;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#23459;&#35328;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12395;&#21547;&#12417;&#12414;&#12377;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#27704;&#32154;&#12392;&#35211;&#12394;&#12373;&#12428;&#12414;&#12379;&#12435;&#65306; </p><pre class="programlisting">
&lt;hibernate-mapping&gt;

    &lt;class name="events.Event" table="EVENTS"&gt;
        &lt;id name="id" column="EVENT_ID"&gt;
            &lt;generator class="native"/&gt;
        &lt;/id&gt;
        &lt;property name="date" type="timestamp" column="EVENT_DATE"/&gt;
        &lt;property name="title"/&gt;
    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p><code class="literal">id</code> &#35201;&#32032;&#12398;&#22580;&#21512;&#12392;&#21516;&#27096;&#12395;&#12289; <code class="literal">property</code> &#35201;&#32032;&#12398; <code class="literal">name</code> &#23646;&#24615;&#12391;&#12289;&#12393;&#12398;&#12466;&#12483;&#12479;&#12540;&#12392;&#12475;&#12483;&#12479;&#12540;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12358;&#12409;&#12365;&#12363;&#12434;Hibernate&#12395;&#25945;&#12360;&#12414;&#12377;&#12290; &#12371;&#12398;&#20363;&#12391;&#12399;&#12289;Hibernate&#12399; <code class="literal">getDate()/setDate()</code> &#12392; <code class="literal">getTitle()/setTitle()</code> &#12434; &#25506;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12394;&#12380; <code class="literal">date</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12395;&#12399; <code class="literal">column</code> &#23646;&#24615;&#12364;&#12354;&#12426;&#12289;<code class="literal">title</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12399;&#12394;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; <code class="literal">column</code> &#23646;&#24615;&#12364;&#12394;&#12369;&#12428;&#12400;&#12289;Hibernate&#12399;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#12459;&#12521;&#12512;&#21517;&#12392;&#12375;&#12390;&#20351;&#12356;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399; <code class="literal">title</code> &#12391;&#12399;&#19978;&#25163;&#12367;&#34892;&#12365;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375; <code class="literal">date</code> &#12399;&#12411;&#12392;&#12435;&#12393;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12391;&#20104;&#32004;&#35486;&#12394;&#12398;&#12391;&#12289; &#36949;&#12358;&#21517;&#21069;&#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12383;&#26041;&#12364;&#12424;&#12356;&#12398;&#12391;&#12377;&#12290; 
            </p>
            <p>&#27425;&#12395;&#33288;&#21619;&#28145;&#12356;&#12398;&#12399; <code class="literal">title</code> &#12510;&#12483;&#12500;&#12531;&#12464;&#12364; <code class="literal">type</code> &#23646;&#24615;&#12434;&#12418;&#27424;&#12356;&#12390;&#12356;&#12427;&#28857;&#12391;&#12377;&#12290; &#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12391;&#23459;&#35328;&#12375;&#12390;&#20351;&#12358;type&#12399;&#12289;&#12362;&#12431;&#12363;&#12426;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;Java&#12398;&#12487;&#12540;&#12479;&#22411;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; SQL&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#22411;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12371;&#12428;&#12399; <span class="emphasis"><em>Hibernate&#12510;&#12483;&#12500;&#12531;&#12464;&#22411;</em></span> &#12392;&#21628;&#12400;&#12428;&#12427;&#12289; Java&#12363;&#12425;SQL&#12487;&#12540;&#12479;&#12398;&#22411;&#12408;&#12414;&#12383;&#12399;SQL&#12363;&#12425;Java&#12487;&#12540;&#12479;&#22411;&#12408;&#32763;&#35379;&#12377;&#12427;&#12467;&#12531;&#12496;&#12540;&#12479;&#12391;&#12377;&#12290; &#32368;&#12426;&#36820;&#12375;&#12395;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;Hibernate&#12399; <code class="literal">type</code> &#23646;&#24615;&#12364;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#20869;&#12395;&#12394;&#12369;&#12428;&#12400;&#12289; &#27491;&#12375;&#12356;&#12467;&#12531;&#12496;&#12540;&#12472;&#12519;&#12531;&#12392;&#12510;&#12483;&#12500;&#12531;&#12464;&#22411;&#12434;&#33258;&#20998;&#12391;&#35299;&#27770;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290; &#65288;Java&#12463;&#12521;&#12473;&#12398;&#12522;&#12501;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12387;&#12383;&#65289;&#12371;&#12398;&#33258;&#21205;&#26908;&#30693;&#12399;&#12289; &#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12354;&#12394;&#12383;&#12364;&#26399;&#24453;&#12414;&#12383;&#12399;&#24517;&#35201;&#12392;&#12377;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#12394;&#12425;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
               <code class="literal">date</code> &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#22580;&#21512;&#12364;&#12381;&#12358;&#12391;&#12375;&#12383;&#12290; Hibernate&#12399;&#12371;&#12398;&#65288; <code class="literal">java.util.Date</code> &#12398;&#65289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; SQL&#12398; <code class="literal">date</code> , <code class="literal">timestamp</code> , <code class="literal">time</code> &#12398;&#12358;&#12385;&#12289;&#12393;&#12398;&#12459;&#12521;&#12512;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12409;&#12365;&#12394;&#12398;&#12363;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290; <code class="literal">timestamp</code> &#12467;&#12531;&#12496;&#12540;&#12479;&#12391;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#23436;&#20840;&#12394;&#26085;&#26178;&#12434;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12371;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;<code class="literal">Event.hbm.xml</code> &#12392;&#12375;&#12390; <code class="literal">Event</code> Java&#12463;&#12521;&#12473;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12398;&#12377;&#12368;&#38563;&#12395;&#12475;&#12540;&#12502;&#12377;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290; &#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12398;&#21629;&#21517;&#26041;&#27861;&#12399;&#20219;&#24847;&#12391;&#12377;&#12364;&#12289;<code class="literal">hbm.xml</code> &#12469;&#12501;&#12451;&#12483;&#12463;&#12473;&#12364;Hibernate&#12398;&#38283;&#30330;&#32773;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#20869;&#12391;&#12398;&#32722;&#24931;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; &#29694;&#22312;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#27083;&#36896;&#12399;&#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12399;&#12378;&#12391;&#12377;&#65306; 
            </p><pre class="programlisting">.
+lib
  &lt;Hibernate and third-party libraries&gt;
+src
  +events
    Event.java
    Event.hbm.xml</pre><p>Hibernate&#12398;&#20027;&#35201;&#12394;&#35373;&#23450;&#12434;&#32154;&#12369;&#12414;&#12377;&#12290; </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-configuration"></a>1.2.3. Hibernate&#12398;&#35373;&#23450;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#12371;&#12371;&#12414;&#12391;&#12391;&#27704;&#32154;&#12463;&#12521;&#12473;&#12392;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12364;&#25539;&#12356;&#12414;&#12375;&#12383;&#12290;&#12371;&#12428;&#12363;&#12425;Hibernate&#12398;&#35373;&#23450;&#12434;&#34892;&#12356;&#12414;&#12377;&#12364;&#12289; &#12381;&#12398;&#21069;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290; HSQL DB&#12399;Java&#12505;&#12540;&#12473;&#12398;&#12452;&#12531;&#12513;&#12514;&#12522;SQL DBMS&#12391;&#12354;&#12426;&#12289;HSQL DB&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;
               &#23455;&#38555;&#12395;&#12399;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12383;&#20013;&#12398; <code class="literal">hsqldb.jar</code> &#12384;&#12369;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290; &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#38283;&#30330;&#12501;&#12457;&#12523;&#12480;&#12398; <code class="literal">lib/</code> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#37197;&#32622;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p>
            <p><code class="literal">data</code> &#12392;&#12356;&#12358;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#38283;&#30330;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12523;&#12540;&#12488;&#12395;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; HSQL DB&#12399;&#12371;&#12371;&#12395;&#12487;&#12540;&#12479;&#12501;&#12449;&#12452;&#12523;&#12434;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12487;&#12540;&#12479;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12362;&#12356;&#12390; <code class="literal">java -classpath lib/hsqldb.jar org.hsqldb.Server</code> &#12434;&#23455;&#34892;&#12375;&#12289; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#36215;&#21205;&#12373;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#21205;&#20316;&#12398;&#38283;&#22987;&#12392;&#12289;TCP/IP&#12477;&#12465;&#12483;&#12488;&#12398;&#12496;&#12452;&#12531;&#12489;&#12364;&#30906;&#35469;&#12391;&#12365;&#12414;&#12377;&#12290; &#24460;&#12411;&#12393;&#20316;&#25104;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12371;&#12371;&#12395;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290; &#12418;&#12375;&#12371;&#12398;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#20013;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#21021;&#26399;&#21270;&#12375;&#12383;&#12369;&#12428;&#12400;&#12289; HSQL DB&#12434;&#12471;&#12515;&#12483;&#12488;&#12480;&#12454;&#12531;&#12375;&#12390;&#65288;&#20316;&#26989;&#12454;&#12451;&#12531;&#12489;&#12454;&#12391;
               <code class="literal">CTRL + C</code> &#12434;&#25276;&#12375;&#12414;&#12377;&#65289; <code class="literal">data/</code> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#20840;&#12390;&#28040;&#21435;&#12375;&#12383;&#24460;&#12289; HSQL DB&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>Hibernate&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#25509;&#32154;&#12377;&#12427;&#23652;&#12394;&#12398;&#12391;&#12289; &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12398;&#24773;&#22577;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12399;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12503;&#12540;&#12523;&#12434;&#36890;&#12376;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12364;&#12289;&#12371;&#12428;&#12418;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; Hibernate&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12395;&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12503;&#12540;&#12523;&#12484;&#12540;&#12523;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
               &#12371;&#12398;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12391;&#12399;Hibernate&#12395;&#32068;&#12415;&#36796;&#12414;&#12428;&#12383;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12503;&#12540;&#12523;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290; &#12418;&#12375;&#35069;&#21697;&#12524;&#12505;&#12523;&#12398;&#21697;&#36074;&#12398;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12503;&#12540;&#12523;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12356;&#12383;&#12369;&#12428;&#12400;&#12289; &#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#24517;&#35201;&#12394;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#12467;&#12500;&#12540;&#12375;&#12390;&#12289;&#30064;&#12394;&#12427;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12503;&#12540;&#12523;&#12434;&#35373;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;
               &#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p>
            <p>Hibernate&#12398;&#35373;&#23450;&#12391;&#12399;&#12289;&#21336;&#32020;&#12394; <code class="literal">hibernate.properties</code> &#12501;&#12449;&#12452;&#12523;&#12289; &#12381;&#12428;&#12424;&#12426;&#23569;&#12375;&#27927;&#32244;&#12373;&#12428;&#12390;&#12356;&#12427; <code class="literal">hibernate.cfg.xml</code> &#12501;&#12449;&#12452;&#12523;&#12289; &#12414;&#12383;&#12399;&#23436;&#20840;&#12395;&#12503;&#12525;&#12464;&#12521;&#12512;&#19978;&#12391;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12377;&#12427;&#26041;&#27861;&#12364;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290; &#12411;&#12392;&#12435;&#12393;&#12398;&#12518;&#12540;&#12470;&#12364;&#22909;&#12416;&#12398;&#12399;XML&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#65306; 
            </p><pre class="programlisting">&lt;?xml version='1.0' encoding='utf-8'?&gt;
&lt;!DOCTYPE hibernate-configuration PUBLIC
        "-//Hibernate/Hibernate Configuration DTD 3.0//EN"
        "http://hibernate.sourceforge.net/hibernate-configuration-3.0.dtd"&gt;

&lt;hibernate-configuration&gt;

    &lt;session-factory&gt;

        &lt;!-- Database connection settings --&gt;
        &lt;property name="connection.driver_class"&gt;org.hsqldb.jdbcDriver&lt;/property&gt;
        &lt;property name="connection.url"&gt;jdbc:hsqldb:hsql://localhost&lt;/property&gt;
        &lt;property name="connection.username"&gt;sa&lt;/property&gt;
        &lt;property name="connection.password"&gt;&lt;/property&gt;

        &lt;!-- JDBC connection pool (use the built-in) --&gt;
        &lt;property name="connection.pool_size"&gt;1&lt;/property&gt;

        &lt;!-- SQL dialect --&gt;
        &lt;property name="dialect"&gt;org.hibernate.dialect.HSQLDialect&lt;/property&gt;

        &lt;!-- Enable Hibernate's automatic session context management --&gt;
        &lt;property name="current_session_context_class"&gt;thread&lt;/property&gt;

        &lt;!-- Disable the second-level cache  --&gt;
        &lt;property name="cache.provider_class"&gt;org.hibernate.cache.NoCacheProvider&lt;/property&gt;

        &lt;!-- Echo all executed SQL to stdout --&gt;
        &lt;property name="show_sql"&gt;true&lt;/property&gt;

        &lt;!-- Drop and re-create the database schema on startup --&gt;
        &lt;property name="hbm2ddl.auto"&gt;create&lt;/property&gt;

        &lt;mapping resource="events/Event.hbm.xml"/&gt;

    &lt;/session-factory&gt;

&lt;/hibernate-configuration&gt;</pre><p>&#12371;&#12398;XML&#12398;&#35373;&#23450;&#12364;&#30064;&#12394;&#12427;DTD&#12434;&#20351;&#12358;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#29305;&#23450;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#21463;&#12369;&#25345;&#12388;&#12464;&#12525;&#12540;&#12496;&#12523;&#12501;&#12449;&#12463;&#12488;&#12522;&#12391;&#12354;&#12427;Hibernate&#12398; <code class="literal">SessionFactory</code> &#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290; &#12418;&#12375;&#35079;&#25968;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#12354;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289; &#65288;&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;&#12434;&#31777;&#21336;&#12395;&#12377;&#12427;&#12383;&#12417;&#65289;&#36890;&#24120;&#12356;&#12367;&#12388;&#12363;&#12398;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#20869;&#12391;&#12289; &#12356;&#12367;&#12388;&#12363;&#12398; <code class="literal">&lt;session-factory&gt;</code> &#12434;&#20351;&#12358;&#35373;&#23450;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p>
            <p>&#26368;&#21021;&#12398;4&#12388;&#12398; <code class="literal">property</code> &#35201;&#32032;&#12399;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12395;&#24517;&#35201;&#12394;&#35373;&#23450;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290; dialect&#12392;&#12356;&#12358;&#21517;&#21069;&#12398; <code class="literal">property</code> &#35201;&#32032;&#12399;&#12289;Hibernate&#12364;&#29983;&#25104;&#12377;&#12427;&#29305;&#23450;&#12398;SQL&#26041;&#35328;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; &#27704;&#32154;&#30340;&#12394;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12395;&#23550;&#12377;&#12427;Hibernate&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#33258;&#21205;&#31649;&#29702;&#12399;&#12289;&#24460;&#12398;&#20363;&#12391;&#12377;&#12368;&#12395;&#12431;&#12363;&#12427;&#12424;&#12358;&#12395;&#12289;&#24441;&#12395;&#31435;&#12388;&#12371;&#12392;&#12391;&#12375;&#12423;&#12358;&#12290; <code class="literal">hbm2ddl.auto</code> &#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12473;&#12461;&#12540;&#12510;&#12398;&#33258;&#21205;&#29983;&#25104;&#12434;on&#12395;&#12375;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#30452;&#25509;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#29983;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290; &#24403;&#28982;&#65288;config&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#21066;&#38500;&#12375;&#12390;&#65289;off&#12395;&#12375;&#12383;&#12426;&#12289; <code class="literal">SchemaExport</code> &#12392;&#12356;&#12358;Ant&#12479;&#12473;&#12463;&#12398;&#21161;&#12369;&#12434;&#20511;&#12426;&#12390;&#12501;&#12449;&#12452;&#12523;&#12395;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12375;&#12383;&#12426;&#12391;&#12365;&#12414;&#12377;&#12290; &#26368;&#24460;&#12395;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12383;&#12417;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12434;&#35373;&#23450;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#12477;&#12540;&#12473;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12467;&#12500;&#12540;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12377;&#12427;&#12392;&#12371;&#12428;&#12399;&#12463;&#12521;&#12473;&#12497;&#12473;&#12398;&#12523;&#12540;&#12488;&#12395;&#12354;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290; Hibernate&#12399;&#12289;&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;&#26178;&#12395;&#12463;&#12521;&#12473;&#12497;&#12473;&#12398;&#12523;&#12540;&#12488;&#12391; <code class="literal">hibernate.cfg.xml</code> &#12392;&#12356;&#12358;&#12501;&#12449;&#12452;&#12523;&#12434;&#33258;&#21205;&#30340;&#12395;&#25506;&#12375;&#12414;&#12377;&#12290; 
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-ant"></a>1.2.4. Ant&#12395;&#12424;&#12427;&#12499;&#12523;&#12489;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#12381;&#12428;&#12391;&#12399;Ant&#12434;&#20351;&#12387;&#12390;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12434;&#12499;&#12523;&#12489;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; &#12381;&#12428;&#12395;&#12399;Ant&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; <a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://ant.apache.org/bindownload.cgi" target="_top">Ant&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12506;&#12540;&#12472;</a> &#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; Ant&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26041;&#27861;&#12399;&#12371;&#12371;&#12391;&#12399;&#35500;&#26126;&#12375;&#12414;&#12379;&#12435;&#12398;&#12391;&#12289; <a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://ant.apache.org/manual/index.html" target="_top">Ant&#12510;&#12491;&#12517;&#12450;&#12523;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; Ant&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12428;&#12400;&#12289;&#12499;&#12523;&#12489;&#12501;&#12449;&#12452;&#12523;&#12398;&#20316;&#25104;&#12434;&#38283;&#22987;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399; <code class="literal">build.xml</code> &#12392;&#21628;&#12400;&#12428;&#12289;&#38283;&#30330;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#30452;&#25509;&#37197;&#32622;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>&#22522;&#26412;&#30340;&#12394;&#12499;&#12523;&#12489;&#12501;&#12449;&#12452;&#12523;&#12399;&#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#65306; </p><pre class="programlisting">&lt;project name="hibernate-tutorial" default="compile"&gt;

    &lt;property name="sourcedir" value="${basedir}/src"/&gt;
    &lt;property name="targetdir" value="${basedir}/bin"/&gt;
    &lt;property name="librarydir" value="${basedir}/lib"/&gt;

    &lt;path id="libraries"&gt;
        &lt;fileset dir="${librarydir}"&gt;
            &lt;include name="*.jar"/&gt;
        &lt;/fileset&gt;
    &lt;/path&gt;

    &lt;target name="clean"&gt;
        &lt;delete dir="${targetdir}"/&gt;
        &lt;mkdir dir="${targetdir}"/&gt;
    &lt;/target&gt;

    &lt;target name="compile" depends="clean, copy-resources"&gt;
      &lt;javac srcdir="${sourcedir}"
             destdir="${targetdir}"
             classpathref="libraries"/&gt;
    &lt;/target&gt;

    &lt;target name="copy-resources"&gt;
        &lt;copy todir="${targetdir}"&gt;
            &lt;fileset dir="${sourcedir}"&gt;
                &lt;exclude name="**/*.java"/&gt;
            &lt;/fileset&gt;
        &lt;/copy&gt;
    &lt;/target&gt;

&lt;/project&gt;</pre><p>&#12371;&#12428;&#12399; <code class="literal">.jar</code> &#12391;&#32066;&#12431;&#12427;lib&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#12289; &#12467;&#12531;&#12497;&#12452;&#12523;&#12395;&#20351;&#29992;&#12377;&#12427;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12434;Ant&#12395;&#25945;&#12360;&#12414;&#12377;&#12290; &#12414;&#12383;&#12289;Java&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12391;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#12479;&#12540;&#12466;&#12483;&#12488;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12467;&#12500;&#12540;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12420;Hibernate&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12394;&#12393;&#12391;&#12377;&#12290;
               &#20170;Ant&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#20986;&#21147;&#12364;&#12354;&#12427;&#12399;&#12378;&#12391;&#12377;&#65306; 
            </p><pre class="programlisting">C:\hibernateTutorial\&gt;ant
Buildfile: build.xml

copy-resources:
     [copy] Copying 2 files to C:\hibernateTutorial\bin

compile:
    [javac] Compiling 1 source file to C:\hibernateTutorial\bin

BUILD SUCCESSFUL
Total time: 1 second </pre></div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-helpers"></a>1.2.5. &#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;&#12392;&#12504;&#12523;&#12497;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#12373;&#12390; <code class="literal">Event</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12375;&#12383;&#12426;&#26684;&#32013;&#12375;&#12383;&#12426;&#12377;&#12427;&#28310;&#20633;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290; &#12375;&#12363;&#12375;&#12414;&#12378;&#12399;&#12452;&#12531;&#12501;&#12521;&#12473;&#12488;&#12521;&#12463;&#12481;&#12515;&#12398;&#12467;&#12540;&#12489;&#12434;&#26360;&#12356;&#12390;&#12289;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12434;&#23436;&#20102;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12414;&#12378;&#12399;Hibernate&#12434;&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#12371;&#12398;&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;&#12395;&#12399;&#12289;&#12464;&#12525;&#12540;&#12496;&#12523;&#12398;
               <code class="literal">SessionFactory</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#29983;&#25104;&#12375;&#12390;&#12289; &#12381;&#12428;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12467;&#12540;&#12489;&#12391;&#12450;&#12463;&#12475;&#12473;&#12375;&#12420;&#12377;&#12356;&#22580;&#25152;&#12395;&#26684;&#32013;&#12377;&#12427;&#12371;&#12392;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290; <code class="literal">SessionFactory</code> &#12399;&#26032;&#12375;&#12367; <code class="literal">Session</code> &#12434;&#12458;&#12540;&#12503;&#12531;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; <code class="literal">Session</code> &#12399;&#12471;&#12531;&#12464;&#12523;&#12473;&#12524;&#12483;&#12489;&#12398;&#20316;&#26989;&#21336;&#20301;(Unit of Work)&#12434;&#34920;&#29694;&#12375;&#12414;&#12377;&#12290; &#12381;&#12428;&#12395;&#23550;&#12375;<code class="literal">SessionFactory</code> &#12399;&#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12398;&#12464;&#12525;&#12540;&#12496;&#12523;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12426;&#12289; &#19968;&#24230;&#12384;&#12369;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12371;&#12371;&#12391;&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;&#12434;&#34892;&#12356;&#12289; &#20415;&#21033;&#12395; <code class="literal">SessionFactory</code> &#12408;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427; <code class="literal">HibernateUtil</code> &#12504;&#12523;&#12497;&#12463;&#12521;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290; &#23455;&#35013;&#12434;&#35211;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#65306; 
            </p><pre class="programlisting">package util;

import org.hibernate.*;
import org.hibernate.cfg.*;

public class HibernateUtil {

    private static final SessionFactory sessionFactory;

    static {
        try {
            // Create the SessionFactory from hibernate.cfg.xml
            sessionFactory = new Configuration().configure().buildSessionFactory();
        } catch (Throwable ex) {
            // Make sure you log the exception, as it might be swallowed
            System.err.println("Initial SessionFactory creation failed." + ex);
            throw new ExceptionInInitializerError(ex);
        }
    }

    public static SessionFactory getSessionFactory() {
        return sessionFactory;
    }

}</pre><p>&#12371;&#12398;&#12463;&#12521;&#12473;&#12399;&#38745;&#30340;&#21021;&#26399;&#21270;&#12502;&#12525;&#12483;&#12463;&#65288;&#12463;&#12521;&#12473;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;JVM&#12395;&#12424;&#12387;&#12390;&#19968;&#24230;&#12384;&#12369;&#21628;&#12400;&#12428;&#12427;&#65289; &#12391;&#12464;&#12525;&#12540;&#12496;&#12523;&#12398; <code class="literal">SessionFactory</code> &#12434;&#29983;&#25104;&#12377;&#12427;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289; &#38745;&#30340;&#12471;&#12531;&#12464;&#12523;&#12488;&#12531;&#12398;&#20351;&#29992;&#12434;&#38560;&#34109;&#12375;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12469;&#12540;&#12496;&#12540;&#12398;JNDI&#12363;&#12425; <code class="literal">SessionFactory</code> &#12434; &#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#12377;&#12427;&#12398;&#12392;&#21516;&#27096;&#12391;&#12377;&#12290; 
            </p>
            <p>&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#20869;&#12391; <code class="literal">SessionFactory</code> &#12395;&#21517;&#21069;&#12434;&#19982;&#12360;&#12427;&#12392;&#12289; Hibernate&#12399; <code class="literal">SessionFactory</code> &#27083;&#31689;&#24460;&#12395;JNDI&#12395;&#23550;&#12375;&#12496;&#12452;&#12531;&#12489;&#12434;&#34892;&#12362;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#12467;&#12540;&#12489;&#12434;&#23436;&#20840;&#12395;&#25490;&#38500;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289; JMX&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12434;&#21033;&#29992;&#12375;&#12390; JMX&#12434;&#21033;&#29992;&#12391;&#12365;&#12427;&#12467;&#12531;&#12486;&#12490;&#12434;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12375;&#12289; <code class="literal">HibernateService</code> &#12434;JNDI&#12408;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12428;&#12425;&#12398;&#39640;&#24230;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;Hibernate&#12398;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#35500;&#26126;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; 
            </p>
            <p><code class="literal">HibernateUtil.java</code> &#12434;&#38283;&#30330;&#12477;&#12540;&#12473;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12354;&#12427; <code class="literal">events</code> &#12497;&#12483;&#12465;&#12540;&#12472;&#12398; &#38563;&#12395;&#37197;&#32622;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p><pre class="programlisting">.
+lib
  &lt;Hibernate and third-party libraries&gt;
+src
  +events
    Event.java
    Event.hbm.xml
  +util
    HibernateUtil.java
  hibernate.cfg.xml
+data
build.xml</pre><p>&#12371;&#12428;&#12399;&#21839;&#38988;&#12394;&#12367;&#20877;&#12467;&#12531;&#12497;&#12452;&#12523;&#12391;&#12365;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290; &#26368;&#24460;&#12395;&#12525;&#12462;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12434;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; Hibernate&#12399;commons logging&#12434;&#20351;&#12358;&#12383;&#12417;&#12289;Log4j&#12392;JDK 1.4 logging&#12398;&#36984;&#25246;&#12434;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#12411;&#12392;&#12435;&#12393;&#12398;&#38283;&#30330;&#32773;&#12364;&#22909;&#12416;&#12398;&#12399;Log4j&#12391;&#12377;&#12290;
               Hibernate&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#65288;&#12398;<code class="literal">etc/</code> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#65289;&#12363;&#12425; <code class="literal">log4j.properties</code> &#12434;&#12354;&#12394;&#12383;&#12398; <code class="literal">src</code> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12398; <code class="literal">hibernate.cfg.xml</code> &#12398;&#38563;&#12395;&#12467;&#12500;&#12540;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#35373;&#23450;&#20363;&#12434;&#35211;&#12390;&#12289;&#20887;&#38263;&#12394;&#20986;&#21147;&#12364;&#12424;&#12369;&#12428;&#12400;&#35373;&#23450;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;Hibernate&#12398;&#12473;&#12479;&#12540;&#12488;&#12450;&#12483;&#12503;&#12513;&#12483;&#12475;&#12540;&#12472;&#12384;&#12369;&#12364;&#27161;&#28310;&#20986;&#21147;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12398;&#12452;&#12531;&#12501;&#12521;&#12399;&#23436;&#20840;&#12391;&#12377;&#12290; Hibernate&#12434;&#20351;&#12387;&#12390;&#23455;&#38555;&#12398;&#20316;&#26989;&#12434;&#12377;&#12427;&#28310;&#20633;&#12364;&#25972;&#12356;&#12414;&#12375;&#12383;&#12290; </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-workingpersistence"></a>1.2.6. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;&#12392;&#26684;&#32013;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#12388;&#12356;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;&#12392;&#26684;&#32013;&#12395;Hibernate&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; <code class="literal">main()</code> &#12513;&#12477;&#12483;&#12489;&#12434;&#25345;&#12388; <code class="literal">EventManager</code> &#12463;&#12521;&#12473;&#12434;&#26360;&#12365;&#12414;&#12377;&#65306; 
            </p><pre class="programlisting">package events;
import org.hibernate.Session;

import java.util.Date;

import util.HibernateUtil;

public class EventManager {

    public static void main(String[] args) {
        EventManager mgr = new EventManager();

        if (args[0].equals("store")) {
            mgr.createAndStoreEvent("My Event", new Date());
        }

        HibernateUtil.getSessionFactory().close();
    }

    private void createAndStoreEvent(String title, Date theDate) {

        Session session = HibernateUtil.getSessionFactory().getCurrentSession();

        session.beginTransaction();

        Event theEvent = new Event();
        theEvent.setTitle(title);
        theEvent.setDate(theDate);

        session.save(theEvent);

        session.getTransaction().commit();
    }

}</pre><p>&#26032;&#12375;&#12356; <code class="literal">Event</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#29983;&#25104;&#12375;&#12289;&#12381;&#12428;&#12434;Hibernate&#12395;&#28193;&#12375;&#12414;&#12377;&#12290; &#20170;&#12391;&#12399;Hibernate&#12364;SQL&#12434;&#20966;&#29702;&#12375;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12391; <code class="literal">INSERT</code> &#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290; &#23455;&#34892;&#21069;&#12395; <code class="literal">Session</code> &#12392; <code class="literal">Transaction</code> &#12434;&#20966;&#29702;&#12377;&#12427;&#12467;&#12540;&#12489;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p>
            <p><code class="literal">Session</code> &#12399;1&#12388;&#12398;&#20316;&#26989;&#21336;&#20301;(Unit of Work)&#12391;&#12377;&#12290; &#24403;&#20998;&#12398;&#38291;&#12289;&#35441;&#12434;&#31777;&#21336;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; <code class="literal">Session</code> &#12392; <code class="literal">Transaction</code> &#12398;&#23550;&#24540;&#12434;&#19968;&#23550;&#19968;&#12392;&#20206;&#23450;&#12375;&#12414;&#12377;&#12290; &#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12471;&#12473;&#12486;&#12512;&#65288;&#12371;&#12398;&#12465;&#12540;&#12473;&#12391;&#12399;JTA&#12392;&#20849;&#23384;&#12391;&#12365;&#12427;&#21336;&#32020;&#12394;JDBC&#65289;&#12363;&#12425;&#12467;&#12540;&#12489;&#12434;&#20445;&#35703;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; Hibernate <code class="literal">Session</code> &#19978;&#12391;&#21033;&#29992;&#21487;&#33021;&#12394; <code class="literal">Transaction</code> API&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p><code class="literal">sessionFactory.getCurrentSession()</code> &#12399;&#12394;&#12395;&#12434;&#12377;&#12427;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#12414;&#12378;&#12289;&#12356;&#12387;&#12383;&#12435; <code class="literal">SessionFactory</code> &#12434;&#21462;&#24471;&#12375;&#20445;&#25345;&#12377;&#12428;&#12400; &#65288; <code class="literal">HibernateUtil</code> &#12398;&#12362;&#12363;&#12370;&#12391;&#31777;&#21336;&#12391;&#12377;&#65289;&#12289;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#20309;&#24230;&#12391;&#12418;&#12289; &#12393;&#12371;&#12363;&#12425;&#12391;&#12418;&#21628;&#12403;&#20986;&#12377;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290; <code class="literal">getCurrentSession()</code> &#12513;&#12477;&#12483;&#12489;&#12399;&#24120;&#12395;&#12300;&#29694;&#22312;&#12398;&#12301;&#20316;&#26989;&#21336;&#20301;(Unit of Work)&#12434;&#36820;&#12375;&#12414;&#12377;&#12290; <code class="literal">hibernate.cfg.xml</code> &#12398;&#12371;&#12398;&#27231;&#33021;&#12398;&#35373;&#23450;&#12391;&#12289;"thread"&#12434;&#25351;&#23450;&#12375;&#12383;&#12371;&#12392;&#12434;&#24605;&#12356;&#20986;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12398;&#12383;&#12417;&#29694;&#22312;&#12398;&#20316;&#26989;&#21336;&#20301;&#12398;&#12473;&#12467;&#12540;&#12503;&#12399;&#12289;&#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12377;&#12427;&#29694;&#22312;&#12398;Java&#12473;&#12524;&#12483;&#12489;&#12391;&#12377;&#12290; &#12375;&#12363;&#12375;&#12371;&#12428;&#12391;&#20840;&#12390;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; 
            </p>
            <p><code class="literal">Session</code> &#12399;&#26368;&#21021;&#12395;&#24517;&#35201;&#12392;&#12394;&#12387;&#12383;&#12392;&#12365;&#12289;&#12388;&#12414;&#12426;&#26368;&#21021;&#12395; <code class="literal">getCurrentSession()</code> &#12364; &#21628;&#12400;&#12428;&#12383;&#12392;&#12365;&#12395;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290; &#12381;&#12398;&#12392;&#12365;Hibernate&#12395;&#12424;&#12426;&#29694;&#22312;&#12398;&#12473;&#12524;&#12483;&#12489;&#12395;&#32080;&#12403;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#32066;&#20102;&#65288;&#12467;&#12511;&#12483;&#12488;&#12418;&#12375;&#12367;&#12399;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#65289;&#12375;&#12383;&#12392;&#12365;&#12289; Hibernate&#12418;&#12473;&#12524;&#12483;&#12489;&#12363;&#12425; <code class="literal">Session</code> &#12434;&#20999;&#12426;&#38626;&#12375;&#12289;&#12463;&#12525;&#12540;&#12474;&#12375;&#12414;&#12377;&#12290; &#20877;&#12403; <code class="literal">getCurrentSession()</code> &#12434;&#21628;&#12406;&#12392;&#12289; &#26032;&#12375;&#12356; <code class="literal">Session</code> &#12434;&#21462;&#24471;&#12375;&#12390;&#26032;&#12375;&#12356;&#20316;&#26989;&#21336;&#20301;&#12434;&#12473;&#12479;&#12540;&#12488;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398; <span class="emphasis"><em>thread-bound</em></span> &#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12539;&#12514;&#12487;&#12523;&#12399;Hibernate&#12434;&#21033;&#29992;&#12377;&#12427;&#19978;&#12391;&#26368;&#12418;&#20154;&#27671;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; 
            </p>
            <p>Related to the unit of work scope, should the Hibernate <code class="literal">Session</code> be used to execute one or several database operations? The above example uses one <code class="literal">Session</code> for one operation. This is pure coincidence, the example is just not complex enough to show any other approach. The scope
               of a Hibernate <code class="literal">Session</code> is flexible but you should never design your application to use a new Hibernate <code class="literal">Session</code> for <span class="emphasis"><em>every</em></span> database operation. So even if you see it a few more times in the following (very trivial) examples, consider <span class="emphasis"><em>session-per-operation</em></span> an anti-pattern. A real (web) application is shown later in this tutorial. 
            </p>
            <p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#25201;&#12356;&#12392;&#22659;&#30028;&#12398;&#35443;&#12375;&#12356;&#24773;&#22577;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289; <a href="transactions.html" title="&#31532;11&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;">&#31456;&nbsp;11. <i xmlns:xlink="http://www.w3.org/1999/xlink">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#20006;&#34892;&#24615;</i></a> &#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12398;&#20363;&#12391;&#12399;&#12456;&#12521;&#12540;&#20966;&#29702;&#12420;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12418;&#21106;&#24859;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>&#12371;&#12398;&#26368;&#21021;&#12398;&#12523;&#12540;&#12481;&#12531;&#12434;&#23455;&#34892;&#12377;&#12427;&#12395;&#12399;&#12289;Ant&#12398;&#12499;&#12523;&#12489;&#12501;&#12449;&#12452;&#12523;&#12395;&#21628;&#12403;&#20986;&#12375;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434; &#36861;&#21152;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#65306; </p><pre class="programlisting">&lt;target name="run" depends="compile"&gt;
    &lt;java fork="true" classname="events.EventManager" classpathref="libraries"&gt;
        &lt;classpath path="${targetdir}"/&gt;
        &lt;arg value="${action}"/&gt;
    &lt;/java&gt;
&lt;/target&gt;</pre><p><code class="literal">action</code> &#24341;&#25968;&#12398;&#20516;&#12399;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#21628;&#12406;&#12392;&#12365;&#12395;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12391;&#35373;&#23450;&#12375;&#12414;&#12377;&#65306; 
            </p><pre class="programlisting">C:\hibernateTutorial\&gt;ant run -Daction=store</pre><p>&#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#12392;&#12289;Hibernate&#12364;&#12473;&#12479;&#12540;&#12488;&#12375;&#12289;&#12354;&#12394;&#12383;&#12398;&#35373;&#23450;&#12395;&#12424;&#12426;&#12414;&#12377;&#12364;&#12289; &#22810;&#12367;&#12398;&#12525;&#12464;&#20986;&#21147;&#12364;&#12354;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290; &#12381;&#12398;&#26368;&#24460;&#12395;&#12399;&#20197;&#19979;&#12398;&#34892;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#65306; </p><pre class="programlisting">[java] Hibernate: insert into EVENTS (EVENT_DATE, title, EVENT_ID) values (?, ?, ?)</pre><p>&#12371;&#12428;&#12399;Hibernate&#12364;&#23455;&#34892;&#12377;&#12427; <code class="literal">INSERT</code> &#12391;&#12289; &#12463;&#12456;&#12473;&#12481;&#12519;&#12531;&#12510;&#12540;&#12463;&#12399;JDBC&#12496;&#12452;&#12531;&#12489;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#34920;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290; &#24341;&#25968;&#12392;&#12375;&#12390;&#12496;&#12452;&#12531;&#12489;&#12373;&#12428;&#12427;&#20516;&#12434;&#35211;&#12427;&#12383;&#12417;&#12289;&#12354;&#12427;&#12356;&#12399;&#12525;&#12464;&#12398;&#20887;&#38263;&#24615;&#12434;&#28187;&#12425;&#12377;&#12383;&#12417;&#12395;&#12399;&#12289; <code class="literal">log4j.properties</code> &#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p>
            <p>&#12381;&#12428;&#12391;&#12399;&#21516;&#12376;&#12424;&#12358;&#12395;&#26684;&#32013;&#12373;&#12428;&#12383;&#12452;&#12505;&#12531;&#12488;&#12398;&#19968;&#35239;&#12434;&#35211;&#12424;&#12358;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290; &#12381;&#12398;&#12383;&#12417;&#12513;&#12452;&#12531;&#12513;&#12477;&#12483;&#12489;&#12395;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#65306; </p><pre class="programlisting">if (args[0].equals("store")) {
    mgr.createAndStoreEvent("My Event", new Date());
}
else if (args[0].equals("list")) {
    List events = mgr.listEvents();
    for (int i = 0; i &lt; events.size(); i++) {
        Event theEvent = (Event) events.get(i);
        System.out.println("Event: " + theEvent.getTitle() +
                           " Time: " + theEvent.getDate());
    }
}</pre><p>&#26032;&#12375;&#12356; <code class="literal">listEvents()&#12513;&#12477;&#12483;&#12489;</code> &#12418;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290; 
            </p><pre class="programlisting">private List listEvents() {

    Session session = HibernateUtil.getSessionFactory().getCurrentSession();

    session.beginTransaction();

    List result = session.createQuery("from Event").list();

    session.getTransaction().commit();

    return result;
}</pre><p>&#12371;&#12371;&#12391;&#12377;&#12427;&#12371;&#12392;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#23384;&#22312;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398; <code class="literal">Event</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;HQL (Hibernate Query Language) &#12463;&#12456;&#12522;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; Hibernate&#12399;&#36969;&#20999;&#12394;SQL&#12434;&#29983;&#25104;&#12375;&#12289;&#12381;&#12428;&#12434;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#36865;&#12426;&#12289; &#12381;&#12398;&#12487;&#12540;&#12479;&#12434;&#20351;&#12387;&#12390; <code class="literal">Event</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#29983;&#25104;&#12375;&#12414;&#12377;&#12290; &#24403;&#28982;HQL&#12391;&#12373;&#12425;&#12395;&#35079;&#38609;&#12394;&#12463;&#12456;&#12522;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
            <p>&#20197;&#19979;&#12398;&#12473;&#12486;&#12483;&#12503;&#12391;&#12289;&#12377;&#12409;&#12390;&#12398;&#23455;&#34892;&#12392;&#12486;&#12473;&#12488;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290; </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>hbm2ddl&#12434;&#36890;&#12377;&#21069;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12487;&#12540;&#12479;&#12434;&#20316;&#25104;&#12375;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12473;&#12461;&#12540;&#12510;&#12434;&#29983;&#25104;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; <code class="literal">ant run -Daction=store</code> &#12434;&#23455;&#34892;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
                     </p>
                  </li>
                  <li>
                     <p>Now disable hbm2ddl by commenting out the property in your <code class="literal">hibernate.cfg.xml</code> file. Usually you only leave it turned on in continuous unit testing, but another run of hbm2ddl would <span class="emphasis"><em>drop</em></span> everything you have stored - the <code class="literal">create</code> configuration setting actually translates into "drop all tables from the schema, then re-create all tables, when the SessionFactory
                        is build". 
                     </p>
                  </li>
               </ul>
            </div>
            <p>&#20170; <code class="literal">-Daction=list</code> &#12392;&#25351;&#23450;&#12375;&#12390;Ant&#12434;&#21628;&#12406;&#12392;&#12289; &#12371;&#12428;&#12414;&#12391;&#26684;&#32013;&#12375;&#12383;&#12452;&#12505;&#12531;&#12488;&#12364;&#35211;&#12360;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290; <code class="literal">store</code> &#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#25968;&#22238;&#20197;&#19978;&#21628;&#12406;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290; 
            </p>
            <p>&#27880;&#24847;&#65306;&#21021;&#12417;&#12390;Hibernate&#12395;&#35302;&#12428;&#12427;&#20154;&#12293;&#12398;&#22810;&#12367;&#12364;&#12371;&#12371;&#12391;&#22833;&#25943;&#12377;&#12427;&#12383;&#12417;&#12289;<span class="emphasis"><em>Table not found</em></span> &#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395; &#38306;&#12377;&#12427;&#36074;&#21839;&#12434;&#23450;&#26399;&#30340;&#12395;&#35211;&#12363;&#12369;&#12414;&#12377;&#12290; &#12375;&#12363;&#12375;&#19978;&#35352;&#12398;&#12473;&#12486;&#12483;&#12503;&#12395;&#24467;&#12360;&#12400;&#12289;hbm2ddl&#12364;&#26368;&#21021;&#12395;&#23455;&#34892;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12473;&#12461;&#12540;&#12510;&#12434;&#20316;&#25104;&#12375;&#12289; &#12381;&#12398;&#24460;&#12398;&#23455;&#34892;&#12395;&#12362;&#12356;&#12390;&#12418;&#12371;&#12398;&#12473;&#12461;&#12540;&#12510;&#12434;&#20351;&#29992;&#12377;&#12427;&#12398;&#12391;&#12289;&#21839;&#38988;&#12399;&#36215;&#12371;&#12425;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290; &#12510;&#12483;&#12500;&#12531;&#12464;&#12420;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12473;&#12461;&#12540;&#12510;&#12434;&#22793;&#26356;&#12375;&#12383;&#12392;&#12365;&#12399;&#12289;&#12418;&#12358;&#19968;&#24230;hbm2ddl&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
               
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="tutorial.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="tutorial.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="tutorial-associations.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">&#31532;1&#31456; Hibernate&#12398;&#23566;&#20837;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;1.3. &#12497;&#12540;&#12488;2 - &#38306;&#36899;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</td>
            </tr>
         </table>
      </div>
   </body>
</html>