<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>1.3. &#12497;&#12540;&#12488;2 - &#38306;&#36899;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java">
      <link rel="up" href="tutorial.html" title="&#31532;1&#31456; Hibernate&#12398;&#23566;&#20837;">
      <link rel="prev" href="tutorial-firstapp.html" title="1.2. &#12497;&#12540;&#12488;1 - &#21021;&#12417;&#12390;&#12398;Hibernate&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;">
      <link rel="next" href="tutorial-webapp.html" title="1.4. &#12497;&#12540;&#12488;3 - EventManager Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">1.3. &#12497;&#12540;&#12488;2 - &#38306;&#36899;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="tutorial-firstapp.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <th width="60%" align="center">&#31532;1&#31456; Hibernate&#12398;&#23566;&#20837;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="tutorial-webapp.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ja-JP">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="tutorial-associations"></a>1.3. &#12497;&#12540;&#12488;2 - &#38306;&#36899;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#27704;&#32154;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12463;&#12521;&#12473;&#12434;&#12486;&#12540;&#12502;&#12523;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12375;&#12383;&#12290; &#12373;&#12425;&#12395;&#12371;&#12398;&#19978;&#12395;&#12356;&#12367;&#12388;&#12363;&#12398;&#12463;&#12521;&#12473;&#12398;&#38306;&#36899;&#12434;&#36861;&#21152;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290; &#12414;&#12378;&#21021;&#12417;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#20154;&#12293;&#12434;&#36861;&#21152;&#12375;&#12289;&#24444;&#12425;&#12364;&#21442;&#21152;&#12377;&#12427;&#12452;&#12505;&#12531;&#12488;&#12398;&#12522;&#12473;&#12488;&#12434;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290; </p>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-mappinguser"></a>1.3.1. Person&#12463;&#12521;&#12473;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#26368;&#21021;&#12398; <code class="literal">Person</code> &#12463;&#12521;&#12473;&#12399;&#21336;&#32020;&#12391;&#12377;&#65306; 
            </p><pre class="programlisting">package events;

public class Person {

    private Long id;
    private int age;
    private String firstname;
    private String lastname;

    public Person() {}

    // Accessor methods for all properties, private setter for 'id'

}</pre><p><code class="literal">Person.hbm.xml</code> &#12392;&#12356;&#12358;&#26032;&#12375;&#12356;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356; &#65288;&#12501;&#12449;&#12452;&#12523;&#12398;&#26368;&#21021;&#12395;DTD&#12408;&#12398;&#21442;&#29031;&#12434;&#24536;&#12428;&#12378;&#12395;&#20837;&#12428;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#65306; 
            </p><pre class="programlisting">&lt;hibernate-mapping&gt;

    &lt;class name="events.Person" table="PERSON"&gt;
        &lt;id name="id" column="PERSON_ID"&gt;
            &lt;generator class="native"/&gt;
        &lt;/id&gt;
        &lt;property name="age"/&gt;
        &lt;property name="firstname"/&gt;
        &lt;property name="lastname"/&gt;
    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>&#26368;&#24460;&#12395;Hibernate&#12398;&#35373;&#23450;&#12395;&#26032;&#12375;&#12356;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#36861;&#21152;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65306; </p><pre class="programlisting">&lt;mapping resource="events/Event.hbm.xml"/&gt;
&lt;mapping resource="events/Person.hbm.xml"/&gt;</pre><p>&#12381;&#12428;&#12391;&#12399;&#12371;&#12428;&#12425;2&#12388;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#38291;&#12398;&#38306;&#36899;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290; &#20154;&#12293;&#12364;&#12452;&#12505;&#12531;&#12488;&#12395;&#21442;&#21152;&#12391;&#12365;&#12289;&#12452;&#12505;&#12531;&#12488;&#12364;&#21442;&#21152;&#32773;&#12434;&#25345;&#12388;&#12398;&#12399;&#26126;&#12425;&#12363;&#12391;&#12377;&#12290; &#25201;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#35373;&#35336;&#12398;&#21839;&#38988;&#12399;&#12289;&#26041;&#21521;&#12289;&#22810;&#37325;&#24230;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#25391;&#12427;&#33310;&#12356;&#12391;&#12377;&#12290; </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-unidirset"></a>1.3.2. &#21336;&#26041;&#21521;Set&#12505;&#12540;&#12473;&#38306;&#36899;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#12452;&#12505;&#12531;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434; <code class="literal">Person</code> &#12463;&#12521;&#12473;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290; &#12371;&#12358;&#12375;&#12390;&#12362;&#12367;&#12392;&#12289;&#26126;&#31034;&#30340;&#12394;&#12463;&#12456;&#12522;&#12289;&#12388;&#12414;&#12426;&#12431;&#12374;&#12431;&#12374;<code class="literal">aPerson.getEvents()</code>&#12434;&#21628;&#12403;&#20986;&#12373;&#12378;&#12395;&#12289; &#29305;&#23450;&#12398;&#20154;&#12395;&#32016;&#20184;&#12367;&#12452;&#12505;&#12531;&#12488;&#12434;&#31777;&#21336;&#12395;&#12490;&#12499;&#12466;&#12540;&#12488;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#31169;&#12383;&#12385;&#12399;Java&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12289;<code class="literal">Set</code> &#12434;&#20351;&#12356;&#12414;&#12377;&#12290; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#37325;&#35079;&#35201;&#32032;&#12434;&#25345;&#12383;&#12394;&#12356;&#12375;&#12289;&#38918;&#30058;&#12399;&#31169;&#12383;&#12385;&#12395;&#12399;&#24847;&#21619;&#12364;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290; 
            </p>
            <p><code class="literal">Set</code> &#12391;&#23455;&#35013;&#12373;&#12428;&#12427;&#21336;&#26041;&#21521;&#12289;&#22810;&#20516;&#38306;&#36899;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290; Java&#12463;&#12521;&#12473;&#20869;&#12395;&#23550;&#24540;&#12377;&#12427;&#12467;&#12540;&#12489;&#12434;&#26360;&#12356;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12375;&#12423;&#12358;&#65306; 
            </p><pre class="programlisting">public class Person {

    private Set events = new HashSet();

    public Set getEvents() {
        return events;
    }

    public void setEvents(Set events) {
        this.events = events;
    }
}</pre><p>&#12371;&#12398;&#38306;&#36899;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#21069;&#12395;&#12289;&#21453;&#23550;&#20596;&#12395;&#12388;&#12356;&#12390;&#32771;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#26126;&#12425;&#12363;&#12394;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;&#20170;&#12399;&#12371;&#12428;&#12434;&#21336;&#26041;&#21521;&#12395;&#12375;&#12383;&#12384;&#12369;&#12391;&#12377;&#12290; &#36870;&#12395;&#12289; <code class="literal">Event</code> &#20596;&#12395;&#12418;&#21029;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20316;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#20363;&#12360;&#12400; <code class="literal">anEvent.getParticipants()</code> &#12398;&#12424;&#12358;&#12395;&#12289; &#21452;&#26041;&#21521;&#12395;&#12490;&#12499;&#12466;&#12540;&#12488;&#12375;&#12383;&#12369;&#12428;&#12400;&#12289;&#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#27231;&#33021;&#30340;&#12395;&#12415;&#12390;&#24517;&#35201;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; &#29305;&#23450;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#38306;&#20418;&#12377;&#12427;&#12487;&#12540;&#12479;&#12434;&#21462;&#24471;&#12377;&#12427;&#26126;&#30906;&#12394;&#12463;&#12456;&#12522;&#12434;&#12289;&#12356;&#12388;&#12391;&#12418;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12375;&#12383;&#12290; &#12371;&#12398;&#35373;&#35336;&#12398;&#36984;&#25246;&#12399;&#38283;&#30330;&#32773;&#12395;&#20219;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#12371;&#12398;&#35696;&#35542;&#12395;&#12424;&#12426;&#26126;&#12425;&#12363;&#12394;&#12398;&#12399;&#38306;&#36899;&#12398;&#22810;&#37325;&#24230;&#12391;&#12377;&#12290;
               &#12388;&#12414;&#12426;&#20001;&#20596;&#12434;&#12300;&#22810;&#12301;&#20516;&#12395;&#12377;&#12427;&#12289; <span class="emphasis"><em>&#22810;&#23550;&#22810;</em></span> &#12392;&#21628;&#12400;&#12428;&#12427;&#38306;&#36899;&#12391;&#12377;&#12290; &#12381;&#12398;&#12383;&#12417;Hibernate&#12398;many-to-many&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#20351;&#12356;&#12414;&#12377;&#65306; 
            </p><pre class="programlisting">&lt;class name="events.Person" table="PERSON"&gt;
    &lt;id name="id" column="PERSON_ID"&gt;
        &lt;generator class="native"/&gt;
    &lt;/id&gt;
    &lt;property name="age"/&gt;
    &lt;property name="firstname"/&gt;
    &lt;property name="lastname"/&gt;

    &lt;set name="events" table="PERSON_EVENT"&gt;
        &lt;key column="PERSON_ID"/&gt;
        &lt;many-to-many column="EVENT_ID" class="events.Event"/&gt;
    &lt;/set&gt;

&lt;/class&gt;</pre><p>Hibernate&#12399;&#12354;&#12426;&#12392;&#12354;&#12425;&#12422;&#12427;&#31278;&#39006;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289; &#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#12418;&#12398;&#12364; <code class="literal">&lt;set&gt;</code> &#12391;&#12377;&#12290; &#22810;&#23550;&#22810;&#38306;&#36899;&#65288;&#12414;&#12383;&#12399; <span class="emphasis"><em>n:m</em></span> &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12522;&#12524;&#12540;&#12471;&#12519;&#12531;&#12471;&#12483;&#12503;&#65289;&#12395;&#12399;&#12289; &#38306;&#36899;&#12486;&#12540;&#12502;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290; &#12371;&#12398;&#12486;&#12540;&#12502;&#12523;&#12398;&#12381;&#12428;&#12382;&#12428;&#12398;&#34892;&#12399;&#12289;&#20154;&#12392;&#12452;&#12505;&#12531;&#12488;&#38291;&#12398;&#12522;&#12531;&#12463;&#12434;&#34920;&#29694;&#12375;&#12414;&#12377;&#12290; &#12486;&#12540;&#12502;&#12523;&#21517;&#12399; <code class="literal">set</code> &#35201;&#32032;&#12398; <code class="literal">table</code> &#23646;&#24615;&#12391;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290; &#20154;&#20596;&#12398;&#38306;&#36899;&#12398;&#35672;&#21029;&#23376;&#12459;&#12521;&#12512;&#21517;&#12399; <code class="literal">&lt;key&gt;</code> &#35201;&#32032;&#12391;&#12289; &#12452;&#12505;&#12531;&#12488;&#20596;&#12398;&#12459;&#12521;&#12512;&#21517;&#12399; <code class="literal">&lt;many-to-many&gt;</code> &#12398; <code class="literal">column</code> &#23646;&#24615;&#12391;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; Hibernate&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12463;&#12521;&#12473; &#65288;&#27491;&#30906;&#12395;&#12399;&#12289;&#21442;&#29031;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#21453;&#23550;&#20596;&#12398;&#12463;&#12521;&#12473;&#65289;&#12434;&#25945;&#12360;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; 
            </p>
            <p>&#12381;&#12398;&#12383;&#12417;&#12371;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12473;&#12461;&#12540;&#12510;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#65306; </p><pre class="programlisting">
    _____________        __________________
   |             |      |                  |       _____________
   |   EVENTS    |      |   PERSON_EVENT   |      |             |
   |_____________|      |__________________|      |    PERSON   |
   |             |      |                  |      |_____________|
   | *EVENT_ID   | &lt;--&gt; | *EVENT_ID        |      |             |
   |  EVENT_DATE |      | *PERSON_ID       | &lt;--&gt; | *PERSON_ID  |
   |  TITLE      |      |__________________|      |  AGE        |
   |_____________|                                |  FIRSTNAME  |
                                                  |  LASTNAME   |
                                                  |_____________|
 </pre></div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-working"></a>1.3.3. &#38306;&#36899;&#12434;&#20685;&#12363;&#12379;&#12427;
                     </h3>
                  </div>
               </div>
            </div>
            <p><code class="literal">EventManager</code> &#12398;&#26032;&#12375;&#12356;&#12513;&#12477;&#12483;&#12489;&#12391;&#20154;&#12293;&#12392;&#12452;&#12505;&#12531;&#12488;&#12434;&#19968;&#32210;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#65306; 
            </p><pre class="programlisting">private void addPersonToEvent(Long personId, Long eventId) {

    Session session = HibernateUtil.getSessionFactory().getCurrentSession();
    session.beginTransaction();

    Person aPerson = (Person) session.load(Person.class, personId);
    Event anEvent = (Event) session.load(Event.class, eventId);

    aPerson.getEvents().add(anEvent);

    session.getTransaction().commit();
}</pre><p><code class="literal">Person</code> &#12392; <code class="literal">Event</code> &#12434;&#12525;&#12540;&#12489;&#12375;&#12383;&#24460;&#12289; &#26222;&#36890;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12387;&#12390;&#21336;&#32020;&#12395;&#12381;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12372;&#35239;&#12398;&#12392;&#12362;&#12426; <code class="literal">update()</code> &#12420; <code class="literal">save()</code> &#12398;&#26126;&#31034;&#30340;&#12394;&#21628;&#12403;&#20986;&#12375;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; Hibernate&#12399;&#12289;&#20462;&#27491;&#12373;&#12428;&#12383;&#12371;&#12392;&#12395;&#12424;&#12426;&#26356;&#26032;&#12377;&#12427;&#24517;&#35201;&#12398;&#12354;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#33258;&#21205;&#30340;&#12395;&#26908;&#30693;&#12375;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399; <span class="emphasis"><em>&#33258;&#21205;&#12480;&#12540;&#12486;&#12451;&#12481;&#12455;&#12483;&#12463;</em></span> &#12392;&#21628;&#12400;&#12428;&#12289; &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21517;&#21069;&#12420;date&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20462;&#27491;&#12377;&#12427;&#12371;&#12392;&#12391;&#35430;&#12377;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290; &#12381;&#12428;&#12425;&#12364; <span class="emphasis"><em>&#27704;&#32154;</em></span> &#29366;&#24907;&#12395;&#12354;&#12427;&#38480;&#12426;&#12289; &#12388;&#12414;&#12426;&#29305;&#23450;&#12398;Hibernate <code class="literal">Session</code> &#12395;&#12496;&#12452;&#12531;&#12489;&#12373;&#12428;&#12390;&#12356;&#12427;&#38480;&#12426; &#65288;&#20363;&#12360;&#12400;&#20316;&#26989;&#21336;&#20301;(Unit of Work)&#12398;&#20013;&#12391;&#21336;&#12395;&#12525;&#12540;&#12489;&#12414;&#12383;&#12399;&#12475;&#12540;&#12502;&#12373;&#12428;&#12383;&#65289;&#12289; Hibernate&#12399;&#12393;&#12435;&#12394;&#22793;&#26356;&#12418;&#12514;&#12491;&#12479;&#12540;&#12375;&#12289;&#36933;&#24310;&#26360;&#12365;&#36796;&#12415;(write-behind)&#12391;SQL&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290; &#36890;&#24120;&#12289;&#20316;&#26989;&#21336;&#20301;(Unit
               of Work)&#12398;&#26368;&#24460;&#12395;&#12384;&#12369;&#34892;&#12431;&#12428;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12513;&#12514;&#12522;&#12398;&#29366;&#24907;&#12434;&#21516;&#26399;&#12373;&#12379;&#12427;&#20966;&#29702;&#12399;&#12289; <span class="emphasis"><em>&#12501;&#12521;&#12483;&#12471;&#12517;</em></span> &#12392;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290; &#12371;&#12398;&#12467;&#12540;&#12489;&#12391;&#12399;&#12289;&#20316;&#26989;&#21336;&#20301;(Unit of Work)&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12467;&#12511;&#12483;&#12488;&#65288;&#12418;&#12375;&#12367;&#12399;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#65289;&#12391;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289; <code class="literal">CurrentSessionContext</code> &#12463;&#12521;&#12473;&#12395;&#23550;&#12375;&#12390; <code class="literal">thread</code> &#12434;&#35373;&#23450;&#12375;&#12383;&#12383;&#12417;&#12391;&#12377;&#12290; 
            </p>
            <p>&#30064;&#12394;&#12427;&#20316;&#26989;&#21336;&#20301;(Unit of Work)&#12391;&#20154;&#12293;&#12392;&#12452;&#12505;&#12531;&#12488;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12418;&#24403;&#28982;&#12391;&#12365;&#12414;&#12377;&#12290; &#12381;&#12358;&#12391;&#12394;&#12369;&#12428;&#12400;&#12289;&#27704;&#32154;&#29366;&#24907;&#12395;&#12394;&#12356;&#12392;&#12365;&#65288;&#20197;&#21069;&#12395;&#27704;&#32154;&#12391;&#12354;&#12387;&#12383;&#12394;&#12425;&#12289;&#12371;&#12398;&#29366;&#24907;&#12434; <span class="emphasis"><em>&#20998;&#38626;&#65288;detached&#65289;</em></span> &#12392;&#21628;&#12403;&#12414;&#12377;&#65289;&#12289; <code class="literal">Session</code> &#12398;&#22806;&#37096;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20462;&#27491;&#12375;&#12414;&#12377;&#12290; &#20998;&#38626;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#65306; 
            </p><pre class="programlisting">private void addPersonToEvent(Long personId, Long eventId) {

    Session session = HibernateUtil.getSessionFactory().getCurrentSession();
    session.beginTransaction();

    Person aPerson = (Person) session
            .createQuery("select p from Person p left join fetch p.events where p.id = :pid")
            .setParameter("pid", personId)
            .uniqueResult(); // Eager fetch the collection so we can use it detached

    Event anEvent = (Event) session.load(Event.class, eventId);

    session.getTransaction().commit();

    // End of first unit of work

    aPerson.getEvents().add(anEvent); // aPerson (and its collection) is detached

    // Begin second unit of work

    Session session2 = HibernateUtil.getSessionFactory().getCurrentSession();
    session2.beginTransaction();

    session2.update(aPerson); // Reattachment of aPerson

    session2.getTransaction().commit();
}</pre><p><code class="literal">update</code> &#12398;&#21628;&#12403;&#20986;&#12375;&#12399;&#20998;&#38626;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20877;&#12403;&#27704;&#32154;&#21270;&#12375;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#12289;&#26032;&#12375;&#12356;&#20316;&#26989;&#21336;&#20301;(Unit of Work)&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12392;&#35328;&#12360;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290; &#12381;&#12398;&#12383;&#12417;&#20998;&#38626;&#12398;&#38291;&#12395;&#21152;&#12360;&#12425;&#12428;&#12383;&#12393;&#12398;&#12424;&#12358;&#12394;&#20462;&#27491;&#12418;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#12475;&#12540;&#12502;&#12391;&#12365;&#12414;&#12377;&#12290; &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12408;&#12398;&#20462;&#27491;&#65288;&#36861;&#21152;&#65381;&#21066;&#38500;&#65289;&#12418;&#21516;&#27096;&#12395;&#12475;&#12540;&#12502;&#12391;&#12365;&#12414;&#12377;&#12290;
               
            </p>
            <p>&#12371;&#12428;&#12399;&#20170;&#12399;&#12354;&#12414;&#12426;&#20351;&#12356;&#12415;&#12385;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289; &#33258;&#20998;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#35373;&#35336;&#12395;&#32068;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#37325;&#35201;&#12394;&#12467;&#12531;&#12475;&#12503;&#12488;&#12391;&#12377;&#12290; &#12381;&#12428;&#12391;&#12399;&#12371;&#12398;&#12456;&#12463;&#12469;&#12469;&#12452;&#12474;&#12398;&#26368;&#24460;&#12395;&#12289; <code class="literal">EventManager</code> &#12398;&#12513;&#12452;&#12531;&#12513;&#12477;&#12483;&#12489;&#12395;&#26032;&#12375;&#12356;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#36861;&#21152;&#12375;&#12390; &#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12363;&#12425;&#21628;&#12403;&#20986;&#12375;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;&#12290; &#20154;&#12420;&#12452;&#12505;&#12531;&#12488;&#12398;&#35672;&#21029;&#23376;&#12364;&#24517;&#35201;&#12394;&#12425;&#12289; <code class="literal">save()</code> &#12513;&#12477;&#12483;&#12489;&#12364;&#36820;&#12375;&#12390;&#12367;&#12428;&#12414;&#12377; &#65288;&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#35672;&#21029;&#23376;&#12434;&#36820;&#12377;&#12383;&#12417;&#12395;&#12513;&#12477;&#12483;&#12489;&#12434;&#20462;&#27491;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#65289;&#12290; 
            </p><pre class="programlisting">else if (args[0].equals("addpersontoevent")) {
    Long eventId = mgr.createAndStoreEvent("My Event", new Date());
    Long personId = mgr.createAndStorePerson("Foo", "Bar");
    mgr.addPersonToEvent(personId, eventId);
    System.out.println("Added person " + personId + " to event " + eventId);
}</pre><p>&#12371;&#12428;&#12399;&#21516;&#12376;&#12424;&#12358;&#12395;&#37325;&#35201;&#12394;2&#12388;&#12398;&#12463;&#12521;&#12473;&#12289;&#12388;&#12414;&#12426;2&#12388;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#38291;&#12398;&#38306;&#36899;&#12398;&#20363;&#12391;&#12375;&#12383;&#12290; &#21069;&#12395;&#36848;&#12409;&#12383;&#12424;&#12358;&#12395;&#12289;&#20856;&#22411;&#30340;&#12394;&#12514;&#12487;&#12523;&#12395;&#12399;&#12289;&#26222;&#36890;&#12300;&#27604;&#36611;&#30340;&#37325;&#35201;&#12391;&#12399;&#12394;&#12356;&#12301;&#20182;&#12398;&#12463;&#12521;&#12473;&#12392;&#22411;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; &#12371;&#12428;&#12414;&#12391;&#12395;&#35211;&#12383;&#12424;&#12358;&#12394; <code class="literal">int</code> &#12420; <code class="literal">String</code> &#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#12290; &#12371;&#12398;&#12424;&#12358;&#12394;&#12463;&#12521;&#12473;&#12434; <span class="emphasis"><em>&#20516;&#22411;</em></span> &#12392;&#35328;&#12356;&#12414;&#12377;&#12290; &#12371;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#29305;&#23450;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395; <span class="emphasis"><em>&#20381;&#23384;</em></span> &#12375;&#12414;&#12377;&#12290; &#12371;&#12398;&#22411;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#29420;&#33258;&#12398;ID&#12434;&#25345;&#12385;&#12414;&#12379;&#12435;&#12375;&#12289; &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#38291;&#12391;&#20849;&#26377;&#12373;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435; &#65288;&#12501;&#12449;&#12540;&#12473;&#12488;&#12493;&#12540;&#12512;&#12364;&#21516;&#12376;&#12384;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;2&#20154;&#12398;&#20154;&#12399;&#21516;&#12376; <code class="literal">firstname</code> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21442;&#29031;&#12375;&#12414;&#12379;&#12435;&#65289;&#12290; &#20516;&#22411;&#12399;&#12418;&#12385;&#12429;&#12435;JDK&#20869;&#12395;&#35211;&#12388;&#12363;&#12426;&#12414;&#12377;&#12364;&#12289;&#12381;&#12428;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367; &#65288;&#23455;&#38555;&#12289;Hibernate&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12362;&#12356;&#12390;&#12377;&#12409;&#12390;&#12398;JDK&#12463;&#12521;&#12473;&#12399;&#20516;&#22411;&#12392;&#35211;&#12394;&#12379;&#12414;&#12377;&#65289;&#12289; &#20363;&#12360;&#12400; <code class="literal">Address</code> &#12420; <code class="literal">MonetaryAmount</code> &#12398;&#12424;&#12358;&#12394;&#29420;&#33258;&#12398;&#20381;&#23384;&#12463;&#12521;&#12473;&#12434;&#26360;&#12367;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; 
            </p>
            <p>&#20516;&#22411;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#35373;&#35336;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#21442;&#29031;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#12399;&#27010;&#24565;&#30340;&#12395;&#38750;&#24120;&#12395;&#30064;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289; Java&#12391;&#12399;&#12411;&#12392;&#12435;&#12393;&#21516;&#12376;&#12424;&#12358;&#12395;&#35211;&#12360;&#12414;&#12377;&#12290; </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-valuecollections"></a>1.3.4. &#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#20516;&#22411;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434; <code class="literal">Person</code> &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290; E&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434;&#26684;&#32013;&#12375;&#12383;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;<code class="literal">String</code> &#22411;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#20877;&#12403; <code class="literal">Set</code> &#12391;&#12377;&#65306; 
            </p><pre class="programlisting">private Set emailAddresses = new HashSet();

public Set getEmailAddresses() {
    return emailAddresses;
}

public void setEmailAddresses(Set emailAddresses) {
    this.emailAddresses = emailAddresses;
}</pre><p>&#12371;&#12398; <code class="literal">Set</code> &#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12377;&#65306; 
            </p><pre class="programlisting">&lt;set name="emailAddresses" table="PERSON_EMAIL_ADDR"&gt;
    &lt;key column="PERSON_ID"/&gt;
    &lt;element type="string" column="EMAIL_ADDR"/&gt;
&lt;/set&gt;</pre><p>&#21069;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12392;&#27604;&#12409;&#12390;&#36949;&#12358;&#12398;&#12399; <code class="literal">element</code> &#12398;&#37096;&#20998;&#12391;&#12377;&#12364;&#12289; Hibernate&#12395;&#12371;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#21442;&#29031;&#12434;&#21547;&#12414;&#12378;&#12289; <code class="literal">String</code> &#22411;&#12398;&#35201;&#32032;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21547;&#12416;&#12371;&#12392;&#12434;&#25945;&#12360;&#12414;&#12377;&#12290; &#65288;&#23567;&#25991;&#23383;&#12398;&#21517;&#21069;(string)&#12399;Hibernate&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#22411;&#12414;&#12383;&#12399;&#12467;&#12531;&#12496;&#12540;&#12479;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#65289;&#12290; &#32368;&#12426;&#36820;&#12375;&#12414;&#12377;&#12364;&#12289;<code class="literal">set</code> &#35201;&#32032;&#12398; <code class="literal">table</code> &#23646;&#24615;&#12399;&#12289; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12383;&#12417;&#12398;&#12486;&#12540;&#12502;&#12523;&#21517;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; <code class="literal">key</code> &#35201;&#32032;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12486;&#12540;&#12502;&#12523;&#12398;&#22806;&#37096;&#12461;&#12540;&#12459;&#12521;&#12512;&#21517;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; <code class="literal">element</code> &#35201;&#32032;&#12398; <code class="literal">column</code> &#23646;&#24615;&#12399; <code class="literal">String</code> &#12398;&#20516;&#12364;&#23455;&#38555;&#12395;&#26684;&#32013;&#12373;&#12428;&#12427;&#12459;&#12521;&#12512;&#12398;&#21517;&#21069;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290; 
            </p>
            <p>&#26356;&#26032;&#12375;&#12383;&#12473;&#12461;&#12540;&#12510;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#65306; </p><pre class="programlisting">
  _____________        __________________
 |             |      |                  |       _____________
 |   EVENTS    |      |   PERSON_EVENT   |      |             |       ___________________
 |_____________|      |__________________|      |    PERSON   |      |                   |
 |             |      |                  |      |_____________|      | PERSON_EMAIL_ADDR |
 | *EVENT_ID   | &lt;--&gt; | *EVENT_ID        |      |             |      |___________________|
 |  EVENT_DATE |      | *PERSON_ID       | &lt;--&gt; | *PERSON_ID  | &lt;--&gt; |  *PERSON_ID       |
 |  TITLE      |      |__________________|      |  AGE        |      |  *EMAIL_ADDR      |
 |_____________|                                |  FIRSTNAME  |      |___________________|
                                                |  LASTNAME   |
                                                |_____________|
 </pre><p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12486;&#12540;&#12502;&#12523;&#12398;&#20027;&#12461;&#12540;&#12399;&#12289;&#23455;&#38555;&#12399;&#20001;&#26041;&#12398;&#12459;&#12521;&#12512;&#12434;&#20351;&#12387;&#12383;&#35079;&#21512;&#12461;&#12540;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12431;&#12363;&#12426;&#12414;&#12377;&#12290; &#12371;&#12428;&#12399;&#20154;&#12372;&#12392;&#12395;E&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12364;&#37325;&#35079;&#12391;&#12365;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12289; Java&#12398;set&#12395;&#35201;&#27714;&#12373;&#12428;&#12427;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12381;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290; </p>
            <p>&#20197;&#21069;&#20154;&#12392;&#12452;&#12505;&#12531;&#12488;&#12434;&#38306;&#36899;&#12389;&#12369;&#12383;&#12392;&#12365;&#12392;&#20840;&#12367;&#21516;&#12376;&#12424;&#12358;&#12395;&#12289; &#20170;&#12420;&#35430;&#12375;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#35201;&#32032;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290; &#20001;&#26041;&#12392;&#12418;Java&#12391;&#12399;&#21516;&#12376;&#12467;&#12540;&#12489;&#12391;&#12377;&#12290; </p><pre class="programlisting">private void addEmailToPerson(Long personId, String emailAddress) {

    Session session = HibernateUtil.getSessionFactory().getCurrentSession();
    session.beginTransaction();

    Person aPerson = (Person) session.load(Person.class, personId);

    // The getEmailAddresses() might trigger a lazy load of the collection
    aPerson.getEmailAddresses().add(emailAddress);

    session.getTransaction().commit();
}</pre><p>This time we didn't use a <span class="emphasis"><em>fetch</em></span> query to initialize the collection. Hence, the call to its getter method will trigger an additional select to initialize
               it, so we can add an element to it. Monitor the SQL log and try to optimize this with an eager fetch. 
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-bidirectional"></a>1.3.5. &#21452;&#26041;&#21521;&#38306;&#36899;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#27425;&#12395;&#21452;&#26041;&#21521;&#38306;&#36899;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290; Java&#12391;&#20001;&#20596;&#12363;&#12425;&#20154;&#12392;&#12452;&#12505;&#12531;&#12488;&#12398;&#38306;&#36899;&#12434;&#21205;&#20316;&#12373;&#12379;&#12414;&#12377;&#12290; &#12418;&#12385;&#12429;&#12435;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12473;&#12461;&#12540;&#12510;&#12399;&#22793;&#12431;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#22810;&#37325;&#24230;&#12399;&#22810;&#23550;&#22810;&#12398;&#12414;&#12414;&#12391;&#12377;&#12290; &#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12399;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12424;&#12426;&#12418;&#26580;&#36575;&#12394;&#12398;&#12391;&#12289;
               &#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12398;&#26041;&#21521;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12379;&#12435;&#12290; &#12487;&#12540;&#12479;&#12399;&#12354;&#12425;&#12422;&#12427;&#12398;&#26041;&#27861;&#12391;&#35211;&#12383;&#12426;&#24489;&#20803;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; 
            </p>
            <p>&#12414;&#12378; <code class="literal">Event</code> &#12452;&#12505;&#12531;&#12488;&#12463;&#12521;&#12473;&#12395;&#21442;&#21152;&#32773;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#65306; 
            </p><pre class="programlisting">private Set participants = new HashSet();

public Set getParticipants() {
    return participants;
}

public void setParticipants(Set participants) {
    this.participants = participants;
}</pre><p>&#12381;&#12428;&#12391;&#12399; <code class="literal">Event.hbm.xml</code> &#12391;&#38306;&#36899;&#12398;&#12371;&#12385;&#12425;&#20596;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p><pre class="programlisting">&lt;set name="participants" table="PERSON_EVENT" inverse="true"&gt;
    &lt;key column="EVENT_ID"/&gt;
    &lt;many-to-many column="PERSON_ID" class="events.Person"/&gt;
&lt;/set&gt;</pre><p>&#12372;&#35239;&#12398;&#12392;&#12362;&#12426;&#12289;&#12356;&#12378;&#12428;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;(XML&#12501;&#12449;&#12452;&#12523;)&#12391;&#12418;&#12289;&#26222;&#36890;&#12398; <code class="literal">set</code> &#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290; <code class="literal">key</code> &#12392; <code class="literal">many-to-many</code> &#12398;&#12459;&#12521;&#12512;&#21517;&#12364;&#12289; &#20001;&#26041;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#20837;&#12428;&#26367;&#12360;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27880;&#30446;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12371;&#12391;&#26368;&#12418;&#37325;&#35201;&#12394;&#36861;&#21152;&#38917;&#30446;&#12399;&#12289; <code class="literal">Event</code> &#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398; <code class="literal">set</code> &#35201;&#32032;&#12395;&#12354;&#12427; <code class="literal">inverse="true"</code> &#23646;&#24615;&#12391;&#12377;&#12290; 
            </p>
            <p>&#12371;&#12398;&#25351;&#23450;&#12398;&#24847;&#21619;&#12399;&#12289;2&#12388;&#12398;&#38291;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#38291;&#12398;&#12522;&#12531;&#12463;&#12395;&#12388;&#12356;&#12390;&#12398;&#24773;&#22577;&#12434;&#25506;&#12377;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12365;&#12289; Hibernate&#12399;&#21453;&#23550;&#20596;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12289;&#12388;&#12414;&#12426; <code class="literal">Person</code> &#12463;&#12521;&#12473;&#12363;&#12425;&#25506;&#12377;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; &#19968;&#24230;2&#12388;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#38291;&#12398;&#21452;&#26041;&#21521;&#12522;&#12531;&#12463;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#20316;&#25104;&#12373;&#12428;&#12427;&#12363;&#12364;&#12431;&#12363;&#12428;&#12400;&#12289; &#12371;&#12428;&#12434;&#29702;&#35299;&#12377;&#12427;&#12371;&#12392;&#12399;&#12392;&#12390;&#12418;&#31777;&#21336;&#12391;&#12377;&#12290; 
            </p>
         </div>
         <div class="sect2" lang="ja-JP">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-usingbidir"></a>1.3.6. &#21452;&#26041;&#21521;&#12522;&#12531;&#12463;&#12398;&#21205;&#20316;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#12414;&#12378;&#12289;Hibernate&#12364;&#36890;&#24120;&#12398;Java&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12395;&#24433;&#38911;&#12434;&#21450;&#12412;&#12373;&#12394;&#12356;&#12371;&#12392;&#12434;&#24515;&#12395;&#30041;&#12417;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#31169;&#12383;&#12385;&#12399;&#12289;&#21336;&#26041;&#21521;&#12398;&#20363;&#12392;&#12375;&#12390;&#12393;&#12398;&#12424;&#12358;&#12395; <code class="literal">Person</code> &#12392; <code class="literal">Event</code> &#12398;&#38291;&#12398;&#12522;&#12531;&#12463;&#12434;&#20316;&#25104;&#12375;&#12383;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; <code class="literal">Person</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12452;&#12505;&#12531;&#12488;&#12408;&#12398;&#21442;&#29031;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395; <code class="literal">Event</code> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36861;&#21152;&#12375;&#12414;&#12375;&#12383;&#12290; &#12381;&#12398;&#12383;&#12417;&#12371;&#12398;&#12522;&#12531;&#12463;&#12434;&#21452;&#26041;&#21521;&#12395;&#12375;&#12383;&#12369;&#12428;&#12400;&#12289; &#24403;&#12383;&#12426;&#21069;&#12391;&#12377;&#12364;&#21453;&#23550;&#20596;&#12395;&#12418;&#21516;&#12376;&#12371;&#12392;&#12434;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; <code class="literal">Event</code> &#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395; <code class="literal">Person</code> &#12408;&#12398; &#21442;&#29031;&#12434;&#36861;&#21152;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; &#12371;&#12398;&#12300;&#20001;&#20596;&#12391;&#12522;&#12531;&#12463;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12301;&#12399;&#32118;&#23550;&#12395;&#24517;&#35201;&#12394;&#12398;&#12391;&#12289;&#27770;&#12375;&#12390;&#24536;&#12428;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290; 
            </p>
            <p>Many developers program defensively and create link management methods to correctly set both sides, e.g. in <code class="literal">Person</code>: 
            </p><pre class="programlisting">protected Set getEvents() {
    return events;
}

protected void setEvents(Set events) {
    this.events = events;
}

public void addToEvent(Event event) {
    this.getEvents().add(event);
    event.getParticipants().add(this);
}

public void removeFromEvent(Event event) {
    this.getEvents().remove(event);
    event.getParticipants().remove(this);
}</pre><p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12466;&#12483;&#12488;&#12392;&#12475;&#12483;&#12488;&#12513;&#12477;&#12483;&#12489;&#12364;&#29694;&#22312;protected&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#12371;&#12428;&#12399;&#21516;&#12376;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12463;&#12521;&#12473;&#12420;&#12469;&#12502;&#12463;&#12521;&#12473;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#20381;&#28982;&#12450;&#12463;&#12475;&#12473;&#12364;&#21487;&#33021;&#12391;&#12377;&#12364;&#12289; &#65288;&#12411;&#12392;&#12435;&#12393;&#65289;&#12381;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#22806;&#12398;&#12393;&#12398;&#12463;&#12521;&#12473;&#12391;&#12418;&#30452;&#25509;&#12381;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21488;&#28961;&#12375;&#12395;&#12377;&#12427;&#12371;&#12392;&#12434;&#38450;&#12366;&#12414;&#12377;&#12290;
               &#12362;&#12381;&#12425;&#12367;&#21453;&#23550;&#20596;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12418;&#21516;&#12376;&#12371;&#12392;&#12434;&#12375;&#12383;&#26041;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290; 
            </p>
            <p><code class="literal">inverse</code> &#12510;&#12483;&#12500;&#12531;&#12464;&#23646;&#24615;&#12392;&#12399;&#12356;&#12387;&#12383;&#12356;&#20309;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311; &#38283;&#30330;&#32773;&#12392;Java&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#21452;&#26041;&#21521;&#12522;&#12531;&#12463;&#12399;&#21336;&#12395;&#20001;&#20596;&#12398;&#21442;&#29031;&#12434;&#27491;&#12375;&#12367;&#35373;&#23450;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; &#12375;&#12363;&#12375;Hibernate&#12399;&#65288;&#21046;&#32004;&#36949;&#21453;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12395;&#65289;SQL&#12398; <code class="literal">INSERT</code> &#12392; <code class="literal">UPDATE</code> &#25991;&#12434;&#27491;&#30906;&#12395;&#22793;&#26356;&#12377;&#12427;&#12383;&#12417;&#12398;&#21313;&#20998;&#12394;&#24773;&#22577;&#12434;&#25345;&#12387;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12289; &#21452;&#26041;&#21521;&#38306;&#36899;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25201;&#12358;&#12383;&#12417;&#12398;&#20309;&#12425;&#12363;&#12398;&#21161;&#12369;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290; &#38306;&#36899;&#12398;&#29255;&#20596;&#12434; <code class="literal">inverse</code> &#12395;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;Hibernate&#12399;&#22522;&#26412;&#30340;&#12395;&#12399;&#35373;&#23450;&#12375;&#12383;&#20596;&#12434;&#28961;&#35222;&#12375;&#12289; &#21453;&#23550;&#20596;&#12398; <span class="emphasis"><em>&#37857;</em></span> &#12392;&#12375;&#12390;&#32771;&#12360;&#12414;&#12377;&#12290; &#12371;&#12428;&#12384;&#12369;&#12391;&#12289;Hibernate&#12399;&#26041;&#21521;&#12434;&#25345;&#12388;&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12514;&#12487;&#12523;&#12434;SQL&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12473;&#12461;&#12540;&#12510;&#12408;&#22793;&#25563;&#12377;&#12427;&#12392;&#12365;&#12398; &#12377;&#12409;&#12390;&#12398;&#21839;&#38988;&#12395;&#12358;&#12414;&#12367;&#23550;&#20966;&#12391;&#12365;&#12414;&#12377;&#12290; &#35226;&#12360;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12523;&#12540;&#12523;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290; &#21452;&#26041;&#21521;&#38306;&#36899;&#12399;&#24517;&#12378;&#29255;&#20596;&#12434; <code class="literal">inverse</code> &#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290; &#19968;&#23550;&#22810;&#38306;&#36899;&#12391;&#12399;&#12381;&#12428;&#12399;&#22810;&#20596;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; &#22810;&#23550;&#22810;&#38306;&#36899;&#12391;&#12399;&#12393;&#12385;&#12425;&#20596;&#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;&#12393;&#12385;&#12425;&#12391;&#12418;&#36949;&#12356;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290; 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="tutorial-firstapp.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="tutorial.html">&#19978;&#12395;&#25147;&#12427;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="tutorial-webapp.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">1.2. &#12497;&#12540;&#12488;1 - &#21021;&#12417;&#12390;&#12398;Hibernate&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;1.4. &#12497;&#12540;&#12488;3 - EventManager Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</td>
            </tr>
         </table>
      </div>
   </body>
</html>