<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>2&#51109;. &#50500;&#53412;&#53581;&#52376;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="tutorial-summary.html" title="1.5. &#50836;&#50557;">
      <link rel="next" href="architecture-states.html" title="2.2. &#51064;&#49828;&#53556;&#49828; &#49345;&#53468;&#46308;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">2&#51109;. &#50500;&#53412;&#53581;&#52376;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="tutorial-summary.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="architecture-states.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="architecture"></a>2&#51109;. &#50500;&#53412;&#53581;&#52376;
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect1" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="architecture-overview"></a>2.1. &#44060;&#50836;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Hibernate &#50500;&#53412;&#53581;&#52376;&#50640; &#45824;&#54620; (&#47588;&#50864;) &#45458;&#51008; &#49688;&#51456;&#51032; &#44060;&#50836;:: </p>
            <div class="mediaobject" align="center"><img src="images/overview.png" align="middle"></div>
            <p>&#51060; &#45796;&#51060;&#50612;&#44536;&#47016;&#51008; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#50689;&#49549;&#54868; &#49436;&#48708;&#49828;&#46308;(&#44284; &#50689;&#49549; &#44061;&#52404;&#46308;)&#51012; &#51228;&#44277;&#54616;&#44592; &#50948;&#54644; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50752; &#52968;&#54588;&#44536;&#47112;&#51060;&#49496;&#51012; &#49324;&#50857;&#54616;&#45716; Hibernate&#47484; &#48372;&#50668;&#51456;&#45796;. </p>
            <p>&#50864;&#47532;&#45716; &#47088;&#53440;&#51076; &#50500;&#53412;&#53581;&#52376;&#50640; &#45824;&#54620; &#48372;&#45796; &#49345;&#49464;&#54620; &#48624;&#47484; &#48372;&#50668;&#51452;&#44256; &#49910;&#45796;. &#48520;&#54665;&#54616;&#44172;&#46020;, Hibernate&#45716; &#50976;&#50672;&#54616;&#47728; &#47751; &#44032;&#51648; &#51217;&#44540;&#48277;&#46308;&#51012; &#51228;&#44277;&#54620;&#45796;. &#50864;&#47532;&#45716; &#46160; &#44032;&#51648; &#44537;&#45800;&#51012; &#48372;&#50668;&#51460; &#44163;&#51060;&#45796;. "&#44221;&#47049;&#44553;" &#50500;&#53412;&#53581;&#52376;&#45716; &#44536;&#44163; &#51088;&#49888;&#51032; JDBC
               &#52964;&#45349;&#49496;&#46308;&#51012; &#51228;&#44277;&#54616;&#44256; &#44536;&#44163; &#51088;&#49888;&#51032; &#53944;&#47004;&#51117;&#49496;&#46308;&#51012; &#44288;&#47532;&#54616;&#45716; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#44054;&#45716;&#45796;. &#51060; &#51217;&#44540;&#48277;&#51008; Hibernate&#51032; API&#51032; &#52572;&#49548; &#48512;&#48516;&#51665;&#54633;&#51012; &#49324;&#50857;&#54620;&#45796;: 
            </p>
            <div class="mediaobject" align="center"><img src="images/lite.png" align="middle"></div>
            <p>"&#51204;&#52404; &#51221;&#49688;" &#50500;&#53412;&#53581;&#52376;&#45716; &#44592;&#48376; JDBC/JTA&#47196;&#48512;&#53552; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#52628;&#49345;&#54868; &#49884;&#53412;&#44256; Hibernate&#47196; &#54616;&#50668;&#44552; &#49345;&#49464;&#54620; &#44163;&#51012; &#52376;&#47532;&#54616;&#44172; &#54620;&#45796;. </p>
            <div class="mediaobject" align="center"><img src="images/full_cream.png" align="middle"></div>
            <p>Heres some definitions of the objects in the diagrams: </p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term">SessionFactory (<code class="literal">org.hibernate.SessionFactory</code>)</span></dt>
                  <dd>
                     <p>&#45800;&#51068; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#45824;&#54620; &#52980;&#54028;&#51068;&#46108; &#47588;&#54609;&#46308;&#51032; threadsafe (&#48520;&#48320;&#51032;) &#52880;&#49884;. Session&#44284; ConnectionProvider&#51032; &#53364;&#46972;&#51060;&#50616;&#53944;&#47484; &#50948;&#54620; &#54057;&#53664;&#47532;. &#54532;&#47196;&#49464;&#49828; &#47112;&#48296; &#46608;&#45716; &#53364;&#47084;&#49828;&#53552; &#47112;&#48296;&#50640;&#49436; &#53944;&#47004;&#51117;&#49496;&#46308; &#49324;&#51060;&#50640; &#51116;&#49324;&#50857;
                        &#44032;&#45733;&#54620; &#45936;&#51060;&#53552;&#51032; &#49440;&#53469;&#51201;&#51064; (second-level) &#52880;&#49884;&#47484; &#48372;&#44288;&#54624; &#49688;&#46020; &#51080;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term">Session (<code class="literal">org.hibernate.Session</code>)</span></dt>
                  <dd>
                     <p>&#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#44284; &#50689;&#49549; &#51200;&#51109;&#49548; &#49324;&#51060;&#51032; &#45824;&#54868;&#47484; &#54364;&#54788;&#54616;&#45716; &#45800;&#51068; &#50416;&#47112;&#46300;&#51060;&#44256;, &#49688;&#47749;&#51060; &#51687;&#51008; &#44061;&#52404;. JDBC &#52964;&#45349;&#49496;&#51012; &#54252;&#51109;&#54620;&#45796;. <code class="literal">Transaction</code> &#50857; &#54057;&#53664;&#47532;. &#44061;&#52404; &#44536;&#47000;&#54532;&#47484; &#45348;&#48708;&#44172;&#51060;&#53944; &#54616;&#44144;&#45208; &#49885;&#48324;&#51088;&#47196; &#44061;&#52404;&#46308;&#51012; &#47337;&#50629;&#54624; &#46412; &#49324;&#50857;&#46104;&#45716; &#50689;&#49549; &#44061;&#52404;&#46308;&#50640; &#45824;&#54620; &#54596;&#49688;&#51201;&#51064;(&#52395; &#48264;&#51704; &#47112;&#48296;&#51032;) &#52880;&#49884;&#47484; &#48372;&#44288;&#54620;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term">&#50689;&#49549; &#44061;&#52404;&#46308;&#44284; &#53084;&#47113;&#49496;&#46308;</span></dt>
                  <dd>
                     <p>persistent &#49345;&#53468;&#50752; &#48708;&#51648;&#45768;&#49828; &#44592;&#45733;&#51012; &#54252;&#54632;&#54616;&#45716; &#49688;&#47749;&#51060; &#51687;&#44256;, &#45800;&#51068; &#50416;&#47112;&#46300;&#51064; &#44061;&#52404;&#46308;. &#51060;&#44163;&#46308;&#51008; &#53685;&#49345;&#51032; JavaBeans/POJO&#46308;&#51068; &#49688; &#51080;&#44256;, &#50724;&#51649; &#44536;&#44163;&#46308;&#50640; &#45824;&#54620; &#50724;&#51649; &#53945;&#48324;&#54620; &#44163;&#51008; &#44536;&#44163;&#46308;&#51060; &#54788;&#51116; (&#51221;&#54869;&#54616;&#44172; &#54620; &#44060;&#51032;)
                        <code class="literal">Session</code>&#44284; &#50672;&#44288;&#46104;&#50612; &#51080;&#45796;&#45716; &#51216;&#51060;&#45796;. <code class="literal">Session</code>&#51060; &#45803;&#55176;&#51088;&#47560;&#51088;, &#44536;&#44163;&#46308;&#51008; &#48516;&#47532;&#46112;(detached &#49345;&#53468;&#44032; &#46112;) &#44163;&#51060;&#44256; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#47112;&#51060;&#50612;&#50640;&#49436; &#49324;&#50857;&#54616;&#45716; &#44163;&#51060; &#51088;&#50976;&#47196;&#50752;&#51652;&#45796;(&#50696;&#47484; &#46308;&#47732;. &#51649;&#51217;&#51201;&#51004;&#47196; &#54532;&#47532;&#51232;&#53580;&#51060;&#49496; &#44228;&#52789;&#51004;&#47196; &#45936;&#51060;&#53552; &#51204;&#49569; &#44061;&#52404;&#46308;&#47196;&#49436; &#44536;&#47532;&#44256; &#51649;&#51217;&#51201;&#51004;&#47196; &#54532;&#47532;&#51232;&#53580;&#51060;&#49496; &#44228;&#52789;&#51004;&#47196;&#48512;&#53552;
                        &#45936;&#51060;&#53552; &#51204;&#49569; &#44061;&#52404;&#46308;&#47196;&#49436;). 
                     </p>
                  </dd>
                  <dt><span class="term">&#51204;&#51060;(Transient, &#54596;&#51088; &#51452;-&#44284;&#46020;) &#44061;&#52404;&#46308;&#44284; &#53084;&#47113;&#49496;&#46308;</span></dt>
                  <dd>
                     <p><code class="literal">Session</code>&#44284; &#54788;&#51116; &#50672;&#44288;&#46104;&#50612; &#51080;&#51648; &#50506;&#51008; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#51032; &#51064;&#49828;&#53556;&#49828;&#46308;. &#44536;&#44163;&#46308;&#51008; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#51032;&#54644; &#52488;&#44592;&#54868; &#46104;&#50632;&#44256; (&#50500;&#51649;) &#50689;&#49549;&#54868; &#46104;&#51648; &#50506;&#50520;&#44144;&#45208; &#44536;&#44163;&#46308;&#51008; &#45803;&#54784;&#51652;<code class="literal">Session</code>&#50640; &#51032;&#54644; &#52488;&#44592;&#54868; &#46104;&#50632;&#51012; &#49688;&#46020; &#51080;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term">Transaction (<code class="literal">org.hibernate.Transaction</code>)</span></dt>
                  <dd>
                     <p>(&#50741;&#49496;) &#51089;&#50629;&#51032; &#50896;&#51088; &#45800;&#50948;&#47484; &#51648;&#51221;&#54616;&#44592; &#50948;&#54644; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#51032;&#54644; &#49324;&#50857;&#46104;&#45716; &#45800;&#51068; &#50416;&#47112;&#46300;&#51060;&#44256;, &#49688;&#47749;&#51060; &#51687;&#51008; &#44061;&#52404;. &#44592;&#48376; JDBC, JTA &#46608;&#45716; CORBA &#53944;&#47004;&#51117;&#49496;&#51004;&#47196;&#48512;&#53552; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#52628;&#49345;&#54868; &#49884;&#53416;&#45796;. &#47751;&#47751; &#44221;&#50864;&#46308;&#50640;&#49436; &#54616;&#45208;&#51032;
                        <code class="literal">Session</code>&#51008; &#50668;&#47084; &#44060;&#51032; <code class="literal">Transaction</code>&#46308;&#50640; &#44152;&#52832; &#49688; &#51080;&#45796;. &#54616;&#51648;&#47564; &#44592;&#48376; API &#46608;&#45716; <code class="literal">Transaction</code>&#51012; &#49324;&#50857;&#54616;&#45716; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228; &#49444;&#51221;&#51008; &#44208;&#53076; &#50741;&#49496;&#51060; &#50500;&#45768;&#45796;! 
                     </p>
                  </dd>
                  <dt><span class="term">ConnectionProvider (<code class="literal">org.hibernate.connection.ConnectionProvider</code>)</span></dt>
                  <dd>
                     <p>(&#50741;&#49496;) JDBC &#52964;&#45349;&#49496;&#46308;&#50640; &#45824;&#54620; &#54057;&#53664;&#47532;(&#44536;&#47532;&#44256; &#44536;&#44163;&#46308;&#51032; pool). &#44592;&#48376; <code class="literal">Datasource</code> &#46608;&#45716; <code class="literal">DriverManager</code>&#47196;&#48512;&#53552; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#52628;&#49345;&#54868; &#49884;&#53416;&#45796;. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#45432;&#52636;&#46104;&#51648;&#45716; &#50506;&#51648;&#47564; &#44060;&#48156;&#51088;&#50640; &#51032;&#54644; &#54869;&#51109;/&#44396;&#54788; &#46108;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term">TransactionFactory (<code class="literal">org.hibernate.TransactionFactory</code>)</span></dt>
                  <dd>
                     <p>(&#50741;&#49496;) <code class="literal">Transaction</code> &#51064;&#49828;&#53556;&#49828;&#46308;&#50640; &#45824;&#54620; &#54057;&#53664;&#47532;. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#45432;&#52636;&#46104;&#51648;&#45716; &#50506;&#51648;&#47564; &#44060;&#48156;&#51088;&#50640; &#51032;&#54644; &#54869;&#51109;/&#44396;&#54788; &#46108;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term"><span class="emphasis"><em>Extension Interfaces</em></span></span></dt>
                  <dd>
                     <p>Hibernate&#45716; &#45817;&#49888;&#51032; &#50689;&#49549; &#44228;&#52789;&#51032; &#53945;&#49457;&#51012; &#47582;&#52644;&#54868; &#49884;&#53412;&#44592; &#50948;&#54644; &#45817;&#49888;&#51060; &#44396;&#54788;&#54624; &#49688; &#51080;&#45716; &#49440;&#53469;&#51201;&#51064; &#54869;&#51109; &#51064;&#53552;&#54168;&#51060;&#49828;&#46308;&#51012; &#51228;&#44277;&#54620;&#45796;. &#49345;&#49464;&#54620; &#44163;&#51008; API &#47928;&#49436;&#47484; &#48372;&#46972;. </p>
                  </dd>
               </dl>
            </div>
            <p>
                       
            </p>
            <p>&#51452;&#50612;&#51652; "&#44221;&#47049;&#44553;" &#50500;&#53412;&#53581;&#52376;&#51032; &#44221;&#50864;, &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; JTA &#46608;&#45716; JDBC&#50752; &#51649;&#51217; &#45824;&#54868;&#54616;&#44592; &#50948;&#54644;&#49436; <code class="literal">Transaction</code>/<code class="literal">TransactionFactory</code> &#44536;&#47532;&#44256;/&#46608;&#45716; <code class="literal">ConnectionProvider</code> API&#46308;&#51012; &#47924;&#49884;&#54620;&#45796;. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="tutorial-summary.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="architecture-states.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">1.5. &#50836;&#50557;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;2.2. &#51064;&#49828;&#53556;&#49828; &#49345;&#53468;&#46308;</td>
            </tr>
         </table>
      </div>
   </body>
</html>