<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>2.3. JMX &#53685;&#54633;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="architecture.html" title="2&#51109;. &#50500;&#53412;&#53581;&#52376;">
      <link rel="prev" href="architecture-states.html" title="2.2. &#51064;&#49828;&#53556;&#49828; &#49345;&#53468;&#46308;">
      <link rel="next" href="architecture-jca.html" title="2.4. JCA &#51648;&#50896;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">2.3. JMX &#53685;&#54633;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="architecture-states.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">2&#51109;. &#50500;&#53412;&#53581;&#52376;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="architecture-jca.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="architecture-jmx"></a>2.3. JMX &#53685;&#54633;
                  </h2>
               </div>
            </div>
         </div>
         <p>JMX&#45716; &#51088;&#48148; &#52980;&#54252;&#45324;&#53944; &#44288;&#47532;&#47484; &#50948;&#54620; J2EE &#54364;&#51456;&#51060;&#45796;. Hibernate&#45716; JMX &#54364;&#51456; &#49436;&#48708;&#49828;&#47484; &#53685;&#54644; &#44288;&#47532;&#46112; &#49688;&#46020; &#51080;&#45796;. &#50864;&#47532;&#45716; &#48176;&#54252;&#48376; &#45236;&#50640; MBean &#44396;&#54788;, <code class="literal">org.hibernate.jmx.HibernateService</code>&#47484; &#51228;&#44277;&#54620;&#45796;. 
         </p>
         <p>JBoss &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#49345;&#50640; Hibernae&#47484; JMX &#49436;&#48708;&#49828;&#47196;&#49436; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;&#50640; &#45824;&#54620; &#50696;&#51228;&#45716; JBoss &#49324;&#50857;&#51088; &#44032;&#51060;&#46300;&#47484; &#48372;&#44600; &#48148;&#46976;&#45796;. JBoss &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#49345;&#50640;&#49436;, &#47564;&#51068; &#45817;&#49888;&#51060; JMX&#47484; &#49324;&#50857;&#54616;&#50668; &#48176;&#52824;&#54624; &#44221;&#50864;
            &#45817;&#49888;&#51008; &#46608;&#54620; &#45796;&#51020; &#51060;&#51216;&#46308;&#51012; &#50619;&#45716;&#45796;: 
         </p>
         <div class="itemizedlist">
            <ul type="disc">
               <li>
                  <p><span class="emphasis"><em>Session &#44288;&#47532;:</em></span> Hibernate <code class="literal">Session</code>&#51032; &#49373;&#47749;&#51452;&#44592;&#44032; JTA &#53944;&#47004;&#51117;&#49496;&#51032; &#50689;&#50669; &#45236;&#50640; &#51088;&#46041;&#51201;&#51004;&#47196; &#48148;&#51064;&#46300; &#46112; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; &#45817;&#49888;&#51060; &#45908;&#51060;&#49345; <code class="literal">Session</code>&#51012; &#49688;&#51089;&#50629;&#51004;&#47196; &#50676;&#44256; &#45803;&#51648; &#50506;&#50500;&#46020; &#46120;&#51012; &#51032;&#48120;&#54616;&#44256;, &#51060;&#44163;&#51008; JBoss EJB &#51064;&#53552;&#49481;&#53552;&#51032; &#50629;&#47924;&#44032; &#46108;&#45796;. &#45817;&#49888;&#51008; &#46608;&#54620; &#45908; &#51060;&#49345; &#45817;&#49888;&#51032; &#53076;&#46300; &#50612;&#45712; &#44275;&#50640;&#49436;&#46304; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228;&#49444;&#51221;&#50640; &#45824;&#54644; &#44145;&#51221;&#54616;&#51648; &#50506;&#50500;&#46020; &#46108;&#45796;(&#45817;&#49888;&#51060; &#47932;&#47200; &#51060;&#49885;&#49457; &#51080;&#45716;
                     &#50689;&#49549; &#44228;&#52789;&#51012; &#51089;&#49457;&#54616;&#44256;&#51088; &#50896;&#54616;&#51648; &#50506;&#45716;&#54620;, &#51060;&#47484; &#50948;&#54644; &#50741;&#49496; Hibernate <code class="literal">Transaction</code> API&#47484; &#49324;&#50857;&#54616;&#46972;). &#45817;&#49888;&#51008; <code class="literal">Session</code>&#50640; &#51217;&#44540;&#54616;&#44592; &#50948;&#54644; <code class="literal">HibernateContext</code>&#47484; &#54840;&#52636;&#54620;&#45796;. 
                  </p>
               </li>
               <li>
                  <p><span class="emphasis"><em>HAR &#48176;&#52824;:</em></span> &#45824;&#44060; &#45817;&#49888;&#51008; JBoss &#49436;&#48708;&#49828; &#48176;&#52824; &#46356;&#49828;&#53356;&#47549;&#53552;&#47484; &#49324;&#50857;&#54616;&#50668; Hibernate JMX &#49436;&#48708;&#49828;&#47484; (EAR &#44284;/&#46608;&#45716; SAR &#54028;&#51068;&#47196;) &#48176;&#52824;&#54616;&#44256;, &#44536;&#44163;&#51008; Hibernate <code class="literal">SessionFactory</code>&#51032; &#53685;&#49345;&#51201;&#51064; &#44396;&#49457; &#50741;&#49496;&#46308; &#47784;&#46160;&#47484; &#51648;&#50896;&#54620;&#45796;. &#54616;&#51648;&#47564; &#45817;&#49888;&#51008; &#50668;&#51204;&#55176; &#47784;&#46304; &#45817;&#49888;&#51032; &#47588;&#54609; &#54028;&#51068;&#46308;&#51012; &#48176;&#52824; &#46356;&#49828;&#53356;&#47549;&#53552; &#49549;&#50640; &#47749;&#47749;&#54644;&#50556; &#54620;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#50741;&#49496; HAR &#48176;&#52824;&#47484; &#49324;&#50857;&#54616;&#44256;&#51088; &#44208;&#51221;&#54616;&#45716; &#44221;&#50864;, JBoss&#45716; &#45817;&#49888;&#51032; HAR &#54028;&#51068;
                     &#45236;&#50640; &#51080;&#45716; &#47784;&#46304; &#47588;&#54609; &#54028;&#51068;&#46308;&#51012; &#51088;&#46041;&#51201;&#51004;&#47196; &#44160;&#52636;&#54644;&#45244; &#44163;&#51060;&#45796;. 
                  </p>
               </li>
            </ul>
         </div>
         <p>&#51060;&#46308; &#50741;&#49496;&#46308;&#50640; &#45824;&#54620; &#52628;&#44032; &#51221;&#48372;&#45716; JBoss &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#49324;&#50857;&#51088; &#44032;&#51060;&#46300;&#47484; &#52280;&#51312;&#54616;&#46972;. </p>
         <p>JMX &#49436;&#48708;&#49828;&#47196;&#49436; &#51060;&#50857; &#44032;&#45733;&#54620; &#46608;&#45796;&#47480; &#53945;&#51669;&#51008; &#47088;&#53440;&#51076; Hibernate &#53685;&#44228;&#51060;&#45796;. <a href="configuration-optional.html#configuration-optional-statistics" title="3.4.6. Hibernate &#53685;&#44228;">3.4.6&#51208;. &#8220;Hibernate &#53685;&#44228;&#8221;</a>&#47484; &#48372;&#46972;. 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="architecture-states.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="architecture.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="architecture-jca.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">2.2. &#51064;&#49828;&#53556;&#49828; &#49345;&#53468;&#46308;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;2.4. JCA &#51648;&#50896;</td>
            </tr>
         </table>
      </div>
   </body>
</html>