<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>2.5. &#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="architecture.html" title="2&#51109;. &#50500;&#53412;&#53581;&#52376;">
      <link rel="prev" href="architecture-jca.html" title="2.4. JCA &#51648;&#50896;">
      <link rel="next" href="session-configuration.html" title="3&#51109;. &#44396;&#49457;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">2.5. &#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="architecture-jca.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">2&#51109;. &#50500;&#53412;&#53581;&#52376;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="session-configuration.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="architecture-current-session"></a>2.5. &#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate&#47484; &#49324;&#50857;&#54616;&#45716; &#45824;&#48512;&#48516;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#51008; &#50612;&#46500; &#50577;&#49885;&#51032; "&#52968;&#53581;&#49828;&#53944;&#49345;&#51032;(contextual)" &#49464;&#49496;&#46308;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;. &#50668;&#44592;&#49436; &#51452;&#50612;&#51652; &#49464;&#49496;&#51008; &#51452;&#50612;&#51652; &#52968;&#53581;&#49828;&#53944;&#51032; &#50689;&#50669;&#50640; &#44152;&#52432; &#54876;&#46041;&#51012; &#54620;&#45796;. &#54616;&#51648;&#47564; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#51012; &#44032;&#47196;&#51656;&#47084;
            &#52968;&#53581;&#49828;&#53944;&#47484; &#44396;&#49457;&#54616;&#45716; &#44163;&#50640; &#45824;&#54620; &#51221;&#51032;&#45716; &#51068;&#48152;&#51201;&#51004;&#47196; &#45796;&#47476;&#45796;; &#44536;&#47532;&#44256; &#45796;&#47480; &#52968;&#53581;&#49828;&#53944;&#46308;&#51008; &#54788;&#51116;&#46972;&#44256; &#54616;&#45716; &#44060;&#45392;&#50640; &#45824;&#54644; &#45796;&#47480; &#50689;&#50669;&#46308;&#51012; &#51221;&#51032;&#54620;&#45796;. &#48260;&#51204; 3.0 &#51204;&#51032; Hibernate&#47484; &#49324;&#50857;&#54616;&#45716; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#51008; &#51088;&#44032;&#49373;&#49328;&#46108; <code class="literal">ThreadLocal</code>-&#44592;&#48152;&#51032; &#52968;&#53581;&#49828;&#49345;&#51032; &#49464;&#49496;&#46308;, <code class="literal">HibernateUtil</code>&#44284; &#44057;&#51008; helper &#53364;&#47000;&#49828;&#46308;&#51012; &#54876;&#50857;&#54664;&#44144;&#45208; &#54532;&#46973;&#49884;/&#51064;&#53552;&#49481;&#49496; &#44592;&#48152;&#51032; &#52968;&#53581;&#49828;&#53944;&#49345;&#51032; &#49464;&#49496;&#46308;&#51012; &#51228;&#44277;&#54644;&#51452;&#50632;&#45912; (Spring &#46608;&#45716; Pico&#50752; &#44057;&#51008; )&#51228; 3&#51032; &#54532;&#47112;&#51076;&#50893;&#46308;&#51012; &#54876;&#50857;&#54616;&#45716; &#44221;&#54693;&#51060; &#51080;&#50632;&#45796;. 
         </p>
         <p>&#48260;&#51204; 3.0.1&#50640;&#49436;&#48512;&#53552; &#49884;&#51089;&#54616;&#50668;, Hibernate&#45716; <code class="literal">SessionFactory.getCurrentSession()</code> &#47700;&#49548;&#46300;&#47484; &#52628;&#44032;&#54664;&#45796;. &#52488;&#44592;&#50640; &#51060;&#44163;&#51008; <code class="literal">JTA</code> &#53944;&#47004;&#51117;&#49496;&#46308;&#51012; &#49324;&#50857;&#54616;&#45716; &#44163;&#51012; &#51204;&#51228;&#54664;&#45796;. &#50668;&#44592;&#49436; <code class="literal">JTA</code> &#53944;&#47004;&#51117;&#49496;&#51008; &#54788;&#51116; &#49464;&#49496;&#51032; &#50689;&#50669;&#44284; &#52968;&#53581;&#49828;&#53944;&#47484; &#51221;&#51032;&#54664;&#45796;. Hibernate &#54016;&#51008; &#49457;&#49689;&#46108; &#45796;&#49688;&#51032; &#49828;&#53472;&#46300;&#50620;&#47200; <code class="literal">JTA TransactionManager</code> &#44396;&#54788;&#46308;&#51060; &#48156;&#54364;&#46104;&#47732;, (&#51204;&#48512;&#45716; &#50500;&#45768;&#44192;&#51648;&#47564;) &#45824;&#48512;&#48516;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#51060; &#44536;&#44163;&#46308;&#51060; <code class="literal">J2EE</code> &#52968;&#53580;&#51060;&#45320; &#45236;&#47196; &#48176;&#52824;&#46104;&#46304; &#44536;&#47111;&#51648; &#50506;&#46304; &#44036;&#50640; <code class="literal">JTA</code> &#53944;&#47004;&#51117;&#49496; &#44288;&#47532;&#47484; &#49324;&#50857;&#54616;&#44172; &#46112; &#44163;&#51060;&#46972;&#44256; &#51452;&#51109;&#54620;&#45796;. &#44536;&#44163;&#50640; &#44592;&#52488;&#54616;&#50668;, <code class="literal">JTA</code>&#50640; &#44592;&#48152;&#54620; &#52968;&#53581;&#49828;&#53944;&#49345;&#51032; &#49464;&#49496;&#46308;&#51008; &#50616;&#51232;&#44032; &#45817;&#49888;&#51060; &#49324;&#50857;&#51012; &#54596;&#50836;&#47196; &#54616;&#44172; &#46112; &#51204;&#48512;&#45796;. 
         </p>
         <p>&#54616;&#51648;&#47564; &#48260;&#51204; 3.1 &#51060;&#54980;&#47196; <code class="literal">SessionFactory.getCurrentSession()</code> &#51060;&#47732;&#51032; &#52376;&#47532;&#44284;&#51221;&#51008; &#51060;&#51228; &#54540;&#47084;&#44536; &#44032;&#45733;&#54616;&#45796;. &#44536;&#44163;&#51012; &#45149;&#45236;&#44592; &#50948;&#54644;, &#54616;&#45208;&#51032; &#49352;&#47196;&#50868; &#54869;&#51109; &#51064;&#53552;&#54168;&#51060;&#49828; (<code class="literal">org.hibernate.context.CurrentSessionContext</code>)&#50752; &#54616;&#45208;&#51032; &#49352;&#47196;&#50868; &#44396;&#49457; &#54028;&#46972;&#48120;&#53552;(<code class="literal">hibernate.current_session_context_class</code>)&#44032; &#54788;&#51116; &#49464;&#49496;&#46308;&#51012; &#51221;&#51032;&#54616;&#45716; &#50689;&#50669;&#44284; &#52968;&#53581;&#49828;&#53944;&#51032; &#54540;&#47084;&#44536; &#44032;&#45733;&#49457;&#51012; &#54728;&#50857;&#54616;&#44592; &#50948;&#54644; &#52628;&#44032;&#46104;&#50632;&#45796;. 
         </p>
         <p>&#44536;&#44163;&#51032; &#44228;&#50557;&#50640; &#45824;&#54620; &#49345;&#49464;&#54620; &#45436;&#51032;&#45716; <code class="literal">org.hibernate.context.CurrentSessionContext</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#50640; &#44288;&#54620; javadocs&#47484; &#48372;&#46972;. &#44536;&#44163;&#51008; &#54616;&#45208;&#51032; &#47700;&#49548;&#46300;, <code class="literal">currentSession()</code>&#47484; &#51221;&#51032;&#54616;&#47728;, &#44536; &#44396;&#54788;&#51008; &#54788;&#51116;&#51032; &#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#51012; &#52628;&#51201;&#54624; &#52293;&#51076;&#51060; &#51080;&#45796;. &#48708;&#44277;&#49885;&#51201;&#51004;&#47196;, Hibernate&#45716; &#51060; &#51064;&#53552;&#54168;&#51060;&#49828;&#50640; &#45824;&#54620; &#49464; &#44060;&#51032; &#44396;&#54788;&#46308;&#51012; &#48512;&#49688;&#51201;&#51004;&#47196; &#54252;&#54632;&#54616;&#44256; &#51080;&#45796;. 
         </p>
         <div class="itemizedlist">
            <ul type="disc">
               <li>
                  <p><code class="literal">org.hibernate.context.JTASessionContext</code> - &#54788;&#51116;&#51032; &#49464;&#49496;&#46308;&#51008; &#54616;&#45208;&#51032; <code class="literal">JTA</code>&#50640; &#51032;&#54644; &#52628;&#51201;&#46104;&#44256; &#50689;&#50669;&#54868; &#46108;&#45796;. &#50668;&#44592;&#49436; &#52376;&#47532;&#44284;&#51221;&#51008; &#51060;&#51204;&#51032; JTA-&#51204;&#50857; &#51217;&#44540;&#44284; &#51221;&#54869;&#54616;&#44172; &#46041;&#51068;&#54616;&#45796;. &#49345;&#49464;&#54620; &#44163;&#51008; javadocs&#47484; &#48372;&#46972;. 
                  </p>
               </li>
               <li>
                  <p><code class="literal">org.hibernate.context.ThreadLocalSessionContext</code> - &#54788;&#51116;&#51032; &#49464;&#49496;&#46308;&#51008; &#49892;&#54665; &#50416;&#47112;&#46300;&#50640; &#51032;&#54644; &#52628;&#51201;&#46108;&#45796;. &#49345;&#49464;&#54620; &#44163;&#51008; &#45796;&#49884; javadocs&#47484; &#48372;&#46972;. 
                  </p>
               </li>
               <li>
                  <p>NOT TRANSLATED! <code class="literal">org.hibernate.context.ManagedSessionContext</code> - current sessions are tracked by thread of execution. However, you are responsible to bind and unbind a <code class="literal">Session</code> instance with static methods on this class, it does never open, flush, or close a <code class="literal">Session</code>. 
                  </p>
               </li>
            </ul>
         </div>
         <p>The first two implementations provide a "one session - one database transaction" programming model, also known and used as
            <span class="emphasis"><em>session-per-request</em></span>. The beginning and end of a Hibernate session is defined by the duration of a database transaction. If you use programmatic
            transaction demarcation in plain JSE without JTA, you are advised to use the Hibernate <code class="literal">Transaction</code> API to hide the underlying transaction system from your code. If you use JTA, use the JTA interfaces to demarcate transactions.
            If you execute in an EJB container that supports CMT, transaction boundaries are defined declaratively and you don't need
            any transaction or session demarcation operations in your code. Refer to <a href="transactions.html" title="11&#51109;. &#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;">11&#51109;. <i xmlns:xlink="http://www.w3.org/1999/xlink">&#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;</i></a> for more information and code examples. 
         </p>
         <p><code class="literal">hibernate.current_session_context_class</code> &#44396;&#49457; &#54028;&#46972;&#48120;&#53552;&#45716; <code class="literal">org.hibernate.context.CurrentSessionContext</code> &#44396;&#54788;&#51060; &#49324;&#50857;&#46112; &#44163;&#51076;&#51012; &#51221;&#51032;&#54620;&#45796;. &#50669;&#54840;&#54872;&#51012; &#50948;&#54644;. &#47564;&#51068; &#51060; &#44396;&#49457; &#54028;&#46972;&#48120;&#53552;&#44032; &#49444;&#51221;&#46104;&#51648; &#50506;&#50520;&#51648;&#47564; &#54616;&#45208;&#51032; <code class="literal">org.hibernate.transaction.TransactionManagerLookup</code>&#51060; &#44396;&#49457;&#46104;&#50612; &#51080;&#51012; &#44221;&#50864;, Hibernate&#45716; <code class="literal">org.hibernate.context.JTASessionContext</code>&#47484; &#49324;&#50857;&#54624; &#44163;&#51076;&#51012; &#45432;&#53944;&#54616;&#46972;. &#51068;&#48152;&#51201;&#51004;&#47196;, &#51060; &#54028;&#46972;&#48120;&#53552;&#51032; &#44050;&#51008; &#45800;&#51648; &#49324;&#50857;&#54624; &#44396;&#54788; &#53364;&#47000;&#49828;&#47484; &#47749;&#47749;&#54624; &#44163;&#51060;&#45796;; &#54616;&#51648;&#47564; &#46160; &#44032;&#51648; &#48708;&#44277;&#49885;&#51201;&#51064; &#44396;&#54788;&#46308;&#47196;&#49436; &#46160; &#44060;&#51032; &#45824;&#51025;&#54616;&#45716; &#51687;&#51008; &#51060;&#47492;&#46308; "jta"&#50752; "thread"&#51060; &#51316;&#51116;&#54620;&#45796;. 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="architecture-jca.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="architecture.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="session-configuration.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">2.4. JCA &#51648;&#50896;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;3&#51109;. &#44396;&#49457;</td>
            </tr>
         </table>
      </div>
   </body>
</html>