<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>24&#51109;. &#52572;&#49345;&#51032; &#49892;&#51204; &#44221;&#54744;&#46308;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="misc.html" title="23.4. &#44592;&#53440; &#50696;&#51228; &#47588;&#54609;&#46308;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">24&#51109;. &#52572;&#49345;&#51032; &#49892;&#51204; &#44221;&#54744;&#46308;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="misc.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;</td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="best-practices"></a>24&#51109;. &#52572;&#49345;&#51032; &#49892;&#51204; &#44221;&#54744;&#46308;
                  </h2>
               </div>
            </div>
         </div>
         <div class="variablelist">
            <dl>
               <dt><span class="term">fine-grained &#53364;&#47000;&#49828;&#46308;&#51012; &#51089;&#49457;&#54616;&#44256; <code class="literal">&lt;component&gt;</code>&#47484; &#49324;&#50857;&#54616;&#50668; &#44536;&#44163;&#46308;&#51012; &#47588;&#54609;&#54616;&#46972;.</span></dt>
               <dd>
                  <p><code class="literal">street</code>, <code class="literal">suburb</code>, <code class="literal">state</code>, <code class="literal">postcode</code>&#47484; &#52897;&#49808;&#54868; &#49884;&#53412;&#45716;&#45936; <code class="literal">Address</code> &#53364;&#47000;&#49828;&#47484; &#49324;&#50857;&#54616;&#46972;. &#51060;&#44163;&#51008; &#53076;&#46300; &#51116;&#49324;&#50857;&#49457;&#51012; &#52489;&#51652;&#49884;&#53412;&#44256; &#47532;&#54057;&#53664;&#47553;&#51012; &#45800;&#49692;&#54868; &#49884;&#53416;&#45796;. 
                  </p>
               </dd>
               <dt><span class="term">&#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54644; &#49885;&#48324;&#51088; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#49440;&#50616;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>Hibernate&#45716; &#49885;&#48324;&#51088; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#50741;&#49496;&#51004;&#47196; &#47564;&#46304;&#45796;. &#50780; &#50864;&#47532;&#44032; &#44536;&#44163;&#46308;&#51012; &#49324;&#50857;&#54644;&#50556; &#54616;&#45716;&#44032;&#50640; &#45824;&#54620; &#47784;&#46304; &#51333;&#47448;&#51032; &#51060;&#50976;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;. &#50864;&#47532;&#45716; &#49885;&#48324;&#51088;&#46308;&#51060; '&#54633;&#49457;(synthetic)'&#51060; &#46104;&#45716;(&#48708;&#51648;&#45768;&#49828; &#51032;&#48120; &#50630;&#51060; &#49373;&#49457;&#46104;&#45716;) &#44163;&#51012;
                     &#44428;&#51109;&#54620;&#45796;. 
                  </p>
               </dd>
               <dt><span class="term">&#44256;&#50976; &#53412;&#46308;&#51012; &#49885;&#48324;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>&#47784;&#46304; &#50644;&#54000;&#54000;&#46308;&#50640; &#45824;&#54644; &#44256;&#50976; &#53412;&#46308;&#51012; &#49885;&#48324;&#54616;&#44256;, <code class="literal">&lt;natural-id&gt;</code>&#47484; &#49324;&#50857;&#54616;&#50668; &#44536;&#44163;&#46308;&#51012; &#47588;&#54609;&#54616;&#46972;. &#44256;&#50976; &#53412;&#47484; &#44396;&#49457;&#54616;&#45716; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#48708;&#44368;&#54616;&#44592; &#50948;&#54644; <code class="literal">equals()</code>&#50752; <code class="literal">hashCode()</code>&#47484; &#44396;&#54788;&#54616;&#46972;. 
                  </p>
               </dd>
               <dt><span class="term">&#44033;&#44033;&#51032; &#53364;&#47000;&#49828; &#47588;&#54609;&#51012; &#44536;&#44163; &#51088;&#49888;&#51032; &#54028;&#51068; &#45236;&#50640; &#50948;&#52824;&#51648;&#50892;&#46972;.</span></dt>
               <dd>
                  <p>&#54616;&#45208;&#51032; &#54620;&#45929;&#50612;&#47532; &#47588;&#54609; &#47928;&#49436;&#47484; &#49324;&#50857;&#54616;&#51648; &#47568;&#46972;. <code class="literal">com/eg/Foo.hbm.xml</code> &#54028;&#51068; &#49549;&#50640; <code class="literal">com.eg.Foo</code>&#47484; &#47588;&#54609;&#54616;&#46972;. &#51060;&#44163;&#51008; &#54016; &#54872;&#44221;&#50640;&#49436; &#53945;&#55176; &#51339;&#51008; &#51032;&#48120;&#47484; &#51456;&#45796;. 
                  </p>
               </dd>
               <dt><span class="term">&#47588;&#54609;&#46308;&#51012; &#47532;&#49548;&#49828;&#46308;&#47196;&#49436; &#47196;&#46300;&#49884;&#53020;&#46972;.</span></dt>
               <dd>
                  <p>&#44536;&#44163;&#46308;&#51060; &#47588;&#54609;&#54616;&#45716; &#53364;&#47000;&#49828;&#46308;&#50640; &#46384;&#46972;&#49436; &#47588;&#54609;&#46308;&#51012; &#48176;&#52824;&#54616;&#46972; </p>
               </dd>
               <dt><span class="term">&#51656;&#51032; &#47928;&#51088;&#50676;&#46308;&#51012; &#44061;&#44288;&#54868; &#49884;&#53412;&#45716; &#44163;&#51012; &#44256;&#47140;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>&#45817;&#49888;&#51032; &#51656;&#51032;&#46308;&#51060; ANSI &#54364;&#51456;&#51060; &#50500;&#45772; SQL &#54632;&#49688;&#46308;&#51012; &#54840;&#52636;&#54616;&#45716; &#44221;&#50864;&#45716; &#51339;&#51008; &#49892;&#51204;&#50672;&#49845;&#51060;&#45796;. &#51656;&#51032; &#47928;&#51088;&#50676;&#46308;&#51012; &#47588;&#54609; &#54028;&#51068;&#46308;&#50640;&#45796;&#44032; &#50808;&#48512;&#54868; &#49884;&#53412;&#45716; &#44163;&#51008; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#48372;&#45796; &#51060;&#49885;&#49457; &#51080;&#46020;&#47197; &#47564;&#46308;&#50612;&#51460; &#44163;&#51060;&#45796;. </p>
               </dd>
               <dt><span class="term">&#48148;&#51064;&#46300; &#48320;&#49688;&#46308;&#51012; &#49324;&#50857;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>JDBC&#50640;&#49436;&#52376;&#47100;, &#49345;&#49688; &#50500;&#45772; &#44050;&#46308;&#51012; "?"&#47196; &#45824;&#52404;&#49884;&#53020;&#46972;. &#51656;&#51032; &#49549;&#50640; &#49345;&#49688; &#50500;&#45772; &#44050;&#51012; &#48148;&#51064;&#46300; &#49884;&#53412;&#45716;&#45936; &#47928;&#51088;&#50676; &#52376;&#47532;&#47484; &#44208;&#53076; &#49324;&#50857;&#54616;&#51648; &#47568;&#46972;! &#45908; &#51339;&#44172;&#45716; &#51656;&#51032;&#46308; &#49549;&#50640; &#47749;&#47749;&#46108; &#54028;&#46972;&#48120;&#53552;&#46308;&#51012; &#49324;&#50857;&#54616;&#45716; &#44163;&#51012; &#44256;&#47140;&#54616;&#46972;. </p>
               </dd>
               <dt><span class="term">&#45817;&#49888; &#51088;&#49888;&#51032; JDBC &#52964;&#45349;&#49496;&#46308;&#51012; &#44288;&#47532;&#54616;&#51648; &#47568;&#46972;.</span></dt>
               <dd>
                  <p>Hibernate&#45716; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51004;&#47196; &#54616;&#50668;&#44552; JDBC &#52964;&#45349;&#49496;&#46308;&#51012; &#44288;&#47532;&#54616;&#46020;&#47197; &#54620;&#45796;. &#51060; &#51217;&#44540;&#48277;&#51008; &#47560;&#51648;&#47561; &#49688;&#45800;&#51004;&#47196;&#49436; &#44256;&#47140;&#46104;&#50612;&#50556; &#54620;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#48120;&#47532; &#47564;&#46308;&#50612;&#51652; &#52964;&#45349;&#49496; &#54532;&#47196;&#48148;&#51060;&#45908;&#46308;&#51012; &#49324;&#50857;&#54624; &#49688; &#50630;&#51012; &#44221;&#50864;, <code class="literal">org.hibernate.connection.ConnectionProvider</code>&#50640; &#45824;&#54620; &#45817;&#49888; &#51088;&#49888;&#51032; &#44396;&#54788;&#51012; &#51228;&#44277;&#54616;&#45716; &#44163;&#51012; &#44256;&#47140;&#54616;&#46972;. 
                  </p>
               </dd>
               <dt><span class="term">&#47582;&#52644;&#54805; &#53440;&#51077; &#49324;&#50857;&#51012; &#44256;&#47140;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>&#45817;&#49888;&#51060; &#51088;&#48148; &#53440;&#51077;&#51012; &#44054;&#44256; &#51080;&#44256;, &#50612;&#46500; &#46972;&#51060;&#48652;&#47084;&#47532;&#47196;&#48512;&#53552; &#47568;&#54616;&#44256;, &#44536;&#44163;&#51060; &#50689;&#49549;&#54868; &#46112; &#54596;&#50836;&#44032; &#51080;&#51648;&#47564; &#44536;&#44163;&#51012; &#52980;&#54252;&#45324;&#53944;&#47196;&#49436; &#47588;&#54609;&#49884;&#53412;&#45716;&#45936; &#54596;&#50836;&#54620; accessor&#46308;&#51012; &#51228;&#44277;&#54624; &#54596;&#50836;&#44032; &#50630;&#45796;&#44256; &#44032;&#51221;&#54616;&#51088;. &#45817;&#49888;&#51008; <code class="literal">org.hibernate.UserType</code>&#51012; &#44396;&#54788;&#54616;&#45716; &#44163;&#51012; &#44256;&#47140;&#54644;&#50556; &#54624; &#44163;&#51060;&#45796;. &#51060; &#51217;&#44540;&#48277;&#51008; Hibernate &#53440;&#51077;&#51004;&#47196;/&#51004;&#47196;&#48512;&#53552; &#48320;&#54872;&#46308;&#51012; &#44396;&#54788;&#54616;&#45716; &#44163;&#51004;&#47196;&#48512;&#53552; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53076;&#46300;&#47484; &#51088;&#50976;&#47213;&#44172; &#54644;&#51456;&#45796;. 
                  </p>
               </dd>
               <dt><span class="term">&#48337;&#47785; &#51648;&#51216;&#46308;&#50640;&#49436; &#49688;&#51089;&#50629;&#51004;&#47196; &#53076;&#46377;&#46108; JDBC&#47484; &#49324;&#50857;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>&#49884;&#49828;&#53596;&#51032; &#54140;&#54252;&#47676;&#49828;&#44032; &#51473;&#45824;&#54620; &#50689;&#50669;&#46308;&#50640;&#49436;, &#47751;&#47751; &#51333;&#47448;&#51032; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51008; &#51649;&#51217;&#51201;&#51064; JDBC&#50640;&#49436; &#51060;&#46301;&#51012; &#48376;&#45796;. &#44536;&#47084;&#45208; &#45817;&#49888;&#51060; &#50612;&#46500; &#44163;&#51060; &#48337;&#47785;&#51064;&#51648;&#47484; <span class="emphasis"><em>&#50508;&#44592;</em></span> &#51204;&#44620;&#51648; &#44592;&#45796;&#47532;&#44600; &#48148;&#46976;&#45796;. &#44536;&#47532;&#44256; &#51649;&#51217;&#51201;&#51064; JDBC&#44032; &#48152;&#46300;&#49884; &#45908; &#48736;&#47476;&#45796;&#44256; &#44032;&#51221;&#54616;&#51648; &#47568;&#46972;. &#47564;&#51068; &#45817;&#49888;&#51060; &#51649;&#51217;&#51201;&#51064; JDBC&#47484; &#49324;&#50857;&#54624; &#54596;&#50836;&#44032; &#51080;&#51012; &#44221;&#50864;, Hibernate <code class="literal">Session</code>&#51012; &#50676;&#44256; &#44536; SQL &#52964;&#45349;&#49496;&#51012; &#49324;&#50857;&#54624; &#44032;&#52824;&#44032; &#51080;&#45796;. &#44536; &#48169;&#48277;&#51004;&#47196; &#45817;&#49888;&#51008; &#46041;&#51068;&#54620; &#53944;&#47004;&#51117;&#49496; &#48169;&#46020;&#50752; &#44592;&#48376; &#52964;&#45349;&#49496; &#54532;&#47196;&#48148;&#51060;&#45908;&#47484; &#50668;&#51204;&#55176; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796; 
                  </p>
               </dd>
               <dt><span class="term"><code class="literal">Session</code> flushing&#51012; &#51060;&#54644;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>&#49884;&#44036;&#51060; &#51648;&#45224;&#50640; &#46384;&#46972; Session&#51008; &#44536;&#44163;&#51032; &#50689;&#49549; &#49345;&#53468;&#47484; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50752; &#46041;&#44592;&#54868; &#49884;&#53416;&#45796;. &#47564;&#51068; &#51060; &#44284;&#51221;&#51060; &#45320;&#47924; &#51088;&#51452; &#48156;&#49373;&#54624; &#44221;&#50864; &#54140;&#54252;&#47676;&#49828;&#44032; &#50689;&#54693;&#51012; &#48155;&#51012; &#44163;&#51060;&#45796;. &#45817;&#49888;&#51008; &#46412;&#46412;&#47196; &#51088;&#46041;&#51201;&#51064; flushing&#51012; &#49324;&#50857; &#48520;&#44032;&#45733;&#54616;&#44172; &#47564;&#46308;&#44144;&#45208;
                     &#53945;&#51221; &#53944;&#47004;&#51117;&#49496; &#45236;&#50640;&#49436; &#51656;&#51032;&#46308;&#51032; &#49692;&#49436;&#50752; &#45796;&#47480; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51032; &#49692;&#49436;&#47484; &#48320;&#44221;&#49884;&#53020;&#49436; &#48520;&#54596;&#50836;&#54620; flushing&#51012; &#52572;&#49548;&#54868; &#49884;&#53420; &#49688; &#51080;&#45796;. 
                  </p>
               </dd>
               <dt><span class="term">3-tier &#50500;&#53412;&#53581;&#52376;&#50640;&#49436;, <code class="literal">saveOrUpdate()</code> &#49324;&#50857;&#51012; &#44256;&#47140;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>servlet / session &#48712; &#50500;&#53412;&#53581;&#52376;&#47484; &#49324;&#50857;&#54624; &#46412;, &#45817;&#49888;&#51008; sesson bean &#45236;&#50640; &#47196;&#46300;&#46108; &#50689;&#49549; &#44061;&#52404;&#46308;&#51012; &#49436;&#48660;&#47551;/JSP &#44228;&#52789;&#51004;&#47196;/&#51004;&#47196;&#48512;&#53552; &#51204;&#45804;&#54624;/&#48155;&#51012; &#49688; &#51080;&#45796;. &#44033;&#44033;&#51032; &#50836;&#52397;&#51012; &#49436;&#48708;&#49828;&#54616;&#45716;&#45936; &#49352;&#47196;&#50868; &#49464;&#49496;&#51012; &#49324;&#50857;&#54616;&#46972;.
                     &#44061;&#52404;&#46308;&#51012; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50752; &#46041;&#44592;&#54868; &#49884;&#53412;&#44592; &#50948;&#54644;&#49436; <code class="literal">Session.merge()</code> &#46608;&#45716; <code class="literal">Session.saveOrUpdate()</code>&#47484; &#49324;&#50857;&#54616;&#46972;. 
                  </p>
               </dd>
               <dt><span class="term">2-tier &#50500;&#53412;&#53581;&#52376;&#50640;&#49436;, &#49688;&#47749;&#51060; &#44596; &#50689;&#49549; &#52968;&#53581;&#49828;&#53944;&#46308;&#51012; &#49324;&#50857;&#54616;&#45716; &#44163;&#51012; &#44256;&#47140;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#46308;&#51008; &#52572;&#49345;&#51032; &#44032;&#50857;&#49457;&#51012; &#50948;&#54644; &#44032;&#45733;&#54620; &#54620; &#51687;&#50500;&#50556; &#54620;&#45796;. &#54616;&#51648;&#47564; &#51109;&#44592;&#44036; &#49892;&#54665;&#46104;&#45716; <span class="emphasis"><em>&#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53944;&#47004;&#51117;&#49496;&#46308;</em></span>, &#49324;&#50857;&#51088;&#51032; &#48624; &#44288;&#51216;&#50640;&#49436; &#54620; &#44060;&#51032; &#45800;&#50948; &#51089;&#50629;&#51012; &#44396;&#54788;&#54616;&#45716; &#44163;&#51060; &#44032;&#45140; &#54596;&#49688;&#51201;&#51060;&#45796;. &#54616;&#45208;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53944;&#47004;&#51117;&#49496;&#51008; &#47751; &#44060;&#51032; &#53364;&#46972;&#51060;&#50616;&#53944; &#50836;&#52397;&#46308;&#44284; &#51025;&#45813; &#51452;&#44592;&#46308;&#50640; &#44152;&#52832; &#49688;&#46020; &#51080;&#45796;. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53944;&#47004;&#51117;&#49496;&#46308;&#51012; &#44396;&#54788;&#54616;&#45716;&#45936; detached
                     &#44061;&#52404;&#46308;&#51012; &#49324;&#50857;&#54616;&#45716; &#44163;&#51060; &#44277;&#53685;&#51201;&#51060;&#45796;. 2-&#54000;&#50612; &#50500;&#53412;&#53581;&#52376;&#50640;&#49436; &#47588;&#50864; &#51201;&#51208;&#54620; &#45824;&#50504;&#51008; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53944;&#47004;&#51117;&#49496;&#51032; &#51204;&#52404; &#49373;&#47749;&#51452;&#44592; &#46041;&#50504;&#50640; &#54620; &#44060;&#51032; &#50676;&#47140;&#51652; &#50689;&#49549; &#51217;&#49549; (&#49464;&#49496;)&#51012; &#50976;&#51648;&#54616;&#45716; &#44163;&#51060;&#44256; &#44033;&#44033;&#51032; &#50836;&#52397;&#51032; &#45149;&#50640;&#49436; JDBC &#52964;&#45349;&#49496;&#51012; &#44036;&#45800;&#54616;&#44172;
                     &#50672;&#44208;&#54644;&#51228;&#54616;&#44256; &#52264;&#54980;&#51032; &#50836;&#52397;&#51032; &#49884;&#51089; &#49884;&#50640; &#45796;&#49884; &#50672;&#44208;&#54616;&#45716; &#44163;&#51060;&#45796;. &#54620; &#44060; &#51060;&#49345;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53944;&#47004;&#51117;&#49496;&#51012; &#44032;&#47196;&#51656;&#47084;&#49436; &#54616;&#45208;&#51032; &#45800;&#51068; &#49464;&#49496;&#51012; &#44208;&#53076; &#44277;&#50976;&#54616;&#51648; &#47568;&#46972;. &#44277;&#50976;&#54624; &#44221;&#50864;&#50640; &#45817;&#49888;&#51008; &#49892;&#54952;&#49457;&#51060; &#50630;&#45716; &#45936;&#51060;&#53552;&#47196; &#51089;&#50629;&#54616;&#44172; &#46112; &#44163;&#51060;&#45796;. 
                  </p>
               </dd>
               <dt><span class="term">&#50696;&#50808;&#49345;&#54889;&#46308;&#51012; &#48373;&#44396;&#44032;&#45733;&#54620; &#44163;&#51004;&#47196;&#49436; &#45796;&#47336;&#51648; &#47568;&#46972;.</span></dt>
               <dd>
                  <p>&#51060;&#44163;&#51008; "&#52572;&#49345;&#51032;" &#49892;&#51204;&#51060; &#50500;&#45772; &#48372;&#45796; &#54596;&#49688;&#51201;&#51064; &#49892;&#51204;&#51060;&#45796;. &#50696;&#50808;&#49345;&#54889;&#51060; &#48156;&#49373;&#54624; &#46412;, <code class="literal">Transaction</code>&#51012; &#47204;&#48177;&#49884;&#53412;&#44256; <code class="literal">Session</code>&#51012; &#45803;&#50500;&#46972;. &#47564;&#51068; &#45817;&#49888;&#51060; &#44536;&#47111;&#44172; &#54616;&#51648; &#50506;&#51012; &#44221;&#50864;, Hibernate&#45716; &#47700;&#47784;&#47532; &#45236; &#49345;&#53468;&#44032; &#50689;&#49549; &#49345;&#53468;&#47484; &#51221;&#54869;&#54616;&#44172; &#54364;&#54788;&#54616;&#45716; &#44163;&#51012; &#48372;&#51613;&#54624; &#49688; &#50630;&#45796;. &#51060; &#53945;&#48324;&#54620; &#44221;&#50864;&#52376;&#47100;, &#47564;&#51068; &#51452;&#50612;&#51652; &#49885;&#48324;&#51088;&#47484; &#44032;&#51652; &#51064;&#49828;&#53556;&#49828;&#44032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49345;&#50640;
                     &#51316;&#51116;&#54616;&#45716;&#51648; &#50668;&#48512;&#47484; &#44208;&#51221;&#54616;&#45716;&#45936; <code class="literal">Session.load()</code>&#47484; &#49324;&#50857;&#54616;&#51648; &#47568;&#46972;; &#45824;&#49888;&#50640; <code class="literal">Session.get()</code> &#46608;&#45716; &#54616;&#45208;&#51032; &#51656;&#51032;&#47484; &#49324;&#50857;&#54616;&#46972;. 
                  </p>
               </dd>
               <dt><span class="term">&#50672;&#44288;&#46308;&#50640; &#45824;&#54620; lazy &#54168;&#52845;&#51012; &#49440;&#54840;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>eager &#54168;&#52845;&#51012; &#44288;&#45824;&#54616;&#44172; &#49324;&#50857;&#54616;&#46972;. second-level &#52880;&#49884; &#45236;&#50640; &#50756;&#51204;&#54616;&#44172; &#48372;&#44288;&#46104;&#51648; &#50506;&#51012; &#44163; &#44057;&#51008; &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54620; &#45824;&#48529;&#48516;&#51032; &#50672;&#44288;&#46308;&#50640; &#45824;&#54644; &#54532;&#46973;&#49884;&#46308;&#44284; lazy &#53084;&#47113;&#49496;&#46308;&#51012; &#49324;&#50857;&#54616;&#46972;. &#52880;&#49884;&#46108; &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54620; &#50672;&#44288;&#46308;&#51032; &#44221;&#50864;,
                     &#51060;&#44275;&#51008; &#52880;&#49884; &#49457;&#44277;&#51032; &#47588;&#50864; &#45458;&#51008; &#54869;&#47456;&#51060; &#51316;&#51116;&#54616;&#45716; &#44275;&#51060;&#47728;, <code class="literal">lazy="false"</code>&#47484; &#49324;&#50857;&#54616;&#50668; eager &#54168;&#52845;&#51012; &#47749;&#49884;&#51201;&#51004;&#47196; &#49324;&#50857; &#48520;&#44032;&#45733;&#54616;&#44172; &#54616;&#46972;. &#54620;&#51032; join &#54168;&#52845;&#51060; &#53945;&#51221; &#50416;&#51076;&#49352;&#50640; &#45824;&#54644; &#51201;&#51208;&#54624; &#46412;, &#54616;&#45208;&#51032; <code class="literal">left join fetch</code>&#47484; &#44032;&#51652; &#51656;&#51032;&#47484; &#49324;&#50857;&#54616;&#46972;. 
                  </p>
               </dd>
               <dt><span class="term">&#54168;&#52824;&#46104;&#51648; &#50506;&#51008; &#45936;&#51060;&#53552; &#47928;&#51228;&#51216;&#46308;&#51012; &#54588;&#54616;&#44592; &#50948;&#54644; <span class="emphasis"><em>&#48624; &#45236;&#50640; &#50676;&#47140;&#51652; &#49464;&#49496;(open session in view)</em></span> &#54056;&#53556; &#46608;&#45716; &#54616;&#45208;&#51032; &#51221;&#47532;&#46108; <span class="emphasis"><em>&#50612;&#49480;&#48660;&#47532; &#45800;&#44228;(assembly phase)</em></span>&#47484; &#49324;&#50857;&#54616;&#46972;. </span></dt>
               <dd>
                  <p>Hibernate&#45716; &#44060;&#48156;&#51088;&#46308;&#51060; <span class="emphasis"><em>Data Transfer Objects</em></span> (DTO)&#47484; &#51648;&#47336;&#54616;&#44172; &#51089;&#49457;&#54616;&#45716; &#44163;&#51004;&#47196;&#48512;&#53552; &#51088;&#50976;&#47213;&#44172; &#54644;&#51456;&#45796;. &#51204;&#53685;&#51201;&#51064; EJB &#50500;&#53412;&#53581;&#52376;&#50640;&#49436;, DTO&#45716; &#51060;&#51473; &#50857;&#46020;&#47196; &#44592;&#45733;&#54620;&#45796;: &#52395; &#48264;&#51704;&#47196; &#44536;&#44163;&#46308;&#51008; &#50644;&#54000;&#54000; &#48712;&#51592;&#44032; &#51649;&#47148;&#54868; &#44032;&#45733;&#54616;&#51648; &#50506;&#45716; &#47928;&#51228;&#51216;&#50640; &#45824;&#54644; &#52265;&#49688;&#54620;&#45796;; &#46160; &#48264;&#51704;&#47196; &#44536;&#44163;&#46308;&#51008;
                     &#48624;&#50640; &#51032;&#54644; &#49324;&#50857;&#46104;&#45716; &#47784;&#46304; &#45936;&#51060;&#53552;&#44032; &#54532;&#47532;&#51232;&#53580;&#51060;&#49496; &#54000;&#50612;&#47196; &#52968;&#53944;&#47204;&#51012; &#48152;&#54872;&#54616;&#44592; &#51204;&#50640; DTO&#46308; &#49549;&#51004;&#47196; &#54168;&#52824;&#46104;&#44256; &#47560;&#49388;&#47553;&#46104;&#45716; &#50612;&#49480;&#48660;&#47532; &#45800;&#44228;&#47484; &#50516;&#47925;&#51201;&#51004;&#47196; &#51221;&#51032;&#54620;&#45796;. Hibernate&#45716; &#52395; &#48264;&#51704; &#50857;&#46020;&#47484; &#51228;&#44144;&#49884;&#53416;&#45796;. &#54616;&#51648;&#47564; &#45817;&#49888;&#51060; &#48624; &#47116;&#45908;&#47553;
                     &#54532;&#47196;&#49464;&#49828;&#47484; &#44032;&#47196;&#51656;&#47084; &#50676;&#47140;&#51256; &#51080;&#45716; &#50689;&#49549; &#52968;&#53581;&#49828;&#53944;(&#49464;&#49496;)&#51012; &#48372;&#44288;&#54624; &#51456;&#48708;&#44032; &#46104;&#50612; &#51080;&#51648; &#50506;&#45716; &#54620;, &#45817;&#49888;&#51008; &#50668;&#51204;&#55176; &#50612;&#49480;&#48660;&#47532; &#45800;&#44228;&#47484; &#54596;&#50836;&#47196; &#54624; &#44163;&#51060;&#45796;(detached &#44061;&#52404;&#46308;&#50640;&#49436; &#51060;&#50857;&#44032;&#45733;&#54620; &#45936;&#51060;&#53552;&#44032; &#47924;&#50631;&#51064;&#51648;&#50640; &#45824;&#54644; &#54532;&#47532;&#51232;&#53580;&#51060;&#49496; &#54000;&#50612;&#50752;
                     &#50628;&#44201;&#54616;&#44172; &#44228;&#50557;&#51012; &#44054;&#46020;&#47197; &#45817;&#49888;&#51032; &#48708;&#51648;&#45768;&#49828; &#47700;&#49548;&#46300;&#46308;&#51012; &#44256;&#47140;&#54616;&#46972;) &#51060;&#44163;&#51008; Hibernate&#51032; &#54620;&#44228;&#51216;&#51060; &#50500;&#45768;&#45796;! &#44536;&#44163;&#51008; &#50504;&#51204;&#54620; &#53944;&#47004;&#51117;&#49496; &#45936;&#51060;&#53552; &#51217;&#44540;&#51032; &#54596;&#49688; &#51312;&#44148;&#51060;&#45796;. 
                  </p>
               </dd>
               <dt><span class="term">Hibernate&#50640;&#49436; &#45817;&#49888;&#51032; &#48708;&#51648;&#45768;&#49828; &#47196;&#51649;&#51012; &#52628;&#49345;&#54868; &#49884;&#53412;&#45716; &#44163;&#51012; &#44256;&#47140;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>(Hibernate) &#45936;&#51060;&#53552; &#50529;&#49464;&#49828; &#53076;&#46300;&#47484; &#51064;&#53552;&#54168;&#51060;&#49828; &#51060;&#47732;&#50640; &#51008;&#54224;&#49884;&#53020;&#46972;. <span class="emphasis"><em>DAO</em></span>&#50752; <span class="emphasis"><em>Thread Local Session</em></span> &#54056;&#53556;&#46308;&#51012; &#44208;&#54633;&#49884;&#53020;&#46972;. &#45817;&#49888;&#51008; &#49900;&#51648;&#50612; <code class="literal">UserType</code>&#51012; &#53685;&#54644; Hibernate&#50640; &#50672;&#44288;&#46108;, &#49688;&#51089;&#50629;&#51004;&#47196; &#53076;&#46377;&#46108; JDBC&#47196;&#49436; &#47751;&#47751; &#53364;&#47000;&#49828;&#46308;&#51012; &#50689;&#49549;&#54868; &#49884;&#53420; &#49688;&#46020; &#51080;&#45796;. (&#51060; &#52649;&#44256;&#45716; "&#52649;&#48516;&#55176; &#53360;" &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#50640; &#45824;&#54620; &#44163;&#51060;&#45796;; &#44536;&#44163;&#51008; 5&#44060;&#51032; &#53580;&#51060;&#48660;&#46308;&#51012; &#44032;&#51652; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#45824;&#54644;&#49436;&#45716;
                     &#51201;&#51208;&#54616;&#51648; &#50506;&#45796;!) 
                  </p>
               </dd>
               <dt><span class="term">&#49888;&#51333;&#51032; &#50672;&#44288; &#47588;&#54609;&#51012; &#49324;&#50857;&#54616;&#51648; &#47568;&#46972;.</span></dt>
               <dd>
                  <p>&#49892;&#51228;&#51032; many-to-many &#50672;&#44288;&#46308;&#50640; &#45824;&#54620; &#51339;&#51008; &#50416;&#51076;&#49352;&#46308;&#51008; &#46300;&#47932;&#45796;. &#45824;&#48512;&#48516;&#51032; &#49884;&#44036; &#46041;&#50504; &#45817;&#49888;&#51008; "&#50672;&#44208; &#53580;&#51060;&#48660;" &#45236;&#50640; &#51200;&#51109;&#46108; &#52628;&#44032;&#51201;&#51064; &#51221;&#48372;&#47484; &#54596;&#50836;&#47196; &#54620;&#45796;. &#51060; &#44221;&#50864;&#50640;, &#47588;&#44060;&#54616;&#45716; &#50672;&#44208; &#53364;&#47000;&#49828;&#50640; &#45824;&#54644; &#46160; &#44060;&#51032; one-to-many
                     &#50672;&#44288;&#46308;&#51012; &#49324;&#50857;&#54616;&#45716; &#44163;&#51060; &#55016;&#50476; &#45908; &#51339;&#45796;. &#49324;&#49892; &#50864;&#47532;&#45716; &#45824;&#48512;&#48516;&#51032; &#50672;&#44288;&#46308;&#51060; one-to-many&#50752; many-to-one&#51060;&#46972;&#44256; &#49373;&#44033;&#54616;&#47728;, &#45817;&#49888;&#51008; &#45796;&#47480; &#50672;&#44288; &#49828;&#53440;&#51068;&#51012; &#49324;&#50857;&#54624; &#46412; &#51452;&#51032;&#54644;&#50556; &#54616;&#44256; &#44536;&#44163;&#51060; &#51652;&#51221; &#54596;&#49688;&#51201;&#51064;&#51648;&#47484; &#45817;&#49888; &#49828;&#49828;&#47196;
                     &#51656;&#47928;&#54616;&#46972;. 
                  </p>
               </dd>
               <dt><span class="term">&#50577;&#48169;&#54693; &#50672;&#44288;&#46308;&#51012; &#49440;&#54840;&#54616;&#46972;.</span></dt>
               <dd>
                  <p>&#45800;&#48169;&#54693; &#50672;&#44288;&#46308;&#51008; &#51656;&#51032;&#54616;&#44592;&#44032; &#45908; &#50612;&#47157;&#45796;. &#47566;&#51008; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436;, &#44144;&#51032; &#47784;&#46304; &#50672;&#44288;&#46308;&#51008; &#51656;&#51032;&#46308; &#45236;&#50640;&#49436; &#50577; &#48169;&#54693;&#51004;&#47196; &#45348;&#48708;&#44172;&#51060;&#53944; &#44032;&#45733;&#54644;&#50556; &#54620;&#45796;. </p>
               </dd>
            </dl>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="misc.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;</td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">23.4. &#44592;&#53440; &#50696;&#51228; &#47588;&#54609;&#46308;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;</td>
            </tr>
         </table>
      </div>
   </body>
</html>