<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>6&#51109;. &#53084;&#47113;&#49496; &#47588;&#54609;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="mapping-database-object.html" title="5.7. &#48372;&#51312; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44061;&#52404;&#46308;">
      <link rel="next" href="collections-mapping.html" title="6.2. &#53084;&#47113;&#49496; &#47588;&#54609;&#46308;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">6&#51109;. &#53084;&#47113;&#49496; &#47588;&#54609;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="mapping-database-object.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="collections-mapping.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="collections"></a>6&#51109;. &#53084;&#47113;&#49496; &#47588;&#54609;
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect1" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="collections-persistent"></a>6.1. &#50689;&#49549; &#53084;&#47113;&#49496;&#46308;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#50696;&#47484; &#46308;&#50612; Hibernate&#45716; &#50689;&#49549; &#53084;&#47113;&#49496;-&#44050;&#51012; &#44032;&#51652; &#54596;&#46300;&#46308;&#51060; &#51064;&#53552;&#54168;&#51060;&#49828; &#53440;&#51077;&#51004;&#47196;&#49436; &#49440;&#50616;&#46112; &#44163;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;: </p><pre class="programlisting">public class Product {
    private String serialNumber;
    private Set parts = new HashSet();
    
    public Set getParts() { return parts; }
    void setParts(Set parts) { this.parts = parts; }
    public String getSerialNumber() { return serialNumber; }
    void setSerialNumber(String sn) { serialNumber = sn; }
}</pre><p>&#49892;&#51228; &#51064;&#53552;&#54168;&#51060;&#49828;&#45716; <code class="literal">java.util.Set</code>, <code class="literal">java.util.Collection</code>, <code class="literal">java.util.List</code>, <code class="literal">java.util.Map</code>, <code class="literal">java.util.SortedSet</code>, <code class="literal">java.util.SortedMap</code> &#46608;&#45716; &#45817;&#49888;&#51060; &#51339;&#50500;&#54616;&#45716; &#50612;&#46500; &#44163;&#51068; &#49688; &#51080;&#45796;!(&#50668;&#44592;&#49436; "&#45817;&#49888;&#51060; &#51339;&#50500;&#54616;&#45716; &#50612;&#46500; &#44163;"&#51060;&#46976; &#45817;&#49888;&#51060; <code class="literal">org.hibernate.usertype.UserCollectionType</code>&#50640; &#45824;&#54620; &#44396;&#54788;&#51012; &#51089;&#49457;&#54644;&#50556; &#54632;&#51012; &#51032;&#48120;&#54620;&#45796;.) 
            </p>
            <p>&#50864;&#47532;&#44032; <code class="literal">HashSet</code>&#51032; &#51064;&#49828;&#53556;&#49828;&#47484; &#44032;&#51652; &#51064;&#49828;&#53556;&#49828; &#48320;&#49688;&#47484; &#52488;&#44592;&#54868; &#49884;&#53040;&#45912; &#48169;&#48277;&#51012; &#51452;&#47785;&#54616;&#46972;. &#51060;&#44163;&#51008; &#49352;&#47196;&#51060; &#52488;&#44592;&#54868; &#46108;(&#48708;-&#50689;&#49549;) &#51064;&#49828;&#53556;&#49828;&#46308;&#51012; &#44032;&#51652; &#53084;&#47113;&#49496; &#44050; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#52488;&#44592;&#54868; &#49884;&#53412;&#45716; &#52572;&#49440;&#51032; &#48169;&#48277;&#51060;&#45796;. &#45817;&#49888;&#51060; -&#50696;&#47484; &#46308;&#50612; <code class="literal">persist()</code>&#47484; &#54840;&#52636;&#54616;&#50668;- &#51064;&#49828;&#53556;&#49828;&#47484; &#50689;&#49549;&#54868; &#49884;&#53420; &#46412; Hibernate&#45716; &#49892;&#51228;&#47196; <code class="literal">HashSet</code>&#51012; <code class="literal">Set</code>&#50640; &#45824;&#54620; Hibernate &#51088;&#49888;&#51032; &#44396;&#54788;&#51032; &#51064;&#49828;&#53556;&#49828;&#47196; &#45824;&#52404;&#49884;&#53420; &#44163;&#51060;&#45796;. &#45796;&#51020;&#44284; &#44057;&#51008; &#50724;&#47448;&#46308;&#51012; &#44288;&#52272;&#54616;&#46972;: 
            </p><pre class="programlisting">Cat cat = new DomesticCat();
Cat kitten = new DomesticCat();
....
Set kittens = new HashSet();
kittens.add(kitten);
cat.setKittens(kittens);
session.persist(cat);
kittens = cat.getKittens(); // Okay, kittens collection is a Set
(HashSet) cat.getKittens(); // Error!</pre><p>Hibernate&#50640; &#51032;&#54644; &#46020;&#51077;&#46108; &#50689;&#49549; &#53084;&#47113;&#49496;&#46308;&#51008; &#51064;&#53552;&#54168;&#51060;&#49828; &#53440;&#51077;&#50640; &#46384;&#46972; <code class="literal">HashMap</code>, <code class="literal">HashSet</code>, <code class="literal">TreeMap</code>, <code class="literal">TreeSet</code> &#46608;&#45716; <code class="literal">ArrayList</code>&#50752; &#44057;&#51060; &#54665;&#50948;&#54620;&#45796;. 
            </p>
            <p>&#53084;&#47113;&#49496; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; value &#53440;&#51077;&#46308;&#51012; &#44032;&#51652; &#53685;&#49345;&#51032; &#53945;&#51669;&#51012; &#44054;&#45716;&#45796;. &#44536;&#44163;&#46308;&#51008; &#50689;&#49549; &#44061;&#52404;&#50640; &#51032;&#54644; &#52280;&#51312;&#46112; &#46412; &#51088;&#46041;&#51201;&#51004;&#47196; &#50689;&#49549;&#54868; &#46104;&#44256; &#52280;&#51312; &#54644;&#51228;&#46112; &#46412; &#51088;&#46041;&#51201;&#51004;&#47196; &#49325;&#51228;&#46108;&#45796;. &#47564;&#51068; &#54616;&#45208;&#51032; &#53084;&#47113;&#49496;&#51060; &#54616;&#45208;&#51032; &#50689;&#49549; &#44061;&#52404;&#47196;&#48512;&#53552; &#46608; &#45796;&#47480;
               &#50689;&#49549; &#44061;&#52404;&#47196; &#51204;&#45804;&#46112; &#46412;, &#44536;&#44163;&#51032; &#50836;&#49548;&#46308;&#51008; &#54616;&#45208;&#51032; &#53580;&#51060;&#48660;&#47196;&#48512;&#53552; &#45796;&#47480; &#53580;&#51060;&#48660;&#47196; &#51060;&#46041;&#46112; &#49688; &#51080;&#45796;. &#46160; &#44060;&#51032; &#50644;&#54000;&#54000;&#46308;&#51008; &#46041;&#51068;&#54620; &#53084;&#47113;&#49496; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#52280;&#51312;&#47484; &#44277;&#50976;&#54616;&#51648; &#50506;&#45716;&#45796;. &#44592;&#48376; &#44288;&#44228;&#54805; &#47784;&#54805; &#46412;&#47928;&#50640; &#53084;&#47113;&#49496; &#44050; &#54532;&#47196;&#54140;&#54000;&#46308;&#51008; null
               &#44050; &#51032;&#48120;&#46308;&#51012; &#51648;&#50896;&#54616;&#51648; &#50506;&#45716;&#45796;; Hibernate&#45716; null &#53084;&#47113;&#49496; &#52280;&#51312;&#50752; &#44277;&#48177;&#51032; &#53084;&#47113;&#49496; &#49324;&#51060;&#47484; &#44396;&#48324; &#51667;&#51648; &#50506;&#45716;&#45796;. 
            </p>
            <p>&#45817;&#49888;&#51008; &#51060;&#44163;&#51032; &#50612;&#46500; &#44163;&#50640; &#45824;&#54644; &#45320;&#47924; &#47566;&#51060; &#44145;&#51221;&#54616;&#51648; &#50506;&#50500;&#46020; &#46112; &#44163;&#51060;&#45796;. &#45817;&#49888;&#51060; &#53685;&#49345;&#51032; &#51088;&#48148; &#53084;&#47113;&#49496;&#46308;&#51012; &#49324;&#50857;&#54616;&#45716; &#44163;&#44284; &#46041;&#51068;&#54620; &#48169;&#48277;&#51004;&#47196; &#50689;&#49549; &#53084;&#47113;&#49496;&#46308;&#51012; &#49324;&#50857;&#54616;&#46972;. &#45800;&#51648; &#45817;&#49888;&#51060; &#50577;&#48169;&#54693; &#50672;&#44288;&#44288;&#44228;&#46308;&#50640; &#45824;&#54620; &#51032;&#48120;&#47484; &#54869;&#49892;&#55176; &#51060;&#54644;&#54616;&#46020;&#47197;
               &#54616;&#46972;(&#45208;&#51473;&#50640; &#45436;&#51032;&#46120;). 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="mapping-database-object.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="collections-mapping.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">5.7. &#48372;&#51312; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44061;&#52404;&#46308;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;6.2. &#53084;&#47113;&#49496; &#47588;&#54609;&#46308;</td>
            </tr>
         </table>
      </div>
   </body>
</html>