<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>3.8. J2EE &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#53685;&#54633;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="session-configuration.html" title="3&#51109;. &#44396;&#49457;">
      <link rel="prev" href="configuration-xmlconfig.html" title="3.7. XML &#44396;&#49457; &#54028;&#51068;">
      <link rel="next" href="persistent-classes.html" title="4&#51109;. &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">3.8. J2EE &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#53685;&#54633;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="configuration-xmlconfig.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">3&#51109;. &#44396;&#49457;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="persistent-classes.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="configuration-j2ee"></a>3.8. J2EE &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#53685;&#54633;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate&#45716; J2EE &#51064;&#54532;&#46972;&#49828;&#53944;&#47085;&#52376;&#50640; &#45824;&#54620; &#45796;&#51020; &#53685;&#54633; &#51216;&#46308;&#51012; &#44054;&#44256; &#51080;&#45796;: </p>
         <div class="itemizedlist">
            <ul type="disc">
               <li>
                  <p><span class="emphasis"><em>Container-managed datasources</em></span>: Hibernate&#45716; &#52968;&#53580;&#51060;&#45320;&#50640; &#51032;&#54644; &#44288;&#47532;&#46104;&#45716; JDBC &#52964;&#45349;&#49496;&#46308;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#44256; JNDI&#47484; &#53685;&#54644; &#51228;&#44277;&#46108;&#45796;. &#45824;&#44060; JTA &#54840;&#54872; <code class="literal">TransactionManager</code>&#50752; <code class="literal">ResourceManager</code>&#45716; &#53944;&#47004;&#51117;&#49496; &#44288;&#47532;(CMT), &#53945;&#55176; &#47751;&#47751; &#45936;&#51060;&#53552;&#49548;&#49828;&#46308;&#51012; &#44032;&#47196;&#51656;&#47084; &#48516;&#49328;&#46108; &#53944;&#47004;&#51117;&#49496; &#54648;&#46308;&#47553;&#51012; &#52376;&#47532;&#54620;&#45796;. &#47932;&#47200; &#45817;&#49888;&#51008; &#46608;&#54620; &#54532;&#47196;&#44536;&#47016; &#49345;&#51004;&#47196; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228;&#46308;&#51012; &#54620;&#51221;&#54624; &#49688;&#46020; &#51080;&#44144;&#45208;(BMT) &#45817;&#49888;&#51008; &#45817;&#49888;&#51032; &#53076;&#46300;&#44032; &#51060;&#49885;&#49457;&#51012; &#50976;&#51648;&#54616;&#46020;&#47197;
                     &#51060;&#44163;&#50640; &#45824;&#54620; &#49440;&#53469;&#51201;&#51064; Hibernate <code class="literal">Transaction</code> API&#47484; &#49324;&#50857;&#54616;&#44256;&#51088; &#50896;&#54624; &#49688;&#46020; &#51080;&#45796;. 
                  </p>
               </li>
            </ul>
         </div>
         <div class="itemizedlist">
            <ul type="disc">
               <li>
                  <p><span class="emphasis"><em>&#51088;&#46041;&#51201;&#51064; JNDI &#48148;&#51064;&#46377;</em></span>: Hibernate&#45716; &#49884;&#51089; &#54980;&#50640; &#44536;&#44163;&#51032; <code class="literal">SessionFactory</code>&#47484; JNDI&#50640; &#48148;&#51064;&#46300; &#49884;&#53420; &#49688; &#51080;&#45796;. 
                  </p>
               </li>
            </ul>
         </div>
         <div class="itemizedlist">
            <ul type="disc">
               <li>
                  <p><span class="emphasis"><em>JTA Session &#48148;&#51064;&#46377;</em></span>: Hibernate <code class="literal">Session</code>&#51008; JTA &#53944;&#47004;&#51117;&#49496;&#46308;&#51032; &#50689;&#50669;(scope)&#50640; &#51088;&#46041;&#51201;&#51004;&#47196; &#48148;&#51064;&#46300; &#49884;&#53420; &#49688;&#46020; &#51080;&#45796;. &#44036;&#45800;&#54616;&#44172; JNDI&#47196;&#48512;&#53552; <code class="literal">SessionFactory</code>&#47484; &#47337;&#50629;&#54616;&#44256; &#54788;&#51116; <code class="literal">Session</code>&#51012; &#50619;&#50612;&#46972;. Hibernate&#47196; &#54616;&#50668;&#44552; &#45817;&#49888;&#51032; JTA &#53944;&#47004;&#51117;&#49496;&#51060; &#50756;&#47308;&#46112; &#46412; <code class="literal">Session</code>&#51012; flush&#49884;&#53412;&#44256; &#45803;&#45716; &#44163;&#51012; &#52376;&#47532;&#54616;&#46020;&#47197; &#54616;&#46972;. &#53944;&#47004;&#51117;&#49496; &#44221;&#44228; &#44396;&#48516;&#51008; &#49440;&#50616;&#51201;(CMT)&#51060;&#44144;&#45208; &#54532;&#47196;&#44536;&#47000;&#48141;&#51201;((BMT/UserTransaction))&#51060;&#45796;. 
                  </p>
               </li>
            </ul>
         </div>
         <div class="itemizedlist">
            <ul type="disc">
               <li>
                  <p><span class="emphasis"><em>JMX &#48176;&#52824;</em></span>: &#47564;&#51068; &#45817;&#49888;&#51060; JMX &#44032;&#50857;&#49457;&#51060; &#51080;&#45716; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;(&#50696;&#47484; &#46308;&#47732; JBoss AS)&#47484; &#44054;&#44256; &#51080;&#45796;&#47732;, &#45817;&#49888;&#51008; Hibernate&#47484; &#54616;&#45208;&#51032; managed MBean&#51004;&#47196;&#49436; &#48176;&#52824;&#54616;&#45716; &#44163;&#51012; &#49440;&#53469;&#54624; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; <code class="literal">Configuration</code>&#51004;&#47196;&#48512;&#53552; &#45817;&#49888;&#51032; <code class="literal">SessionFactory</code>&#47484; &#48716;&#46300; &#49884;&#53412;&#45716; &#54620; &#51460;&#51032; &#49884;&#51089; &#53076;&#46300;&#47484; &#51208;&#50557;&#54644;&#51456;&#45796;. &#52968;&#53580;&#51060;&#45320;&#45716; &#45817;&#49888;&#51032; <code class="literal">HibernateService</code>&#47484; &#49884;&#51089;&#54624; &#44163;&#51060;&#44256;, &#46608;&#54620; &#51060;&#49345;&#51201;&#51004;&#47196; &#49436;&#48708;&#49828; &#51032;&#51316;&#49457;&#46308;&#51012; &#52376;&#47532;&#54624; &#44163;&#51060;&#45796;(&#45936;&#51060;&#53552;&#49548;&#49828;&#45716; Hibernate&#44032; &#49884;&#51089;&#46104;&#44592; &#51204;&#50640; &#51060;&#50857; &#44032;&#45733;&#54644;&#50556; &#54620;&#45796;). 
                  </p>
               </li>
            </ul>
         </div>
         <p>&#45817;&#49888;&#51032; &#54872;&#44221;&#50640; &#46384;&#46972;, &#45817;&#49888;&#51008; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#44032; "connection containment(&#50672;&#44208; &#48393;&#49604;)" &#50696;&#50808;&#49345;&#54889;&#46308;&#51012; &#48372;&#51068; &#44221;&#50864;&#50640; &#44396;&#49457; &#50741;&#49496; <code class="literal">hibernate.connection.aggressive_release</code>&#47484; true&#47196; &#49444;&#51221;&#54644;&#50556; &#46112; &#49688;&#46020; &#51080;&#45796;. 
         </p>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="configuration-optional-transactionstrategy"></a>3.8.1. &#53944;&#47004;&#51117;&#49496; &#48169;&#46020; &#44396;&#49457;
                     </h3>
                  </div>
               </div>
            </div>
            <p>Hibernate <code class="literal">Session</code> API&#45716; &#45817;&#49888;&#51032; &#50500;&#52852;&#53581;&#52376; &#45236;&#50640;&#49436; &#51076;&#51032;&#51032; &#53944;&#47004;&#51117;&#49496; &#44288;&#54624; &#49884;&#49828;&#53596;&#50640; &#46021;&#47549;&#51201;&#51060;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; Hibernate&#47196; &#54616;&#50668;&#44552; &#52964;&#45349;&#49496; &#54400;&#51012; &#53685;&#54644; &#51649;&#51217; JDBC&#47484; &#49324;&#50857;&#54616;&#46020;&#47197; &#44053;&#51228;&#54624; &#44221;&#50864;, &#45817;&#49888;&#51008; JDBC API&#47484; &#54840;&#52636;&#54616;&#50668; &#45817;&#49888;&#51032; &#53944;&#47004;&#51117;&#49496;&#51012;
               &#49884;&#51089;&#54616;&#44256; &#45149;&#45244; &#49688; &#51080;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; J2EE &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#47484; &#49892;&#54665; &#51473;&#51060;&#46972;&#47732;, &#45817;&#49888;&#51008; &#54596;&#50836;&#54624; &#46412; bean-managed &#53944;&#47004;&#51117;&#49496;&#46308;&#51012; &#49324;&#50857;&#54616;&#44256; JTA API&#50752; <code class="literal">UserTransaction</code>&#51012; &#54840;&#52636;&#54616;&#44256;&#51088; &#50896;&#54624; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#51060;&#46308; &#46160; &#44060;&#51032; (&#44536;&#47532;&#44256; &#45796;&#47480;) &#54872;&#44221;&#46308;&#50640;&#49436; &#45817;&#49888;&#51032; &#53076;&#46300;&#50640; &#51060;&#49885;&#49457;&#51012; &#50976;&#51648;&#54616;&#44592; &#50948;&#54644; &#50864;&#47532;&#45716; &#44592;&#48376; &#49884;&#49828;&#53596;&#51012; &#54252;&#51109;&#54616;&#44256; &#51008;&#54224;&#49884;&#53412;&#45716; &#49440;&#53469;&#51201;&#51064; Hibernate <code class="literal">Transaction</code> API&#47484; &#44428;&#51109;&#54620;&#45796;. &#45817;&#49888;&#51008; Hibernate &#44396;&#49457; &#54532;&#47196;&#54140;&#54000; <code class="literal">hibernate.transaction.factory_class</code>&#47484; &#49324;&#50857;&#54616;&#50668; <code class="literal">Transaction</code> &#51064;&#49828;&#53556;&#49828;&#46308;&#50640; &#45824;&#54620; &#54057;&#53664;&#47532; &#53364;&#47000;&#49828;&#47484; &#51648;&#51221;&#54644;&#50556; &#54620;&#45796;. 
            </p>
            <p>&#49464; &#44060;&#51032; &#54364;&#51456;(&#48120;&#47532; &#47564;&#46308;&#50612;&#51652;) &#49440;&#53469;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;: </p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term"><code class="literal">org.hibernate.transaction.JDBCTransactionFactory</code></span></dt>
                  <dd>
                     <p>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; (JDBC) &#53944;&#47004;&#51117;&#49496;&#46308;&#50640;&#44172; &#50948;&#51076;&#49884;&#53416;&#45796;(&#46356;&#54260;&#53944;)</p>
                  </dd>
                  <dt><span class="term"><code class="literal">org.hibernate.transaction.JTATransactionFactory</code></span></dt>
                  <dd>
                     <p>&#44592;&#51316;&#51032; &#53944;&#47004;&#51117;&#49496;&#51060; &#51060; &#52968;&#53581;&#49828;&#53944;(&#50696;&#47484; &#46308;&#47732; EJB session bean &#47700;&#49548;&#46300;) &#45236;&#50640;&#49436; &#51652;&#54665; &#51473;&#51068; &#44221;&#50864;&#50640; container-managed transaction&#50640;&#44172; &#50948;&#51076;&#49884;&#53412;&#44256;, &#44536; &#48150;&#51032; &#44221;&#50864; &#49352;&#47196;&#50868; &#53944;&#47004;&#51117;&#49496;&#51060; &#49884;&#51089;&#46104;&#44256; bean-managed
                        transaction&#51060; &#49324;&#50857;&#46108;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">org.hibernate.transaction.CMTTransactionFactory</code></span></dt>
                  <dd>
                     <p>container-managed JTA &#53944;&#47004;&#51117;&#49496;&#46308;&#50640;&#44172; &#50948;&#51076;&#49884;&#53416;&#45796;</p>
                  </dd>
               </dl>
            </div>
            <p>&#45817;&#49888;&#51008; &#46608;&#54620; &#45817;&#49888; &#51088;&#49888;&#51032; &#53944;&#47004;&#51117;&#49496; &#48169;&#46020;&#46308;(&#50696;&#47484; &#46308;&#47732; CORBA &#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828;)&#51012; &#51221;&#51032;&#54624; &#49688;&#46020; &#51080;&#45796;. </p>
            <p>Hibernate&#50640; &#51080;&#45716; &#47751;&#47751; &#53945;&#51669;&#46308;(&#50696;&#47484; &#46308;&#47732;. second level &#52880;&#49884;, JTA&#47484; &#44032;&#51652; &#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;, &#44592;&#53440;.)&#51008; &#44288;&#47532;&#46104;&#45716; &#54872;&#44221;&#50640;&#49436; JTA <code class="literal">TransactionManager</code>&#50640; &#45824;&#54620; &#51217;&#44540;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#50640;&#49436; &#45817;&#49888;&#51008; Hibernate&#44032; <code class="literal">TransactionManager</code>&#50640; &#45824;&#54620; &#52280;&#51312;&#47484; &#54925;&#46301;&#54616;&#45716; &#48169;&#48277;&#51012; &#51648;&#51221;&#54644;&#50556; &#54620;&#45796;. &#50780;&#45264;&#54616;&#47732; J2EE&#44032; &#54620; &#44060;&#51032; &#47700;&#52964;&#45768;&#51608;&#51012; &#54364;&#51456;&#54868; &#49884;&#53412;&#44256; &#51080;&#51648; &#50506;&#44592; &#46412;&#47928;&#51060;&#45796;: 
            </p>
            <div class="table"><a name="jtamanagerlookup"></a><p class="title"><b>&#54364; 3.10. JTA TransactionManagers</b></p>
               <div class="table-contents">
                  <table summary="JTA TransactionManagers" border="1">
                     <colgroup>
                        <col>
                        <col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th>&#53944;&#47004;&#51117;&#49496; &#54057;&#53664;&#47532;</th>
                           <th align="center">&#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.JBossTransactionManagerLookup</code></td>
                           <td align="center">JBoss</td>
                        </tr>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.WeblogicTransactionManagerLookup</code></td>
                           <td align="center">Weblogic</td>
                        </tr>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.WebSphereTransactionManagerLookup</code></td>
                           <td align="center">WebSphere</td>
                        </tr>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.WebSphereExtendedJTATransactionLookup</code></td>
                           <td align="center">WebSphere 6</td>
                        </tr>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.OrionTransactionManagerLookup</code></td>
                           <td align="center">Orion</td>
                        </tr>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.ResinTransactionManagerLookup</code></td>
                           <td align="center">Resin</td>
                        </tr>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.JOTMTransactionManagerLookup</code></td>
                           <td align="center">JOTM</td>
                        </tr>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.JOnASTransactionManagerLookup</code></td>
                           <td align="center">JOnAS</td>
                        </tr>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.JRun4TransactionManagerLookup</code></td>
                           <td align="center">JRun4</td>
                        </tr>
                        <tr>
                           <td><code class="literal">org.hibernate.transaction.BESTransactionManagerLookup</code></td>
                           <td align="center">Borland ES</td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div><br class="table-break"></div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="configuration-optional-jndi"></a>3.8.2. JNDI-bound <code class="literal">SessionFactory</code></h3>
                  </div>
               </div>
            </div>
            <p>&#54616;&#45208;&#51032; JNDI &#48148;&#51064;&#46300;&#46108; Hibernate <code class="literal">SessionFactory</code>&#45716; &#44536; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#47337;&#50629;&#44284; &#49352;&#47196;&#50868; <code class="literal">Session</code>&#46308;&#51032; &#49373;&#49457;&#51012; &#45800;&#49692;&#54868; &#49884;&#53420; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; JNDI &#48148;&#51064;&#46300;&#46108; <code class="literal">Datasource</code>&#50640; &#44288;&#47144;&#46104;&#50612; &#51080;&#51648; &#50506;&#44256;, &#45800;&#49692;&#54616;&#44172; &#46168; &#45796; &#46041;&#51068;&#54620; &#47112;&#51648;&#49828;&#53944;&#47532;&#47484; &#49324;&#50857;&#54620;&#45796;&#45716; &#51216;&#51012; &#45432;&#53944;&#54616;&#46972;! 
            </p>
            <p>&#47564;&#51068; &#45817;&#49888;&#51060; <code class="literal">SessionFactory</code>&#47484; &#54616;&#45208;&#51032; JNDI namespace&#50640; &#48148;&#51064;&#46300; &#49884;&#53412;&#44256;&#51088; &#50896;&#54624; &#44221;&#50864;, <code class="literal">hibernate.session_factory_name</code> &#54532;&#47196;&#54140;&#54000;&#47484; &#49324;&#50857;&#54616;&#50668; &#54620; &#44060;&#51032; &#51060;&#47492;(&#50696;&#47484; &#46308;&#47732;. <code class="literal">java:hibernate/SessionFactory</code>)&#51012; &#51648;&#51221;&#54616;&#46972;. &#47564;&#51068; &#51060; &#54532;&#47196;&#54140;&#54000;&#44032; &#49373;&#47029;&#46112; &#44221;&#50864;, <code class="literal">SessionFactory</code>&#45716; JNDI&#50640; &#48148;&#51064;&#46300; &#46104;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;. (&#51060;&#44163;&#51008; &#51069;&#44592;-&#51204;&#50857; JNDI &#46356;&#54260;&#53944; &#44396;&#54788;&#51012; &#44032;&#51652; &#54872;&#44221;&#46308;, &#50696;&#47484; &#46308;&#47732; Tomcat&#50640;&#49436; &#53945;&#55176; &#50976;&#50857;&#54616;&#45796;.) 
            </p>
            <p><code class="literal">SessionFactory</code>&#47484; JNDI&#50640; &#48148;&#51064;&#46300; &#49884;&#53420; &#46412;, Hibernate&#45716; &#52488;&#44592; &#52968;&#53581;&#49828;&#53944;&#47484; &#52488;&#44592;&#54868; &#49884;&#53412;&#44592; &#50948;&#54644; <code class="literal">hibernate.jndi.url</code>, <code class="literal">hibernate.jndi.class</code>&#51032; &#44050;&#46308;&#51012; &#49324;&#50857;&#54624; &#44163;&#51060;&#45796;. &#47564;&#51068; &#44536;&#44163;&#46308;&#51060; &#51648;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#51012; &#44221;&#50864;, &#46356;&#54260;&#53944; <code class="literal">InitialContext</code>&#44032; &#49324;&#50857;&#46112; &#44163;&#51060;&#45796;. 
            </p>
            <p>Hibernate&#45716; &#45817;&#49888;&#51060; <code class="literal">cfg.buildSessionFactory()</code>&#47484; &#54840;&#52636;&#54620; &#54980;&#50640; <code class="literal">SessionFactory</code>&#47484; JNDI &#45236;&#50640; &#51088;&#46041;&#51201;&#51004;&#47196; &#50948;&#52824;&#51648;&#50872; &#44163;&#51060;&#45796;. &#51060;&#44163;&#51008; &#45817;&#49888;&#51060; (&#45208;&#51473;&#50640; &#45436;&#51032;&#46104;&#45716;) <code class="literal">HibernateService</code>&#47484; &#44032;&#51652; JMX &#48176;&#52824;&#47484; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#54620;, &#45817;&#49888;&#51060; &#51201;&#50612;&#46020; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#45236;&#50640; &#51080;&#45716; &#50612;&#46500; &#49884;&#51089; &#53076;&#46300; (&#46608;&#45716; &#50976;&#54008;&#47532;&#54000; &#53364;&#47000;&#49828;) &#45236;&#50640;&#49436; &#51060;&#44163;&#51012; &#54840;&#52636;&#54624; &#44163;&#51076;&#51012; &#51032;&#48120;&#54620;&#45796;. 
            </p>
            <p>&#47564;&#51068; &#45817;&#49888;&#51060; &#54616;&#45208;&#51032; JNDI <code class="literal">SessionFactory</code>&#47484; &#49324;&#50857;&#54624; &#44221;&#50864;, &#54616;&#45208;&#51032; EJB &#46608;&#45716; &#50612;&#46500; &#45796;&#47480; &#53364;&#47000;&#49828;&#45716; JNDI &#47337;&#50629;&#51012; &#49324;&#50857;&#54616;&#50668; <code class="literal">SessionFactory</code>&#47484; &#50619;&#51012; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#50864;&#47532;&#45716; &#44288;&#47532;&#46104;&#45716; &#54872;&#44221;&#46308;&#50640;&#49436; <code class="literal">SessionFactory</code>&#47484; JNDI&#50640; &#48148;&#51064;&#46300; &#49884;&#53412;&#44256; &#44536; &#48150;&#51032; &#44221;&#50864;&#50640;&#45716; &#54616;&#45208;&#51032; <code class="literal">static</code> &#49905;&#44544;&#53668;&#51012; &#49324;&#50857;&#54616;&#45716; &#44163;&#51012; &#44428;&#51109;&#54620;&#45796;. &#51060;&#46308; &#49345;&#49464;&#47196;&#48512;&#53552; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53076;&#46300;&#47484; &#51008;&#54224;&#49884;&#53412;&#44592; &#50948;&#54644;, &#50864;&#47532;&#45716; &#46608;&#54620; <code class="literal">HibernateUtil.getSessionFactory()</code>&#44284; &#44057;&#51008; &#54616;&#45208;&#51032; helper &#53364;&#47000;&#49828; &#45236;&#50640;&#49436; <code class="literal">SessionFactory</code>&#50640; &#45824;&#54620; &#49892;&#51228; &#47337;&#50629; &#53076;&#46300;&#47484; &#51008;&#54224;&#49884;&#53412;&#44592;&#47484; &#44428;&#51109;&#54620;&#45796;. &#44536;&#47088; &#53364;&#47000;&#49828;&#45716; &#46608;&#54620; Hibernate&#47484; &#49884;&#51089;&#54616;&#45716; &#54200;&#47532;&#54620; &#48169;&#48277;&#51076;&#51012; &#45432;&#53944;&#54616;&#46972; 1&#51109;&#51012; &#48372;&#46972;. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="configuration-j2ee-currentsession"></a>3.8.3. Current Session context management with JTA
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#45817;&#49888; &#51088;&#49888;&#51032; <code class="literal">ThreadLocal</code> &#50976;&#54008;&#47532;&#54000;&#47484; &#51089;&#46041;&#49884;&#53412;&#45716; &#45824;&#49888;&#50640;, &#50864;&#47532;&#45716; &#46608;&#54620; Hibernate <code class="literal">Session</code>&#47484; &#50619;&#44592; &#50948;&#54644; <code class="literal">SessionFactory</code> &#49345;&#51032; <code class="literal">getCurrentSession()</code> &#47700;&#49548;&#46300; &#49324;&#50857;&#51012; &#44428;&#51109;&#54620;&#45796;. <a href="architecture-current-session.html" title="2.5. &#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;">2.5&#51208;. &#8220;&#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;&#8221;</a>&#50640; &#44288;&#54620; &#45436;&#51032;&#47484; &#48372;&#46972;. <code class="literal">"jta"</code> &#49464;&#49496; &#52968;&#53581;&#49828;&#53944;&#47484; &#49324;&#50857;&#54616;&#44256; &#51080;&#45716; &#44221;&#50864;&#50640;, &#54788;&#51116;&#51032; JTA &#53944;&#47004;&#51117;&#49496;&#51004;&#47196; &#49884;&#51089;&#46104;&#44256; &#50672;&#44288;&#46108; Hibernate <code class="literal">Session</code>&#51060; &#51316;&#51116;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864;, &#50864;&#47532;&#45716; JTA &#53944;&#47004;&#51117;&#49496;&#51004;&#47196; &#49884;&#51089;&#46104;&#44256; &#50672;&#44288;&#46112; &#44163;&#51060;&#45796;. <code class="literal">"jta"</code> &#52968;&#53581;&#49828;&#53944;&#50640;&#49436; <code class="literal">getCurrentSession()</code>&#47484; &#53685;&#54644; &#44160;&#49353;&#46108; <code class="literal">Session</code>&#46308;&#51008; &#44536; &#53944;&#47004;&#51117;&#49496;&#51060; &#50756;&#47308;&#46104;&#44592; &#51204;&#50640; &#51088;&#46041;&#51201;&#51004;&#47196; flush&#46112; &#44163;&#51060;&#44256; &#53944;&#47004;&#51117;&#49496; &#50756;&#47308; &#54980;&#50640; &#45803;&#54784;&#51656; &#44163;&#51060;&#44256;, &#44536;&#47532;&#44256; &#44033;&#44033;&#51032; &#47928;&#51109; &#46244;&#50640; JDBC &#52964;&#45349;&#49496;&#46308;&#51012; &#51201;&#44537;&#51201;&#51004;&#47196; &#54644;&#51228;&#54624; &#44163;&#51060;&#45796;. &#51060;&#44163;&#51008; &#44536;&#47088; &#44288;&#47532; &#49324;&#54637;&#46308;&#50640; &#45824;&#54644; &#49324;&#50857;&#51088; &#53076;&#46300;&#47484;
               &#47749;&#47308;&#54616;&#44172; &#50976;&#51648;&#49884;&#53020;&#49436;, &#50672;&#44288;&#46104;&#50612; &#51080;&#45716; JTA &#53944;&#47004;&#51117;&#49496;&#51032; &#49373;&#47749;&#51452;&#44592;&#50640; &#51032;&#54644; <code class="literal">Session</code>&#46308;&#51060; &#44288;&#47532;&#46104;&#46020;&#47197; &#54728;&#50857;&#54644;&#51456;&#45796;. &#51060;&#44163;&#51008; &#44536;&#47088; &#44288;&#47532; &#49324;&#54637;&#46308;&#50640; &#45824;&#54644; &#49324;&#50857;&#51088; &#53076;&#46300;&#47484; &#47749;&#47308;&#54616;&#44172; &#50976;&#51648;&#49884;&#53020;&#49436;, &#49464;&#49496;&#51060; &#50672;&#44288;&#46104;&#50612; &#51080;&#45716; JTA &#53944;&#47004;&#51117;&#49496;&#51032; &#49373;&#47749;&#51452;&#44592;&#50640; &#51032;&#54644; &#44288;&#47532;&#46104;&#45716; &#44163;&#51012; <code class="literal">Session</code>&#46308;&#50640;&#44172; &#54728;&#50857;&#54644;&#51456;&#45796;. &#45817;&#49888;&#51032; &#53076;&#46300;&#45716; <code class="literal">Session</code>&#46308;&#44284; &#53944;&#47004;&#51117;&#49496;&#46308;&#51012; &#52376;&#47532;&#54616;&#45716; &#44032;&#51109; &#49552;&#49772;&#50868; &#48169;&#48277;&#51008; Hibernate&#51032; &#51088;&#46041;&#51201;&#51064; "&#54788;&#51116;" <code class="literal">Session</code>&#51060;&#45796;. <a href="architecture-current-session.html" title="2.5. &#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;">2.5&#51208;. &#8220;&#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;&#8221;</a>&#50640; &#44288;&#54620; &#45436;&#51032;&#47484; &#48372;&#46972;. <code class="literal">"jta"</code> &#49464;&#49496; &#52968;&#53581;&#49828;&#53944;&#47484; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864;, &#54788;&#51116;&#51032; JTA &#53944;&#47004;&#51117;&#49496;&#51004;&#47196; &#49884;&#51089;&#46104;&#44256; &#50672;&#44288;&#46108; Hibernate <code class="literal">Session</code>&#46308;&#51060; &#51316;&#51116;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864;, &#45817;&#49888;&#51060; <code class="literal">sessionFactory.getCurrentSession()</code>&#51012; &#52376;&#51020; &#54840;&#52636;&#54624; &#46412; &#54616;&#45208;&#51032; &#49464;&#49496;&#51060; &#54788;&#51116;&#51032; JTA &#53944;&#47004;&#51117;&#49496;&#50640; &#45824;&#54644; &#49884;&#51089;&#46104;&#44256; &#50672;&#44288;&#46112; &#44163;&#51060;&#45796;. <code class="literal">"jta"</code> &#52968;&#53581;&#49828;&#53944;&#50640;&#49436; <code class="literal">getCurrentSession()</code>&#51012; &#53685;&#54644; &#44160;&#49353;&#46108; <code class="literal">Session</code>&#46308;&#51008; &#44536; &#53944;&#47004;&#51117;&#49496;&#51060; &#50756;&#47308;&#46104;&#44592; &#51204;&#50640; &#51088;&#46041;&#51201;&#51004;&#47196; flush&#46112; &#44163;&#51060;&#44256; &#44536; &#53944;&#47004;&#51117;&#49496; &#50756;&#47308;&#46308; &#54980;&#50640; &#45803;&#54784;&#51656; &#44163;&#51060;&#44256; &#44033;&#44033;&#51032; &#47928;&#51109; &#54980;&#50640; JDBC &#52964;&#45349;&#49496;&#46308;&#51012; &#51201;&#44537;&#51201;&#51004;&#47196; &#54644;&#51228;&#54624; &#44163;&#51060;&#45796;. &#51060;&#44163;&#51008; &#44536;&#47088; &#44288;&#47532; &#49324;&#54637;&#46308;&#50640; &#45824;&#54644; &#49324;&#50857;&#51088; &#53076;&#46300;&#47484; &#47749;&#47308;&#54616;&#44172;
               &#50976;&#51648;&#49884;&#53020;&#49436;, &#50672;&#44288;&#46104;&#50612; &#51080;&#45716; JTA &#53944;&#47004;&#51117;&#49496;&#51032; &#49373;&#47749;&#51452;&#44592;&#50640; &#51032;&#54644; <code class="literal">Session</code>&#46308;&#51060; &#44288;&#47532;&#46104;&#46020;&#47197; &#54728;&#50857;&#54644;&#51456;&#45796;. &#51060;&#44163;&#51008; &#44536;&#47088; &#44288;&#47532; &#49324;&#54637;&#46308;&#50640; &#45824;&#54644; &#49324;&#50857;&#51088; &#53076;&#46300;&#47484; &#47749;&#47308;&#54616;&#44172; &#50976;&#51648;&#49884;&#53020;&#49436;, &#49464;&#49496;&#51060; &#50672;&#44288;&#46104;&#50612; &#51080;&#45716; JTA &#53944;&#47004;&#51117;&#49496;&#51032; &#49373;&#47749;&#51452;&#44592;&#50640; &#51032;&#54644; &#44288;&#47532;&#46104;&#45716; &#44163;&#51012; <code class="literal">Session</code>&#46308;&#50640;&#44172; &#54728;&#50857;&#54644;&#51456;&#45796;. &#45817;&#49888;&#51032; &#53076;&#46300;&#45716; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228;&#46308;&#51012; &#49444;&#51221;&#54616;&#45716;&#45936; <code class="literal">UserTransaction</code>&#51012; &#53685;&#54644; &#54532;&#47196;&#44536;&#47016; &#49345;&#51004;&#47196; JTA&#47484; &#49324;&#50857;&#54616;&#44144;&#45208;, Hibernate <code class="literal">Transaction</code> API&#47484; (&#51060;&#49885;&#49457;&#51012; &#50948;&#54620; &#53076;&#46300;&#47196; &#44428;&#51109;&#46120;) &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#54616;&#45208;&#51032; EJB &#52968;&#53580;&#51060;&#45320;&#50640;&#49436; &#49892;&#54665;&#54616;&#44256; &#51080;&#51012; &#44221;&#50864;, CMT&#51032; &#44221;&#50864;&#50640; &#49440;&#50616;&#51201;&#51064; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228;&#49444;&#51221;&#51060; &#49440;&#54840;&#46108;&#45796;. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="configuration-j2ee-jmx"></a>3.8.4. JMX &#48176;&#52824;
                     </h3>
                  </div>
               </div>
            </div>
            <p><code class="literal">cfg.buildSessionFactory()</code> &#51460;&#51008; &#50668;&#51204;&#55176; JNDI&#50640; &#48537;&#51008; &#54616;&#45208;&#51032; <code class="literal">SessionFactory</code>&#47484; &#50619;&#44592; &#50948;&#54644; &#50612;&#46360;&#44032;&#50640;&#49436; &#49892;&#54665;&#46104;&#50612;&#50556; &#54620;&#45796;. &#45817;&#49888;&#51008; (<code class="literal">HibernateUtil</code> &#45236;&#50640; &#51080;&#45716; &#44163;&#52376;&#47100;) <code class="literal">static</code> initializer &#48660;&#47197; &#49549;&#50640;&#49436; &#51060;&#44163;&#51012; &#54665;&#54624; &#49688; &#51080;&#44144;&#45208; &#45817;&#49888;&#51008; Hibernate&#47484; <span class="emphasis"><em>managed service</em></span>&#47196;&#49436; &#48176;&#52824;&#54624; &#49688; &#51080;&#45796;. 
            </p>
            <p>Hibernate&#45716; JBoss AS&#50752; &#44057;&#51008; JMX &#44032;&#50857;&#49457;&#46308;&#51012; &#44032;&#51652; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#49345;&#51032; &#48176;&#52824;&#47484; &#50948;&#54644; <code class="literal">org.hibernate.jmx.HibernateService</code>&#47484; &#48176;&#54252;&#54616;&#44256; &#51080;&#45796;. &#49892;&#51228; &#48176;&#52824;&#50752; &#44396;&#49457;&#51008; &#48292;&#45908; &#51648;&#51221;&#51201;&#51060;&#45796;. &#45796;&#51020;&#51008; JBoss 4.0.x&#47484; &#50948;&#54620; <code class="literal">jboss-service.xml</code> &#50696;&#51228;&#51060;&#45796;: 
            </p><pre class="programlisting">&lt;?xml version="1.0"?&gt;
&lt;server&gt;

&lt;mbean code="org.hibernate.jmx.HibernateService"
    name="jboss.jca:service=HibernateFactory,name=HibernateFactory"&gt;

    &lt;!-- Required services --&gt;
    &lt;depends&gt;jboss.jca:service=RARDeployer&lt;/depends&gt;
    &lt;depends&gt;jboss.jca:service=LocalTxCM,name=HsqlDS&lt;/depends&gt;

    &lt;!-- Bind the Hibernate service to JNDI --&gt;
    &lt;attribute name="JndiName"&gt;java:/hibernate/SessionFactory&lt;/attribute&gt;

    &lt;!-- Datasource settings --&gt;
    &lt;attribute name="Datasource"&gt;java:HsqlDS&lt;/attribute&gt;
    &lt;attribute name="Dialect"&gt;org.hibernate.dialect.HSQLDialect&lt;/attribute&gt;

    &lt;!-- Transaction integration --&gt;
    &lt;attribute name="TransactionStrategy"&gt;
        org.hibernate.transaction.JTATransactionFactory&lt;/attribute&gt;
    &lt;attribute name="TransactionManagerLookupStrategy"&gt;
        org.hibernate.transaction.JBossTransactionManagerLookup&lt;/attribute&gt;
    &lt;attribute name="FlushBeforeCompletionEnabled"&gt;true&lt;/attribute&gt;
    &lt;attribute name="AutoCloseSessionEnabled"&gt;true&lt;/attribute&gt;

    &lt;!-- Fetching options --&gt;
    &lt;attribute name="MaximumFetchDepth"&gt;5&lt;/attribute&gt;

    &lt;!-- Second-level caching --&gt;
    &lt;attribute name="SecondLevelCacheEnabled"&gt;true&lt;/attribute&gt;
    &lt;attribute name="CacheProviderClass"&gt;org.hibernate.cache.EhCacheProvider&lt;/attribute&gt;
    &lt;attribute name="QueryCacheEnabled"&gt;true&lt;/attribute&gt;

    &lt;!-- Logging --&gt;
    &lt;attribute name="ShowSqlEnabled"&gt;true&lt;/attribute&gt;

    &lt;!-- Mapping files --&gt;
    &lt;attribute name="MapResources"&gt;auction/Item.hbm.xml,auction/Category.hbm.xml&lt;/attribute&gt;

&lt;/mbean&gt;

&lt;/server&gt;</pre><p>&#51060; &#54028;&#51068;&#51008; <code class="literal">META-INF</code>&#47196; &#47749;&#47749;&#46108; &#46356;&#47113;&#53664;&#47532; &#49549;&#50640; &#48176;&#52824;&#46104;&#44256; &#54869;&#51109;&#51088; <code class="literal">.sar</code> (service archive)&#47484; &#44032;&#51652; &#54620; &#44060;&#51032; JAR &#54028;&#51068; &#49549;&#50640; &#54056;&#53412;&#51669;&#46108;&#45796;. &#45817;&#49888;&#51008; &#46608;&#54620; Hibernate, &#44536;&#44163;&#51032; &#54596;&#50836;&#54620; &#51228; 3&#51032; &#46972;&#51060;&#48652;&#47084;&#47532;&#46308;, &#45817;&#49888;&#51032; &#52980;&#54028;&#51068;&#46108; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308; &#49104;&#47564; &#50500;&#45768;&#46972; &#45817;&#49888;&#51032; &#47588;&#54609; &#54028;&#51068;&#46308;&#51012; &#46041;&#51068;&#54620;
               &#50500;&#52852;&#51060;&#48652; &#49549;&#50640; &#54056;&#53412;&#51669;&#54624; &#54596;&#50836;&#44032; &#51080;&#45796;. &#45817;&#49888;&#51032; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; &#48712;&#51592;(&#45824;&#44060; session beans)&#45716; &#44536;&#44163;&#46308; &#51088;&#49888;&#51032; JAR &#54028;&#51068; &#49549;&#50640; &#50976;&#51648;&#46112; &#49688; &#51080;&#51648;&#47564;, &#45817;&#49888;&#51008; &#54620; &#44060;&#51032; (hot-)&#48176;&#52824; &#44032;&#45733;&#54620; &#45800;&#50948;&#47484; &#50619;&#44592; &#50948;&#54644; &#47700;&#51064; &#49436;&#48708;&#49828;
               &#50500;&#52852;&#51060;&#48652; &#49549;&#50640; &#51060; EJB JAR &#54028;&#51068;&#51012; &#54252;&#54632;&#49884;&#53420; &#49688;&#46020; &#51080;&#45796;. JMX &#49436;&#48708;&#49828;&#50752; EJB &#48176;&#52824;&#50640; &#44288;&#54620; &#52628;&#44032; &#51221;&#48372;&#45716; JBoss AS &#47928;&#49436;&#47484; &#52280;&#51312;&#54616;&#46972;. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="configuration-xmlconfig.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="session-configuration.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="persistent-classes.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">3.7. XML &#44396;&#49457; &#54028;&#51068;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;4&#51109;. &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;</td>
            </tr>
         </table>
      </div>
   </body>
</html>