<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>21&#51109;. &#50696;&#51228;: &#48512;&#47784;/&#51088;&#49885;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="toolsetguide.html" title="20&#51109;. &#46020;&#44396;&#49483; &#50504;&#45236;">
      <link rel="next" href="example-parentchild-bidir.html" title="21.2. &#50577;&#48169;&#54693; one-to-many">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">21&#51109;. &#50696;&#51228;: &#48512;&#47784;/&#51088;&#49885;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="toolsetguide.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="example-parentchild-bidir.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="example-parentchild"></a>21&#51109;. &#50696;&#51228;: &#48512;&#47784;/&#51088;&#49885;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#49352;&#47196;&#50868; &#49324;&#50857;&#51088;&#46308;&#51060; Hibernate&#47196; &#54665;&#54616;&#44256;&#51088; &#49884;&#46020;&#54616;&#45716; &#48148;&#47196; &#52395; &#48264;&#51704; &#44163;&#46308; &#51473; &#54616;&#45208;&#45716; &#48512;&#47784;/&#51088;&#49885; &#53440;&#51077;&#51032; &#44288;&#44228;&#47484; &#47784;&#54805;&#54868; &#49884;&#53412;&#45716; &#44163;&#51060;&#45796;. &#51060;&#44163;&#50640; &#45824;&#54620; &#46160; &#44032;&#51648; &#45796;&#47480; &#51217;&#44540;&#48277;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;. &#50668;&#47084;&#44032;&#51648; &#51060;&#50976;&#46308;&#47196; &#51064;&#54644; &#53945;&#55176; &#49352;&#47196;&#50868;
            &#49324;&#50857;&#51088;&#46308;&#50640;&#44172; &#44032;&#51109; &#54200;&#54620; &#51217;&#44540;&#48277;&#51008; <code class="literal">Parent</code>&#47196;&#48512;&#53552; <code class="literal">Child</code>&#47196;&#51032; <code class="literal">&lt;one-to-many&gt;</code> &#50672;&#44288;&#51012; &#44032;&#51652; &#50644;&#54000;&#54000; &#53364;&#47000;&#49828;&#46308;&#47196;&#49436; <code class="literal">Parent</code>&#50752; <code class="literal">Child</code> &#50577;&#51088;&#47484; &#47784;&#54805;&#54868; &#49884;&#53412;&#45716; &#44163;&#51060;&#45796;. (&#45796;&#47480; &#51217;&#44540;&#48277;&#51008; <code class="literal">Child</code>&#47484; <code class="literal">&lt;composite-element&gt;</code>&#47196; &#49440;&#50616;&#54616;&#45716; &#44163;&#51060;&#45796;.) &#51060;&#51228;, (Hibernate&#50640;&#49436;) one to many &#50672;&#44288;&#50640; &#45824;&#54620; &#46356;&#54260;&#53944; &#51032;&#48120;&#45716; composite &#50836;&#49548; &#47588;&#54609;&#51032; &#51032;&#48120;&#48372;&#45796; &#48512;&#47784;/&#51088;&#49885; &#44288;&#44228;&#51032; &#53685;&#49345;&#51201;&#51064; &#51032;&#48120;&#50640; &#55016;&#50476; &#45916; &#44032;&#44637;&#45796;&#45716; &#44163;&#51060; &#54032;&#47749;&#46108;&#45796;. &#50864;&#47532;&#45716;
            &#48512;&#47784;/&#51088;&#49885; &#44288;&#44228;&#47484; &#54952;&#50984;&#51201;&#51060;&#44256; &#44053;&#47141;&#54616;&#44172; &#47784;&#54805;&#54868; &#49884;&#53412;&#44592; &#50948;&#54644; <span class="emphasis"><em>&#52992;&#49828;&#52992;&#51060;&#46300;&#46308;&#51012; &#44032;&#51652; &#50577;&#48169;&#54693; one to many &#50672;&#44288;</em></span>&#51012; &#49324;&#50857;&#54616;&#45716; &#48169;&#48277;&#51012; &#49444;&#47749;&#54624; &#44163;&#51060;&#45796;. &#44536;&#44163;&#51008; &#51204;&#54784; &#50612;&#47157;&#51648; &#50506;&#45796;! 
         </p>
         <div class="sect1" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="example-parentchild-collections"></a>21.1. &#53084;&#47113;&#49496;&#46308;&#50640; &#44288;&#54620; &#45432;&#53944;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Hibernate &#53084;&#47113;&#49496;&#46308;&#51008; &#44536;&#44163;&#46308;&#51032; &#49548;&#50976;&#54616;&#44256; &#51080;&#45716; &#50644;&#54000;&#54000;&#51032; &#45436;&#47532;&#51201; &#48512;&#48516;&#51004;&#47196; &#44036;&#51452;&#46108;&#45796;; &#44208;&#53076; &#54252;&#54632;&#46108; &#50644;&#54000;&#54000;&#46308;&#51032; &#48512;&#48516;&#51060; &#50500;&#45768;&#45796;. &#51060;&#44163;&#51008; &#51473;&#45824;&#54620; &#44396;&#48516;&#51216;&#51060;&#45796;! &#44536;&#44163;&#51008; &#45796;&#51020;&#51008; &#45796;&#51020; &#44208;&#44284;&#46308;&#51012; &#44054;&#45716;&#45796;: </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#53084;&#47113;&#49496;&#51004;&#47196;&#48512;&#53552; &#44061;&#52404;&#47484; &#51228;&#44144;&#54616;&#44256;/&#53084;&#47113;&#49496;&#50640; &#44061;&#52404;&#47484; &#52628;&#44032; &#49884;&#53420; &#46412;, &#53084;&#47113;&#49496; &#49548;&#50976;&#51088;&#51032; &#48260;&#51204; &#48264;&#54840;&#44032; &#51613;&#44032;&#46108;&#45796;. </p>
                  </li>
                  <li>
                     <p>&#47564;&#51068; &#53084;&#47113;&#49496;&#51004;&#47196;&#48512;&#53552; &#51228;&#44144;&#46104;&#50632;&#45912; &#44061;&#52404;&#44032; &#54616;&#45208;&#51032; &#44050; &#53440;&#51077;&#51032; &#51064;&#49828;&#53556;&#49828;(&#50696;&#47484; &#46308;&#50612; composite &#50836;&#49548;)&#51060;&#47732;, &#44536; &#44061;&#52404;&#45716; &#50689;&#49549;&#49345;&#53468;&#47484; &#45149;&#45236;&#44256; &#44536;&#44163;&#51032; &#49345;&#53468;&#44032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196;&#48512;&#53552; &#50756;&#51204;&#55176; &#51228;&#44144;&#46112; &#44163;&#51060;&#45796;. &#47560;&#52268;&#44032;&#51648;&#47196; &#54616;&#45208;&#51032; &#44050; &#53440;&#51077;&#51032;
                        &#51064;&#49828;&#53556;&#49828;&#47484; &#53084;&#47113;&#49496;&#50640; &#52628;&#44032;&#49884;&#53412;&#45716; &#44163;&#51008; &#44536;&#44163;&#51032; &#49345;&#53468;&#44032; &#51593;&#49884; &#50689;&#49549;&#54868; &#46104;&#46020;&#47197; &#44053;&#51228;&#49884;&#53420; &#44163;&#51060;&#45796;. 
                     </p>
                  </li>
                  <li>
                     <p>&#48152;&#47732;&#50640;, &#47564;&#51068; &#50644;&#54000;&#54000;&#44032; &#53084;&#47113;&#49496;&#51004;&#47196;&#48512;&#53552; &#51228;&#44144;&#46112; &#44221;&#50864;(one-to-many &#46608;&#45716; many-to-many &#50672;&#44288;), &#44536;&#44163;&#51008; &#46356;&#54260;&#53944;&#47196; &#49325;&#51228;&#46104;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;. &#51060; &#53945;&#51669;&#51008; &#50756;&#51204;&#54616;&#44172; &#51068;&#44288;&#51201;&#51060;&#45796; - &#45796;&#47480; &#50644;&#54000;&#54000;&#51032; &#45236;&#48512; &#49345;&#53468;&#50640; &#45824;&#54620; &#48320;&#44221;&#51008;
                        &#50672;&#44288;&#46108; &#50644;&#54000;&#54000;&#47484; &#49324;&#46972;&#51648;&#46020;&#47197; &#44053;&#51228;&#54616;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;! &#47560;&#52268;&#44032;&#51648;&#47196; &#53084;&#47113;&#49496;&#50640; &#50644;&#54000;&#54000;&#47484; &#52628;&#44032;&#49884;&#53412;&#45716; &#44163;&#51008; &#46356;&#54260;&#53944;&#47196; &#44536; &#50644;&#54000;&#54000;&#44032; &#50689;&#49549;&#54868; &#46104;&#46020;&#47197; &#44053;&#51228;&#49884;&#53412;&#51648; &#50506;&#45716;&#45796;. 
                     </p>
                  </li>
               </ul>
            </div>
            <p>&#45824;&#49888;&#50640; &#53084;&#47113;&#49496;&#51004;&#47196;&#51032; &#50644;&#54000;&#54000; &#52628;&#44032;&#44032; &#46160; &#50644;&#54000;&#54000;&#46308; &#49324;&#51060;&#50640; &#45800;&#51648; &#54616;&#45208;&#51032; &#47553;&#53356;&#47484; &#49373;&#49457;&#49884;&#53412;&#45716; &#48152;&#47732;&#50640;, &#44536;&#44163;&#51012; &#51228;&#44144;&#54616;&#45716; &#44163;&#51008; &#47553;&#53356;&#47484; &#51228;&#44144;&#54620;&#45796;&#45716; &#51216;&#51060; &#46356;&#54260;&#53944; &#53945;&#51669;&#51060;&#45796;. &#51060;&#44163;&#51008; &#47784;&#46304; &#51333;&#47448;&#51032; &#44221;&#50864;&#46308;&#50640; &#45824;&#54644; &#47588;&#50864; &#51201;&#51208;&#54616;&#45796;. &#44536;&#44163;&#51060; &#51204;&#54784;
               &#51201;&#51208;&#54616;&#51648; &#50506;&#51008; &#44275;&#51008; &#48512;&#47784;/&#51088;&#49885; &#44288;&#44228;&#51064; &#44221;&#50864;&#51060;&#44256;, &#50668;&#44592;&#49436; &#51088;&#49885;&#51032; &#49373;&#50528;&#45716; &#48512;&#47784;&#51032; &#49373;&#47749;&#51452;&#44592;&#50640; &#47926;&#50668;&#51256; &#51080;&#45796;. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="toolsetguide.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="example-parentchild-bidir.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">20&#51109;. &#46020;&#44396;&#49483; &#50504;&#45236;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;21.2. &#50577;&#48169;&#54693; one-to-many</td>
            </tr>
         </table>
      </div>
   </body>
</html>