<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>17&#51109;. &#45936;&#51060;&#53552; &#54596;&#53552;&#47553;&#54616;&#44592;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="querysql-load.html" title="16.4. &#47196;&#46377;&#51012; &#50948;&#54620; &#47582;&#52644;&#54805; SQL">
      <link rel="next" href="xml.html" title="18&#51109;. XML &#47588;&#54609;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">17&#51109;. &#45936;&#51060;&#53552; &#54596;&#53552;&#47553;&#54616;&#44592;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="querysql-load.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="xml.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="filters"></a>17&#51109;. &#45936;&#51060;&#53552; &#54596;&#53552;&#47553;&#54616;&#44592;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate3&#51008; &#54785;&#49888;&#51201;&#51064; "&#44032;&#49884;&#49457;(visibility)" &#44508;&#52825;&#46308;&#47196;&#49436; &#45936;&#51060;&#53552;&#47484; &#52376;&#47532;&#54616;&#45716; &#49352;&#47196;&#50868; &#51217;&#44540;&#48277;&#51012; &#51228;&#44277;&#54620;&#45796;. <span class="emphasis"><em>Hibernate &#54596;&#53552;</em></span>&#45716; &#53945;&#51221; Hibernate &#49464;&#49496;&#50640; &#45824;&#54644; &#51060;&#50857; &#44032;&#45733;&#54616;&#44172; &#46104;&#44144;&#45208; &#51060;&#50857; &#48520;&#44032;&#45733;&#54616;&#44172; &#46112; &#49688;&#46020; &#51080;&#45716; &#51204;&#50669;, &#47749;&#47749;&#46108; &#54028;&#46972;&#48120;&#53552;&#54868; &#46108; &#54596;&#53552;&#51060;&#45796;. 
         </p>
         <div class="sect1" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="objectstate-filters"></a>17.1. Hibernate &#54596;&#53552;&#46308;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Hibernate3&#51008; &#54596;&#53552; &#44592;&#51456;(criteria)&#51012; &#48120;&#47532; &#51221;&#51032;&#54616;&#44256; &#53364;&#47000;&#49828; &#47112;&#48296;&#44284; &#53084;&#47113;&#49496; &#47112;&#48296; &#50577;&#51088;&#50640;&#49436; &#44536;&#46308; &#54596;&#53552;&#46308;&#51012; &#52392;&#48512;&#54624; &#45733;&#47141;&#51012; &#52628;&#44032;&#49884;&#53416;&#45796;. &#54596;&#53552; &#44592;&#51456;(criteria)&#51008; &#53364;&#47000;&#49828; &#50836;&#49548;&#50752; &#45796;&#50577;&#54620; &#53084;&#47113;&#49496; &#50836;&#49548;&#46308;&#50640; &#45824;&#54644; &#51060;&#50857;
               &#44032;&#45733;&#54620; &#44592;&#51316;&#51032; "where" &#49549;&#49457;&#44284; &#47588;&#50864; &#50976;&#49324;&#54620; &#54616;&#45208;&#51032; &#51228;&#54620; &#51208;&#51012; &#51221;&#51032;&#54616;&#45716; &#45733;&#47141;&#51060;&#45796;. &#51060;&#44163;&#46308;&#51012; &#51228;&#50808;&#54616;&#47732; &#54596;&#53552; &#51312;&#44148;&#46308;&#51008; &#54028;&#46972;&#48120;&#53552;&#54868; &#46112; &#49688; &#51080;&#45796;. &#44536;&#46412; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#51452;&#50612;&#51652; &#54596;&#53552;&#46308;&#51060; &#51060;&#50857; &#44032;&#45733;&#54620;&#51648; &#50668;&#48512; &#44536;&#47532;&#44256; &#44536;&#46308; &#54028;&#46972;&#48120;&#53552;
               &#44050;&#46308;&#51060; &#47924;&#50631;&#51060;&#50612;&#50556; &#54616;&#45716;&#51648;&#47484; &#49892;&#54665; &#49884;&#50640; &#44208;&#51221;&#54624; &#49688; &#51080;&#45796;. &#54596;&#53552;&#46308;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#48624;&#46308; &#52376;&#47100; &#49324;&#50857;&#46112; &#49688; &#51080;&#51648;&#47564;, &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#45236;&#48512;&#50640; &#54028;&#46972;&#48120;&#53552;&#54868; &#46108;&#45796;. 
            </p>
            <p>&#54596;&#53552;&#46308;&#51012; &#49324;&#50857;&#54616;&#44592; &#50948;&#54644;&#49436;, &#44536;&#44163;&#46308;&#51008; &#47676;&#51200; &#51221;&#51032;&#46104;&#44256; &#45208;&#49436; &#51201;&#51208;&#54620; &#47588;&#54609; &#50836;&#49548;&#46308;&#50640; &#52392;&#44032;&#46104;&#50612;&#50556; &#54620;&#45796;. &#54596;&#53552;&#47484; &#51221;&#51032;&#54616;&#44592; &#50948;&#54644;, <code class="literal">&lt;hibernate-mapping/&gt;</code> &#50836;&#49548; &#45236;&#48512;&#50640; <code class="literal">&lt;filter-def/&gt;</code> &#50836;&#49548;&#47484; &#49324;&#50857;&#54616;&#46972;: 
            </p><pre class="programlisting">&lt;filter-def name="myFilter"&gt;
    &lt;filter-param name="myFilterParam" type="string"/&gt;
&lt;/filter-def&gt;</pre><p>&#44536;&#46412; &#51060; &#54596;&#53552;&#45716; &#53364;&#47000;&#49828;&#50640; &#52392;&#44032;&#46112; &#49688; &#51080;&#45796;: </p><pre class="programlisting">&lt;class name="myClass" ...&gt;
    ...
    &lt;filter name="myFilter" condition=":myFilterParam = MY_FILTERED_COLUMN"/&gt;
&lt;/class&gt;</pre><p>&#46608;&#45716; &#53084;&#47113;&#49496;&#50640; &#52392;&#44032;&#46112; &#49688; &#51080;&#45796;: </p><pre class="programlisting">&lt;set ...&gt;
    &lt;filter name="myFilter" condition=":myFilterParam = MY_FILTERED_COLUMN"/&gt;
&lt;/set&gt;</pre><p>&#46608;&#45716; &#46041;&#49884;&#50640; &#50577;&#51088;&#50640;(&#46608;&#45716; &#44033;&#44033;&#51032; &#50668;&#47084;&#48264;) &#52392;&#44032;&#46112; &#49688; &#51080;&#45796;. </p>
            <p>The methods on <code class="literal">Session</code> are: <code class="literal">enableFilter(String filterName)</code>, <code class="literal">getEnabledFilter(String filterName)</code>, and <code class="literal">disableFilter(String filterName)</code>. By default, filters are <span class="emphasis"><em>not</em></span> enabled for a given session; they must be explcitly enabled through use of the <code class="literal">Session.enableFilter()</code> method, which returns an instance of the <code class="literal">Filter</code> interface. Using the simple filter defined above, this would look like: 
            </p><pre class="programlisting">session.enableFilter("myFilter").setParameter("myFilterParam", "some-value");</pre><p>org.hibernate.Filter &#51064;&#53552;&#54168;&#51060;&#49828; &#49345;&#51032; &#47700;&#49548;&#46300;&#46308;&#51008; Hibernate&#50640; &#47588;&#50864; &#44277;&#53685;&#46108; method-chaining&#51012; &#54728;&#50857;&#54620;&#45796;&#45716; &#51216;&#51012; &#45432;&#53944;&#54616;&#46972;. </p>
            <p>&#50976;&#54952;&#54620; &#44592;&#47197; &#45216;&#51676; &#54056;&#53556;&#51012; &#44032;&#51652; &#49884;&#44036; &#45936;&#51060;&#53552;&#47484; &#49324;&#50857;&#54616;&#45716; &#51204;&#52404; &#50696;&#51228; : </p><pre class="programlisting">&lt;filter-def name="effectiveDate"&gt;
    &lt;filter-param name="asOfDate" type="date"/&gt;
&lt;/filter-def&gt;

&lt;class name="Employee" ...&gt;
...
    &lt;many-to-one name="department" column="dept_id" class="Department"/&gt;
    &lt;property name="effectiveStartDate" type="date" column="eff_start_dt"/&gt;
    &lt;property name="effectiveEndDate" type="date" column="eff_end_dt"/&gt;
...
    &lt;!--
        Note that this assumes non-terminal records have an eff_end_dt set to
        a max db date for simplicity-sake
    --&gt;
    &lt;filter name="effectiveDate"
            condition=":asOfDate BETWEEN eff_start_dt and eff_end_dt"/&gt;
&lt;/class&gt;

&lt;class name="Department" ...&gt;
...
    &lt;set name="employees" lazy="true"&gt;
        &lt;key column="dept_id"/&gt;
        &lt;one-to-many class="Employee"/&gt;
        &lt;filter name="effectiveDate"
                condition=":asOfDate BETWEEN eff_start_dt and eff_end_dt"/&gt;
    &lt;/set&gt;
&lt;/class&gt;</pre><p>&#44536;&#46412; &#45817;&#49888;&#51060; &#54788;&#51116; &#50976;&#54952;&#54620; &#47112;&#53076;&#46300;&#46308;&#51012; &#54637;&#49345; &#50619;&#45716; &#44163;&#51012; &#54869;&#49892;&#55176; &#54616;&#44592; &#50948;&#54644;, employee &#45936;&#51060;&#53552;&#47484; &#44160;&#49353;&#54616;&#44592; &#51204;&#50640; &#49464;&#49496; &#49345;&#50640; &#54596;&#53552;&#47484; &#44036;&#45800;&#54616;&#44172; &#51060;&#50857; &#44032;&#45733;&#54616;&#44172; &#54616;&#46972;: </p><pre class="programlisting">Session session = ...;
session.enableFilter("effectiveDate").setParameter("asOfDate", new Date());
List results = session.createQuery("from Employee as e where e.salary &gt; :targetSalary")
         .setLong("targetSalary", new Long(1000000))
         .list();
</pre><p>&#50948;&#51032; HQL &#50640;&#49436;, &#49900;&#51648;&#50612; &#48708;&#47197; &#50864;&#47532;&#44032; &#44208;&#44284;&#46308;&#50640; &#45824;&#54620; &#48393;&#44553; &#52968;&#49828;&#53944;&#47112;&#51064;&#53944;&#47484; &#47749;&#49884;&#51201;&#51004;&#47196; &#50616;&#44553;&#47564; &#54664;&#51012;&#51648;&#46972;&#46020;, &#51060;&#50857; &#44032;&#45733;&#54620; &#54596;&#53552; &#46412;&#47928;&#50640; &#44536; &#51656;&#51032;&#45716; &#48393;&#44553;&#51060; &#48177;&#47564;&#45804;&#47084; &#51060;&#49345;&#51064; &#54788;&#51116; &#52292;&#50857;&#51473;&#51064; &#51649;&#50896;&#46308;&#47564;&#51012; &#48152;&#54872;&#54624; &#44163;&#51060;&#45796;. </p>
            <p>&#45432;&#53944;: &#47564;&#51068; &#45817;&#49888;&#51060; outer &#51312;&#51064;&#50640; &#45824;&#54644; &#54596;&#53552;&#46308;&#51012; &#49324;&#50857;&#54624; &#44228;&#54925;&#51060;&#46972;&#47732; (HQL&#51060;&#46304; &#47196;&#46300; &#54168;&#52845;&#51060;&#46304;) &#51312;&#44148; &#54364;&#54788;&#49885;&#51032; &#48169;&#54693;&#51012; &#51452;&#51032;&#54616;&#46972;. &#51060;&#44163;&#51012; left outer join&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#44163;&#51060; &#44032;&#51109; &#50504;&#51204;&#54616;&#45796;; &#51068;&#48152;&#51201;&#51004;&#47196; &#50724;&#54140;&#47112;&#51060;&#53552;
               &#46244;&#50640; &#51080;&#45716; &#52972;&#47100; &#51060;&#47492;(&#46308;)&#51060; &#46244;&#46384;&#47476;&#45716; &#52395;&#48264;&#51704;&#50640; &#54028;&#46972;&#48120;&#53552;&#47484; &#50948;&#52824;&#51648;&#50892;&#46972;. 
            </p>
            <p>&#54596;&#53552;&#44032; &#51221;&#51032;&#46108; &#54980;&#50640;&#45716; &#44536;&#44163; &#51088;&#49888;&#51032; &#51312;&#44148;&#50640; &#45824;&#54644; &#44033;&#44033; &#50668;&#47084; &#44060;&#51032; &#50644;&#54000;&#54000;&#46308; &#44536;&#47532;&#44256;/&#46608;&#45716; &#53084;&#47113;&#49496;&#46308;&#50640; &#52392;&#44032;&#46112; &#49688; &#51080;&#45796;. &#51312;&#44148;&#46308;&#51060; &#47588;&#48264; &#46041;&#51068;&#54624; &#46412; &#44536;&#44163;&#51008; &#51648;&#47336;&#54624; &#49688; &#51080;&#45796;. &#46384;&#46972;&#49436; <code class="literal">&lt;filter-def/&gt;</code>&#51008; attribute &#46304; CDATA &#46304; &#50612;&#45712;&#44163;&#51060;&#46304; &#46356;&#54260;&#53944; &#51312;&#44148;&#51012; &#51221;&#51032;&#54616;&#45716; &#44163;&#51012; &#54728;&#50857;&#54644;&#51456;&#45796;: 
            </p><pre class="programlisting">&lt;filter-def name="myFilter" condition="abc &gt; xyz"&gt;...&lt;/filter-def&gt;
&lt;filter-def name="myOtherFilter"&gt;abc=xyz&lt;/filter-def&gt;</pre><p>&#44536;&#46412; &#51060; &#46356;&#54260;&#53944; &#51312;&#44148;&#51008; &#44536; &#54596;&#53552;&#44032; &#50612;&#46500; &#51312;&#44148;&#51012; &#51648;&#51221;&#54632;&#51060; &#50630;&#51060; &#50612;&#46500; &#44163;&#50640; &#52392;&#44032;&#46112;&#46412;&#47560;&#45796; &#49324;&#50857;&#46112; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; &#45817;&#49888;&#51060; &#53945;&#51221;&#54620; &#44221;&#50864;&#50640; &#46356;&#54260;&#53944; &#51312;&#44148;&#51012; &#50724;&#48260;&#46972;&#51060;&#46300; &#49884;&#53412;&#45716; &#54596;&#53552;&#51032; &#52392;&#44032; &#48512;&#48516;&#51004;&#47196;&#49436; &#53945;&#51221; &#51312;&#44148;&#51012; &#48512;&#50668;&#54624; &#49688; &#51080;&#51020;&#51012; &#51032;&#48120;&#54632;&#51012;
               &#45432;&#53944;&#54616;&#46972;. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="querysql-load.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="xml.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">16.4. &#47196;&#46377;&#51012; &#50948;&#54620; &#47582;&#52644;&#54805; SQL&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;18&#51109;. XML &#47588;&#54609;</td>
            </tr>
         </table>
      </div>
   </body>
</html>