<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>5.2. Hibernate &#53440;&#51077;&#46308;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="mapping.html" title="5&#51109;. &#44592;&#48376; O/R &#47588;&#54609;">
      <link rel="prev" href="mapping.html" title="5&#51109;. &#44592;&#48376; O/R &#47588;&#54609;">
      <link rel="next" href="mapping-entityname.html" title="5.3. &#54616;&#45208;&#51032; &#53364;&#47000;&#49828;&#47484; &#54620; &#48264; &#51060;&#49345; &#47588;&#54609;&#54616;&#44592;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">5.2. Hibernate &#53440;&#51077;&#46308;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="mapping.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">5&#51109;. &#44592;&#48376; O/R &#47588;&#54609;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="mapping-entityname.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="mapping-types"></a>5.2. Hibernate &#53440;&#51077;&#46308;
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="mapping-types-entitiesvalues"></a>5.2.1. &#50644;&#54000;&#54000;&#46308;&#44284; &#44050;&#46308;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#50689;&#49549; &#49436;&#48708;&#49828;&#50640; &#44288;&#54620; &#50668;&#47084; Java &#50616;&#50612;-&#47112;&#48296;&#51032; &#44061;&#52404;&#46308;&#51012; &#51060;&#54644;&#54616;&#44592; &#50948;&#54644;, &#50864;&#47532;&#45716; &#44536;&#44163;&#46308;&#51012; &#45796;&#51020; &#46160; &#44060;&#51032; &#44536;&#47353;&#46308;&#47196; &#48516;&#47448;&#54624; &#54596;&#50836;&#44032; &#51080;&#45796;: </p>
            <p><span class="emphasis"><em>entity</em></span>&#45716; &#50644;&#54000;&#54000;&#50640; &#45824;&#54620; &#52280;&#51312;&#46308;&#51012; &#48372;&#44288;&#54616;&#45716; &#51076;&#51032;&#51032; &#45796;&#47480; &#44061;&#52404;&#46308;&#44284;&#45716; &#46021;&#47549;&#51201;&#51004;&#47196; &#51316;&#51116;&#54620;&#45796;. &#52280;&#51312;&#46104;&#51648; &#50506;&#51008; &#44061;&#52404;&#44032; &#50416;&#47112;&#44592; &#49688;&#51665;&#46104;&#45716; &#53685;&#49345;&#51032; &#51088;&#48148; &#47784;&#54805;&#44284; &#51060;&#44163;&#51008; &#45824;&#51312;&#51201;&#51060;&#45796;. (&#51200;&#51109;&#46308;&#44284; &#49325;&#51228;&#46308;&#51060; &#48512;&#47784; &#50644;&#54000;&#54000;&#47196;&#48512;&#53552; &#44536;&#44163;&#51032; &#51088;&#49885;&#51004;&#47196;&#51032; &#52992;&#49828;&#52992;&#51060;&#46300;
               &#46104;&#45716; &#44221;&#50864;&#47484; &#51228;&#50808;&#54616;&#47732;) &#50644;&#54000;&#54000;&#46308;&#51008; &#47749;&#49884;&#51201;&#51004;&#47196; &#51200;&#51109;&#46104;&#44256; &#49325;&#51228;&#46104;&#50612;&#50556; &#54620;&#45796;. &#51060;&#44163;&#51008; &#46020;&#45804; &#44032;&#45733;&#49457;(reachablity)&#50640; &#51032;&#54620; &#44061;&#52404; &#50689;&#49549;&#49457;&#51032; ODMG &#47784;&#54805;&#44284;&#45716; &#45796;&#47476;&#45796; - &#44536;&#47532;&#44256; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44061;&#52404;&#46308;&#51060; &#45824;&#54805; &#49884;&#49828;&#53596;&#46308;&#50640;&#49436; &#45824;&#44060; &#50612;&#46523;&#44172;
               &#49324;&#50857;&#46104;&#45716;&#44032;&#50640; &#55016;&#50476; &#45908; &#44032;&#44637;&#44172; &#45824;&#51025;&#54620;&#45796;. &#50644;&#54000;&#54000;&#46308;&#51008; &#49692;&#54872; &#52280;&#51312;&#50752; &#44277;&#50976; &#52280;&#51312;&#46308;&#51012; &#51648;&#50896;&#54620;&#45796;. &#44536;&#44163;&#46308; &#46608;&#54620; &#48260;&#51204;&#54868; &#46112; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#50644;&#54000;&#54000;&#51032; &#50689;&#49549; &#49345;&#53468;&#45716; &#45796;&#47480; &#50644;&#54000;&#54000;&#46308;&#50640; &#45824;&#54620; &#52280;&#51312;&#46308;&#44284; <span class="emphasis"><em>value</em></span> &#53440;&#51077;&#46308;&#47196; &#44396;&#49457;&#46108;&#45796;. &#44050;&#46308;&#51008; &#50896;&#49884; &#53440;&#51077;&#46308;, &#53084;&#47113;&#49496;&#46308;(&#54616;&#45208;&#51032; &#53084;&#47113;&#49496; &#45236;&#48512;&#50640; &#51080;&#51648; &#50506;&#45716; &#44163;&#46308;), &#52980;&#54252;&#45324;&#53944;&#46308;, &#44536;&#47532;&#44256; &#50612;&#46500; &#48520;&#48320;&#51032; &#44061;&#52404;&#46308;&#51060;&#45796;. entities&#50752;&#45716; &#45804;&#47532;, (&#53945;&#48324;&#54620; &#53084;&#47113;&#49496;&#46308;&#44284; &#52980;&#54252;&#45324;&#53944;&#46308;&#50640;&#49436;) &#44050;&#46308;&#51008; &#46020;&#45804;&#44032;&#45733;&#49457;(reachability)&#50640;
               &#51032;&#54644; &#50689;&#49549;&#54868; <span class="emphasis"><em>&#46104;&#44256;</em></span> &#49325;&#51228; &#46108;&#45796;. value &#44061;&#52404;&#46308;(&#44284; &#50896;&#49884; &#53440;&#51077;&#46308;)&#51060; &#44536;&#44163;&#46308;&#51032; &#54252;&#54632;&#54616;&#45716; &#50644;&#54000;&#54000;&#50640; &#46384;&#46972; &#50689;&#49549;&#54868; &#46104;&#44256; &#49325;&#51228; &#46104;&#48064;&#47196;, &#44536;&#44163;&#46308;&#51008; &#46021;&#47549;&#51201;&#51004;&#47196; &#48260;&#51204;&#54868; &#46104;&#51648; &#50506;&#45716;&#45796;. &#44050;&#46308;&#51008; &#46021;&#47549;&#51201;&#51064; &#50644;&#54000;&#54000;&#47484; &#44054;&#51648; &#50506;&#50500;&#49436;, &#44536;&#44163;&#46308;&#51008; &#46160; &#44060;&#51032; &#50644;&#54000;&#54000;&#46308;&#51060;&#45208;
               &#53084;&#47113;&#49496;&#46308;&#50640; &#51032;&#54644; &#44277;&#50976;&#46112; &#49688; &#50630;&#45796;. 
            </p>
            <p>&#51648;&#44552;&#44620;&#51648; &#50864;&#47532;&#45716; &#50644;&#54000;&#54000;&#46308;&#51012; &#52280;&#51312;&#54616;&#44592; &#50948;&#54644; "&#50689;&#49549; &#53364;&#47000;&#49828;"&#47484; &#49324;&#50857;&#54644; &#50772;&#45796;. &#50864;&#47532;&#45716; &#44536;&#44163;&#51012; &#44228;&#49549; &#49324;&#50857;&#54624; &#44163;&#51060;&#45796;. &#54616;&#51648;&#47564; &#50628;&#44201;&#55176; &#47568;&#54644;, &#50689;&#49549; &#49345;&#53468;&#47484; &#44032;&#51652; &#47784;&#46304; &#49324;&#50857;&#51088; &#51221;&#51032; &#53364;&#47000;&#49828;&#46308;&#51008; &#50644;&#54000;&#54000;&#46308;&#51060; &#50500;&#45768;&#45796;. <span class="emphasis"><em>&#52980;&#54252;&#45324;&#53944;</em></span>&#45716; value &#51032;&#48120;&#47484; &#44032;&#51652; &#49324;&#50857;&#51088; &#51221;&#51032; &#53364;&#47000;&#49828;&#51060;&#45796;. <code class="literal">java.lang.String</code> &#53440;&#51077;&#51032; &#51088;&#48148; &#54532;&#47196;&#54140;&#54000;&#45716; &#46608;&#54620; value &#51032;&#48120;&#47484; &#44054;&#45716;&#45796;. &#51060; &#51221;&#51032;&#44032; &#51452;&#50612;&#51648;&#47732;, &#50864;&#47532;&#45716; JDK&#50640; &#51032;&#54644; &#51228;&#44277;&#46108; &#47784;&#46304; &#53440;&#51077;&#46308;(&#53364;&#47000;&#49828;&#46308;)&#51060; &#51088;&#48148;&#50640;&#49436; value &#53440;&#51077; &#51032;&#48120;&#47484; &#44054;&#44256;, &#48152;&#47732;&#50640; &#49324;&#50857;&#51088; &#51221;&#51032; &#53440;&#51077;&#46308;&#51008; &#50644;&#54000;&#54000; &#46608;&#45716; type
               &#51032;&#48120;&#47196;&#49436; &#47588;&#54609;&#46108;&#45796;&#44256; &#47568;&#54624; &#49688; &#51080;&#45796;. &#51060; &#54032;&#45800;&#51008; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44060;&#48156;&#51088;&#50640;&#44172; &#45804;&#47140; &#51080;&#45796;. &#46020;&#47700;&#51064; &#47784;&#54805;&#50640;&#49436; &#50644;&#54000;&#54000; &#53364;&#47000;&#49828;&#50640; &#45824;&#54620; &#51339;&#51008; &#55180;&#53944;&#45716; &#44536; &#53364;&#47000;&#49828;&#51032; &#54616;&#45208;&#51032; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#44277;&#50976;&#46108; &#52280;&#51312;&#46308;&#51064; &#48152;&#47732;&#50640;, composition&#51060;&#45208;
               aggregation&#51008; &#45824;&#44060; value &#53440;&#51077;&#51004;&#47196; &#48320;&#54872;&#46108;&#45796;. 
            </p>
            <p>&#50864;&#47532;&#45716; &#47928;&#49436;&#47484; &#53685;&#54644; &#46160; &#44060;&#45392;&#46308;&#51012; &#45796;&#49884; &#44256;&#52272;&#54624; &#44163;&#51060;&#45796;. </p>
            <p>&#46020;&#51216;&#51216;&#51008; Java type &#49884;&#49828;&#53596;(&#44284; &#50644;&#54000;&#54000;&#46308; &#48143; value &#53440;&#51077;&#46308;&#50640; &#45824;&#54620; &#44060;&#48156;&#51088;&#51032; &#51221;&#51032;)&#47484; SQL/&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; type &#53440;&#51077;&#51004;&#47196; &#47588;&#54609;&#54616;&#45716; &#44163;&#51060;&#45796;. &#46160; &#49884;&#49828;&#53596;&#46308; &#49324;&#51060;&#51032; &#45796;&#47532;&#45716; Hibernate&#50640; &#51032;&#54644; &#51228;&#44277;&#46108;&#45796;: &#50644;&#54000;&#54000;&#46308;&#51032;
               &#44221;&#50864; &#50864;&#47532;&#45716; <code class="literal">&lt;class&gt;</code>, <code class="literal">&lt;subclass&gt;</code> &#46321;&#51012; &#49324;&#50857;&#54620;&#45796;.value &#53440;&#51077;&#46308;&#51032; &#44221;&#50864; &#50864;&#47532;&#45716; &#45824;&#44060;<code class="literal">type</code> &#49549;&#49457;&#51012; &#44032;&#51652; <code class="literal">&lt;property&gt;</code>, <code class="literal">&lt;component&gt;</code> &#46321;&#51012; &#49324;&#50857;&#54620;&#45796;. &#51060; &#49549;&#49457;&#51032; &#44050;&#51008; Hibernate <span class="emphasis"><em>&#47588;&#54609; &#53440;&#51077;</em></span>&#51032; &#51060;&#47492;&#51060;&#45796;. Hibernate&#45716; (&#54364;&#51456; JDK value &#53440;&#51077;&#46308;&#50640; &#45824;&#54644;) &#47566;&#51008; &#47588;&#54609;&#46308;&#51012; &#51228;&#44277;&#54620;&#45796;. &#45208;&#51473;&#50640; &#48372;&#44172; &#46104;&#46319;&#51060;, &#45817;&#49888;&#51008; &#45817;&#49888; &#51088;&#49888;&#51032; &#47588;&#54609; &#53440;&#51077;&#46308;&#51012; &#51089;&#49457;&#54624; &#49688; &#51080;&#44256; &#47560;&#52268;&#44032;&#51648;&#47196; &#45817;&#49888;&#51032; &#47582;&#52644;&#54805; &#48320;&#54872; &#48169;&#46020;&#46308;&#51012; &#44396;&#54788;&#54624;
               &#49688; &#51080;&#45796;. 
            </p>
            <p>&#53084;&#47113;&#49496;&#46308;&#51012; &#51228;&#50808;&#54620; &#47784;&#46304; &#48120;&#47532; &#48716;&#46300;&#46108; Hibernate &#53440;&#51077;&#46308;&#51008; null &#51032;&#48120;&#47484; &#51648;&#50896;&#54620;&#45796;. </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="mapping-types-basictypes"></a>5.2.2. &#44592;&#48376; value &#53440;&#51077;&#46308;
                     </h3>
                  </div>
               </div>
            </div>
            <p>The built-in <span class="emphasis"><em>basic mapping types</em></span> may be roughly categorized into 
            </p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term"><code class="literal">integer, long, short, float, double, character, byte, boolean, yes_no, true_false</code></span></dt>
                  <dd>
                     <p>&#51088;&#48148; &#50896;&#49884;&#53440;&#51077;&#46308;&#51060;&#45208; wrapper &#53364;&#47000;&#49828;&#46308;&#47196;&#48512;&#53552; &#51201;&#51208;&#54620;(&#48292;&#45908;-&#51648;&#51221;&#51201;&#51064;) SQL &#52972;&#47100; &#53440;&#51077;&#46308;&#47196;&#51032; &#53440;&#51077; &#47588;&#54609;. <code class="literal">boolean, yes_no</code>&#50752; <code class="literal">true_false</code>&#45716; Java <code class="literal">boolean</code>&#51060;&#45208; <code class="literal">java.lang.Boolean</code>&#50640; &#45824;&#54620; &#47784;&#46304; &#45824;&#52404;&#51201;&#51064; &#51064;&#53076;&#46377;&#46308;&#51060;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">string</code></span></dt>
                  <dd>
                     <p><code class="literal">java.lang.String</code>&#51004;&#47196;&#48512;&#53552; <code class="literal">VARCHAR</code> (&#46608;&#45716; Oracle <code class="literal">VARCHAR2</code>)&#47196;&#51032; &#53440;&#51077; &#47588;&#54609;. 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">date, time, timestamp</code></span></dt>
                  <dd>
                     <p><code class="literal">java.util.Date</code>&#50752; &#44536;&#44163;&#51032; &#49436;&#48652;&#53364;&#47000;&#49828;&#47196;&#48512;&#53552; SQL &#53440;&#51077;&#46308;&#51064; <code class="literal">DATE</code>, <code class="literal">TIME</code>, <code class="literal">TIMESTAMP</code> (&#46608;&#45716; &#46321;&#44032;&#47932;)&#47196;&#51032; &#53440;&#51077; &#47588;&#54609;&#46308;. 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">calendar, calendar_date</code></span></dt>
                  <dd>
                     <p><code class="literal">java.util.Calendar</code>&#47196;&#48512;&#53552; SQL &#53440;&#51077;&#46308;&#51064; <code class="literal">TIMESTAMP</code>, <code class="literal">DATE</code> (&#46608;&#45716; &#46321;&#44032;&#47932;)&#47196;&#51032; &#53440;&#51077; &#47588;&#54609;&#46308;. 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">big_decimal, big_integer</code></span></dt>
                  <dd>
                     <p><code class="literal">java.math.BigDecimal</code>&#44284; <code class="literal">java.math.BigInteger</code>&#47196;&#48512;&#53552; <code class="literal">NUMERIC</code> (&#46608;&#45716; Oracle <code class="literal">NUMBER</code>)&#47196;&#51032; &#53440;&#51077; &#47588;&#54609;&#46308;. 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">locale, timezone, currency</code></span></dt>
                  <dd>
                     <p><code class="literal">java.util.Locale</code>, <code class="literal">java.util.TimeZone</code>, &#44536;&#47532;&#44256; <code class="literal">java.util.Currency</code>&#47196;&#48512;&#53552; <code class="literal">VARCHAR</code>(&#46608;&#45716; Oracle <code class="literal">VARCHAR2</code>)&#47196;&#51032; &#53440;&#51077; &#47588;&#54609;. <code class="literal">Locale</code>&#44284; <code class="literal">Currency</code>&#51032; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#44536;&#44163;&#46308;&#51032; ISO &#53076;&#46300;&#46308;&#47196; &#47588;&#54609;&#46108;&#45796;. <code class="literal">TimeZone</code>&#51032; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#44536;&#44163;&#46308;&#51032; <code class="literal">ID</code>&#47196; &#47588;&#54609;&#46108;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">class</code></span></dt>
                  <dd>
                     <p><code class="literal">java.lang.Class</code>&#47196;&#48512;&#53552; <code class="literal">VARCHAR</code> (&#46608;&#45716; Oracle <code class="literal">VARCHAR2</code>)&#47196;&#51032; &#53440;&#51077; &#47588;&#54609;. <code class="literal">Class</code>&#45716; &#44536;&#44163;&#51032; &#51204;&#52404; &#49688;&#49885;&#50612;&#44032; &#48537;&#51008; &#51060;&#47492;&#51004;&#47196; &#47588;&#54609;&#46108;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">binary</code></span></dt>
                  <dd>
                     <p>byte &#48176;&#50676;&#46308;&#51012; &#51201;&#51208;&#54620; SQL binary &#53440;&#51077;&#51004;&#47196; &#47588;&#54609;&#49884;&#53416;&#45796;. </p>
                  </dd>
                  <dt><span class="term"><code class="literal">text</code></span></dt>
                  <dd>
                     <p>long Java &#47928;&#51088;&#50676;&#51012; SQL <code class="literal">CLOB</code> &#46608;&#45716; <code class="literal">TEXT</code> &#53440;&#51077;&#51004;&#47196; &#47588;&#54609;&#49884;&#53416;&#45796; 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">serializable</code></span></dt>
                  <dd>
                     <p>serializable Java &#53440;&#51077;&#46308;&#51012; &#51201;&#51208;&#54620; SQL binary &#53440;&#51077;&#51004;&#47196; &#47588;&#54609;&#49884;&#53416;&#45796;. &#45817;&#49888;&#51008; &#46608;&#54620; &#46356;&#54260;&#53944;&#47196; &#44592;&#48376; &#53440;&#51077;&#51060; &#50500;&#45772; serializable &#51088;&#48148; &#53364;&#47000;&#49828; &#46608;&#45716; &#51064;&#53552;&#54168;&#51060;&#49828;&#51032; &#51060;&#47492;&#51012; &#44032;&#51652; Hibernate &#53440;&#51077;
                        <code class="literal">serializable</code>&#51012; &#45208;&#53440;&#45244; &#49688;&#46020; &#51080;&#45796;. 
                     </p>
                  </dd>
                  <dt><span class="term"><code class="literal">clob, blob</code></span></dt>
                  <dd>
                     <p><code class="literal">java.sql.Clob</code>&#50752; <code class="literal">java.sql.Blob</code> JDBC &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54620; &#53440;&#51077; &#47588;&#54609;&#46308;. &#51060;&#46308; &#53440;&#51077;&#46308;&#51008; &#47751;&#47751; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#50640;&#49436;&#45716; &#48520;&#54200;&#54616;&#45796;. &#50780;&#45264;&#54616;&#47732; blob &#46608;&#45716; clob &#44061;&#52404;&#45716; &#53944;&#47004;&#51117;&#49496; &#50808;&#48512;&#50640;&#49436; &#51116;&#49324;&#50857;&#46112; &#49688; &#50630;&#44592; &#46412;&#47928;&#51060;&#45796;.(&#44172;&#45796;&#44032; &#46300;&#46972;&#51060;&#48260; &#51648;&#50896;&#51060; &#48708;&#51068;&#44288;&#51201;&#51060;&#44256; &#54168;&#52824;&#46104;&#50612;&#50556;
                        &#54620;&#45796;) 
                     </p>
                  </dd>
                  <dt><span class="term">
                                                    <code class="literal">imm_date, imm_time, imm_timestamp, imm_calendar, imm_calendar_date, imm_serializable, imm_binary</code>
                                                </span></dt>
                  <dd>
                     <p>&#45824;&#44060; &#44032;&#48320;&#51201;&#51064; Java &#53440;&#51077;&#46308;&#47196; &#44036;&#51452;&#46104;&#45716; &#44163;&#50640; &#45824;&#54620; &#53440;&#51077; &#47588;&#54609;&#46308;. &#50668;&#44592;&#49436; Hibernate&#45716; &#48520;&#48320;&#51201;&#51064; Java &#53440;&#51077;&#46308;&#50640; &#45824;&#54644;&#49436;&#47564; &#51201;&#51208;&#54620; &#50612;&#46500; &#52572;&#51201;&#54868;&#47484; &#54665;&#54616;&#44256;, &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44536; &#44061;&#52404;&#47484; &#48320;&#54624; &#49688; &#50630;&#45716; &#44163;&#51004;&#47196; &#52712;&#44553;&#54620;&#45796;. &#50696;&#47484;
                        &#46308;&#50612;, &#45817;&#49888;&#51008; <code class="literal">imm_timestamp</code>&#47196;&#49436; &#47588;&#54609;&#46108; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; <code class="literal">Date.setTime()</code>&#51012; &#54840;&#52636;&#54616;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;. &#54532;&#47196;&#54140;&#54000;&#51032; &#44050;&#51012; &#48320;&#44221;&#49884;&#53412;&#44256;, &#44536; &#48320;&#44221;&#51012; &#50689;&#49549;&#54868; &#49884;&#53412;&#44592; &#50948;&#54644;&#49436;, &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#54616;&#45208;&#51032; &#49352;&#47196;&#50868; (&#46041;&#51068;&#54616;&#51648; &#50506;&#51008;) &#44061;&#52404;&#47484; &#44536; &#54532;&#47196;&#54140;&#54000;&#50640; &#54624;&#45817;&#54644;&#50556; &#54620;&#45796;. 
                     </p>
                  </dd>
               </dl>
            </div>
            <p>
               
                           
            </p>
            <p>&#50644;&#53944;&#47532;&#46308;&#44284; &#53084;&#47113;&#49496;&#46308;&#51032; &#50976;&#51068; &#49885;&#48324;&#51088;&#46308;&#51008; <code class="literal">binary</code>, <code class="literal">blob</code> &#44536;&#47532;&#44256; <code class="literal">clob</code>&#47484; &#51228;&#50808;&#54620; &#44592;&#48376; &#53440;&#51077; &#51473; &#50612;&#45712; &#44163;&#51068; &#49688; &#51080;&#45796;. (Composite &#49885;&#48324;&#51088;&#46308;&#51060; &#46608;&#54620; &#54728;&#50857;&#46108;&#45796;. &#50500;&#47000;&#47484; &#48372;&#46972;.) 
            </p>
            <p>&#44592;&#48376; value &#53440;&#51077;&#46308;&#51008; <code class="literal">org.hibernate.Hibernate</code>&#50640; &#51221;&#51032;&#46104;&#50612; &#51080;&#45716; &#45824;&#51025;&#54616;&#45716; <code class="literal">Type</code> &#49345;&#49688;&#46308;&#51012; &#44054;&#45716;&#45796;. &#50696;&#47484; &#46308;&#50612;, <code class="literal">Hibernate.STRING</code>&#51008; <code class="literal">string</code> &#53440;&#51077;&#51012; &#54364;&#54788;&#54620;&#45796;. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="mapping-types-custom"></a>5.2.3. &#47582;&#52644;&#54805; value &#53440;&#51077;&#46308;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#44060;&#48156;&#51088;&#46308;&#51060; &#44536;&#46308; &#51088;&#49888;&#46308;&#51032; value &#53440;&#51077;&#46308;&#51012; &#49373;&#49457;&#49884;&#53412;&#45716; &#44163;&#51060; &#49345;&#45824;&#51201;&#51004;&#47196; &#49789;&#45796;. &#50696;&#47484; &#46308;&#50612;, &#45817;&#49888;&#51008; <code class="literal">java.lang.BigInteger</code> &#53440;&#51077;&#51032; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; <code class="literal">VARCHAR</code> &#52972;&#47100;&#46308;&#47196; &#50689;&#49549;&#54868; &#49884;&#53412;&#44256;&#51088; &#50896;&#54624; &#49688; &#51080;&#45796;. Hibernate&#45716; &#51060;&#44163;&#51012; &#50948;&#54620; &#48120;&#47532; &#47564;&#46308;&#50612;&#51652; &#53440;&#51077;&#51012; &#51228;&#44277;&#54616;&#51648; &#50506;&#45716;&#45796;. &#44536;&#47084;&#45208; &#47582;&#52644;&#54805; &#53440;&#51077;&#46308;&#51008; &#54532;&#47196;&#54140;&#54000;(&#46608;&#45716; &#53084;&#47113;&#49496; &#50836;&#49548;)&#47484; &#54616;&#45208;&#51032; &#53580;&#51060;&#48660; &#52972;&#47100;&#51004;&#47196;&#51032; &#47588;&#54609;&#54616;&#45716; &#44163;&#50640; &#51228;&#50557;&#46104;&#51648; &#50506;&#45716;&#45796;.
               &#46384;&#46972;&#49436; &#50696;&#47484; &#46308;&#50612;, &#45817;&#49888;&#51008; <code class="literal">FIRST_NAME</code>, <code class="literal">INITIAL</code>, <code class="literal">SURNAME</code> &#52972;&#47100;&#46308;&#47196; &#50689;&#49549;&#54868; &#46104;&#45716; <code class="literal">java.lang.String</code> &#53440;&#51077;&#51032; &#51088;&#48148; &#54532;&#47196;&#54140;&#54000;<code class="literal">getName()</code>/ <code class="literal">setName()</code>&#47484; &#44032;&#51656; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#47582;&#52644;&#54805; &#53440;&#51077;&#51012; &#44396;&#54788;&#54616;&#47140;&#47732;, <code class="literal">org.hibernate.UserType</code> &#46608;&#45716; <code class="literal">org.hibernate.CompositeUserType</code>&#51012; &#44396;&#54788;&#54616;&#44256; &#44536; &#53440;&#51077;&#51032; &#51204;&#52404; &#49688;&#49885;&#50612;&#44032; &#48537;&#51008; &#53364;&#47000;&#49828;&#47749;&#51012; &#49324;&#50857;&#54616;&#50668; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#49440;&#50616;&#54616;&#46972;. &#44032;&#45733;&#54620; &#51333;&#47448;&#51032; &#44163;&#46308;&#51012; &#48372;&#47140;&#47732; <code class="literal">org.hibernate.test.DoubleStringType</code>&#51012; &#52404;&#53356;&#54616;&#46972;. 
            </p><pre class="programlisting">&lt;property name="twoStrings" type="org.hibernate.test.DoubleStringType"&gt;
    &lt;column name="first_string"/&gt;
    &lt;column name="second_string"/&gt;
&lt;/property&gt;</pre><p>&#54616;&#45208;&#51032; &#54532;&#47196;&#54140;&#54000;&#47484; &#50668;&#47084; &#44060;&#51032; &#52972;&#47100;&#46308;&#47196; &#47588;&#54609;&#49884;&#53412;&#45716; <code class="literal">&lt;column&gt;</code> &#53468;&#44536;&#51032; &#49324;&#50857;&#51012; &#51452;&#47785;&#54616;&#46972;. 
            </p>
            <p><code class="literal">CompositeUserType</code>, <code class="literal">EnhancedUserType</code>, <code class="literal">UserCollectionType</code>, &#44536;&#47532;&#44256; <code class="literal">UserVersionType</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#46308;&#51008; &#45908; &#47566;&#51008; &#53945;&#54868;&#46108; &#49324;&#50857;&#46308;&#51012; &#50948;&#54620; &#51648;&#50896;&#51012; &#51228;&#44277;&#54620;&#45796;. 
            </p>
            <p>&#45817;&#49888;&#51008; &#47588;&#54609; &#54028;&#51068; &#49549;&#50640; <code class="literal">UserType</code>&#50640; &#45824;&#54620; &#54028;&#46972;&#48120;&#53552;&#46308;&#51012; &#51228;&#44277;&#54624; &#49688;&#46020; &#51080;&#45796;. &#51060;&#44163;&#51012; &#54665;&#54616;&#44592; &#50948;&#54644;, &#45817;&#49888;&#51032; <code class="literal">UserType</code>&#51008; <code class="literal">org.hibernate.usertype.ParameterizedType</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54620;&#45796;. &#45817;&#49888;&#51032; &#47582;&#52644;&#54805; &#53440;&#51077;&#50640; &#54028;&#46972;&#48120;&#53552;&#46308;&#51012; &#51228;&#44277;&#54616;&#44592; &#50948;&#54644;, &#45817;&#49888;&#51008; &#45817;&#49888;&#51032; &#47588;&#54609; &#54028;&#51068;&#46308; &#49549;&#50640; <code class="literal">&lt;type&gt;</code> &#50836;&#49548;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. 
            </p><pre class="programlisting">&lt;property name="priority"&gt;
    &lt;type name="com.mycompany.usertypes.DefaultValueIntegerType"&gt;
        &lt;param name="default"&gt;0&lt;/param&gt;
    &lt;/type&gt;
&lt;/property&gt;</pre><p><code class="literal">UserType</code>&#51008; &#51060;&#51228; &#44536;&#44163;&#50640; &#51204;&#45804;&#46108; <code class="literal">Properties</code> &#44061;&#52404;&#47196;&#48512;&#53552; <code class="literal">default</code>&#47196; &#47749;&#47749;&#46108; &#54028;&#46972;&#48120;&#53552;&#50640; &#45824;&#54620; &#44050;&#51012; &#44160;&#49353;&#54624; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#47564;&#51068; &#45817;&#49888;&#51060; &#47588;&#50864; &#51088;&#51452; &#50612;&#46500; UserType&#51012; &#49324;&#50857;&#54624; &#44221;&#50864;, &#44536;&#44163;&#51008; &#44536;&#44163;&#50640; &#45824;&#54620; &#45908; &#51687;&#51008; &#51060;&#47492;&#51012; &#51221;&#51032;&#54616;&#45716; &#44163;&#51060; &#50976;&#50857;&#54624; &#49688; &#51080;&#45796;. <code class="literal">&lt;typedef&gt;</code> &#50836;&#49548;&#47484; &#49324;&#50857;&#54616;&#50668; &#51060;&#44163;&#51012; &#54665;&#54624; &#49688; &#51080;&#45796;. Typedef&#46308;&#51008; &#51060;&#47492;&#51012; &#47582;&#52644;&#54805; &#53440;&#51077;&#50640; &#54624;&#45817;&#54616;&#44256;, &#46608;&#54620; &#47564;&#51068; &#44536; &#53440;&#51077;&#51060; &#54028;&#46972;&#48120;&#53552;&#54868; &#46108; &#44221;&#50864;&#50640; &#46356;&#54260;&#53944; &#54028;&#46972;&#48120;&#53552; &#44050;&#46308;&#51032; &#47532;&#49828;&#53944;&#47484; &#54252;&#54632;&#54624; &#49688;&#46020; &#51080;&#45796;. 
            </p><pre class="programlisting">&lt;typedef class="com.mycompany.usertypes.DefaultValueIntegerType" name="default_zero"&gt;
    &lt;param name="default"&gt;0&lt;/param&gt;
&lt;/typedef&gt;</pre><pre class="programlisting">&lt;property name="priority" type="default_zero"/&gt;</pre><p>property &#47588;&#54609; &#49345;&#50640; type &#54028;&#46972;&#48120;&#53552;&#46308;&#51012; &#49324;&#50857;&#54632;&#51004;&#47196;&#50024; &#44221;&#50864;&#50640; &#47582;&#44172; typedef &#45236;&#50640; &#51228;&#44277;&#46108; &#54028;&#46972;&#48120;&#53552;&#46308;&#51012; &#50724;&#48260;&#46972;&#51060;&#46300; &#49884;&#53412;&#45716; &#44163;&#51060; &#44032;&#45733;&#54616;&#45796;. </p>
            <p>&#48708;&#47197; Hibernate&#51032; &#54413;&#48512;&#54620; &#48276;&#50948;&#51032; &#48120;&#47532; &#47564;&#46308;&#50612;&#51652; &#53440;&#51077;&#46308;&#44284; &#52980;&#54252;&#45324;&#53944;&#46308;&#50640; &#45824;&#54620; &#51648;&#50896;&#51060; &#45817;&#49888;&#51060; &#44032;&#45140; &#47582;&#52644;&#54805; &#53440;&#51077;&#51012; &#49324;&#50857;&#54624; <span class="emphasis"><em>&#54596;&#50836;&#44032;</em></span> &#44144;&#51032; &#50630;&#51012; &#44163;&#51076;&#51012; &#51032;&#48120;&#54624; &#51648;&#46972;&#46020;, &#44536;&#47100;&#50640;&#46020; &#48520;&#44396;&#54616;&#44256; &#44536;&#44163;&#51008; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#51088;&#51452; &#48156;&#49373;&#54616;&#45716; (&#50644;&#54000;&#54000;&#44032; &#50500;&#45772;) &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54644; &#47582;&#52644;&#54805; &#53440;&#51077;&#46308;&#51012; &#49324;&#50857;&#54616;&#45716; &#51339;&#51008; &#54805;&#49885;&#51004;&#47196; &#44036;&#51452;&#46108;&#45796;. &#50696;&#47484; &#46308;&#50612; <code class="literal">MonetaryAmount</code> &#53364;&#47000;&#49828;&#45716; &#48708;&#47197; &#44536;&#44163;&#51060; &#52980;&#54252;&#45324;&#53944;&#47196;&#49436; &#49789;&#44172; &#47588;&#54609;&#46112; &#49688; &#51080;&#51012;&#51648;&#46972;&#46020;, <code class="literal">CompositeUserType</code>&#50640; &#45824;&#54620; &#51339;&#51008; &#54980;&#48372;&#51060;&#45796;. &#51060;&#44163;&#50640; &#45824;&#54620; &#54616;&#45208;&#51032; &#46041;&#44592;&#45716; &#52628;&#49345;&#54868;&#51060;&#45796;. &#47582;&#52644;&#54805; &#53440;&#51077;&#51004;&#47196;, &#45817;&#49888;&#51032; &#47588;&#54609; &#47928;&#49436;&#46308;&#51008; &#54868;&#54224; &#44050;&#46308;&#51012; &#54364;&#54788;&#54616;&#45716; &#45817;&#49888;&#51032; &#48169;&#48277;&#50640;&#49436; &#44032;&#45733;&#54620; &#48320;&#44221;&#46308;&#50640; &#45824;&#54644; &#51109;&#52264; &#44160;&#51613;&#46112; &#44163;&#51060;&#45796;. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="mapping.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="mapping.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="mapping-entityname.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">5&#51109;. &#44592;&#48376; O/R &#47588;&#54609;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;5.3. &#54616;&#45208;&#51032; &#53364;&#47000;&#49828;&#47484; &#54620; &#48264; &#51060;&#49345; &#47588;&#54609;&#54616;&#44592;</td>
            </tr>
         </table>
      </div>
   </body>
</html>