<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>12.2. &#51060;&#48292;&#53944; &#49884;&#49828;&#53596;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="events.html" title="12&#51109;. &#51064;&#53552;&#49481;&#53552;&#46308;&#44284; &#51060;&#48292;&#53944;&#46308;">
      <link rel="prev" href="events.html" title="12&#51109;. &#51064;&#53552;&#49481;&#53552;&#46308;&#44284; &#51060;&#48292;&#53944;&#46308;">
      <link rel="next" href="objectstate-decl-security.html" title="12.3. Hibernate &#49440;&#50616;&#51201;&#51064; &#48372;&#50504;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">12.2. &#51060;&#48292;&#53944; &#49884;&#49828;&#53596;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="events.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">12&#51109;. &#51064;&#53552;&#49481;&#53552;&#46308;&#44284; &#51060;&#48292;&#53944;&#46308;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-decl-security.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="objectstate-events"></a>12.2. &#51060;&#48292;&#53944; &#49884;&#49828;&#53596;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#47564;&#51068; &#45817;&#49888;&#51060; &#45817;&#49888;&#51032; &#50689;&#49549; &#44228;&#52789;&#50640;&#49436; &#53945;&#51221; &#51060;&#48292;&#53944;&#46308;&#50640; &#45824;&#54644; &#48152;&#51025;&#54644;&#50556; &#54620;&#45796;&#47732;, &#45817;&#49888;&#51008; &#46608;&#54620; Hibernate3 <span class="emphasis"><em>event</em></span> &#50500;&#53412;&#53581;&#52376;&#47484; &#49324;&#50857;&#54624; &#49688;&#46020; &#51080;&#45796;. &#51060;&#48292;&#53944; &#49884;&#49828;&#53596;&#51008; &#48512;&#44032;&#47932;&#47196; &#49324;&#50857;&#46112; &#49688; &#51080;&#44144;&#45208; &#51064;&#53552;&#49481;&#53552;&#46308;&#50640; &#45824;&#54620; &#45824;&#52404;&#47932;&#47196; &#49324;&#50857;&#46112; &#49688; &#51080;&#45796;. 
         </p>
         <p>&#48376;&#51656;&#51201;&#51004;&#47196; <code class="literal">Session</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#51032; &#47784;&#46304; &#47700;&#49548;&#46300;&#46308;&#51008; &#51060;&#48292;&#53944;&#50752; &#49436;&#47196; &#44288;&#47144;&#46104;&#50612; &#51080;&#45796;. &#45817;&#49888;&#51008; <code class="literal">LoadEvent</code>, <code class="literal">FlushEvent</code>, &#46321;&#51012; &#44054;&#45716;&#45796; (&#51221;&#51032;&#46108; &#51060;&#48292;&#53944; &#53440;&#51077;&#46308;&#51032; &#51204;&#52404; &#47532;&#49828;&#53944;&#50640; &#45824;&#54644;&#49436;&#45716; XML &#44396;&#49457; &#54028;&#51068; DTD &#46608;&#45716; <code class="literal">org.hibernate.event</code> &#54056;&#53412;&#51648;&#47484; &#52280;&#51312;&#54616;&#46972;). &#54616;&#45208;&#51032; &#50836;&#52397;&#51060; &#51060;&#46308; &#47700;&#49548;&#46300;&#46308; &#51473; &#54616;&#45208;&#50640; &#51032;&#54644; &#47564;&#46308;&#50612;&#51656; &#46412;, Hibernate <code class="literal">Session</code>&#51008; &#51201;&#51208;&#54620; &#51060;&#48292;&#53944;&#47484; &#49373;&#49457;&#49884;&#53412;&#44256; &#44536;&#44163;&#51012; &#44536; &#53440;&#51077;&#51032; &#44396;&#49457;&#46108; &#51060;&#48292;&#53944; &#47532;&#49828;&#45320;&#50640;&#44172; &#51204;&#45804;&#54620;&#45796;. &#48149;&#49905;&#50630;&#51060;, &#51060;&#46308; &#47532;&#49828;&#45320;&#46308;&#51008; &#44536;&#46308; &#47700;&#49548;&#46300;&#46308;&#51060; &#54637;&#49345; &#44480;&#44208;&#46104;&#50632;&#45912; &#46041;&#51068;&#54620; &#54532;&#47196;&#49464;&#49905;&#51012; &#44396;&#54788;&#54620;&#45796;. &#54616;&#51648;&#47564; &#45817;&#49888;&#51060; &#47532;&#49828;&#45320; &#51064;&#53552;&#54168;&#51060;&#49828;&#46308; &#51473; &#54616;&#45208;&#51032; &#47582;&#52644;&#51012;
            &#44396;&#54788;&#54616;&#45716; &#44163;&#51060; &#51088;&#50976;&#47213;&#44256;(&#50696;&#47484; &#46308;&#50612; <code class="literal">LoadEvent</code>&#45716; <code class="literal">LoadEventListener</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#51032; &#46321;&#47197;&#46108; &#44396;&#54788;&#50640; &#51032;&#54644; &#52376;&#47532;&#46108;&#45796;), &#44536; &#44221;&#50864;&#50640; &#44536;&#46308; &#44396;&#54788;&#51008; <code class="literal">Session</code>&#50640; &#45824;&#54644; &#54665;&#54644;&#51652; &#51076;&#51032;&#51032; <code class="literal">load()</code> &#50836;&#52397;&#46308;&#51012; &#52376;&#47532;&#54624; &#52293;&#51076;&#51060; &#51080;&#51012; &#44163;&#51060;&#45796;. 
         </p>
         <p>&#47532;&#49828;&#45320;&#46308;&#51008; &#54952;&#50984;&#51201;&#51060;&#44172;&#45140; &#49905;&#44544;&#53668;(singleton)&#46308;&#47196; &#44036;&#51452;&#46104;&#50612;&#50556; &#54624; &#44163;&#51060;&#45796;; &#51060;&#44163;&#51008; &#44536;&#44163;&#46308;&#51060; &#50836;&#52397;&#46308; &#49324;&#51060;&#50640;&#49436; &#44277;&#50976;&#46104;&#44256;, &#46384;&#46972;&#49436; &#51076;&#51032;&#51032; &#49345;&#53468;&#47484; &#51064;&#49828;&#53556;&#49828; &#48320;&#49688;&#46308;&#47196;&#49436; &#51200;&#51109;&#54616;&#51648; &#47568;&#50500;&#50556; &#54632;&#51012; &#51032;&#48120;&#54620;&#45796;. </p>
         <p>&#47582;&#52644;&#54805; &#47532;&#49828;&#45320;&#45716; &#44536;&#44163;&#51060; &#54200;&#51032;&#51201;&#51064; &#44592;&#51200; &#53364;&#47000;&#49828;&#46308;(&#46608;&#45716; &#47532;&#49828;&#45320;&#46308;&#51060; &#51060; &#50857;&#46020;&#47196; final&#51060; &#50500;&#45772; &#44163;&#51004;&#47196; &#49440;&#50616;&#46104;&#48064;&#47196; Hibernate out-of-the-box&#50640; &#51032;&#54644; &#49324;&#50857;&#46108; &#46356;&#54260;&#53944; &#51060;&#48292;&#53944; &#47532;&#49828;&#45320;&#46308;) &#51473; &#54616;&#45208;&#47484; &#52376;&#47532;&#54616;&#44256;/&#54616;&#44144;&#45208;
            &#54869;&#51109;&#54616;&#44256;&#51088; &#50896;&#54616;&#45716; &#51060;&#48292;&#53944;&#46308;&#50640; &#45824;&#54644; &#51201;&#51208;&#54620; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54620;&#45796;. &#47582;&#52644;&#54805; &#47532;&#49828;&#45320;&#46308;&#51008; <code class="literal">Configuration</code> &#44061;&#52404;&#47484; &#53685;&#54644; &#54532;&#47196;&#44536;&#47016; &#49345;&#51004;&#47196; &#46321;&#47197;&#46112; &#49688; &#51080;&#44144;&#45208;, Hibernate &#44396;&#49457; XML &#49549;&#50640; &#51648;&#51221;&#46112; &#49688; &#51080;&#45796; (properties &#54028;&#51068;&#51012; &#53685;&#54620; &#49440;&#50616;&#51201;&#51064; &#44396;&#49457;&#51008; &#51648;&#50896;&#46104;&#51648; &#50506;&#45716;&#45796;). &#45796;&#51020;&#51008; &#47582;&#52644;&#54805; load &#51060;&#48292;&#53944; &#47532;&#49828;&#45320;&#50640; &#45824;&#54620; &#50696;&#51228;&#51060;&#45796;:
            
         </p><pre class="programlisting">public class MyLoadListener implements LoadEventListener {
    // this is the single method defined by the LoadEventListener interface
    public void onLoad(LoadEvent event, LoadEventListener.LoadType loadType)
            throws HibernateException {
        if ( !MySecurity.isAuthorized( event.getEntityClassName(), event.getEntityId() ) ) {
            throw MySecurityException("Unauthorized access");
        }
    }
}</pre><p>&#45817;&#49888;&#51008; &#46608;&#54620; &#46356;&#54260;&#53944; &#47532;&#49828;&#45320;&#50640; &#45927;&#48537;&#50668; &#44536; &#47532;&#49828;&#45320;&#47484; &#49324;&#50857;&#54616;&#46020;&#47197; Hibernate&#50640;&#44172; &#50508;&#47140;&#51452;&#45716; &#44396;&#49457; &#50644;&#53944;&#47532;&#47484; &#54596;&#50836;&#47196; &#54620;&#45796;: </p><pre class="programlisting">&lt;hibernate-configuration&gt;
    &lt;session-factory&gt;
        ...
        &lt;event type="load"&gt;
            &lt;listener class="com.eg.MyLoadListener"/&gt;
            &lt;listener class="org.hibernate.event.def.DefaultLoadEventListener"/&gt;
        &lt;/event&gt;
    &lt;/session-factory&gt;
&lt;/hibernate-configuration&gt;</pre><p>&#45824;&#49888;&#50640; &#45817;&#49888;&#51008; &#44536;&#44163;&#51012; &#54532;&#47196;&#44536;&#47000;&#48141; &#48169;&#49885;&#51004;&#47196; &#46321;&#47197;&#54624; &#49688;&#46020; &#51080;&#45796;: </p><pre class="programlisting">Configuration cfg = new Configuration();
LoadEventListener[] stack = { new MyLoadListener(), new DefaultLoadEventListener() };
cfg.EventListeners().setLoadEventListeners(stack);</pre><p>&#49440;&#50616;&#51201;&#51004;&#47196; &#46321;&#47197;&#46108; &#47532;&#49828;&#45320;&#46308;&#51008; &#51064;&#49828;&#53556;&#49828;&#46308;&#51012; &#44277;&#50976;&#54624; &#49688; &#50630;&#45796;. &#47564;&#51068; &#46041;&#51068;&#54620; &#53364;&#47000;&#49828; &#51060;&#47492;&#51060; &#50668;&#47084; &#44060;&#51032; <code class="literal">&lt;listener/&gt;</code> &#50836;&#49548;&#46308;&#50640;&#49436; &#49324;&#50857;&#46112; &#44221;&#50864;, &#44033;&#44033;&#51032; &#52280;&#51312;&#45716; &#44536; &#53364;&#47000;&#49828;&#50640; &#45824;&#54620; &#48324;&#46020;&#51032; &#51064;&#49828;&#53556;&#49828;&#47196; &#44480;&#44208;&#46112; &#44163;&#51060;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#47532;&#49828;&#45320; &#53440;&#51077;&#46308; &#49324;&#51060;&#50640;&#49436; &#47532;&#49828;&#45320; &#51064;&#49828;&#53556;&#49828;&#46308;&#51012; &#44277;&#50976;&#54624; &#44032;&#50857;&#49457;&#51012; &#54596;&#50836;&#47196; &#54624; &#44221;&#50864; &#45817;&#49888;&#51008; &#54532;&#47196;&#44536;&#47000;&#48141; &#48169;&#49885;&#51032; &#46321;&#47197; &#51217;&#44540;&#48277;&#51012;
            &#49324;&#50857;&#54644;&#50556; &#54620;&#45796;. 
         </p>
         <p>&#44396;&#49457; &#46041;&#50504;&#50640; &#50780; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54616;&#44256; &#53945;&#51221; &#53440;&#51077;&#51012; &#51648;&#51221;&#54616;&#45716;&#44032;? &#47932;&#47200; &#47532;&#49828;&#45320; &#44396;&#54788;&#51008; &#50668;&#47084; &#44060;&#51032; &#51060;&#48292;&#53944; &#47532;&#49828;&#45320; &#51064;&#53552;&#54168;&#51060;&#49828;&#46308;&#51012; &#44396;&#54788;&#54624; &#49688; &#51080;&#45796;. &#46321;&#47197; &#46041;&#50504;&#50640; &#52628;&#44032;&#51201;&#51004;&#47196; &#53440;&#51077;&#51012; &#51221;&#51032;&#54616;&#45716; &#44163;&#51008; &#52968;&#54588;&#44536;&#47112;&#51060;&#49496; &#46041;&#50504;&#50640; &#47582;&#52644;&#54805; &#47532;&#49828;&#45320;&#46308;&#51032;
            &#49324;&#50857; &#50668;&#48512;&#47484; &#51204;&#54872;&#49884;&#53412;&#45716; &#44163;&#51012; &#45908; &#49789;&#44172; &#54644;&#51456;&#45796;. 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="events.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="events.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-decl-security.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">12&#51109;. &#51064;&#53552;&#49481;&#53552;&#46308;&#44284; &#51060;&#48292;&#53944;&#46308;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;12.3. Hibernate &#49440;&#50616;&#51201;&#51064; &#48372;&#50504;</td>
            </tr>
         </table>
      </div>
   </body>
</html>