<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>10.11. Transitive persistence(&#51204;&#51060; &#50689;&#49549;)</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="objectstate.html" title="10&#51109;. &#44061;&#52404;&#46308;&#47196; &#51089;&#50629;&#54616;&#44592;">
      <link rel="prev" href="objectstate-flushing.html" title="10.10. Session&#51012; flush &#49884;&#53412;&#44592;">
      <link rel="next" href="objectstate-metadata.html" title="10.12. &#47700;&#53440;&#45936;&#51060;&#53552; &#49324;&#50857;&#54616;&#44592;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">10.11. Transitive persistence(&#51204;&#51060; &#50689;&#49549;)</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-flushing.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">10&#51109;. &#44061;&#52404;&#46308;&#47196; &#51089;&#50629;&#54616;&#44592;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-metadata.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="objectstate-transitive"></a>10.11. Transitive persistence(&#51204;&#51060; &#50689;&#49549;)
                  </h2>
               </div>
            </div>
         </div>
         <p>&#53945;&#55176; &#45817;&#49888;&#51060; &#50672;&#44288;&#46108; &#44061;&#52404;&#46308;&#51032; &#44536;&#47000;&#54532;&#47484; &#45796;&#47344; &#44221;&#50864;&#50640;, &#53945;&#55176; &#44060;&#48324; &#44061;&#52404;&#46308;&#51012; &#51200;&#51109;&#54616;&#44256;, &#49325;&#51228;&#54616;&#44144;&#45208;, &#51116;&#52392;&#48512;&#49884;&#53412;&#45716; &#44163;&#51060; &#44900; &#48264;&#44144;&#47213;&#45796;. &#44277;&#53685;&#46108; &#44221;&#50864;&#45716; &#54616;&#45208;&#51032; &#48512;&#47784;/&#51088;&#49885; &#44288;&#44228;&#51060;&#45796;. &#45796;&#51020; &#50696;&#51228;&#47484; &#44160;&#53664;&#54616;&#51088;: </p>
         <p>&#47564;&#51068; &#48512;&#47784;/&#51088;&#49885; &#44288;&#44228;&#50640;&#49436; &#51088;&#49885;&#46308;&#51060; &#44050;(value) &#53440;&#51077;(&#50696;&#47484; &#46308;&#47732;. &#51452;&#49548;&#46308; &#46608;&#45716; &#47928;&#51088;&#50676;&#46308;&#51012; &#44032;&#51652; &#54616;&#45208;&#51032; &#53084;&#47113;&#49496;)&#51068; &#44221;&#50864;, &#44536;&#44163;&#46308;&#51032; &#49373;&#47749;&#51452;&#44592;&#45716; &#48512;&#47784;&#50640; &#51032;&#51316;&#54624; &#44163;&#51060;&#44256; &#49345;&#53468; &#48320;&#44221;&#46308;&#50640; &#45824;&#54644; &#54200;&#47532;&#54620; "&#52992;&#49828;&#52992;&#51060;&#46377;"&#50640; &#45908; &#51060;&#49345;&#51032; &#50529;&#49496;&#51060;
            &#54596;&#50836;&#54616;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;. &#47564;&#51068; &#48512;&#47784;&#44032; &#51200;&#51109;&#46112; &#46412;, &#44050;(value)-&#53440;&#51077;&#51032; &#51088;&#49885; &#44061;&#52404;&#46308;&#46020; &#47560;&#52268;&#44032;&#51648;&#47196; &#51200;&#51109;&#46104;&#44256;, &#48512;&#47784;&#44032; &#49325;&#51228;&#46112; &#46412;, &#51088;&#49885;&#46308;&#51060; &#49325;&#51228;&#46112; &#44163;&#51060;&#45796;. &#51060;&#44163;&#51008; &#49900;&#51648;&#50612; &#53084;&#47113;&#49496;&#51004;&#47196;&#48512;&#53552; &#54616;&#45208;&#51032; &#51088;&#49885;&#51012; &#51228;&#44144;&#54616;&#45716; &#44536;&#47088; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#50640;
            &#45824;&#54644;&#49436;&#46020; &#46041;&#51089;&#54620;&#45796;; Hibernate&#45716; &#51060;&#44163;&#51012; &#44160;&#52636;&#54616;&#44256;, &#44050;(value)-&#53440;&#51077;&#51032; &#44061;&#52404;&#46308;&#51008; &#52280;&#51312;&#47484; &#44277;&#50976;&#54624; &#49688; &#50630;&#51004;&#48064;&#47196;, &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196;&#48512;&#53552; &#44536; &#51088;&#49885;&#51012; &#49325;&#51228;&#49884;&#53416;&#45796;. 
         </p>
         <p>&#51060;&#51228; &#44050;(value) &#53440;&#51077;&#51060; &#50500;&#45772;, &#50644;&#54000;&#54000;&#46308;&#51064; &#48512;&#47784;&#50752; &#51088;&#49885; &#44061;&#52404;&#46308;&#51012; &#44032;&#51652; &#46041;&#51068;&#54620; &#49884;&#45208;&#47532;&#50724;&#47484; &#44160;&#53664;&#54616;&#51088;(&#50696;&#47484; &#46308;&#47732;. &#52852;&#53580;&#44256;&#47532;&#46308;&#44284; &#50500;&#51060;&#53596;&#46308;, &#46608;&#45716; &#48512;&#47784; &#44256;&#50577;&#51060;&#45208; &#51088;&#49885; &#44256;&#50577;&#51060;). &#50644;&#54000;&#54000;&#46308;&#51008; &#44536;&#44163;&#46308; &#51088;&#49888;&#51032; &#49373;&#47749;&#51452;&#44592;&#47484; &#44054;&#44256;, &#44277;&#50976;&#46108;
            &#52280;&#51312;&#46308;&#51012; &#51648;&#50896;&#54616;&#44256; (&#46384;&#46972;&#49436; &#53084;&#47113;&#49496;&#51004;&#47196;&#48512;&#53552; &#54616;&#45208;&#51032; &#50644;&#54000;&#54000;&#47484; &#51228;&#44144;&#54616;&#45716; &#44163;&#51008; &#44536;&#44163;&#51060; &#49325;&#51228;&#46112; &#49688; &#51080;&#51020;&#51012; &#51032;&#48120;&#54616;&#51648; &#50506;&#45716;&#45796;), &#44536;&#47532;&#44256; &#46356;&#54260;&#53944;&#47196; &#54616;&#45208;&#51032; &#50644;&#54000;&#54000;&#47196;&#48512;&#53552; &#50612;&#46500; &#45796;&#47480; &#50672;&#44288;&#46108; &#50644;&#54000;&#54000;&#46308;&#47196;&#51032; &#49345;&#53468;&#51032; &#52992;&#49828;&#52992;&#51060;&#46377;&#51008; &#51316;&#51116;&#54616;&#51648; &#50506;&#45716;&#45796;.
            Hibernate&#45716; &#46356;&#54260;&#53944;&#47196; <span class="emphasis"><em>&#46020;&#45804;&#44032;&#45733;&#49457;&#50640; &#51032;&#54620; &#50689;&#49549;&#49457;(persistence by reachability)</em></span>&#51012; &#44396;&#54788;&#54616;&#51648; &#50506;&#45716;&#45796;. 
         </p>
         <p>- <code class="literal">persist(), merge(), saveOrUpdate(), delete(), lock(), refresh(), evict(), replicate()</code>&#47484; &#54252;&#54632;&#54616;&#45716;- Hibernate &#49464;&#49496;&#50640; &#45824;&#54620; &#44033;&#44033;&#51032; &#44592;&#48376; &#50724;&#54140;&#47112;&#51060;&#49496;&#50640; &#45824;&#54644;&#49436; &#54616;&#45208;&#51032; &#45824;&#51025;&#54616;&#45716; &#52992;&#49828;&#52992;&#51060;&#46377; &#49828;&#53440;&#51068;&#51060; &#51316;&#51116;&#54620;&#45796;. &#52992;&#49828;&#52992;&#51060;&#46300; &#49828;&#53440;&#51068;&#46308; &#44033;&#44033;&#51008; <code class="literal">create, merge, save-update, delete, lock, refresh, evict, replicate</code>&#47196; &#47749;&#47749;&#46108;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#54616;&#45208;&#51032; &#50724;&#54140;&#47112;&#51060;&#49496;&#51060; &#54616;&#45208;&#51032; &#50672;&#44288;&#50640; &#46384;&#46972; &#52992;&#49828;&#52992;&#51060;&#46377;&#46104;&#45716; &#44163;&#51012; &#50896;&#54624; &#44221;&#50864;, &#45817;&#49888;&#51008; &#47588;&#54609; &#47928;&#49436; &#45236;&#50640; &#44536;&#44163;&#51012; &#51648;&#49884;&#54644;&#50556; &#54620;&#45796;. &#50696;&#47484; &#46308;&#47732;: 
         </p><pre class="programlisting">&lt;one-to-one name="person" cascade="persist"/&gt;</pre><p>&#52992;&#49828;&#52992;&#51060;&#46377; &#49828;&#53440;&#51068;&#46308;&#51060; &#44208;&#54633;&#46112; &#49688;&#46020; &#51080;&#45796;: </p><pre class="programlisting">&lt;one-to-one name="person" cascade="persist,delete,lock"/&gt;</pre><p>&#45817;&#49888;&#51008; <span class="emphasis"><em>&#47784;&#46304;</em></span> &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51060; &#44536; &#50672;&#44288;&#50640; &#46384;&#46972; &#52992;&#49828;&#52992;&#51060;&#46300; &#46104;&#50612;&#50556; &#54632;&#51012; &#51648;&#51221;&#54616;&#45716;&#45936; <code class="literal">cascade="all"</code>&#51012; &#49324;&#50857;&#54624; &#49688;&#46020; &#51080;&#45796;. &#46356;&#54260;&#53944;<code class="literal">cascade="none"</code>&#51008; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51060; &#52992;&#49828;&#52992;&#51060;&#46300; &#46104;&#51648; &#50506;&#51012; &#44163;&#51076;&#51012; &#51648;&#51221;&#54620;&#45796;. 
         </p>
         <p>&#53945;&#51221;&#54620; &#52992;&#49828;&#52992;&#51060;&#46300; &#49828;&#53440;&#51068;&#51064;, <code class="literal">delete-orphan</code>&#51008; &#50724;&#51649; one-to-many &#50672;&#44288;&#46308;&#50640;&#47564; &#51201;&#50857;&#46104;&#44256;, <code class="literal">delete()</code> &#50724;&#54140;&#47112;&#51060;&#49496;&#51060; &#44536; &#50672;&#44288;&#51004;&#47196;&#48512;&#53552; &#51228;&#44144;&#46104;&#45716; &#51076;&#51032;&#51032; &#51088;&#49885; &#44061;&#52404;&#50640; &#51201;&#50857;&#46104;&#50612;&#50556; &#54632;&#51012; &#45208;&#53440;&#45240;&#45796;. 
         </p>
         <p>&#44428;&#51109;&#49324;&#54637;&#46308; : </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>&#54616;&#45208;&#51032; <code class="literal">&lt;many-to-one&gt;</code> &#46608;&#45716; <code class="literal">&lt;many-to-many&gt;</code> &#50672;&#44288;&#50640; &#45824;&#54644; &#52992;&#49828;&#52992;&#51060;&#46300;&#47484; &#44032;&#45733;&#54616;&#44172; &#54616;&#45716; &#44163;&#51008; &#45824;&#44060; &#51032;&#48120;&#44032; &#50630;&#45796;. &#52992;&#49828;&#52992;&#51060;&#46300;&#45716; <code class="literal">&lt;one-to-one&gt;</code> &#50672;&#44288;&#44284; <code class="literal">&lt;one-to-many&gt;</code> &#50672;&#44288;&#50640; &#45824;&#54644; &#51333;&#51333; &#50976;&#50857;&#54616;&#45796;. 
                  </p>
               </li>
               <li>
                  <p>&#47564;&#51068; &#51088;&#49885; &#44061;&#52404;&#51032; &#49688;&#47749;&#51060; &#44536; &#48512;&#47784; &#44061;&#52404;&#51032; &#49688;&#47749;&#50640; &#47926;&#50668;&#51256; &#51080;&#51012; &#44221;&#50864;, <code class="literal">cascade="all,delete-orphan"</code>&#51012; &#51648;&#51221;&#54632;&#51004;&#47196;&#50024; &#44536;&#44163;&#51012; <span class="emphasis"><em>&#49373;&#47749; &#51452;&#44592; &#44061;&#52404;</em></span>&#47196; &#47564;&#46308;&#50612;&#46972;. 
                  </p>
               </li>
               <li>
                  <p>&#44536; &#48150;&#51032; &#44221;&#50864;, &#45817;&#49888;&#51008; &#52992;&#49828;&#52992;&#51060;&#46300;&#47484; &#51204;&#54784; &#54596;&#50836;&#47196; &#54616;&#51648; &#50506;&#51012; &#49688; &#51080;&#45796;. &#44536;&#47084;&#45208; &#47564;&#51068; &#45817;&#49888;&#51060; &#46041;&#51068;&#54620; &#53944;&#47004;&#51117;&#49496; &#45236;&#50640;&#49436; &#48512;&#47784;&#50752; &#51088;&#49885;&#50640; &#45824;&#54644; &#51088;&#51452; &#54632;&#44760; &#51089;&#50629;&#54616;&#44172; &#46112; &#44163;&#51060;&#46972; &#49373;&#44033;&#46104;&#44256;, &#45817;&#49888; &#49828;&#49828;&#47196; &#53440;&#51060;&#54609; &#54616;&#45716; &#44163;&#51012; &#51208;&#50557;&#54616;&#44256;&#51088; &#50896;&#54624;
                     &#44221;&#50864;, <code class="literal">cascade="persist,merge,save-update"</code>&#47484; &#49324;&#50857;&#54616;&#45716; &#44163;&#51012; &#44256;&#47140;&#54616;&#46972;. 
                  </p>
               </li>
            </ul>
         </div>
         <p><code class="literal">cascade="all"</code>&#51012; &#44032;&#51652; (&#45800;&#51068; &#44050; &#50672;&#44288;&#51060;&#46304; &#54616;&#45208;&#51032; &#53084;&#47113;&#49496;&#51060;&#46304;) &#54616;&#45208;&#51032; &#50672;&#44288;&#51012; &#47588;&#54609;&#49884;&#53412;&#45716; &#44163;&#51008; &#44536; &#50672;&#44288;&#51012; &#48512;&#47784;&#51032; &#51200;&#51109;/&#50629;&#45936;&#51060;&#53944;/&#49325;&#51228;&#44032; &#51088;&#49885; &#46608;&#45716; &#51088;&#49885;&#46308;&#51032; &#51200;&#51109;/&#50629;&#45936;&#51060;&#53944;/&#49325;&#51228;&#47196; &#44480;&#44208;&#46104;&#45716; <span class="emphasis"><em>&#48512;&#47784;/&#51088;&#49885;</em></span> &#49828;&#53440;&#51068;&#51032; &#44288;&#44228;&#47196; &#47560;&#53356;&#54620;&#45796;. 
         </p>
         <p>&#44172;&#45796;&#44032;, &#54616;&#45208;&#51032; &#50689;&#49549; &#48512;&#47784;&#47196;&#48512;&#53552; &#54616;&#45208;&#51032; &#51088;&#49885;&#50640; &#45824;&#54620; &#45800;&#49692;&#54620; &#52280;&#51312;&#45716; &#51088;&#49885;&#51032; &#51200;&#51109;/&#50629;&#45936;&#51060;&#53944;&#47196; &#44480;&#44208;&#46112; &#44163;&#51060;&#45796;. &#54616;&#51648;&#47564; &#51060; &#47700;&#53440;&#54252;&#45716; &#48520;&#50756;&#51204;&#54616;&#45796;. &#44536;&#44163;&#51032; &#48512;&#47784;&#50640; &#51032;&#54644; &#52280;&#51312; &#54644;&#51228;&#46104;&#45716; &#51088;&#49885;&#51008; <code class="literal">cascade="delete-orphan"</code>&#51004;&#47196; &#47588;&#54609;&#46108; &#54616;&#45208;&#51032; <code class="literal">&lt;one-to-many&gt;</code> &#50672;&#44288;&#51032; &#44221;&#50864;&#47484; &#51228;&#50808;&#54616;&#47732;, &#51088;&#46041;&#51201;&#51004;&#47196; &#49325;&#51228;&#46104;&#51648; <span class="emphasis"><em>&#50506;&#45716;&#45796;</em></span>. &#54616;&#45208;&#51032; &#48512;&#47784;/&#51088;&#49885; &#44288;&#44228;&#50640; &#45824;&#54620; &#52992;&#49828;&#52992;&#51060;&#46377; &#50724;&#54140;&#47112;&#51060;&#49496;&#51032; &#51221;&#54869;&#54620; &#51032;&#48120;&#45716; &#45796;&#51020;&#44284; &#44057;&#45796;: 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>&#47564;&#51068; &#48512;&#47784;&#44032; <code class="literal">persist()</code>&#50640; &#51204;&#45804;&#46112; &#44221;&#50864;, &#47784;&#46304; &#51088;&#49885;&#46308;&#51060; <code class="literal">persist()</code>&#50640; &#51204;&#45804;&#46108;&#45796; 
                  </p>
               </li>
               <li>
                  <p>&#47564;&#51068; &#48512;&#47784;&#44032; <code class="literal">merge()</code>&#50640; &#51204;&#45804;&#46112; &#44221;&#50864;, &#47784;&#46304; &#51088;&#49885;&#46308;&#51060; <code class="literal">merge()</code>&#50640; &#51204;&#45804;&#46108;&#45796; 
                  </p>
               </li>
               <li>
                  <p>&#47564;&#51068; &#48512;&#47784;&#44032; <code class="literal">save()</code>, <code class="literal">update()</code> &#46608;&#45716; <code class="literal">saveOrUpdate()</code>&#50640; &#51204;&#45804;&#46112; &#44221;&#50864;, &#47784;&#46304; &#51088;&#49885;&#46308;&#51060; <code class="literal">saveOrUpdate()</code>&#50640; &#51204;&#45804;&#46108;&#45796; 
                  </p>
               </li>
               <li>
                  <p>&#47564;&#51068; transient &#46608;&#45716; detached &#51088;&#49885;&#51060; &#50689;&#49549; &#48512;&#47784;&#50640; &#51032;&#54644; &#52280;&#51312;&#46112; &#44221;&#50864;, &#44536;&#44163;&#51008; <code class="literal">saveOrUpdate()</code>&#50640; &#51204;&#45804;&#46108;&#45796; 
                  </p>
               </li>
               <li>
                  <p>&#47564;&#51068; &#48512;&#47784;&#44032; &#49325;&#51228;&#46112; &#44221;&#50864;, &#47784;&#46304; &#51088;&#49885;&#46308;&#51060; <code class="literal">delete()</code>&#50640; &#51204;&#45804;&#46108;&#45796; 
                  </p>
               </li>
               <li>
                  <p>&#47564;&#51068; &#51088;&#49885;&#51060; &#50689;&#49549; &#48512;&#47784;&#50640; &#51032;&#54644; &#52280;&#51312; &#54644;&#51228; &#46112; &#44221;&#50864;, <code class="literal">cascade="delete-orphan"</code>&#51060; &#50500;&#45772; &#54620;, <span class="emphasis"><em>&#53945;&#48324;&#54620; &#50612;&#46500; &#44163;&#46020; &#48156;&#49373;&#54616;&#51648; &#50506;&#45716;&#45796;</em></span> - &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#54596;&#50836;&#54620; &#44221;&#50864;&#50640; &#51088;&#49885;&#51012; &#47749;&#49884;&#51201;&#51004;&#47196; &#49325;&#51228;&#54644;&#50556; &#54620;&#45796; -, <code class="literal">cascade="delete-orphan"</code>&#51064; &#44221;&#50864;&#50640; "orphaned(&#44256;&#50500;)"&#51064; &#44221;&#50864; &#51088;&#49885;&#51060; &#49325;&#51228;&#46108;&#45796;. 
                  </p>
               </li>
            </ul>
         </div>
         <p>&#47560;&#51648;&#47561;&#51004;&#47196; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51032; &#52992;&#49828;&#52992;&#51060;&#46377;&#51060; <span class="emphasis"><em>&#54840;&#52636; &#49884;&#51216;</em></span>&#50640;&#49436; &#46608;&#45716; <span class="emphasis"><em>flush &#49884;&#51216;</em></span>&#50640;&#49436; &#44061;&#52404; &#44536;&#47000;&#54532;&#50640; &#51201;&#50857;&#46112; &#49688; &#51080;&#51020;&#51012; &#45432;&#53944;&#54616;&#46972;. &#51060;&#50857; &#44032;&#45733;&#54624; &#44221;&#50864;&#50640; &#47784;&#46304; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51008; &#44536; &#50724;&#54140;&#47112;&#51060;&#49496;&#51060; &#49892;&#54665;&#46112; &#46412; &#46020;&#45804; &#44032;&#45733;&#54620; &#50672;&#44288;&#46108; &#50644;&#54000;&#54000;&#46308;&#50640; &#45824;&#54644; &#52992;&#49828;&#52992;&#51060;&#46300; &#46108;&#45796;. &#54616;&#51648;&#47564; <code class="literal">save-upate</code>&#50752; <code class="literal">delete-orphan</code>&#51008; <code class="literal">Session</code>&#51032; flush &#46041;&#50504;&#50640; &#46020;&#45804; &#44032;&#45733;&#54620; &#47784;&#46304; &#50672;&#44288;&#46108; &#50644;&#54000;&#54000;&#46308;&#50640; &#45824;&#54644; &#51060;&#54665;&#51201;(transitive)&#51060;&#45796;. 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-flushing.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="objectstate.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-metadata.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.10. Session&#51012; flush &#49884;&#53412;&#44592;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;10.12. &#47700;&#53440;&#45936;&#51060;&#53552; &#49324;&#50857;&#54616;&#44592;</td>
            </tr>
         </table>
      </div>
   </body>
</html>