<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>10&#51109;. &#44061;&#52404;&#46308;&#47196; &#51089;&#50629;&#54616;&#44592;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="inheritance-limitations.html" title="9.2. &#51228;&#50557;&#46308;">
      <link rel="next" href="objectstate-makingpersistent.html" title="10.2. &#44061;&#52404;&#46308;&#51012; &#50689;&#49549;&#54868; &#49884;&#53412;&#44592;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">10&#51109;. &#44061;&#52404;&#46308;&#47196; &#51089;&#50629;&#54616;&#44592;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="inheritance-limitations.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-makingpersistent.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="objectstate"></a>10&#51109;. &#44061;&#52404;&#46308;&#47196; &#51089;&#50629;&#54616;&#44592;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate&#45716; &#44592;&#48376; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44288;&#47532; &#49884;&#49828;&#53596;&#51032; &#49345;&#49464;&#47196;&#48512;&#53552; &#44060;&#48156;&#51088;&#46308;&#51012; &#51008;&#54224;&#49884;&#53020;&#51460; &#49104;&#47564; &#50500;&#45768;&#46972;, &#46608;&#54620; &#44061;&#52404;&#46308;&#50640; &#45824;&#54620; <span class="emphasis"><em>&#49345;&#53468; &#44288;&#47532;</em></span>&#47484; &#51228;&#44277;&#54616;&#45716; &#54616;&#45208;&#51032; &#50756;&#51204;&#54620; &#44061;&#52404;/&#44288;&#44228;&#54805; &#47588;&#54609; &#49556;&#47336;&#49496;&#51060;&#45796;. &#51060;&#44163;&#51008; &#44277;&#53685;&#51201;&#51064; JDBC/SQL &#50689;&#49549; &#44228;&#52789;&#46308; &#45236;&#50640;&#49436;&#51032; SQL <code class="literal">&#47928;&#51109;&#46308;</code>&#50640; &#45824;&#54620; &#44288;&#47532;&#50752;&#45716; &#48152;&#45824;&#47196;, &#51088;&#48148; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#50640;&#49436; &#50689;&#49549;&#50640; &#44288;&#54620; &#47588;&#50864; &#44256;&#50976;&#54620; &#44061;&#52404;-&#51648;&#54693;&#51201; &#44288;&#51216;&#51060;&#45796;. 
         </p>
         <p>&#45804;&#47532; &#47568;&#54644;, Hibernate &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44060;&#48156;&#51088;&#46308;&#51008; &#44536;&#46308;&#51032; &#44061;&#52404;&#46308;&#51032; <span class="emphasis"><em>&#49345;&#53468;</em></span>&#50640; &#45824;&#54644; &#54637;&#49345; &#49373;&#44033;&#54644;&#50556; &#54616;&#44256;, SQL &#47928;&#51109;&#46308;&#51032; &#49892;&#54665;&#50640; &#45824;&#54644;&#49436;&#45716; &#54596;&#49688;&#51201;&#51060;&#51648; &#50506;&#45796;. &#51060; &#48512;&#48516;&#51008; Hibernate&#50640; &#51032;&#54644; &#52376;&#47532;&#46104;&#44256; &#49884;&#49828;&#53596;&#51032; &#54140;&#54252;&#47676;&#49828;&#47484; &#53916;&#45789;&#54624; &#46412; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44060;&#48156;&#51088;&#50752; &#50976;&#51068;&#54616;&#44172; &#44288;&#47144;&#46108;&#45796;. 
         </p>
         <div class="sect1" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="objectstate-overview"></a>10.1. Hibernate &#44061;&#52404; &#49345;&#53468;&#46308;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Hibernate &#45796;&#51020; &#44061;&#52404; &#49345;&#53468;&#46308;&#51012; &#51221;&#51032;&#54616;&#44256; &#51648;&#50896;&#54620;&#45796;: </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p><span class="emphasis"><em>Transient</em></span> - &#47564;&#51068; &#44061;&#52404;&#44032; <code class="literal">new</code> &#50672;&#49328;&#51088;&#47484; &#49324;&#50857;&#54616;&#50668; &#48169;&#44552; &#52488;&#44592;&#54868; &#46104;&#50632;&#45796;&#47732; &#44061;&#52404;&#45716; transient&#51060;&#44256;, &#44536;&#44163;&#51008; Hibernate <code class="literal">Session</code>&#44284; &#50672;&#44288;&#46104;&#50612; &#51080;&#51648; &#50506;&#45796;. &#44536;&#44163;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#45236;&#50640;&#49436; &#50689;&#49549; &#54364;&#49345;&#51012; &#44054;&#51648; &#50506;&#44256; &#49885;&#48324;&#51088; &#44050;&#51060; &#54624;&#45817;&#46104;&#51648; &#50506;&#50520;&#45796;. &#47564;&#51068; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#45908; &#51060;&#49345; &#52280;&#51312;&#47484; &#49548;&#50976;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864; transient &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#50416;&#47112;&#44592; &#49688;&#51665;&#44592;&#50640; &#51032;&#54644; &#54028;&#44340;&#46112;
                        &#44163;&#51060;&#45796;. &#44061;&#52404;&#47484; &#50689;&#49549;&#54868; &#49884;&#53412;&#45716;&#45936; (&#44536;&#47532;&#44256; &#51060; &#51204;&#51060;(transition)&#50640; &#45824;&#54644; &#49892;&#54665;&#46112; &#54596;&#50836;&#44032; &#51080;&#45716; SQL &#47928;&#51109;&#46308;&#51012; Hibernate&#47196; &#54616;&#50668;&#44552; &#52376;&#47532;&#54616;&#46020;&#47197; &#54616;&#45716;&#45936;) Hibernate <code class="literal">Session</code>&#51012; &#49324;&#50857;&#54616;&#46972;. 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Persistent</em></span> - &#54616;&#45208;&#51032; &#50689;&#49549; &#51064;&#49828;&#53556;&#49828;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#45236;&#50640;&#49436; &#54616;&#45208;&#51032; &#54364;&#49345;&#51012; &#44054;&#44256; &#54616;&#45208;&#51032; &#49885;&#48324;&#51088; &#44050;&#51012; &#44054;&#45716;&#45796;. &#44536;&#44163;&#51008; &#48169;&#44552; &#51200;&#51109;&#46104;&#50632;&#44144;&#45208; &#47196;&#46300;&#46104;&#50632;&#51012; &#49688; &#51080;&#51648;&#47564;, &#51221;&#51032;&#49345; &#44536;&#44163;&#51008; <code class="literal">Session</code>&#51032; &#48276;&#50948; &#45236;&#50640; &#51080;&#45796;. Hibernate&#45716; &#50689;&#49549; &#49345;&#53468;&#50640;&#49436; &#44061;&#52404;&#50640; &#45824;&#54644; &#54665;&#54644;&#51652; &#51076;&#51032;&#51032; &#48320;&#44221;&#46308;&#51012; &#44160;&#52636;&#54644;&#45244; &#44163;&#51060;&#44256; &#45800;&#50948; &#51089;&#50629;&#51060; &#50756;&#47308;&#46112; &#46412; &#44536; &#49345;&#53468;&#47484; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50752; &#46041;&#44592;&#54868; &#49884;&#53420; &#44163;&#51060;&#45796;. &#44060;&#48156;&#51088;&#46308;&#51008; &#54616;&#45208;&#51032; &#44061;&#52404;&#44032; transient&#47196;
                        &#46104;&#50612;&#50556; &#54624; &#46412; <code class="literal">UPDATE</code> &#47928;&#51109;&#46308;&#51060;&#45208; <code class="literal">DELETE</code> &#47928;&#51109;&#46308;&#51012; &#49688;&#51089;&#50629;&#51004;&#47196; &#49892;&#54665;&#54616;&#51648; &#50506;&#45716;&#45796;. 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Detached</em></span> - &#54616;&#45208;&#51032; detached &#51064;&#49828;&#53556;&#49828;&#45716; &#50689;&#49549;&#54868; &#46104;&#50632;&#51648;&#47564;, &#44536;&#44163;&#51032; <code class="literal">Session</code>&#51060; &#45803;&#54784;&#51652; &#44061;&#52404;&#51060;&#45796;. &#47932;&#47200; &#44536; &#44061;&#52404;&#50640; &#45824;&#54620; &#52280;&#51312;&#45716; &#50668;&#51204;&#55176; &#50976;&#54952;&#54616;&#44256;, &#44536; detached &#51064;&#49828;&#53556;&#49828;&#45716; &#51060; &#49345;&#53468;&#50640;&#49436;&#46020; &#48320;&#44221;&#46112; &#49688;&#46020; &#51080;&#45796;. &#54616;&#45208;&#51032; detached &#51064;&#49828;&#53556;&#49828;&#45716; &#45208;&#51473;&#50640; &#44536;&#44163;(&#44284; &#47784;&#46160; &#48320;&#44221;&#46308;)&#51012; &#45796;&#49884; &#50689;&#49549;&#54868; &#49884;&#53020;&#49436;
                        &#49352;&#47196;&#50868; <code class="literal">Session</code>&#50640; &#45796;&#49884; &#52392;&#48512;&#46112; &#49688; &#51080;&#45796;. &#51060; &#53945;&#51669;&#51008; &#49324;&#50857;&#51088;&#44032; &#49373;&#44033;&#54624; &#49884;&#44036;&#51012; &#54596;&#50836;&#47196; &#54616;&#45716; &#51109; &#44592;&#44036; &#49892;&#54665;&#46104;&#45716; &#51089;&#50629; &#45800;&#50948;&#47484; &#50948;&#54620; &#54532;&#47196;&#44536;&#47000;&#48141; &#47784;&#54805;&#51012; &#44032;&#45733;&#54616;&#44172; &#54644;&#51456;&#45796;. &#50864;&#47532;&#45716; &#44536;&#44163;&#46308;&#51012; <span class="emphasis"><em>&#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53944;&#47004;&#51117;&#49496;&#46308;</em></span>, &#51593; &#49324;&#50857;&#51088;&#51032; &#44288;&#51216;&#51032; &#51089;&#50629; &#45800;&#50948;&#46972;&#44256; &#48512;&#47480;&#45796;. 
                     </p>
                  </li>
               </ul>
            </div>
            <p>&#51060;&#51228; &#50864;&#47532;&#45716; &#49345;&#53468;&#46308;&#44284; &#49345;&#53468; &#51204;&#51060;(transition)&#46308;(&#44536;&#47532;&#44256; &#51204;&#51060;&#47484; &#53944;&#47532;&#44144; &#49884;&#53412;&#45716; Hibernate &#47700;&#49548;&#46300;&#46308;)&#51012; &#49345;&#49464;&#54616;&#44172; &#45436;&#51032;&#54624; &#44163;&#51060;&#45796;. </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="inheritance-limitations.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-makingpersistent.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">9.2. &#51228;&#50557;&#46308;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;10.2. &#44061;&#52404;&#46308;&#51012; &#50689;&#49549;&#54868; &#49884;&#53412;&#44592;</td>
            </tr>
         </table>
      </div>
   </body>
</html>