<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>10.3. &#44061;&#52404;&#47484; &#47196;&#46300;&#49884;&#53412;&#44592;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="objectstate.html" title="10&#51109;. &#44061;&#52404;&#46308;&#47196; &#51089;&#50629;&#54616;&#44592;">
      <link rel="prev" href="objectstate-makingpersistent.html" title="10.2. &#44061;&#52404;&#46308;&#51012; &#50689;&#49549;&#54868; &#49884;&#53412;&#44592;">
      <link rel="next" href="objectstate-querying.html" title="10.4. &#51656;&#51032;&#54616;&#44592;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">10.3. &#44061;&#52404;&#47484; &#47196;&#46300;&#49884;&#53412;&#44592;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-makingpersistent.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">10&#51109;. &#44061;&#52404;&#46308;&#47196; &#51089;&#50629;&#54616;&#44592;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objectstate-querying.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="objectstate-loading"></a>10.3. &#44061;&#52404;&#47484; &#47196;&#46300;&#49884;&#53412;&#44592;
                  </h2>
               </div>
            </div>
         </div>
         <p><code class="literal">Session</code>&#51032; <code class="literal">load()</code> &#47700;&#49548;&#46300;&#46308;&#51008; &#47564;&#51068; &#45817;&#49888;&#51060; &#44536;&#44163;(&#50689;&#49549; &#51064;&#49828;&#53556;&#49828;)&#51032; &#49885;&#48324;&#51088;&#46308;&#51012; &#51060;&#48120; &#50508;&#44256; &#51080;&#51012; &#44221;&#50864;&#50640; &#50689;&#49549; &#51064;&#49828;&#53556;&#49828;&#47484; &#44160;&#49353;&#54616;&#45716; &#48169;&#48277;&#51012; &#45817;&#49888;&#50640;&#44172; &#51228;&#44277;&#54620;&#45796;. <code class="literal">load()</code>&#45716; &#54616;&#45208;&#51032; &#53364;&#47000;&#49828; &#44061;&#52404;&#47484; &#52712;&#54616;&#44256; &#44536; &#49345;&#53468;&#47484; &#50689;&#49549;(persistent) &#49345;&#53468;&#47196; &#44536; &#53364;&#47000;&#49828;&#51032; &#49352;&#47196;&#51060; &#52488;&#44592;&#54868; &#46108; &#51064;&#49828;&#53556;&#49828; &#49549;&#51004;&#47196; &#47196;&#46300;&#49884;&#53420; &#44163;&#51060;&#45796;. 
         </p><pre class="programlisting">Cat fritz = (Cat) sess.load(Cat.class, generatedId);</pre><pre class="programlisting">// you need to wrap primitive identifiers
long id = 1234;
DomesticCat pk = (DomesticCat) sess.load( DomesticCat.class, new Long(id) );</pre><p>&#45796;&#47480; &#48169;&#48277;&#51004;&#47196; &#45817;&#49888;&#51008; &#51452;&#50612;&#51652; &#51064;&#49828;&#53556;&#49828; &#49549;&#51004;&#47196; &#49345;&#53468;&#47484; &#47196;&#46300;&#49884;&#53420; &#49688; &#51080;&#45796;: </p><pre class="programlisting">Cat cat = new DomesticCat();
// load pk's state into cat
sess.load( cat, new Long(pkId) );
Set kittens = cat.getKittens();</pre><p>&#47564;&#51068; &#51068;&#52824;&#54616;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#54665;&#51060; &#51316;&#51116;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864;&#50640; <code class="literal">load()</code>&#44032; unrecoverable(&#48373;&#44396; &#48520;&#44032;&#45733;&#54620;) &#50696;&#50808;&#49345;&#54889;&#51012; &#45912;&#51656; &#44163;&#51076;&#51012; &#45432;&#53944;&#54616;&#46972;. &#47564;&#51068; &#53364;&#47000;&#49828;&#44032; &#54532;&#46973;&#49884;&#47484; &#44054;&#46020;&#47197; &#47588;&#54609;&#46108; &#44221;&#50864;, <code class="literal">load()</code>&#45716; &#52488;&#44592;&#54868; &#46104;&#51648; &#50506;&#51008; &#54532;&#46973;&#49884;&#47484; &#45800;&#51648; &#48152;&#54872;&#54616;&#44256; &#45817;&#49888;&#51060; &#44536; &#54532;&#46973;&#49884;&#51032; &#47700;&#49548;&#46300;&#47484; &#54840;&#52636;&#54616;&#44592; &#51204;&#44620;&#51648;&#45716; &#49892;&#51228;&#47196; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#51217;&#49549;&#54616;&#51648; &#50506;&#45716;&#45796;. &#45817;&#49888;&#51060; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196;&#48512;&#53552; &#44061;&#52404;&#50640; &#45824;&#54620; &#50672;&#44288;&#51012; &#49892;&#51228;&#47196; &#47196;&#46300;&#49884;&#53412;&#51648; &#50506;&#44256;&#49436; &#44061;&#52404;&#50640; &#45824;&#54620; &#50672;&#44288;&#51012;
            &#49373;&#49457;&#49884;&#53412;&#44256;&#51088; &#50896;&#54624; &#44221;&#50864;&#50640; &#51060; &#53945;&#51669;&#51060; &#47588;&#50864; &#50976;&#50857;&#54616;&#45796;. &#47564;&#51068; <code class="literal">batch-size</code>&#44032; class &#47588;&#54609;&#50640; &#51221;&#51032;&#46104;&#45716; &#44221;&#50864; &#44536;&#44163;&#51008; &#46608;&#54620; &#45796;&#51473; &#51064;&#49828;&#53556;&#49828;&#46308;&#51060; &#54616;&#45208;&#51032; &#48176;&#52824;&#47196;&#49436; &#47196;&#46300;&#46104;&#45716; &#44163;&#51012; &#54728;&#50857;&#54644;&#51456;&#45796;. 
         </p>
         <p>&#47564;&#51068; &#45817;&#49888;&#51060; &#54616;&#45208;&#51032; &#51068;&#52824;&#54616;&#45716; &#54665;&#51060; &#51316;&#51116;&#54616;&#45716;&#51648;&#47484; &#54869;&#49888;&#54624; &#49688; &#50630;&#51012; &#44221;&#50864;, &#45817;&#49888;&#51008; <code class="literal">get()</code> &#47700;&#49548;&#46300;&#47484; &#49324;&#50857;&#54644;&#50556; &#54620;&#45796;. &#44536;&#44163;(<code class="literal">get()</code> &#47700;&#49548;&#46300;)&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#51593;&#49884; &#51217;&#49549;&#54616;&#44256; &#47564;&#51068; &#51068;&#52824;&#54616;&#45716; &#54665;&#51060; &#50630;&#51012; &#44221;&#50864; null&#51012; &#48152;&#54872;&#54620;&#45796;. 
         </p><pre class="programlisting">Cat cat = (Cat) sess.get(Cat.class, id);
if (cat==null) {
    cat = new Cat();
    sess.save(cat, id);
}
return cat;</pre><p>&#45817;&#49888;&#51008; &#54616;&#45208;&#51032; <code class="literal">LockMode</code>&#47484; &#49324;&#50857;&#54616;&#45716;, <code class="literal">SELECT ... FOR UPDATE</code>&#47484; &#49324;&#50857;&#54616;&#50668; &#54616;&#45208;&#51032; &#44061;&#52404;&#47484; &#47196;&#46300;&#49884;&#53420; &#49688;&#46020; &#51080;&#45796;. &#52628;&#44032; &#51221;&#48372;&#45716; API &#47928;&#49436;&#47484; &#48372;&#46972;. 
         </p><pre class="programlisting">Cat cat = (Cat) sess.get(Cat.class, id, LockMode.UPGRADE);</pre><p>&#50612;&#46500; &#50672;&#44288;&#46108; &#51064;&#49828;&#53556;&#49828;&#46308;&#51060;&#45208; &#54252;&#54632;&#46108; &#53084;&#47113;&#49496;&#46308;&#51008; &#45817;&#49888;&#51060; &#44536; &#50672;&#44288;&#50640; &#45824;&#54620; &#52992;&#49828;&#52992;&#51060;&#46300; &#49828;&#53440;&#51068;&#47196;&#49436; <code class="literal">lock</code> &#46608;&#45716; <code class="literal">all</code>&#51012; &#51648;&#51221;&#54616;&#46020;&#47197; &#44208;&#51221;&#54616;&#51648; &#50506;&#45716; &#54620;, <code class="literal">FOR UPDATE</code>&#47196; &#49440;&#53469;&#46104;&#51648; &#50506;&#51020;&#51012; &#45432;&#53944;&#54616;&#46972;. 
         </p>
         <p><code class="literal">refresh()</code> &#47700;&#49548;&#46300;&#47484; &#49324;&#50857;&#54616;&#50668;, &#50500;&#47924;&#46412;&#45208; &#54616;&#45208;&#51032; &#44061;&#52404;&#50752; &#47784;&#46304; &#44536;&#44163;&#51032; &#53084;&#47113;&#49496;&#46308;&#51012; &#45796;&#49884; &#47196;&#46300;&#49884;&#53412;&#45716; &#44163;&#51060; &#44032;&#45733;&#54616;&#45796;. &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47532;&#44144;&#46308;&#51060; &#44536; &#44061;&#52404;&#51032; &#54532;&#47196;&#54140;&#54000;&#46308; &#51473; &#50612;&#46500; &#44163;&#51012; &#52488;&#44592;&#54868; &#49884;&#53412;&#45716;&#45936; &#49324;&#50857;&#46112; &#46412; &#51060;&#44163;&#51060; &#50976;&#50857;&#54616;&#45796;. 
         </p><pre class="programlisting">sess.save(cat);
sess.flush(); //force the SQL INSERT
sess.refresh(cat); //re-read the state (after the trigger executes)</pre><p>&#51473;&#50836;&#54620; &#51656;&#47928;&#51060; &#45824;&#44060; &#51060; &#51648;&#51216;&#50640;&#49436; &#45208;&#53440;&#45212;&#45796;: Hibernate&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#47196;&#48512;&#53552; &#44536;&#44163;&#51012; &#50620;&#47560;&#45208; &#47566;&#51060; &#47196;&#46300;&#49884;&#53412;&#44256; &#44536;&#47532;&#44256; &#50620;&#47560;&#45208; &#47566;&#51008; SQL <code class="literal">SELECT</code>&#46308;&#51060; &#44536;&#44163;&#51012; &#49324;&#50857;&#54624; &#44163;&#51064;&#44032;? &#51060;&#44163;&#51008; <span class="emphasis"><em>&#54168;&#52845; &#48169;&#46020;</em></span>&#50640; &#51032;&#51316;&#54616;&#44256; <a href="performance.html#performance-fetching" title="19.1. &#54168;&#52845; &#48169;&#46020;&#46308;">19.1&#51208;. &#8220;&#54168;&#52845; &#48169;&#46020;&#46308;&#8221;</a>&#50640; &#49444;&#47749;&#46104;&#50612; &#51080;&#45796;. 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-makingpersistent.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="objectstate.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objectstate-querying.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.2. &#44061;&#52404;&#46308;&#51012; &#50689;&#49549;&#54868; &#49884;&#53412;&#44592;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;10.4. &#51656;&#51032;&#54616;&#44592;</td>
            </tr>
         </table>
      </div>
   </body>
</html>