<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>19&#51109;. &#54140;&#54252;&#47676;&#49828; &#44060;&#49440;&#54616;&#44592;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="xml-manipulation.html" title="18.3. XML &#45936;&#51060;&#53552; &#52376;&#47532;&#54616;&#44592;">
      <link rel="next" href="performance-cache.html" title="19.2. &#46160;&#48264;&#51704; &#47112;&#48296; &#52880;&#49884;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">19&#51109;. &#54140;&#54252;&#47676;&#49828; &#44060;&#49440;&#54616;&#44592;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="xml-manipulation.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="performance-cache.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="performance"></a>19&#51109;. &#54140;&#54252;&#47676;&#49828; &#44060;&#49440;&#54616;&#44592;
                  </h2>
               </div>
            </div>
         </div>
         <div class="sect1" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="performance-fetching"></a>19.1. &#54168;&#52845; &#48169;&#46020;&#46308;
                     </h2>
                  </div>
               </div>
            </div>
            <p><span class="emphasis"><em>&#54168;&#52845; &#48169;&#46020;</em></span>&#45716; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#50672;&#44288;&#51012; &#45348;&#48708;&#44172;&#51060;&#53944;&#54624; &#54596;&#50836;&#44032; &#51080;&#51012; &#46412; Hibernate&#44032; &#50672;&#44288;&#46108; &#44061;&#52404;&#46308;&#51012; &#44160;&#49353;&#54616;&#45716;&#45936; &#49324;&#50857;&#54616;&#44172; &#46112; &#48169;&#46020;&#51060;&#45796;.&#54168;&#52824; &#48169;&#46020;&#46308;&#51008; O/R &#47588;&#54609; &#47700;&#53440;&#45936;&#51060;&#53552; &#45236;&#50640;&#49436; &#49440;&#50616;&#46112; &#49688; &#51080;&#44144;&#45208; &#54616;&#45208;&#51032; &#53945;&#51221; HQL &#46608;&#45716; <code class="literal">Criteria</code> &#51656;&#51032;&#50640; &#51032;&#54644; &#50724;&#48260;&#46972;&#51060;&#46300; &#46112; &#49688;&#46020; &#51080;&#45796;. 
            </p>
            <p>Hibernate3&#45716; &#45796;&#51020; &#54168;&#52845; &#48169;&#46020;&#46308;&#51012; &#51221;&#51032;&#54620;&#45796;: </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p><span class="emphasis"><em>Join &#54168;&#52845;</em></span> - Hibernate&#45716; <code class="literal">OUTER JOIN</code>&#51012; &#49324;&#50857;&#54616;&#50668; &#50672;&#44288;&#46108; &#51064;&#49828;&#53556;&#49828; &#46608;&#45716; &#46041;&#51068;&#54620; <code class="literal">SELECT</code> &#45236;&#50640;&#49436; &#53084;&#47113;&#49496;&#51012; &#44160;&#49353;&#54620;&#45796;. 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Select &#54168;&#52845;</em></span> - &#46160; &#48264;&#51704; <code class="literal">SELECT</code>&#45716; &#50672;&#44284;&#46108; &#50644;&#54000;&#54000; &#46608;&#45716; &#53084;&#47113;&#49496;&#51012; &#44160;&#49353;&#54616;&#45716;&#45936; &#49324;&#50857;&#46108;&#45796;. &#45817;&#49888;&#51060; <code class="literal">lazy="false"</code>&#47484; &#51648;&#51221;&#54632;&#51004;&#47196;&#50024; &#47749;&#49884;&#51201;&#51004;&#47196; lazy &#54168;&#52845;&#51012; &#49324;&#50857; &#48520;&#44032;&#45733;&#54616;&#44172; &#54616;&#51648; &#50506;&#45716; &#54620;, &#51060; &#46160; &#48264;&#51704; select&#45716; &#45817;&#49888;&#51060; &#44536; &#50672;&#44288;&#50640; &#49892;&#51228;&#47196; &#50529;&#49464;&#49828;&#54624; &#46412; &#50724;&#51649; &#49892;&#54665;&#46112; &#44163;&#51060;&#45796;. 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Subselect &#54168;&#52845;</em></span> - &#46160; &#48264;&#51704; <code class="literal">SELECT</code>&#45716; &#51060;&#51204; &#51656;&#51032; &#46608;&#45716; &#54168;&#52824;&#50640;&#49436; &#44160;&#49353;&#46108; &#47784;&#46304; &#50644;&#54000;&#54000;&#46308;&#50640; &#45824;&#54644; &#50672;&#44288;&#46108; &#53084;&#47113;&#49496;&#46308;&#51012; &#44160;&#49353;&#54616;&#45716;&#45936; &#49324;&#50857;&#46108;&#45796;. &#45817;&#49888;&#51060; <code class="literal">lazy="false"</code>&#47484; &#51648;&#51221;&#54616;&#50668; &#47749;&#49884;&#51201;&#51004;&#47196; lazy &#54168;&#52845;&#51012; &#49324;&#50857; &#48520;&#44032;&#45733;&#54616;&#44172; &#54616;&#51648; &#50506;&#45716; &#54620;, &#51060; &#46160; &#48264;&#51704; select&#45716; &#45817;&#49888;&#51060; &#49892;&#51228;&#47196; &#44536; &#50672;&#44288;&#50640; &#51217;&#44540;&#54624; &#46412; &#50724;&#51649; &#49892;&#54665;&#46112; &#44163;&#51060;&#45796;. 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Batch &#54168;&#52845;</em></span> - select &#54168;&#52845;&#51012; &#50948;&#54620; &#52572;&#51201;&#54868; &#48169;&#46020; - Hibernate&#45716; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412;&#46308;&#51060;&#45208; foreign &#53412;&#46308;&#51032; &#47532;&#49828;&#53944;&#47484; &#51648;&#51221;&#54632;&#51004;&#47196;&#50024; &#54616;&#45208;&#51032;<code class="literal">SELECT</code> &#45236;&#50640;&#49436; &#50644;&#54000;&#54000; &#51064;&#49828;&#53556;&#49828;&#46308;&#51060;&#45208; &#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54620; batch&#47484; &#44160;&#49353;&#54620;&#45796;. 
                     </p>
                  </li>
               </ul>
            </div>
            <p>Hibernate&#45716; &#46608;&#54620; &#45796;&#51020; &#49324;&#51060;&#47484; &#44396;&#48324; &#51667;&#45716;&#45796;: </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p><span class="emphasis"><em>&#51593;&#44033;&#51201;&#51064; &#54168;&#52845;</em></span> - &#49548;&#50976;&#51088;&#44032; &#47196;&#46300;&#46112; &#46412;, &#50672;&#44288;, &#53084;&#47113;&#49496; &#46608;&#45716; &#49549;&#49457;&#51060; &#51593;&#49884; &#54168;&#52824;&#46108;&#45796;. 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Lazy &#53084;&#47113;&#49496; &#54168;&#52845;</em></span> - &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#44536; &#53084;&#47113;&#49496;&#50640; &#45824;&#54644; &#54616;&#45208;&#51032; &#50724;&#54140;&#47112;&#51060;&#49496;&#51012; &#54840;&#52636;&#54624; &#46412; &#53084;&#47113;&#49496;&#51060; &#54168;&#52824;&#46108;&#45796;.(&#51060;&#44163;&#51008; &#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54644; &#46356;&#54260;&#53944;&#51060;&#45796;.) 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>"Extra-lazy" &#53084;&#47113;&#49496; &#54168;&#52845;</em></span> - &#53084;&#47113;&#49496;&#51032; &#44060;&#48324; &#50836;&#49548;&#46308;&#51008; &#54596;&#50836;&#54624; &#46412; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196;&#48512;&#53552; &#51217;&#44540;&#46108;&#45796;. Hibernate&#45716; &#51208;&#45824;&#51201;&#51004;&#47196; &#54596;&#50836;&#54616;&#51648; &#50506;&#51008; &#54620; &#51204;&#52404; &#53084;&#47113;&#49496;&#51012; &#47700;&#47784;&#47532; &#45236;&#47196; &#54168;&#52824;&#54616;&#47140;&#44256; &#49884;&#46020;&#54616;&#51648; &#50506;&#45716;&#45796;(&#47588;&#50864; &#53360; &#53084;&#47113;&#49496;&#50640; &#51201;&#54633;&#54632;) 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>&#54532;&#46973;&#49884; &#54168;&#52845;</em></span> - &#49885;&#48324;&#51088; getter&#44032; &#50500;&#45772; &#45796;&#47480; &#47700;&#49548;&#46300;&#44032; &#50672;&#44288;&#46108; &#44061;&#52404;&#50640; &#45824;&#54644; &#54840;&#52636;&#46112; &#46412; &#45800;&#51068; &#44050; &#50672;&#44288;&#51060; &#54168;&#52824;&#46108;&#45796;. 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>"No-proxy" &#54168;&#52845;</em></span> - &#51064;&#49828;&#53556;&#49828; &#48320;&#49688;&#44032; &#51217;&#44540;&#46112; &#46412; &#45800;&#51068; &#44050; &#50672;&#44288;&#51060; &#54168;&#52824;&#46108;&#45796;. &#54532;&#46973;&#49884; &#54168;&#52845;&#44284; &#48708;&#44368;&#54624; &#46412;, &#51060; &#51217;&#44540;&#48277;&#51008; &#45796;&#49548; &#45916; lazy&#54616;&#51648;&#47564;(&#44536; &#50672;&#44288;&#51008; &#49900;&#51648;&#50612; &#50976;&#51068;&#54616;&#44172; &#49885;&#48324;&#51088;&#44032; &#51217;&#44540;&#46112; &#46412;&#50640;&#46020; &#54168;&#52824;&#46108;&#45796;)&#48372;&#45796; &#53804;&#47749;&#54616;&#45796;. &#50780;&#45264;&#54616;&#47732; &#54532;&#46973;&#49884;&#45716; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;
                        &#44032;&#49884;&#51201;&#51060;&#51648; &#50506;&#44592; &#46412;&#47928;&#51060;&#45796;. &#51060; &#51217;&#44540;&#48277;&#51008; &#48716;&#46300; &#49884; &#48148;&#51060;&#53944;&#53076;&#46300; &#49688;&#45800;&#51012; &#54596;&#50836;&#47196; &#54616;&#47728; &#46300;&#47932;&#44172; &#54596;&#50836;&#54616;&#45796;. 
                     </p>
                  </li>
                  <li>
                     <p><span class="emphasis"><em>Lazy &#49549;&#49457; &#54168;&#52845;</em></span> - &#51064;&#49828;&#53556;&#49828; &#48320;&#49688;&#44032; &#51217;&#44540;&#46112; &#46412; &#49549;&#49457; &#46608;&#45716; &#45800;&#51068; &#44050; &#50672;&#44288;&#51060; &#54168;&#52824;&#46108;&#45796; &#51060; &#51217;&#44540;&#48277;&#51008; &#48716;&#46300;&#49884; &#48148;&#51060;&#53944;&#53076;&#46300; &#49688;&#45800;&#51012; &#54596;&#50836;&#47196; &#54616;&#47728; &#46300;&#47932;&#44172; &#54596;&#50836;&#54616;&#45796;. 
                     </p>
                  </li>
               </ul>
            </div>
            <p>&#50864;&#47532;&#45716; &#50668;&#44592;&#49436; &#46160; &#44060;&#51032; &#51649;&#44368;&#54616;&#45716; &#44060;&#45392;&#46308;&#51012; &#44054;&#45716;&#45796;: &#50672;&#44288;&#51060; &#54168;&#52824;&#46112; <span class="emphasis"><em>&#46412;</em></span>, &#44536;&#47532;&#44256; &#44536;&#44163;&#51060; &#54168;&#52824;&#46104;&#45716; <span class="emphasis"><em>&#48169;&#48277;</em></span>(&#49324;&#50857;&#46104;&#45716; SQL). &#44536;&#44163;&#46308;&#51012; &#54844;&#46041;&#54616;&#51648; &#47568;&#46972;! &#50864;&#47532;&#45716; &#54140;&#54252;&#47676;&#49828;&#47484; &#53916;&#54021;&#54616;&#45716;&#45936; <code class="literal">&#54168;&#52824;</code>&#47484; &#49324;&#50857;&#54620;&#45796;. &#50864;&#47532;&#45716; &#53945;&#51221; &#53364;&#47000;&#49828;&#51032; &#50612;&#46500; detached &#51064;&#49828;&#53556;&#49828; &#45236;&#50640;&#49436; &#54637;&#49345; &#51060;&#50857; &#44032;&#45733;&#54620; &#45936;&#51060;&#53552;&#44032; &#47924;&#50631;&#51064;&#51648;&#50640; &#45824;&#54620; &#44228;&#50557;&#51012; &#51221;&#51032;&#54616;&#45716;&#45936; <code class="literal">lazy</code>&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. 
            </p>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-lazy"></a>19.1.1. lazy &#50672;&#44288;&#46308;&#47196; &#51089;&#50629;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#46356;&#54260;&#53944;&#47196; Hibernate3&#45716; &#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54644; lazy select &#54168;&#52845;&#51012; &#49324;&#50857;&#54616;&#44256;, &#45800;&#51068; &#44050; &#50672;&#44288;&#46308;&#50640; &#45824;&#54644; lazy &#54532;&#46973;&#49884; &#54168;&#52845;&#51012; &#49324;&#50857;&#54620;&#45796;. &#51060;&#46308; &#46356;&#54260;&#53944;&#46308;&#51008; &#44144;&#51032; &#47784;&#46304; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#50640;&#49436; &#44144;&#51032; &#47784;&#46304; &#50672;&#44288;&#46308;&#50640; &#45824;&#54644; &#50976;&#51032;&#48120;&#54616;&#45796;.
                  
               </p>
               <p><span class="emphasis"><em>&#45432;&#53944;:</em></span> &#47564;&#51068; &#45817;&#49888;&#51060; <code class="literal">hibernate.default_batch_fetch_size</code>&#47484; &#49444;&#51221;&#54616;&#45716; &#44221;&#50864;, Hibernate&#45716; lazy &#54168;&#52845;&#51012; &#50948;&#54620; batch &#54168;&#52824; &#52572;&#51201;&#54868;&#47484; &#49324;&#50857;&#54624; &#44163;&#51060;&#45796;(&#51060; &#52572;&#51201;&#54868;&#45716; &#46608;&#54620; &#45908; &#47566;&#51008; &#44284;&#47549;&#49345;&#51032; &#47112;&#48296;&#50640;&#49436; &#51060;&#50857; &#44032;&#45733;&#54624; &#49688; &#51080;&#45796;). 
               </p>
               <p>&#54616;&#51648;&#47564;, lazy &#54168;&#52845;&#51008; &#45817;&#49888;&#51060; &#50508;&#44256; &#51080;&#50612;&#50556; &#54616;&#45716; &#54620; &#44032;&#51648; &#47928;&#51228;&#47484; &#51228;&#44592;&#54620;&#45796;. &#50676;&#47140;&#51652; Hibernate &#49464;&#49496; &#52968;&#53581;&#49828;&#53944; &#50808;&#48512;&#50640;&#49436; lazy &#50672;&#44288;&#50640; &#45824;&#54620; &#51217;&#44540;&#51008; &#50696;&#50808;&#49345;&#54889;&#51004;&#47196; &#44480;&#44208;&#46112; &#44163;&#51060;&#45796;. &#50696;&#47484; &#46308;&#47732; : </p><pre class="programlisting">s = sessions.openSession();
Transaction tx = s.beginTransaction();
            
User u = (User) s.createQuery("from User u where u.name=:userName")
    .setString("userName", userName).uniqueResult();
Map permissions = u.getPermissions();

tx.commit();
s.close();

Integer accessLevel = (Integer) permissions.get("accounts");  // Error!</pre><p><code class="literal">Session</code>&#51060; &#45803;&#54804;&#51012; &#46412; permissions &#53084;&#47113;&#49496;&#51060; &#52488;&#44592;&#54868; &#46104;&#51648; &#50506;&#50520;&#51004;&#48064;&#47196;, &#44536; &#53084;&#47113;&#49496;&#51008; &#44536;&#44163;&#51032; &#49345;&#53468;&#47484; &#47196;&#46300;&#49884;&#53420; &#49688;&#44032; &#50630;&#51012; &#44163;&#51060;&#45796;. <span class="emphasis"><em>Hibernate &#45716; detached &#44061;&#52404;&#46308;&#50640; &#45824;&#54620; lazy &#52488;&#44592;&#54868;&#47484; &#51648;&#50896;&#54616;&#51648; &#50506;&#45716;&#45796;.</em></span> &#51221;&#51221;&#51008; &#53084;&#47113;&#49496;&#51004;&#47196;&#48512;&#53552; &#51069;&#50612;&#46308;&#51060;&#45716; &#53076;&#46300;&#47484; &#52964;&#48139; &#48148;&#47196; &#51649;&#51204;&#51004;&#47196; &#51060;&#46041;&#49884;&#53412;&#45716; &#44163;&#51060;&#45796;. 
               </p>
               <p>&#45796;&#47480; &#48169;&#48277;&#51004;&#47196; &#50672;&#44288; &#47588;&#54609;&#50640; &#45824;&#54644; <code class="literal">lazy="false"</code>&#47484; &#51648;&#51221;&#54632;&#51004;&#47196;&#50024;, non-lazy &#53084;&#47113;&#49496; &#46608;&#45716; non-lazy &#50672;&#44288;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. &#54616;&#51648;&#47564; lazy &#52488;&#44592;&#54868;&#45716; &#44144;&#51032; &#47784;&#46304; &#53084;&#47113;&#49496;&#46308;&#44284; &#50672;&#44288;&#46308;&#50640; &#45824;&#54644; &#49324;&#50857;&#46104;&#46020;&#47197; &#44256;&#50504;&#46104;&#50612; &#51080;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#45817;&#49888;&#51032; &#44061;&#52404; &#47784;&#54805; &#45236;&#50640; &#45320;&#47924; &#47566;&#51008;
                  non-lazy &#50672;&#44288;&#46308;&#51012; &#51221;&#51032;&#54624; &#44221;&#50864;, Hibernate&#45716; &#47784;&#46304; &#53944;&#47004;&#51117;&#49496;&#50640;&#49436; &#51204;&#52404; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47484; &#47700;&#47784;&#47532; &#49549;&#51004;&#47196; &#54168;&#52824;&#54616;&#45716; &#54596;&#50836;&#49457;&#51012; &#45149;&#45236;&#44172; &#46112; &#44163;&#51060;&#45796;! 
               </p>
               <p>&#45796;&#47480; &#54620;&#54200;&#51004;&#47196;, &#50864;&#47532;&#45716; &#53945;&#51221; &#53944;&#47004;&#51117;&#49496; &#45236;&#50640;&#49436; select &#54168;&#52845; &#45824;&#49888;&#50640; (&#44256;&#50976;&#54616;&#44172; non-lazy&#51064;) join &#54168;&#52845;&#51012; &#49440;&#53469;&#54616;&#44592;&#47484; &#51088;&#51452; &#50896;&#54620;&#45796;. &#50864;&#47532;&#45716; &#51060;&#51228; &#54168;&#52845; &#48169;&#46020;&#47484; &#47582;&#52644;&#54868; &#49884;&#53412;&#45716; &#48169;&#48277;&#51012; &#50508;&#44172; &#46112; &#44163;&#51060;&#45796;. Hibernate3&#50640;&#49436;,
                  &#54168;&#52824; &#48169;&#46020;&#47484; &#49440;&#53469;&#54616;&#45716; &#47700;&#52964;&#45768;&#51608;&#51008; &#45800;&#51068; &#44050; &#50672;&#44288;&#46308;&#44284; &#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54644; &#46041;&#51068;&#54616;&#45796;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-custom"></a>19.1.2. &#54168;&#52824; &#48169;&#46020;&#46308;&#51012; &#53916;&#45789;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>select &#54168;&#52845;(&#46356;&#54260;&#53944;)&#51008; N+1 selects &#47928;&#51228;&#51216;&#46308;&#50640; &#47588;&#50864; &#52712;&#50557;&#54644;&#49436;, &#50864;&#47532;&#45716; &#47588;&#54609; &#47928;&#49436;&#50640;&#49436; join &#54168;&#52845;&#51012; &#49324;&#50857; &#44032;&#45733;&#54616;&#44172; &#54616;&#44592;&#47484; &#50896;&#54624; &#49688;&#46020; &#51080;&#45796;: </p><pre class="programlisting">&lt;set name="permissions" 
            fetch="join"&gt;
    &lt;key column="userId"/&gt;
    &lt;one-to-many class="Permission"/&gt;
&lt;/set</pre><pre class="programlisting">&lt;many-to-one name="mother" class="Cat" fetch="join"/&gt;</pre><p>&#47588;&#54609; &#47928;&#49436; &#45236;&#50640; &#51221;&#51032;&#46108; <code class="literal">fetch</code> &#48169;&#46020;&#45716; &#45796;&#51020;&#50640; &#50689;&#54693;&#51012; &#51456;&#45796;: 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p><code class="literal">get()</code> &#46608;&#45716; <code class="literal">load()</code>&#47484; &#53685;&#54620; &#44160;&#49353; 
                        </p>
                     </li>
                     <li>
                        <p>&#50672;&#44288;&#51060; &#45348;&#48708;&#44172;&#51060;&#53944;&#46112; &#46412; &#54632;&#52629;&#51201;&#51004;&#47196; &#48156;&#49373;&#54616;&#45716; &#44160;&#49353; </p>
                     </li>
                     <li>
                        <p><code class="literal">Criteria</code> &#51656;&#51032;&#46308; 
                        </p>
                     </li>
                     <li>
                        <p><code class="literal">subselect</code> &#54168;&#52845;&#51060; &#49324;&#50857;&#46112; &#44221;&#50864;&#50640; HQL &#51656;&#51032;&#46308; 
                        </p>
                     </li>
                  </ul>
               </div>
               <p>&#45817;&#49888;&#51060; &#49324;&#50857;&#54616;&#45716; &#54168;&#52845; &#48169;&#46020;&#44032; &#47924;&#50631;&#51064;&#44032;&#50640; &#49345;&#44288;&#50630;&#51060;, &#51221;&#51032;&#46108; &#48708;-lazy &#44536;&#47000;&#54532;&#44032; &#47700;&#47784;&#47532; &#45236;&#47196; &#47196;&#46300;&#46104;&#45716; &#44163;&#51060; &#48372;&#51109;&#46108;&#45796;. &#51060;&#44163;&#51008; &#54616;&#45208;&#51032; &#53945;&#48324;&#54620; HQL &#51656;&#51032;&#47484; &#49892;&#54665;&#49884;&#53412;&#45716;&#45936; &#49324;&#50857;&#46104;&#45716; &#47751;&#47751; &#51593;&#49884;&#51201;&#51064; select&#46308;&#47196; &#44480;&#44208;&#46112; &#49688; &#51080;&#51020;&#51012;
                  &#45432;&#53944;&#54616;&#46972;. 
               </p>
               <p>&#45824;&#44060;, &#50864;&#47532;&#45716; &#54168;&#52845;&#51012; &#47582;&#52644;&#54868; &#49884;&#53412;&#45716;&#45936; &#47588;&#54609; &#47928;&#49436;&#47484; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716;&#45796;. &#45824;&#49888;&#50640;, &#50864;&#47532;&#45716; &#46356;&#54260;&#53944; &#53945;&#51669;&#51012; &#50976;&#51648;&#54616;&#44256;, HQL&#50640;&#49436; <code class="literal">left join fetch</code>&#47484; &#49324;&#50857;&#54616;&#50668;, &#53945;&#51221; &#53944;&#47004;&#51117;&#49496;&#50640; &#45824;&#54644; &#44536;&#44163;&#51012; &#50724;&#48260;&#46972;&#51060;&#46300; &#49884;&#53416;&#45796;. &#51060;&#44163;&#51008; outer join&#51012; &#49324;&#50857;&#54616;&#50668; &#52395; &#48264;&#51704; select&#50640;&#49436; &#52488;&#44592;&#50640; &#44536; &#50672;&#44288;&#51012; eagerly &#54168;&#52824;&#49884;&#53420; &#44163;&#51012; Hibernate&#50640;&#44172; &#50508;&#47140;&#51456;&#45796;. <code class="literal">Criteria</code> query API&#50640;&#49436;, &#50864;&#47532;&#45716; <code class="literal">setFetchMode(FetchMode.JOIN)</code>&#51012; &#49324;&#50857;&#54620;&#45796;. 
               </p>
               <p>&#47564;&#51068; &#45817;&#49888;&#51060; <code class="literal">get()</code> &#46608;&#45716; <code class="literal">load()</code>&#50640; &#51032;&#54644; &#49324;&#50857;&#46108; &#54168;&#52845; &#48169;&#46020;&#47484; &#48320;&#44221;&#49884;&#53420; &#49688; &#51080;&#44592;&#47484; &#45817;&#49888;&#51060; &#50896;&#54620;&#45796;&#44256; &#45712;&#45188; &#44221;&#50864;, &#45800;&#49692;&#54616;&#44172; <code class="literal">Criteria</code> &#51656;&#51032;&#47484; &#49324;&#50857;&#54616;&#46972;. &#50696;&#47484; &#46308;&#47732;: 
               </p><pre class="programlisting">User user = (User) session.createCriteria(User.class)
                .setFetchMode("permissions", FetchMode.JOIN)
                .add( Restrictions.idEq(userId) )
                .uniqueResult();</pre><p>(&#51060;&#44163;&#51008; &#47751;&#47751; ORM &#49556;&#47336;&#49496;&#46308;&#51060; "&#54168;&#52824; &#44228;&#54925;"&#51060;&#46972;&#44256; &#48512;&#47476;&#45716; &#44163;&#50640; &#45824;&#54620; Hibernate&#51032; &#46321;&#44032;&#47932;&#51060;&#45796;.) </p>
               <p>N+1 &#44060;&#51032; select&#46308;&#51012; &#44032;&#51652; &#47928;&#51228;&#51216;&#46308;&#51012; &#54588;&#54616;&#45716; &#50756;&#51204;&#55176; &#45796;&#47480; &#48169;&#48277;&#51008; second-level &#52880;&#49884;&#47484; &#49324;&#50857;&#54616;&#45716; &#44163;&#51060;&#45796;. </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-proxies"></a>19.1.3. Single-ended &#50672;&#44288; &#54532;&#46973;&#49884;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54620; Lazy &#54168;&#52845;&#51008; &#50689;&#49549; &#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54620; Hibernate &#51088;&#49888;&#51032; &#44396;&#54788;&#51012; &#49324;&#50857;&#54616;&#50668; &#44396;&#54788;&#46108;&#45796;. &#54616;&#51648;&#47564; &#45796;&#47480; &#47700;&#52964;&#45768;&#51608;&#51008; single-ended &#50672;&#44288;&#46308;&#50640;&#49436; lazy &#53945;&#51669;&#50640; &#54596;&#50836;&#54616;&#45796;. &#50672;&#44288;&#51032; &#45824;&#49345; &#50644;&#54000;&#54000;&#45716; &#54532;&#46973;&#49884;
                  &#46104;&#50612;&#50556; &#54620;&#45796;. Hibernate&#45716; (&#54988;&#47469;&#54620; CGLIB &#46972;&#51060;&#48652;&#47084;&#47532;&#47484; &#53685;&#54644;) &#47088;&#53440;&#51076; &#48148;&#51060;&#53944;&#53076;&#46300; &#51613;&#51652;&#51012; &#49324;&#50857;&#54616;&#50668; &#50689;&#49549; &#44061;&#52404;&#46308;&#50640; &#45824;&#54620; lazy &#52488;&#44592;&#54868; &#54532;&#46973;&#49884;&#46308;&#51012; &#44396;&#54788;&#54620;&#45796;. 
               </p>
               <p>&#46356;&#54260;&#53944;&#47196;, Hibernate3&#45716; &#47784;&#46304; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54644; (&#49884;&#51089; &#49884;&#50640;) &#54532;&#46973;&#49884;&#46308;&#51012; &#49373;&#49457;&#49884;&#53412;&#44256; <code class="literal">many-to-one</code> &#50672;&#44288;&#44284; <code class="literal">one-to-one</code> &#50672;&#44288;&#50640; &#45824;&#54644; lazy &#54168;&#52845;&#51012; &#51060;&#50857; &#44032;&#45733;&#54616;&#44172; &#54616;&#45716;&#45936; &#44536;&#44163;&#46308;&#51012; &#49324;&#50857;&#54620;&#45796;. 
               </p>
               <p>&#47588;&#54609; &#54028;&#51068;&#51008; &#44536; &#53364;&#47000;&#49828;&#50640; &#45824;&#54620; &#54532;&#46973;&#49884; &#51064;&#53552;&#54168;&#51060;&#49828;&#47196;&#49436; &#49324;&#50857;&#54624;, <code class="literal">proxy</code> &#49549;&#49457;&#51012; &#44032;&#51652;, &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#49440;&#50616;&#54624; &#49688;&#46020; &#51080;&#45796;. &#46356;&#54260;&#53944;&#47196; Hibernate&#45716; &#44536; &#53364;&#47000;&#49828;&#51032; &#49436;&#48652;&#53364;&#47000;&#49828;&#47484; &#49324;&#50857;&#54620;&#45796;. <span class="emphasis"><em>&#54532;&#46973;&#49884;&#46108; &#53364;&#47000;&#49828;&#45716; &#52572;&#49548;&#54620;&#51032; &#54056;&#53412;&#51648; &#44032;&#49884;&#49457; (visibility)&#51012; &#44032;&#51652; &#46356;&#54260;&#53944; &#49373;&#49457;&#51088;&#47484; &#44396;&#54788;&#54644;&#50556; &#54632;&#51012; &#45432;&#53944;&#54616;&#46972;. &#50864;&#47532;&#45716; &#47784;&#46304; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54644; &#51060; &#49373;&#49457;&#51088;&#47484; &#44428;&#51109;&#54620;&#45796;!</em></span> 
               </p>
               <p>&#45796;&#54805;&#49457; &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54644; &#51060; &#51217;&#44540;&#48277;&#51012; &#54869;&#51109;&#54624; &#46412; &#51032;&#49885;&#54644;&#50556; &#54616;&#45716; &#47751;&#47751; &#45212;&#52376;&#54632;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;. &#50696;&#47484; &#46308;&#47732;. </p><pre class="programlisting">&lt;class name="Cat" proxy="Cat"&gt;
    ......
    &lt;subclass name="DomesticCat"&gt;
        .....
    &lt;/subclass&gt;
&lt;/class&gt;</pre><p>&#52395; &#48264;&#51704;&#47196;, &#49900;&#51648;&#50612; &#44592;&#48376; &#51064;&#49828;&#53556;&#49828;&#44032; <code class="literal">DomesticCat</code>&#51032; &#51064;&#49828;&#53556;&#49828;&#51064; &#44221;&#50864;&#51312;&#52264;&#46020;, <code class="literal">Cat</code>&#51032; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#44208;&#53076; <code class="literal">DomesticCat</code>&#51004;&#47196; &#53440;&#51077;&#52880;&#49828;&#53944;&#44032; &#44032;&#45733;&#54616;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;: 
               </p><pre class="programlisting">Cat cat = (Cat) session.load(Cat.class, id);  // instantiate a proxy (does not hit the db)
if ( cat.isDomesticCat() ) {                  // hit the db to initialize the proxy
    DomesticCat dc = (DomesticCat) cat;       // Error!
    ....
}</pre><p>&#46160;&#48264;&#51704;&#47196;, &#54532;&#46973;&#49884; <code class="literal">==</code>&#47484; &#54028;&#44592;&#54624; &#44032;&#45733;&#49457;&#51060; &#51080;&#45796;. 
               </p><pre class="programlisting">Cat cat = (Cat) session.load(Cat.class, id);            // instantiate a Cat proxy
DomesticCat dc = 
        (DomesticCat) session.load(DomesticCat.class, id);  // acquire new DomesticCat proxy!
System.out.println(cat==dc);                            // false</pre><p>&#54616;&#51648;&#47564;, &#44536; &#44221;&#50864;&#45716; &#48372;&#51060;&#45716; &#47564;&#53372; &#44536;&#47111;&#44172; &#45208;&#49240;&#51648;&#45716; &#50506;&#45796;. &#49900;&#51648;&#50612; &#50864;&#47532;&#44032; &#51060;&#51228; &#45796;&#47480; &#54532;&#46973;&#49884; &#44061;&#52404;&#46308;&#50640; &#45824;&#54620; &#46160; &#44060;&#51032; &#52280;&#51312;&#47484; &#44032;&#51656;&#51648;&#46972;&#46020;, &#44592;&#48376; &#51064;&#49828;&#53556;&#49828;&#45716; &#50668;&#51204;&#55176; &#46041;&#51068;&#54620; &#44061;&#52404;&#46308;&#51068; &#44163;&#51060;&#45796;: </p><pre class="programlisting">cat.setWeight(11.0);  // hit the db to initialize the proxy
System.out.println( dc.getWeight() );  // 11.0</pre><p>&#49464;&#48264;&#51704;&#47196;, &#45817;&#49888;&#51008; <code class="literal">final</code> &#53364;&#47000;&#49828; &#46608;&#45716; &#51076;&#51032;&#51032; <code class="literal">final</code> &#47700;&#49548;&#46300;&#46308;&#51012; &#44032;&#51652; &#53364;&#47000;&#49828;&#50640; &#45824;&#54644; CGLIB &#54532;&#46973;&#49884;&#47484; &#49324;&#50857;&#54616;&#51648; &#50506;&#51012; &#49688; &#51080;&#45796;. 
               </p>
               <p>&#47560;&#51648;&#47561;&#51004;&#47196;, &#47564;&#51068; &#45817;&#49888;&#51032; &#50689;&#49549; &#44061;&#52404;&#44032; &#52488;&#44592;&#54868; &#49884;&#50640; &#50612;&#46500; &#47532;&#49548;&#49828;&#46308;&#51012; &#54596;&#50836;&#47196; &#54624; &#44221;&#50864;(&#50696;&#47484; &#46308;&#50612;, initializer&#46308; &#46608;&#45716; &#46356;&#54260;&#53944; &#49373;&#49457;&#51088; &#45236;&#50640;&#49436;), &#44536;&#46412; &#44536;&#46308; &#47532;&#49548;&#49828;&#46308;&#51060; &#46608;&#54620; &#54532;&#46973;&#49884;&#50640; &#51032;&#54644; &#54925;&#46301;&#46112; &#44163;&#51060;&#45796;. &#54532;&#46973;&#49884; &#53364;&#47000;&#49828;&#45716;
                  &#50689;&#49549; &#53364;&#47000;&#49828;&#50640; &#45824;&#54620; &#49892;&#51228; &#49436;&#48652;&#53364;&#47000;&#49828;&#51060;&#45796;. 
               </p>
               <p>&#51060;&#46308; &#47928;&#51228;&#51216;&#46308;&#51008; &#47784;&#46160; &#51088;&#48148;&#51032; &#45800;&#51068; &#49345;&#49549; &#47784;&#54805;&#51032; &#44592;&#48376;&#51201;&#51064; &#51228;&#50557; &#46412;&#47928;&#51060;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#51060;&#46308; &#47928;&#51228;&#51216;&#46308;&#51012; &#54588;&#54616;&#44256;&#51088; &#50896;&#54624; &#44221;&#50864; &#45817;&#49888;&#51032; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#51008; &#44033;&#44033; &#44536;&#44163;&#51032; &#48708;&#51648;&#45768;&#49828; &#47700;&#49548;&#46300;&#46308;&#51012; &#49440;&#50616;&#54616;&#45716; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54620;&#45796;. &#45817;&#49888;&#51008;
                  &#47588;&#54609; &#54028;&#51068; &#49549;&#50640; &#51060;&#46308; &#51064;&#53552;&#54168;&#51060;&#49828;&#46308;&#51012; &#51648;&#51221;&#54644;&#50556; &#54620;&#45796;. &#50696;&#47484; &#46308;&#47732;. 
               </p><pre class="programlisting">&lt;class name="CatImpl" proxy="Cat"&gt;
    ......
    &lt;subclass name="DomesticCatImpl" proxy="DomesticCat"&gt;
        .....
    &lt;/subclass&gt;
&lt;/class&gt;</pre><p>&#50668;&#44592;&#49436; <code class="literal">CatImpl</code>&#51008; <code class="literal">Cat</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54616;&#44256; <code class="literal">DomesticCatImpl</code>&#51008; <code class="literal">DomesticCat</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54620;&#45796;. &#44536;&#46412; <code class="literal">Cat</code>&#44284; <code class="literal">DomesticCat</code>&#51032; &#51064;&#49828;&#53556;&#49828;&#46308;&#50640; &#45824;&#54620; &#54532;&#46973;&#49884;&#46308;&#51008; <code class="literal">load()</code> &#46608;&#45716; <code class="literal">iterate()</code>&#50640; &#51032;&#54644; &#48152;&#54872;&#46112; &#49688; &#51080;&#45796;. (<code class="literal">list()</code>&#44032; &#45824;&#44060; &#54532;&#46973;&#49884;&#46308;&#51012; &#48152;&#54872;&#54616;&#51648; &#50506;&#51020;&#51012; &#45432;&#53944;&#54616;&#46972;.) 
               </p><pre class="programlisting">Cat cat = (Cat) session.load(CatImpl.class, catid);
Iterator iter = session.createQuery("from CatImpl as cat where cat.name='fritz'").iterate();
Cat fritz = (Cat) iter.next();</pre><p>&#44288;&#44228;&#46308;&#51008; &#46608;&#54620; lazy &#52488;&#44592;&#54868; &#46108;&#45796;. &#51060;&#44163;&#51008; &#45817;&#49888;&#51060; &#51076;&#51032;&#51032; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; <code class="literal">CatImpl</code> &#53440;&#51077;&#51060; &#50500;&#45772; <code class="literal">Cat</code> &#53440;&#51077;&#51004;&#47196; &#49440;&#50616;&#54644;&#50556; &#54632;&#51012; &#51032;&#48120;&#54620;&#45796;. 
               </p>
               <p>&#50612;&#46500; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51008; &#54532;&#46973;&#49884; &#52488;&#44592;&#54868;&#47484; &#54596;&#50836;&#47196; &#54616;&#51648; <span class="emphasis"><em>&#50506;&#45716;&#45796;</em></span> 
               </p>
               <div class="itemizedlist">
                  <ul type="disc" compact>
                     <li>
                        <p><code class="literal">equals()</code>, &#47564;&#51068; &#50689;&#49549; &#53364;&#47000;&#49828;&#44032; <code class="literal">equals()</code>&#47484; &#50724;&#48260;&#46972;&#51060;&#46300; &#49884;&#53412;&#51648; &#50506;&#45716; &#44221;&#50864; 
                        </p>
                     </li>
                     <li>
                        <p><code class="literal">hashCode()</code>, &#47564;&#51068; &#50689;&#49549; &#53364;&#47000;&#49828;&#44032;<code class="literal">hashCode()</code>&#47484; &#50724;&#48260;&#46972;&#51060;&#46300; &#49884;&#53412;&#51648; &#50506;&#45716; &#44221;&#50864; 
                        </p>
                     </li>
                     <li>
                        <p>&#49885;&#48324;&#51088; getter &#47700;&#49548;&#46300; </p>
                     </li>
                  </ul>
               </div>
               <p>Hibernate&#45716; <code class="literal">equals()</code> &#46608;&#45716; <code class="literal">hashCode()</code>&#47484; &#50724;&#48260;&#46972;&#51060;&#46300; &#49884;&#53412;&#45716; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#51012; &#44160;&#52636;&#54624; &#44163;&#51060;&#45796;. 
               </p>
               <p>&#46356;&#54260;&#53944; <code class="literal">lazy="proxy"</code> &#45824;&#49888;&#50640; <code class="literal">lazy="no-proxy"</code>&#47484; &#49440;&#53469;&#54616;&#50668;, &#50864;&#47532;&#45716; &#53440;&#51077;&#52880;&#49828;&#54021;&#44284; &#50672;&#44288;&#46108; &#47928;&#51228;&#51216;&#46308;&#51012; &#54588;&#54624; &#49688; &#51080;&#45796;. &#54616;&#51648;&#47564; &#50864;&#47532;&#45716; &#48716;&#46300; &#49884; &#48148;&#51060;&#53944;&#53076;&#46300; &#49688;&#45800;&#51012; &#54596;&#50836;&#47196; &#54624; &#44163;&#51060;&#44256;, &#47784;&#46304; &#50672;&#49328;&#46308;&#51008; &#51593;&#44033;&#51201;&#51064; &#54532;&#46973;&#49884; &#52488;&#44592;&#54868;&#47196; &#44480;&#44208;&#46112; &#44163;&#51060;&#45796;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-initialization"></a>19.1.4. &#53084;&#47113;&#49496;&#46308;&#44284; &#54532;&#46973;&#49884;&#46308;&#51012; &#52488;&#44592;&#54868; &#49884;&#53412;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#47564;&#51068; &#52488;&#44592;&#54868; &#46104;&#51648; &#50506;&#51008; &#53084;&#47113;&#49496;&#51060;&#45208; &#54532;&#46973;&#49884;&#44032; <code class="literal">Session</code> &#50689;&#50669;&#51032; &#50808;&#48512;&#50640;&#49436; &#51217;&#44540;&#46112; &#44221;&#50864;&#50640;, &#50696;&#47484; &#46308;&#50612; &#53084;&#47113;&#49496;&#51012; &#49548;&#50976;&#54616;&#44144;&#45208; &#54532;&#46973;&#49884;&#50640; &#45824;&#54620; &#52280;&#51312;&#47484; &#44032;&#51652; &#50644;&#54000;&#54000;&#44032; detached &#49345;&#53468;&#50640; &#51080;&#51012; &#46412;, <code class="literal">LazyInitializationException</code>&#51060; Hibernate&#50640; &#51032;&#54644; &#45912;&#51256;&#51656; &#44163;&#51060;&#45796;. 
               </p>
               <p>&#46412;&#46412;&#47196; &#50864;&#47532;&#45716;<code class="literal">Session</code>&#51012; &#45803;&#44592; &#51204;&#50640; &#54532;&#46973;&#49884; &#46608;&#45716; &#53084;&#47113;&#49496;&#51060; &#52488;&#44592;&#54868; &#46120;&#51012; &#54869;&#49892;&#55176; &#54624; &#54596;&#50836;&#44032; &#51080;&#45796;. &#47932;&#47200; &#50864;&#47532;&#45716; &#50696;&#47484; &#46308;&#50612; <code class="literal">cat.getSex()</code> &#46608;&#45716; <code class="literal">cat.getKittens().size()</code>&#47484; &#54840;&#52636;&#54616;&#50668; &#54637;&#49345; &#52488;&#44592;&#54868;&#47484; &#44053;&#51228;&#49884;&#53420; &#49688; &#51080;&#45796;. &#44536;&#47084;&#45208; &#44536;&#44163;&#51008; &#53076;&#46300;&#51032; &#46021;&#51088;&#46308;&#50640;&#44172;&#45716; &#54844;&#46041;&#49828;&#47101;&#44256; &#51068;&#48152;&#51201;&#51064; &#53076;&#46300;&#47196; &#54200;&#51032;&#51201;&#51060;&#51648; &#50506;&#45796;. 
               </p>
               <p>static &#47700;&#49548;&#46300;&#46308; <code class="literal">Hibernate.initialize()</code>&#50752; <code class="literal">Hibernate.isInitialized()</code>&#45716; lazy &#52488;&#44592;&#54868; &#46108; &#53084;&#47113;&#49496;&#46308;&#51060;&#45208; &#54532;&#46973;&#49884;&#46308;&#50640; &#45824;&#54644; &#51089;&#50629;&#54616;&#45716; &#54200;&#47532;&#54620; &#48169;&#48277;&#51012; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#51228;&#44277;&#54620;&#45796;. <code class="literal">Hibernate.initialize(cat)</code>&#51008; &#44536;&#44163;&#51032; <code class="literal">Session</code>&#51060; &#50668;&#51204;&#55176; &#50676;&#47140;&#51256; &#51080;&#45716; &#54620; &#54532;&#46973;&#49884; <code class="literal">cat</code>&#51032; &#52488;&#44592;&#54868;&#47484; &#44053;&#51228;&#54624; &#44163;&#51060;&#45796;. <code class="literal">Hibernate.initialize( cat.getKittens())</code>&#45716; kittens&#51032; &#53084;&#47113;&#49496;&#50640; &#45824;&#54644; &#50976;&#49324;&#54620; &#54952;&#44284;&#47484; &#44054;&#45716;&#45796;. 
               </p>
               <p>&#46608; &#45796;&#47480; &#50741;&#49496;&#51008; &#47784;&#46304; &#54596;&#50836;&#54620; &#53084;&#47113;&#49496;&#46308;&#44284; &#54532;&#46973;&#49884;&#46308;&#51060; &#47196;&#46300;&#46104;&#44592; &#51204;&#44620;&#51648; <code class="literal">Session</code>&#51012; &#50676;&#47536; &#52292;&#47196; &#50976;&#51648;&#54616;&#45716; &#44163;&#51060;&#45796;. &#47751;&#47751; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#50500;&#53412;&#53581;&#52376;&#46308;, &#53945;&#55176; Hibernate&#47484; &#49324;&#50857;&#54616;&#50668; &#45936;&#51060;&#53552;&#50640; &#51217;&#44540;&#54616;&#45716; &#53076;&#46300;, &#44536;&#47532;&#44256; &#45796;&#47480; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#44228;&#52789;&#46308;&#51060;&#45208; &#45796;&#47480; &#47932;&#47532;&#51201; &#54532;&#47196;&#49464;&#49828;&#46308; &#45236;&#50640;&#49436; &#44536;&#44163;&#51012; &#49324;&#50857;&#54616;&#45716; &#53076;&#46300;&#50640;&#49436;, &#44536;&#44163;&#51008;
                  &#53084;&#47113;&#49496;&#51060; &#52488;&#44592;&#54868; &#46112; &#46412; <code class="literal">Session</code>&#51060; &#50676;&#47140;&#51256; &#51080;&#51020;&#51012; &#54869;&#49892;&#55176; &#54616;&#45716; &#47928;&#51228;&#51068; &#49688; &#51080;&#45796;. &#51060; &#51137;&#51216;&#51012; &#45796;&#47336;&#45716; &#46160; &#44032;&#51648; &#44592;&#48376; &#48169;&#48277;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;: 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>&#50937; &#44592;&#48152; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436;, &#49436;&#48660;&#47551; &#54596;&#53552;&#45716; &#48624; &#47116;&#45908;&#47553;&#51060; &#50756;&#47308;&#46104;&#45716;, &#49324;&#50857;&#51088; &#50836;&#52397;&#51032; &#48148;&#47196; &#45149;&#50640;&#49436;&#47564; <code class="literal">Session</code>&#51012; &#45803;&#45716;&#45936; &#49324;&#50857;&#46112; &#49688; &#51080;&#45796;(<span class="emphasis"><em>Open Session in View</em></span> &#54056;&#53556;). &#47932;&#47200; &#51060;&#44163;&#51008; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#51064;&#54532;&#46972;&#49828;&#53944;&#47085;&#52376;&#51032; &#50696;&#50808;&#49345;&#54889; &#52376;&#47532;&#51032; &#51221;&#51221;&#50640; &#44288;&#54620; &#47924;&#44144;&#50868; &#50836;&#44396;&#47484; &#48512;&#44284;&#54620;&#45796;. &#48624; &#47116;&#45908;&#47553; &#46041;&#50504;&#50640; &#54616;&#45208;&#51032; &#50696;&#50808;&#49345;&#54889;&#51060; &#48156;&#49373;&#54624;&#46412;&#50640;&#46020; &#49324;&#50857;&#51088;&#50640;&#44172; &#48152;&#54872;&#46104;&#44592; &#51204;&#50640; <code class="literal">Session</code>&#51060; &#45803;&#54784;&#51648;&#44256; &#53944;&#47004;&#51117;&#49496;&#51060; &#51333;&#47308;&#46104;&#45716; &#44163;&#51008; &#51648;&#44537;&#55176; &#51473;&#50836;&#54616;&#45796;. &#51060; "Open Session in View" &#54056;&#53556;&#50640; &#44288;&#54620; &#50696;&#51228;&#46308;&#51008; Hibernate &#50948;&#53412;&#47484; &#48372;&#46972;. 
                        </p>
                     </li>
                     <li>
                        <p>&#48324;&#46020;&#51032; &#48708;&#51648;&#45768;&#49828; &#54000;&#50612;&#47484; &#44032;&#51652; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436;, &#48708;&#51648;&#45768;&#49828; &#47196;&#51649;&#51008; &#48152;&#54872; &#51204;&#50640; &#50937; &#54000;&#50612;&#50640; &#54596;&#50836;&#54620; &#47784;&#46304; &#53084;&#47113;&#49496;&#46308;&#51012; "&#51456;&#48708;"&#54644;&#50556; &#54620;&#45796;. &#51060;&#44163;&#51008; &#48708;&#51648;&#45768;&#49828; &#54000;&#50612;&#44032; &#47784;&#46304; &#45936;&#51060;&#53552;&#47484; &#47196;&#46300;&#49884;&#53412;&#44256; &#51060;&#48120; &#52488;&#44592;&#54868;&#46108; &#47784;&#46304; &#45936;&#51060;&#53552;&#47484; &#53945;&#51221; &#50416;&#51076;&#49352;&#50640;
                           &#54596;&#50836;&#54620; &#54532;&#47532;&#51232;&#53580;&#51060;&#49496;/&#50937; &#54000;&#50612;&#47196; &#48152;&#54872;&#54644;&#50556; &#54632;&#51012; &#51032;&#48120;&#54620;&#45796;. &#45824;&#44060; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#50937; &#54000;&#50612;&#50640; &#54596;&#50836;&#54616;&#44172; &#46112; &#44033;&#44033;&#51032; &#53084;&#47113;&#49496;&#50640; &#45824;&#54644; <code class="literal">Hibernate.initialize()</code>&#47484; &#54840;&#52636;&#54616;&#44144;&#45208;(&#51060; &#54840;&#52636;&#51008; &#49464;&#49496;&#51060; &#45803;&#55176;&#44592; &#51204;&#50640; &#48156;&#49373;&#54644;&#50556; &#54620;&#45796;) &#46608;&#45716; <code class="literal">FETCH</code> &#51208;&#51012; &#44054;&#44144;&#45208; &#46608;&#45716; <code class="literal">Criteria</code> &#45236;&#50640; <code class="literal">FetchMode.JOIN</code>&#51012; &#44032;&#51652; Hibernate &#51656;&#51032;&#47484; &#49324;&#50857;&#54616;&#50668; &#53084;&#47113;&#49496;&#51012; &#50676;&#49900;&#55176; &#44160;&#49353;&#54620;&#45796;. &#51060;&#44163;&#51008; &#45824;&#44060; &#45817;&#49888;&#51060; <span class="emphasis"><em>Session Facade</em></span> &#45824;&#49888; <span class="emphasis"><em>Command</em></span> &#54056;&#53556;&#51012; &#52292;&#53469;&#54624; &#44221;&#50864;&#50640; &#45908; &#49789;&#45796;. 
                        </p>
                     </li>
                     <li>
                        <p>&#45817;&#49888;&#51008; &#46608;&#54620; &#52488;&#44592;&#54868; &#46104;&#51648; &#50506;&#51008; &#53084;&#47113;&#49496;&#46308;(&#46608;&#45716; &#45796;&#47480; &#54532;&#46973;&#49884;&#46308;)&#50640; &#51217;&#44540;&#54616;&#44592; &#51204;&#50640; <code class="literal">merge()</code> &#46608;&#45716; <code class="literal">lock()</code>&#51004;&#47196; &#50526;&#49436; &#47196;&#46300;&#46108; &#44061;&#52404;&#47484; &#49352;&#47196;&#50868; <code class="literal">Session</code>n&#50640; &#52392;&#48512;&#54624; &#49688;&#46020; &#51080;&#45796;. &#50500;&#45768;&#45796;. Hibernate&#45716; &#51060;&#44163;&#51012; &#51088;&#46041;&#51201;&#51004;&#47196; &#54665;&#54616;&#51648; &#50506;&#44256;, &#54869;&#49892;&#55176; &#51088;&#46041;&#51201;&#51004;&#47196; &#54665;&#54616;&#51648; <span class="emphasis"><em>&#50506;&#51012; &#44163;&#51060;&#45796;</em></span>. &#50780;&#45264;&#54616;&#47732; &#44536;&#44163;&#51008; &#53945;&#48324;&#54620; &#47785;&#51201;&#51012; &#50948;&#54620; &#53944;&#47004;&#51117;&#49496; &#51032;&#48120;&#47484; &#46020;&#51077;&#54624; &#44163;&#51060;&#44592; &#46412;&#47928;&#51060;&#45796;! 
                        </p>
                     </li>
                  </ul>
               </div>
               <p>&#46412;&#46412;&#47196; &#45817;&#49888;&#51008; &#44144;&#45824;&#54620; &#53084;&#47113;&#49496;&#51012; &#52488;&#44592;&#54868; &#49884;&#53412;&#45716; &#44163;&#51012; &#50896;&#54616;&#51648; &#50506;&#51648;&#47564;, &#50668;&#51204;&#55176; (&#44536;&#44163;&#51032; &#49324;&#51060;&#51592;&#50752; &#44057;&#51008;) &#44536;&#44163;&#50640; &#45824;&#54620; &#50612;&#46500; &#51221;&#48372; &#46608;&#45716; &#45936;&#51060;&#53552;&#51032; &#48512;&#48516;&#51665;&#54633;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;. </p>
               <p>&#45817;&#49888;&#51008; &#44536;&#44163;&#51012; &#52488;&#44592;&#54868; &#49884;&#53412;&#51648; &#50506;&#44256;&#49436; &#53084;&#47113;&#49496;&#51032; &#49324;&#51060;&#51592;&#47484; &#50619;&#45716;&#45936; &#53084;&#47113;&#49496; &#54596;&#53552;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;: </p><pre class="programlisting">( (Integer) s.createFilter( collection, "select count(*)" ).list().get(0) ).intValue()</pre><p><code class="literal">createFilter()</code> &#47700;&#49548;&#46300;&#45716; &#46608;&#54620; &#51204;&#52404; &#53084;&#47113;&#49496;&#51012; &#52488;&#44592;&#54868; &#49884;&#53420; &#54596;&#50836; &#50630;&#51060; &#53084;&#47113;&#49496;&#51032; &#48512;&#48516;&#51665;&#54633;&#46308;&#51012; &#54952;&#50984;&#51201;&#51004;&#47196; &#44160;&#49353;&#54616;&#45716;&#45936; &#49324;&#50857;&#46108;&#45796;: 
               </p><pre class="programlisting">s.createFilter( lazyCollection, "").setFirstResult(0).setMaxResults(10).list();</pre></div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-batch"></a>19.1.5. batch &#54168;&#52845; &#49324;&#50857;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Hibernate&#45716; &#48176;&#52824; &#54168;&#52845;&#51012; &#54952;&#50984;&#51201;&#51004;&#47196; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. &#51593; &#54616;&#45208;&#51032; &#54532;&#46973;&#49884;&#44032; &#50529;&#49464;&#49828; &#46112; &#44221;&#50864;&#50640; Hibernate&#45716; &#47751;&#47751; &#52488;&#44592;&#54868; &#46104;&#51648; &#50506;&#51008; &#54532;&#46973;&#49884;&#46308;&#51012; &#47196;&#46300;&#49884;&#53420; &#49688; &#51080;&#45796;(&#46608;&#45716; &#53084;&#47113;&#49496;&#46308;). batch &#54168;&#52845;&#51008; lazy select
                  &#54168;&#52845; &#48169;&#46020;&#50640; &#45824;&#54620; &#52572;&#51201;&#54868;&#51060;&#45796;. &#45817;&#49888;&#51060; batch &#54168;&#52845;&#51012; &#53916;&#45789;&#49884;&#53420; &#49688; &#51080;&#45716; &#46160; &#44032;&#51648; &#48169;&#48277;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;: &#53364;&#47000;&#49828; &#47112;&#48296;&#50640;&#49436; &#44536;&#47532;&#44256; &#53084;&#47113;&#49496; &#47112;&#48296;&#50640;&#49436;. 
               </p>
               <p>&#53364;&#47000;&#49828;&#46308;/&#50644;&#54000;&#54000;&#46308;&#50640; &#45824;&#54620; batch &#54168;&#52845;&#51008; &#51060;&#54644;&#54616;&#44592;&#44032; &#45908; &#49789;&#45796;. &#45817;&#49888;&#51060; &#49892;&#54665; &#49884;&#50640; &#45796;&#51020; &#49345;&#54889;&#50640; &#52376;&#54620;&#45796;&#44256; &#49345;&#49345;&#54616;&#46972;: &#45817;&#49888;&#51008; &#54616;&#45208;&#51032; <code class="literal">Session</code> &#49549;&#50640; &#47196;&#46300;&#46108; 25&#44060;&#51032; <code class="literal">Cat</code> &#51064;&#49828;&#53556;&#49828;&#46308;&#51012; &#44054;&#44256; &#51080;&#44256;, &#44033;&#44033;&#51032; <code class="literal">Cat</code>&#51008; &#44536;&#44163;&#51032; <code class="literal">&#49548;&#50976;&#51088;</code> &#51593;, <code class="literal">Person</code>&#50640; &#45824;&#54620; &#52280;&#51312;&#47484; &#44054;&#44256; &#51080;&#45796;. <code class="literal">Person</code> &#53364;&#47000;&#49828;&#45716; &#54532;&#46973;&#49884; <code class="literal">lazy="true"</code>&#47196;&#49436; &#47588;&#54609;&#46108;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#51060;&#51228; &#47784;&#46304; cat&#46308;&#51012; &#53685;&#54644; &#48152;&#48373;&#54616;&#44256; &#44033;&#44033;&#51032; cat&#50640; &#45824;&#54644; <code class="literal">getOwner()</code>&#47484; &#54840;&#52636;&#54624; &#44221;&#50864;, Hibernate&#45716; &#54532;&#46973;&#49884;&#46108; &#49548;&#50976;&#51088;&#46308;&#51012; &#44160;&#49353;&#54616;&#44592; &#50948;&#54644; 25&#44060;&#51032; <code class="literal">SELECT</code> &#47928;&#51109;&#46308;&#51012; &#46356;&#54260;&#53944;&#47196; &#49892;&#54665;&#49884;&#53420; &#44163;&#51060;&#45796;. &#45817;&#49888;&#51008; <code class="literal">Person</code> &#47588;&#54609;&#50640;&#49436; <code class="literal">batch-size</code>&#47484; &#51648;&#51221;&#54632;&#51004;&#47196;&#50024; &#51060; &#46041;&#51089;&#51012; &#53916;&#45789;&#49884;&#53420; &#49688; &#51080;&#45796;: 
               </p><pre class="programlisting">&lt;class name="Person" batch-size="10"&gt;...&lt;/class&gt;</pre><p>Hibernate&#45716; &#51060;&#51228; &#49464; &#44060;&#51032; &#51656;&#51032;&#46308; &#47564;&#51012; &#49892;&#54665;&#49884;&#53420; &#44163;&#51060;&#44256;, &#44536; &#54056;&#53556;&#51008; 10,10, 5 &#51060;&#45796;. </p>
               <p>You may also enable batch fetching of collections. For example, if each <code class="literal">Person</code> has a lazy collection of <code class="literal">Cat</code>s, and 10 persons are currently loaded in the <code class="literal">Session</code>, iterating through all persons will generate 10 <code class="literal">SELECT</code>s, one for every call to <code class="literal">getCats()</code>. If you enable batch fetching for the <code class="literal">cats</code> collection in the mapping of <code class="literal">Person</code>, Hibernate can pre-fetch collections: 
               </p><pre class="programlisting">&lt;class name="Person"&gt;
    &lt;set name="cats" batch-size="3"&gt;
        ...
    &lt;/set&gt;
&lt;/class&gt;</pre><p><code class="literal">batch-size</code> 8&#47196;&#49436;, Hibernate&#45716; 4&#44060;&#51032; SELECT&#46308;&#50640;&#49436; 3, 3, 3, 1 &#44060;&#51032; &#53084;&#47113;&#49496;&#46308;&#51012; &#47196;&#46300;&#49884;&#53420; &#44163;&#51060;&#45796;. &#45796;&#49884; &#44536; &#49549;&#49457;&#51032; &#44050;&#51008; &#53945;&#51221; <code class="literal">Session</code> &#45236;&#50640;&#49436; &#52488;&#44592;&#54868; &#46104;&#51648; &#50506;&#51008; &#53084;&#47113;&#49496;&#46308;&#51032; &#50696;&#49345;&#46104;&#45716; &#44060;&#49688;&#50640; &#51032;&#51316;&#54620;&#45796;. 
               </p>
               <p>&#47564;&#51068; &#45817;&#49888;&#51060; &#54637;&#47785;&#46308;&#51032; &#54252;&#44060;&#51652; &#53944;&#47532;&#47484; &#44032;&#51656; &#44221;&#50864;, &#50696;&#47484; &#46308;&#50612; &#51204;&#54805;&#51201;&#51064; bill-of-materials &#54056;&#53556;&#51064; &#44221;&#50864;, (&#48708;&#47197; <span class="emphasis"><em>&#45236;&#54252;&#46108; set</em></span> &#46608;&#45716; <span class="emphasis"><em>&#49892;&#52404;&#54868;&#46108; &#44221;&#47196;(materialized path)</em></span>&#44032; &#51452;&#47196;-&#51069;&#44592;-&#53944;&#47532;&#46308;&#50640; &#45824;&#54644; &#45908; &#51339;&#51008; &#50741;&#49496;&#51068; &#49688; &#51080;&#51012;&#51648;&#46972;&#46020;) &#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54620; batch &#54168;&#52845;&#51060; &#53945;&#55176; &#50976;&#50857;&#54616;&#45796;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-subselect"></a>19.1.6. subselect &#54168;&#52845; &#49324;&#50857;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#47564;&#51068; &#54620; &#44060;&#51032; lazy &#53084;&#47113;&#49496;&#51060;&#45208; &#45800;&#51068; &#44050; &#54532;&#46973;&#49884;&#44032; &#54168;&#52824;&#46104;&#50612;&#50556; &#54620;&#45796;&#47732;, Hibernate&#45716; &#54616;&#45208;&#51032; subselect &#45236;&#50640;&#49436; &#50896;&#47000;&#51032; &#51656;&#51032;&#47484; &#45796;&#49884; &#49892;&#54665;&#54616;&#50668; &#44536;&#44163;&#46308; &#47784;&#46160;&#47484; &#47196;&#46300;&#49884;&#53416;&#45796;. &#51060;&#44163;&#51008; &#51312;&#44033;&#45212; &#47196;&#46377; &#50630;&#51060; batch &#54168;&#52845;&#44284;
                  &#46041;&#51068;&#54620; &#48169;&#49885;&#51004;&#47196; &#46041;&#51089;&#54620;&#45796;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="performance-fetching-lazyproperties"></a>19.1.7. lazy &#54532;&#47196;&#54140;&#54000; &#54168;&#52845; &#49324;&#50857;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Hibernate3&#51008; &#44060;&#48324;&#51201;&#51064; &#54532;&#47196;&#54140;&#54000;&#46308;&#50640; &#45824;&#54620; lazy &#54168;&#52845;&#51012; &#51648;&#50896;&#54620;&#45796;. &#51060; &#52572;&#51201;&#54868; &#44592;&#49696;&#51008; &#46608;&#54620; <span class="emphasis"><em>fetch groups</em></span> &#51004;&#47196; &#50508;&#47140;&#51256; &#51080;&#45796;. &#51060;&#44163;&#51060; &#45824;&#44060; &#47560;&#52992;&#54021; &#53945;&#51669;&#51076;&#51012; &#45432;&#53944;&#54616;&#44600; &#48148;&#46976;&#45796;. &#50780;&#45264;&#54616;&#47732; &#49892;&#51228;&#47196; &#54665; &#51069;&#44592;&#47484; &#52572;&#51201;&#54868; &#49884;&#53412;&#45716; &#44163;&#51060; &#52972;&#47100; &#51069;&#44592;&#50640; &#45824;&#54620; &#52572;&#51201;&#54868; &#48372;&#45796; &#55016;&#50476; &#45908; &#51473;&#50836;&#54616;&#44592; &#46412;&#47928;&#51060;&#45796;. &#54616;&#51648;&#47564; &#47532;&#44144;&#49884; &#53580;&#51060;&#48660;&#46308;&#51060; &#49688;&#48177; &#44060;&#51032; &#52972;&#47100;&#46308;&#51012;
                  &#44054;&#44256; &#45936;&#51060;&#53552; &#47784;&#54805;&#51060; &#44060;&#49440;&#46112; &#49688; &#50630;&#51012; &#46412;, &#50724;&#51649; &#53364;&#47000;&#49828;&#51032; &#47751;&#47751; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#47196;&#46300;&#49884;&#53412;&#45716; &#44163; &#47564;&#51060; &#50976;&#50857;&#54624; &#49688;&#46020; &#51080;&#45796;. 
               </p>
               <p>lazy &#54532;&#47196;&#54140;&#54000; &#47196;&#46377;&#51012; &#51060;&#50857;&#44032;&#45733;&#54616;&#44172; &#54616;&#47140;&#47732;, &#45817;&#49888;&#51032; &#53945;&#51221; property &#47588;&#54609;&#46308;&#50640; &#45824;&#54644; <code class="literal">lazy</code> &#49549;&#49457;&#51012; &#49444;&#51221;&#54616;&#46972;: 
               </p><pre class="programlisting">&lt;class name="Document"&gt;
       &lt;id name="id"&gt;
        &lt;generator class="native"/&gt;
    &lt;/id&gt;
    &lt;property name="name" not-null="true" length="50"/&gt;
    &lt;property name="summary" not-null="true" length="200" lazy="true"/&gt;
    &lt;property name="text" not-null="true" length="2000" lazy="true"/&gt;
&lt;/class&gt;</pre><p>Lazy property &#47196;&#46377;&#51008; &#48716;&#46300; &#49884; &#48148;&#51060;&#53944;&#53076;&#46300; &#49688;&#45800;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;! &#47564;&#51068; &#45817;&#49888;&#51032; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#51060; &#44060;&#49440;&#46104;&#51648; &#50506;&#51012; &#44221;&#50864;, Hibernate&#45716; &#51312;&#50857;&#54616;&#44172; lazy &#54532;&#47196;&#54140;&#54000; &#49444;&#51221;&#46308;&#51012; &#47924;&#49884;&#54616;&#44256; &#51593;&#44033;&#51201;&#51064; &#54168;&#52845;&#51004;&#47196; &#54980;&#53748;&#54624; &#44163;&#51060;&#45796;.
                  
               </p>
               <p>bytecode &#49688;&#45800;&#51004;&#47196;, &#45796;&#51020; Ant &#53468;&#49828;&#53356;&#47484; &#49324;&#50857;&#54616;&#46972;: </p><pre class="programlisting">&lt;target name="instrument" depends="compile"&gt;
    &lt;taskdef name="instrument" classname="org.hibernate.tool.instrument.InstrumentTask"&gt;
        &lt;classpath path="${jar.path}"/&gt;
        &lt;classpath path="${classes.dir}"/&gt;
        &lt;classpath refid="lib.class.path"/&gt;
    &lt;/taskdef&gt;

    &lt;instrument verbose="true"&gt;
        &lt;fileset dir="${testclasses.dir}/org/hibernate/auction/model"&gt;
            &lt;include name="*.class"/&gt;
        &lt;/fileset&gt;
    &lt;/instrument&gt;
&lt;/target&gt;</pre><p>A different (better?) way to avoid unnecessary column reads, at least for read-only transactions is to use the projection
                  features of HQL or Criteria queries. This avoids the need for buildtime bytecode processing and is certainly a preferred solution.
                  
               </p>
               <p>&#45817;&#49888;&#51008; HQL&#50640;&#49436; <code class="literal">fetch all properties</code>&#47484; &#49324;&#50857;&#54616;&#50668; &#54532;&#47196;&#54140;&#54000;&#46308;&#50640; &#45824;&#54620; &#53685;&#49345;&#51032; eager &#54168;&#52845;&#51012; &#44053;&#51228;&#49884;&#53420; &#49688; &#51080;&#45796;. 
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="xml-manipulation.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="performance-cache.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">18.3. XML &#45936;&#51060;&#53552; &#52376;&#47532;&#54616;&#44592;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;19.2. &#46160;&#48264;&#51704; &#47112;&#48296; &#52880;&#49884;</td>
            </tr>
         </table>
      </div>
   </body>
</html>