<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>19.4. &#51656;&#51032; &#52880;&#49884;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="performance.html" title="19&#51109;. &#54140;&#54252;&#47676;&#49828; &#44060;&#49440;&#54616;&#44592;">
      <link rel="prev" href="performance-sessioncache.html" title="19.3. &#52880;&#49884;&#46308;&#51012; &#44288;&#47532;&#54616;&#44592;">
      <link rel="next" href="performance-collections.html" title="19.5. &#53084;&#47113;&#49496; &#54140;&#54252;&#47676;&#49828; &#51060;&#54644;&#54616;&#44592;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">19.4. &#51656;&#51032; &#52880;&#49884;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="performance-sessioncache.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">19&#51109;. &#54140;&#54252;&#47676;&#49828; &#44060;&#49440;&#54616;&#44592;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="performance-collections.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="performance-querycache"></a>19.4. &#51656;&#51032; &#52880;&#49884;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#51656;&#51032; &#44208;&#44284; &#49483;&#46308;&#51060; &#46608;&#54620; &#52880;&#49884;&#46112; &#49688;&#46020; &#51080;&#45796;. &#51060;&#44163;&#51008; &#46041;&#51068;&#54620; &#54028;&#46972;&#48120;&#53552;&#46308;&#51012; &#44032;&#51648;&#44256; &#51088;&#51452; &#49892;&#54665;&#46104;&#45716; &#51656;&#51032;&#46308;&#50640;&#47564; &#50976;&#50857;&#54616;&#45796;. &#51656;&#51032; &#52880;&#49884;&#47484; &#49324;&#50857;&#54616;&#44592; &#50948;&#54644; &#45817;&#49888;&#51008; &#47676;&#51200; &#44536;&#44163;&#51012; &#51060;&#50857; &#44032;&#45733;&#54616;&#46020;&#47197; &#54644;&#50556; &#54620;&#45796;: </p><pre class="programlisting">hibernate.cache.use_query_cache true</pre><p>&#51060; &#49444;&#51221;&#51008; &#46160; &#44060;&#51032; &#49352;&#47196;&#50868; &#52880;&#49884; &#50689;&#50669;&#46308; - &#52880;&#49884;&#46108; &#51656;&#51032; &#44208;&#44284; &#49483;&#46308;&#51012; &#48372;&#44288;&#54616;&#45716; &#44163; (<code class="literal">org.hibernate.cache.StandardQueryCache</code>), &#51656;&#51032; &#44032;&#45733;&#54620; &#53580;&#51060;&#48660;&#46308;&#50640; &#45824;&#54620; &#44032;&#51109; &#52572;&#49888; &#50629;&#45936;&#51060;&#53944;&#46308;&#50640; &#45824;&#54620; timestamp&#46308;&#51012; &#48372;&#44288;&#54616;&#45716; &#45796;&#47480; &#44163; (<code class="literal">org.hibernate.cache.UpdateTimestampsCache</code>)-&#51032; &#49373;&#49457;&#51012; &#44053;&#51228;&#54620;&#45796; . &#51656;&#51032; &#52880;&#49884;&#45716; &#44208;&#44284; &#49483; &#45236;&#50640; &#49892;&#51228; &#50644;&#54000;&#54000;&#46308;&#51032; &#49345;&#53468;&#47484; &#52880;&#49884;&#49884;&#53412;&#51648; &#50506;&#51020;&#51012; &#45432;&#53944;&#54616;&#46972;; &#44536;&#44163;&#51008; &#50724;&#51649; &#49885;&#48324;&#51088; &#44050;&#46308;&#44284; &#44050; &#53440;&#51077;&#51032; &#44208;&#44284;&#46308; &#47564;&#51012; &#52880;&#49884;&#49884;&#53416;&#45796;. &#46384;&#46972;&#49436; &#51656;&#51032; &#52880;&#49884;&#45716; &#54637;&#49345; second-level &#52880;&#49884;&#50752;
            &#54632;&#44760; &#49324;&#50857;&#46104;&#50612;&#50556; &#54620;&#45796;. 
         </p>
         <p>&#45824;&#48512;&#48516;&#51032; &#51656;&#51032;&#46308;&#51008; &#52880;&#49905;&#51004;&#47196;&#48512;&#53552; &#51060;&#51216;&#51060; &#50630;&#44592;&#50640;, &#46356;&#54260;&#53944;&#47196; &#51656;&#51032;&#46308;&#51008; &#52880;&#49884;&#46104;&#51648; &#50506;&#45716;&#45796;. &#52880;&#49905;&#51012; &#51060;&#50857; &#44032;&#45733;&#54616;&#46020;&#47197; &#54616;&#47140;&#47732;, <code class="literal">Query.setCacheable(true)</code>&#47484; &#54840;&#52636;&#54616;&#46972;. &#51060; &#54840;&#52636;&#51008; &#44592;&#51316; &#52880;&#49884; &#44208;&#44284;&#46308;&#51012; &#52286;&#45716; &#44163;&#51012; &#51656;&#51032;&#50640;&#44172; &#54728;&#50857;&#54644;&#51452;&#44144;&#45208; &#51656;&#51032;&#44032; &#49892;&#54665;&#46112; &#46412; &#44536;&#44163;&#51032; &#44208;&#44284;&#46308;&#51012; &#52880;&#49884;&#50640; &#52628;&#44032;&#54616;&#45716; &#44163;&#51012; &#54728;&#50857;&#54644;&#51456;&#45796;. 
         </p>
         <p>&#47564;&#51068; &#45817;&#49888;&#51060; &#51656;&#51032; &#52880;&#49884; &#47564;&#47308; &#51221;&#52293;&#46308;&#50640; &#45824;&#54620; &#49464;&#48128;&#54620; &#51228;&#50612;&#47484; &#54596;&#50836;&#47196; &#54624; &#44221;&#50864;, &#45817;&#49888;&#51008; <code class="literal">Query.setCacheRegion()</code>&#51012; &#54840;&#52636;&#54632;&#51004;&#47196;&#50024; &#53945;&#48324;&#54620; &#51656;&#51032;&#50640; &#45824;&#54644; &#47749;&#47749;&#46104;&#45768; &#52880;&#49884; &#50689;&#50669;&#51012; &#51648;&#51221;&#54624; &#49688;&#46020; &#51080;&#45796;. 
         </p><pre class="programlisting">List blogs = sess.createQuery("from Blog blog where blog.blogger = :blogger")
    .setEntity("blogger", blogger)
    .setMaxResults(15)
    .setCacheable(true)
    .setCacheRegion("frontpages")
    .list();</pre><p>&#47564;&#51068; &#51656;&#51032;&#44032; &#44536;&#44163;&#51032; &#51656;&#51032; &#52880;&#49884; &#50689;&#50669;&#51032; &#44081;&#49888;&#51012; &#44053;&#51228;&#49884;&#53020;&#50556; &#54616;&#45716; &#44221;&#50864;&#50640;, &#45817;&#49888;&#51008; <code class="literal">Query.setCacheMode(CacheMode.REFRESH)</code>&#47484; &#54840;&#52636;&#54644;&#50556; &#54620;&#45796;. &#51060;&#44163;&#51008; &#44592;&#48376; &#45936;&#51060;&#53552;&#44032; &#48324;&#46020;&#51032; &#54532;&#47196;&#49464;&#49828;&#47484; &#53685;&#54644; &#50629;&#45936;&#51060;&#53944;&#46104;&#50632;&#44256;(&#50696;&#47484; &#46308;&#47732;, Hibernate&#47484; &#53685;&#54644; &#48320;&#44221;&#46104;&#51648; &#50506;&#50520;&#44256;) &#53945;&#51221; &#51656;&#51032; &#44208;&#44284; &#49483;&#46308;&#51012; &#49440;&#53469;&#51201;&#51004;&#47196; &#44081;&#49888;&#54616;&#45716; &#44163;&#51012; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#44172; &#54728;&#50857;&#54644;&#51452;&#45716; &#44221;&#50864;&#46308;&#50640;&#49436;
            &#53945;&#48324;&#55176; &#50976;&#50857;&#54616;&#45796;. &#51060;&#44163;&#51008; <code class="literal">SessionFactory.evictQueries()</code>&#47484; &#53685;&#54644; &#51656;&#51032; &#52880;&#49884; &#50689;&#50669;&#51012; &#53748;&#44144;&#49884;&#53412;&#45716; &#48372;&#45796; &#54952;&#44284;&#51201;&#51064; &#45824;&#50504;&#51060;&#45796;. 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="performance-sessioncache.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="performance.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="performance-collections.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">19.3. &#52880;&#49884;&#46308;&#51012; &#44288;&#47532;&#54616;&#44592;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;19.5. &#53084;&#47113;&#49496; &#54140;&#54252;&#47676;&#49828; &#51060;&#54644;&#54616;&#44592;</td>
            </tr>
         </table>
      </div>
   </body>
</html>