<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>19.5. &#53084;&#47113;&#49496; &#54140;&#54252;&#47676;&#49828; &#51060;&#54644;&#54616;&#44592;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="performance.html" title="19&#51109;. &#54140;&#54252;&#47676;&#49828; &#44060;&#49440;&#54616;&#44592;">
      <link rel="prev" href="performance-querycache.html" title="19.4. &#51656;&#51032; &#52880;&#49884;">
      <link rel="next" href="performance-monitoring.html" title="19.6. &#54140;&#54252;&#47676;&#49828; &#47784;&#45768;&#53552;&#47553;&#54616;&#44592;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">19.5. &#53084;&#47113;&#49496; &#54140;&#54252;&#47676;&#49828; &#51060;&#54644;&#54616;&#44592;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="performance-querycache.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">19&#51109;. &#54140;&#54252;&#47676;&#49828; &#44060;&#49440;&#54616;&#44592;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="performance-monitoring.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="performance-collections"></a>19.5. &#53084;&#47113;&#49496; &#54140;&#54252;&#47676;&#49828; &#51060;&#54644;&#54616;&#44592;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#50864;&#47532;&#45716;&#51060;&#48120; &#53084;&#47113;&#49496;&#46308;&#50640; &#44288;&#54644; &#50584;&#44592;&#54616;&#45716;&#45936; &#44900; &#47566;&#51008; &#49884;&#44036;&#51012; &#49548;&#50836;&#54664;&#45796;. &#51060; &#51208;&#50640;&#49436; &#50864;&#47532;&#45716; &#53084;&#47113;&#49496;&#46308;&#51060; &#49892;&#54665; &#49884;&#50640; &#50612;&#46523;&#44172; &#54665;&#50948;&#54616;&#45716;&#51648;&#50640; &#44288;&#54620; &#54620; &#49933;&#51032; &#51137;&#51216;&#46308;&#51012; &#51312;&#47749;&#54624; &#44163;&#51060;&#45796;. </p>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="performance-collections-taxonomy"></a>19.5.1. &#48516;&#47448;
                     </h3>
                  </div>
               </div>
            </div>
            <p>Hibernate&#45716; &#49464; &#44032;&#51648; &#44592;&#48376;&#51201;&#51064; &#51333;&#47448;&#51032; &#53084;&#47113;&#49496;&#46308;&#51012; &#51221;&#51032;&#54620;&#45796;:</p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#44050;&#46308;&#51012; &#44032;&#51652; &#53084;&#47113;&#49496;&#46308;</p>
                  </li>
                  <li>
                     <p>one to many &#50672;&#44288;&#46308;</p>
                  </li>
                  <li>
                     <p>many to many &#50672;&#44288;&#46308;</p>
                  </li>
               </ul>
            </div>
            <p>&#51060; &#48516;&#47448;&#45716; &#50668;&#47084; &#44032;&#51648; &#53580;&#51060;&#48660;&#44284; foreign key &#44288;&#44228;&#46308;&#51012; &#44396;&#48324;&#51667;&#51648;&#47564; &#50864;&#47532;&#44032; &#44288;&#44228;&#54805; &#47784;&#54805;&#50640; &#45824;&#54644; &#50508; &#54596;&#50836;&#44032; &#51080;&#45716; &#47784;&#46304; &#44163;&#51012; &#50864;&#47532;&#50640;&#44172; &#47568;&#54644;&#51452;&#51648; &#50506;&#45716;&#45796;. &#44288;&#44228;&#54805; &#44396;&#51312;&#50752; &#54140;&#54252;&#47676;&#49828; &#53945;&#51669;&#46308;&#51012; &#50756;&#51204;&#54616;&#44172; &#51060;&#54644;&#54616;&#44592; &#50948;&#54644;, &#50864;&#47532;&#45716; &#46608;&#54620;
               &#53084;&#47113;&#49496; &#54665;&#46308;&#51012; &#50629;&#45936;&#51060;&#53944;&#54616;&#44144;&#45208; &#49325;&#51228;&#54616;&#44592; &#50948;&#54644; Hibernate&#50640; &#51032;&#54644; &#49324;&#50857;&#46104;&#45716; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412;&#51032; &#44396;&#51312;&#47484; &#44160;&#53664;&#54644;&#50556; &#54620;&#45796;. &#51060;&#44163;&#51008; &#45796;&#51020; &#48516;&#47448;&#47484; &#51228;&#50504;&#54620;&#45796;: 
            </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#51064;&#45937;&#49905; &#46108; &#53084;&#47113;&#49496;&#46308;</p>
                  </li>
                  <li>
                     <p>set&#46308;</p>
                  </li>
                  <li>
                     <p>bag&#46308;</p>
                  </li>
               </ul>
            </div>
            <p>&#47784;&#46304; &#51064;&#45937;&#49905;&#46108; &#53084;&#47113;&#49496;&#46308;(map&#46308;, list&#46308;, array&#46308;)&#51008; <code class="literal">&lt;key&gt;</code>&#50752; <code class="literal">&lt;index&gt;</code> &#52972;&#47100;&#46308;&#47196; &#51060;&#47336;&#50612;&#51652; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412;&#47484; &#44054;&#45716;&#45796;. &#51060; &#44221;&#50864;&#50640; &#53084;&#47113;&#49496; &#50629;&#45936;&#51060;&#53944;&#46308;&#51008; &#45824;&#44060; &#44537;&#55176; &#54952;&#50984;&#51201;&#51060;&#45796; - Hibernate&#44032; &#44536;&#44163;&#51012; &#50629;&#45936;&#51060;&#53944;&#45208; &#49325;&#51228;&#47484; &#49884;&#46020;&#54624; &#46412; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412;&#45716; &#54952;&#50984;&#51201;&#51004;&#47196; &#51064;&#45937;&#49905;&#46112; &#49688; &#51080;&#44256; &#53945;&#51221; &#54665;&#51008; &#54952;&#50984;&#51201;&#51004;&#47196;
               &#50948;&#52824;&#51648;&#50892;&#51656; &#49688; &#51080;&#45796;. 
            </p>
            <p>Sets have a primary key consisting of <code class="literal">&lt;key&gt;</code> and element columns. This may be less efficient for some types of collection element, particularly composite elements or
               large text or binary fields; the database may not be able to index a complex primary key as efficiently. On the other hand,
               for one to many or many to many associations, particularly in the case of synthetic identifiers, it is likely to be just as
               efficient. (Side-note: if you want <code class="literal">SchemaExport</code> to actually create the primary key of a <code class="literal">&lt;set&gt;</code> for you, you must declare all columns as <code class="literal">not-null="true"</code>.) 
            </p>
            <p><code class="literal">&lt;idbag&gt;</code> &#47588;&#54609;&#46308;&#51008; &#45824;&#50857; &#53412;&#47484; &#51221;&#51032;&#54616;&#50668;&#49436;, &#44536;&#44163;&#46308;&#51008; &#54637;&#49345; &#50629;&#45936;&#51060;&#53944;&#50640; &#47588;&#50864; &#54952;&#50984;&#51201;&#51060;&#45796;. &#49324;&#49892;, &#44536;&#44163;&#46308;&#51008; &#52572;&#49345;&#51032; &#44221;&#50864;&#51060;&#45796;. 
            </p>
            <p>Bag&#46308;&#51008; &#44032;&#51109; &#45208;&#49244; &#44221;&#50864;&#51060;&#45796;. &#50780;&#45264;&#54616;&#47732; &#54616;&#45208;&#51032; bag&#51008; &#51473;&#48373; &#50836;&#49548; &#44050;&#46308;&#51012; &#54728;&#50857;&#54616;&#44256; &#51064;&#45937;&#49828; &#52972;&#47100;&#51012; &#44054;&#51648; &#50506;&#44592; &#46412;&#47928;&#50640;, &#54532;&#46972;&#51060;&#47672;&#47532; &#53412;&#44032; &#51221;&#51032;&#46112; &#49688; &#50630;&#45796;. Hibernate&#45716; &#51473;&#48373; &#54665;&#46308; &#49324;&#51060;&#47484; &#44396;&#48516; &#51667;&#45716; &#48169;&#48277;&#51012; &#44054;&#44256; &#51080;&#51648;
               &#50506;&#45796;. Hibernate&#45716; &#44536;&#44163;&#51060; &#48320;&#44221;&#46112; &#46412;&#47560;&#45796; (&#54620; &#44060;&#51032; DELETE&#47196;) &#53084;&#47113;&#49496;&#51012; &#50756;&#51204;&#54616;&#44172; &#51228;&#44144;&#54616;&#44256; &#45796;&#49884; &#49373;&#49457;&#49884;&#53428;&#51004;&#47196;&#50024; &#51060; &#47928;&#51228;&#47484; &#54644;&#44208;&#54620;&#45796;. &#51060;&#44163;&#51008; &#47588;&#50864; &#48708;&#54952;&#50984;&#51201;&#51060;&#45796;. 
            </p>
            <p>one-to-many &#50672;&#44288;&#51032; &#44221;&#50864;, "&#54532;&#46972;&#51060;&#47672;&#47532; &#53412;"&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53580;&#51060;&#48660;&#51032; &#47932;&#47532;&#51201;&#51064; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412;&#44032; &#50500;&#45776; &#49688;&#46020; &#51080;&#51648;&#47564;- &#51060; &#44221;&#50864;&#50640;&#49436;&#46020; &#50948;&#51032; &#48516;&#47448;&#45716; &#50668;&#51204;&#55176; &#50976;&#50857;&#54616;&#45796;. (&#44536;&#44163;&#51008; &#50668;&#51204;&#55176; Hibernate&#44032; &#53084;&#47113;&#49496;&#51032; &#44060;&#48324; &#54665;&#46308;&#51012;
               &#50612;&#46523;&#44172; "&#50948;&#52824;&#51648;&#50864;&#45716;"&#51648;&#47484; &#48152;&#50689;&#54620;&#45796;.) 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="performance-collections-mostefficientupdate"></a>19.5.2. List, map, idbag, set&#46308;&#51008; update&#50640; &#44032;&#51109; &#54952;&#50984;&#51201;&#51064; &#53084;&#47113;&#49496;&#46308;&#51060;&#45796;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#50948;&#51032; &#45436;&#51032;&#50640;&#49436;, &#51064;&#45937;&#49905;&#46108; &#53084;&#47113;&#49496;&#46308;&#44284; (&#45824;&#44060;) set&#46308;&#51060; &#50836;&#49548;&#46308;&#51012; &#52628;&#44032;&#54616;&#44256;, &#51228;&#44144;&#54616;&#44256; &#50629;&#45936;&#51060;&#53944;&#54632;&#50640; &#51080;&#50612; &#44032;&#51109; &#54952;&#50984;&#51201;&#51064; &#50724;&#54140;&#47112;&#51060;&#49496;&#51012; &#54728;&#50857;&#54644;&#51456;&#45796;. </p>
            <p>&#50500;&#47560; &#51064;&#45937;&#49905; &#46108; &#53084;&#47113;&#49496;&#46308;&#51060; many to many &#50672;&#44288;&#46308;&#51012; &#50948;&#54620; &#46608;&#45716; &#44050;&#46308;&#51012; &#44032;&#51652; &#53084;&#47113;&#49496;&#46308;&#51012; &#50948;&#54620; set&#46308;&#50640; &#45824;&#54644; &#44054;&#44256; &#51080;&#45716; &#54616;&#45208; &#51060;&#49345;&#51032; &#51109;&#51216;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;. <code class="literal">Set</code>&#51032; &#44396;&#51312; &#46412;&#47928;&#50640;, Hibernate&#45716; &#50836;&#49548;&#44032; "&#48320;&#44221;"&#46112; &#46412; &#54665;&#51012; <code class="literal">UPDATE</code> &#54616;&#51648; &#50506;&#45716;&#45796;. <code class="literal">Set</code>&#50640; &#45824;&#54620; &#48320;&#44221;&#46308;&#51008; &#54637;&#49345; (&#44060;&#48324; &#54665;&#46308;&#50640; &#45824;&#54620;) <code class="literal">INSERT</code>&#50752; <code class="literal">DELETE</code>&#47484; &#53685;&#54644; &#46041;&#51089;&#54620;&#45796;. &#45796;&#49884; &#51060; &#44160;&#53664;&#45716; one to many &#50672;&#44288;&#46308;&#50640; &#51201;&#50857;&#46104;&#51648; &#50506;&#45716;&#45796;. 
            </p>
            <p>&#48176;&#50676;&#46308;&#51060; lazy &#46112; &#49688; &#50630;&#51020;&#51012; &#44288;&#52272; &#54620; &#54980;&#50640;, &#50864;&#47532;&#45716; list&#46308;, map&#46308;, &#44536;&#47532;&#44256; idbag&#46308;&#51060; &#45800;&#46021;&#51060; &#50500;&#45772; set&#46308;&#51012; &#44032;&#51652; &#44032;&#51109; &#54140;&#54252;&#47676;&#49828;&#44032; &#51339;&#51008;(non-inverse) &#53084;&#47113;&#49496; &#53440;&#51077;&#46308;&#51076;&#51012; &#44208;&#47200; &#51648;&#51012; &#44163;&#51060;&#45796;. Set&#46308;&#51008;
               Hibernate &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#50640;&#49436; &#44032;&#51109; &#44277;&#53685;&#46108; &#51333;&#47448;&#51032; &#53084;&#47113;&#49496;&#51060; &#46112; &#44163;&#51060;&#46972; &#50696;&#49345;&#46108;&#45796;. &#51060;&#44163;&#51008; "set" &#51032;&#48120;&#44032; &#44288;&#44228;&#54805; &#47784;&#54805;&#50640;&#49436; &#44032;&#51109; &#44256;&#50976;&#54620; &#44163;&#51060;&#44592; &#46412;&#47928;&#51060;&#45796;. 
            </p>
            <p>&#54616;&#51648;&#47564;, &#51096; &#49444;&#44228;&#46108; Hibernate &#46020;&#47700;&#51064; &#47784;&#54805;&#46308;&#50640;&#49436;, &#50864;&#47532;&#45716; &#45824;&#44060; &#45824;&#48512;&#48516;&#51032; &#53084;&#47113;&#49496;&#46308;&#51060; &#49324;&#49892; <code class="literal">inverse="true"</code>&#47484; &#44032;&#51652; one-to-many &#50672;&#44288;&#46308;&#51076;&#51012; &#48372;&#44172; &#46108;&#45796;. &#51060;&#46308; &#50672;&#44288;&#46308;&#51032; &#44221;&#50864;, &#50629;&#45936;&#51060;&#53944;&#45716; &#50672;&#44288;&#51032; many-to-one &#50644;&#46300;&#50640; &#51032;&#54644; &#52376;&#47532;&#46104;&#44256;, &#46384;&#46972;&#49436; &#53084;&#47113;&#49496; &#50629;&#45936;&#51060;&#53944; &#54140;&#54252;&#47676;&#49828;&#50640; &#45824;&#54620; &#44160;&#53664;&#46308;&#51008; &#45800;&#49692;&#55176; &#51201;&#50857;&#46104;&#51648; &#50506;&#45716;&#45796;. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="performance-collections-mostefficentinverse"></a>19.5.3. Bag&#46308;&#44284; list&#46308;&#51008; &#44032;&#51109; &#54952;&#50984;&#51201;&#51064; inverse &#53084;&#47113;&#49496;&#46308;&#51060;&#45796;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#45800;&#51648; &#45817;&#49888;&#51060; &#50689;&#50896;&#55176; bag&#46308;&#51012; &#48260;&#47532;&#44592; &#51204;&#50640;, bag&#46308;(&#44284; &#46608;&#54620; list&#46308;)&#51060; set&#46308;&#48372;&#45796; &#55016;&#50476; &#45908; &#49457;&#45733;&#51060; &#51339;&#51008; &#53945;&#48324;&#54620; &#44221;&#50864;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;. <code class="literal">inverse="true"</code>&#47484; &#44032;&#51652; &#53084;&#47113;&#49496;&#46308;(&#50696;&#47484; &#46308;&#50612;, &#54364;&#51456; &#50577;&#48169;&#54693; one-to-many &#44288;&#44228; &#53945;&#51656;)&#51032; &#44221;&#50864;, &#50864;&#47532;&#45716; bag &#50836;&#49548;&#46308;&#51012; &#52488;&#44592;&#54868;(&#54168;&#52824;) &#49884;&#53420; &#54596;&#50836; &#50630;&#51060; bag &#46608;&#45716; list&#50640; &#50836;&#49548;&#46308;&#51012; &#52628;&#44032;&#49884;&#53420; &#49688; &#51080;&#45796;! &#51060;&#44163;&#51008; <code class="literal">Collection.add()</code> &#46608;&#45716; <code class="literal">Collection.addAll()</code>&#51060; (<code class="literal">Set</code>&#44284;&#45716; &#45804;&#47532;) &#54637;&#49345; bag &#46608;&#45716; <code class="literal">List</code>&#50640; &#45824;&#54644; true&#47484; &#48152;&#54872;&#54644;&#50556;&#54616;&#44592; &#46412;&#47928;&#51060;&#45796;. &#51060;&#44163;&#51008; &#55016;&#50476; &#45796;&#51020; &#44277;&#53685;&#51201;&#51064; &#53076;&#46300;&#47484; &#45908; &#48736;&#47476;&#44172; &#47564;&#46308; &#49688; &#51080;&#45796;. 
            </p><pre class="programlisting">Parent p = (Parent) sess.load(Parent.class, id);
Child c = new Child();
c.setParent(p);
p.getChildren().add(c);  //no need to fetch the collection!
sess.flush();</pre></div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="performance-collections-oneshotdelete"></a>19.5.4. &#50896; &#49399; delete
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#51333;&#51333; &#53084;&#47113;&#49496; &#50836;&#49548;&#46308;&#51012; &#54616;&#45208;&#50473; &#49325;&#51228;&#54616;&#45716; &#44163;&#51008; &#44537;&#55176; &#48708;&#54952;&#50984;&#51201;&#51068; &#49688; &#51080;&#45796;! Hibernate&#45716; &#50756;&#51204;&#54616;&#44172; &#48148;&#48372;&#44032; &#50500;&#45768;&#50612;&#49436;, &#44536;&#44163;&#51008; &#49352;&#47196;&#50868; &#44277;&#48177;&#51032; &#53084;&#47113;&#49496;&#51032; &#44221;&#50864;(&#50696;&#47484; &#46308;&#50612; &#45817;&#49888;&#51060; <code class="literal">list.clear()</code>&#47484; &#54840;&#52636;&#54664;&#51012; &#44221;&#50864;)&#50640; &#44536;&#44163;&#51012; &#54665;&#54616;&#51648; &#50506;&#51012; &#44163;&#51076;&#51012; &#50508;&#44256; &#51080;&#45796;. &#51060; &#44221;&#50864;&#50640;, Hibernate&#45716; &#54616;&#45208;&#51032; <code class="literal">DELETE</code> &#47749;&#47161;&#51012; &#45236;&#47540; &#44163;&#51060;&#44256; &#50864;&#47532;&#45716; &#47784;&#46160; &#54665;&#54664;&#45796;! 
            </p>
            <p>&#50864;&#47532;&#44032; &#44600;&#51060; 20&#51064; &#54616;&#45208;&#51032; &#53084;&#47113;&#49496;&#50640; &#54620; &#44060;&#51032; &#50836;&#49548;&#47484; &#52628;&#44032;&#54616;&#44256; &#44536;&#47088; &#45796;&#51020; &#46160; &#44060;&#51032; &#50836;&#49548;&#46308;&#51012; &#51228;&#44144;&#54620;&#45796;&#44256; &#44032;&#51221;&#54616;&#51088;. Hibernate&#45716; (&#53084;&#47113;&#49496;&#51060; bag&#44032; &#50500;&#45772; &#54620;) &#54620; &#44060;&#51032; <code class="literal">INSERT</code> &#47928;&#51109;&#44284; &#46160; &#44060;&#51032; <code class="literal">DELETE</code> &#47928;&#51109;&#51012; &#47749;&#47161; &#45236;&#47540; &#44163;&#51060;&#45796;. &#51060;&#44163;&#51008; &#54869;&#49892;&#55176; &#47560;&#51020;&#50640; &#46304;&#45796;. 
            </p>
            <p>&#54616;&#51648;&#47564;, &#50864;&#47532;&#44032; &#46160; &#44060;&#51032; &#50836;&#49548;&#46308;&#51012; &#45224;&#44200;&#46164;&#52292; 18 &#44060;&#51032; &#50836;&#49548;&#46308;&#51012; &#51228;&#44144;&#54616;&#44256; &#45208;&#49436; &#49464; &#44060;&#51032; &#49352;&#47196;&#50868; &#50836;&#49548;&#46308;&#51012; &#52628;&#44032;&#54620;&#45796;&#44256; &#44032;&#51221;&#54616;&#51088;. &#46160; &#44032;&#51648; &#44032;&#45733;&#54620; &#52376;&#47532; &#48169;&#48277;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;. </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#54616;&#45208;&#50473; &#50676; &#50668;&#45919; &#44060;&#51032; &#54665;&#46308;&#51012; &#49325;&#51228;&#54620; &#45796;&#51020;&#50640; &#49464; &#44060;&#51032; &#54665;&#46308;&#51012; &#49341;&#51077;&#49884;&#53416;&#45796;</p>
                  </li>
                  <li>
                     <p>(&#54620; &#44060;&#51032; SQL <code class="literal">DELETE</code>&#47196;)&#51204;&#52404; &#53084;&#47113;&#49496;&#51012; &#49325;&#51228;&#54616;&#44256; &#47784;&#46304; &#45796;&#49455;&#44060;&#51032; &#54788;&#51116; &#50836;&#49548;&#46308;&#51012; (&#54616;&#45208;&#50473;) insert &#49884;&#53416;&#45796;
                     </p>
                  </li>
               </ul>
            </div>
            <p>Hibernate&#45716; &#46160; &#48264;&#51704; &#50741;&#49496;&#51060; &#50500;&#47560; &#51060; &#44221;&#50864;&#50640; &#45908; &#48736;&#47476;&#45796;&#45716; &#51216;&#51012; &#50508; &#47564;&#53372; &#52649;&#48516;&#55176; &#50689;&#47532;&#54616;&#51648; &#50506;&#45796;.(&#44536;&#47532;&#44256; Hibernate&#44032; &#44536;&#47111;&#44172; &#50689;&#47532;&#54644;&#51648;&#45716; &#44163;&#51012; &#55148;&#47581; &#54616;&#45716; &#44163;&#51008; &#44032;&#45733;&#54616;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;; &#44536;&#47088; &#53945;&#51669;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47532;&#44144;&#46308;
               &#46321;&#51012; &#54844;&#46041;&#49828;&#47101;&#44172; &#54624; &#49688;&#46020; &#51080;&#45796;.) 
            </p>
            <p>&#45796;&#54665;&#55176;, &#45817;&#49888;&#51008; &#50896;&#47000;&#51032; &#53084;&#47113;&#49496;&#51012; &#54224;&#44592;&#49884;&#53412;&#44256;(&#50696;&#47484; &#46308;&#50612; &#52280;&#51312; &#54644;&#51228;&#54616;&#44256;) &#47784;&#46304; &#54788;&#51116; &#50836;&#49548;&#46308;&#51012; &#44032;&#51652; &#49352;&#47196;&#51060; &#52488;&#44592;&#54868;&#46108; &#53084;&#47113;&#49496;&#51012; &#48152;&#54872;&#54632;&#51004;&#47196;&#50024; &#50500;&#47924;&#46412;&#46304;&#51648; &#51060; &#53945;&#51669;&#51012; &#44053;&#51228;&#49884;&#53420; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; &#49884;&#44036;&#51060; &#55120;&#47492;&#50640; &#46384;&#46972; &#47588;&#50864; &#50976;&#50857;&#54616;&#44256; &#44053;&#47141;&#54644;&#51656;
               &#49688; &#51080;&#45796;. 
            </p>
            <p>&#47932;&#47200; &#45800; &#54620;&#48264;&#51032; &#49325;&#51228;(one-shot-delete)&#45716; <code class="literal">inverse="true"</code>&#47196; &#47588;&#54609;&#46108; &#53084;&#47113;&#49496;&#46308;&#50640; &#51201;&#50857;&#46104;&#51648; &#50506;&#45716;&#45796;. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="performance-querycache.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="performance.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="performance-monitoring.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">19.4. &#51656;&#51032; &#52880;&#49884;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;19.6. &#54140;&#54252;&#47676;&#49828; &#47784;&#45768;&#53552;&#47553;&#54616;&#44592;</td>
            </tr>
         </table>
      </div>
   </body>
</html>