<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>4.5. Tuplizer&#46308;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="persistent-classes.html" title="4&#51109;. &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;">
      <link rel="prev" href="persistent-classes-dynamicmodels.html" title="4.4. &#46041;&#51201;&#51064; &#47784;&#54805;&#46308;">
      <link rel="next" href="persistent-classes-extensions.html" title="4.6. Extentsions">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">4.5. Tuplizer&#46308;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="persistent-classes-dynamicmodels.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">4&#51109;. &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="persistent-classes-extensions.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="persistent-classes-tuplizers"></a>4.5. Tuplizer&#46308;
                  </h2>
               </div>
            </div>
         </div>
         <p><code class="literal">org.hibernate.tuple.Tuplizer</code>, &#44536;&#47532;&#44256; &#44536;&#44163;&#51032; &#49436;&#48652;-&#51064;&#53552;&#54168;&#51060;&#49828;&#46308;&#51008; &#45936;&#51060;&#53552;&#51032; &#51312;&#44033;&#50640; &#45824;&#54620; &#53945;&#48324;&#54620; &#54364;&#54788;&#51032; <code class="literal">org.hibernate.EntityMode</code>&#44032; &#51452;&#50612;&#51648;&#47732; &#44536; &#54364;&#54788;&#51012; &#44288;&#47532;&#54616;&#45716; &#52293;&#51076;&#51060; &#51080;&#45796;. &#47564;&#51068; &#51452;&#50612;&#51652; &#45936;&#51060;&#53552; &#51312;&#44033;&#51060; &#54616;&#45208;&#51032; &#45936;&#51060;&#53552; &#44396;&#51312;&#47196; &#44036;&#51452;&#46112; &#44221;&#50864;, &#44536;&#46412; &#54616;&#45208;&#51032; tuplizer&#45716; &#44536;&#47088; &#45936;&#51060;&#53552; &#44396;&#51312;&#47484; &#49373;&#49457;&#49884;&#53412;&#45716; &#48169;&#48277;&#44284; &#44536;&#47088; &#45936;&#51060;&#53552; &#44396;&#51312;&#47196;&#48512;&#53552; &#44050;&#46308;&#51012; &#52628;&#52636;&#49884;&#53412;&#45716;
            &#48169;&#48277; &#44536;&#47532;&#44256; &#44536;&#47088; &#45936;&#51060;&#53552;&#44396;&#51312; &#49549;&#51004;&#47196; &#44050;&#46308;&#51012; &#49341;&#51077;&#49884;&#53412;&#45716; &#48169;&#48277;&#51012; &#50508;&#44256; &#51080;&#45716; &#44163;&#51060;&#45796;. &#50696;&#47484; &#46308;&#50612;, POJO &#50644;&#54000;&#54000; &#47784;&#46300;&#51032; &#44221;&#50864;, &#45824;&#51025;&#54616;&#45716; tuplizer&#45716; &#44536;&#44163;&#51032; &#49373;&#49457;&#51088;&#47484; &#53685;&#54644; POJO&#47484; &#49373;&#49457;&#49884;&#53412;&#45716; &#48169;&#48277;, &#44536;&#47532;&#44256; &#51221;&#51032;&#46108; &#54532;&#47196;&#54140;&#54000;
            &#51217;&#44540;&#51088;&#46308;&#51012; &#49324;&#50857;&#54616;&#50668; POJO &#54532;&#47196;&#54140;&#54000;&#46308;&#50640; &#51217;&#44540;&#54616;&#45716; &#48169;&#48277;&#51012; &#50504;&#45796;. <code class="literal">org.hibernate.tuple.entity.EntityTuplizer</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#50752; <code class="literal">org.hibernate.tuple.component.ComponentTuplizer</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#50640; &#51032;&#54644; &#54364;&#54788;&#46104;&#45716; &#46160; &#44032;&#51648; &#44256;&#44553; &#50976;&#54805;&#51032; Tuplizer&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;. <code class="literal">EntityTuplizer</code>&#46308;&#51008; &#50644;&#54000;&#54000;&#46308;&#50640; &#44288;&#54644;&#49436;&#45716; &#50948;&#50640; &#50616;&#44553;&#46108; &#44228;&#50557;&#46308;&#51012; &#47588;&#54609;&#54624; &#52293;&#51076;&#51060; &#51080;&#45716; &#48152;&#47732;&#50640;, <code class="literal">ComponentTuplizer</code>&#46308;&#51008; &#52980;&#54252;&#45324;&#53944;&#46308;&#50640; &#45824;&#54644;&#49436;&#46020; &#46041;&#51068;&#54620; &#44163;&#51012; &#54665;&#54620;&#45796;. 
         </p>
         <p>&#49324;&#50857;&#51088;&#46308;&#51008; &#46608;&#54620; &#44536;&#46308; &#51088;&#49888;&#51032; tuplizer&#46308;&#51012; &#54540;&#47084;&#44536; &#49884;&#53420; &#49688; &#51080;&#45796;. &#50500;&#47560; &#45817;&#49888;&#51008; dynamic-map entity-mode &#46041;&#50504;&#50640; &#49324;&#50857;&#46104;&#45716; <code class="literal">java.util.HashMap</code> &#45824;&#49888;&#50640; &#54616;&#45208;&#51032; <code class="literal">java.util.Map</code> &#44396;&#54788;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;; &#46608;&#45716; &#50500;&#47560; &#45817;&#49888;&#51008; &#46356;&#54260;&#53944;&#47196; &#49324;&#50857;&#46104;&#45716; &#48169;&#46020; &#48372;&#45796;&#45716; &#54616;&#45208;&#51032; &#45796;&#47480; &#45796;&#47480; &#54532;&#47533;&#49884; &#49328;&#52636; &#48169;&#46020;&#47484; &#54596;&#50836;&#47196; &#54620;&#45796;. &#46168;&#45796; &#54616;&#45208;&#51032; &#47582;&#52644;&#54805; tuplizer&#47484; &#51221;&#51032;&#54632;&#51004;&#47196;&#50024; &#49457;&#52712;&#46112; &#44163;&#51060;&#45796;. Tuplizer&#46308; &#51221;&#51032;&#46308;&#51008; &#44536;&#44163;&#46308;&#51060;
            &#44288;&#47532;&#54624; &#49688;&#45800;&#51064; &#50644;&#54000;&#54000; &#47588;&#54609; &#46608;&#45716; &#52980;&#54252;&#45324;&#53944; &#47588;&#54609;&#50640; &#52392;&#48512;&#46108;&#45796;. &#50864;&#47532;&#51032; &#44256;&#44061; &#50644;&#54000;&#54000;&#50640; &#45824;&#54620; &#50696;&#51228;&#47196; &#46104;&#46028;&#50500;&#44032;&#47732;: 
         </p><pre class="programlisting">&lt;hibernate-mapping&gt;
    &lt;class entity-name="Customer"&gt;
        &lt;!--
            Override the dynamic-map entity-mode
            tuplizer for the customer entity
        --&gt;
        &lt;tuplizer entity-mode="dynamic-map"
                class="CustomMapTuplizerImpl"/&gt;

        &lt;id name="id" type="long" column="ID"&gt;
            &lt;generator class="sequence"/&gt;
        &lt;/id&gt;

        &lt;!-- other properties --&gt;
        ...
    &lt;/class&gt;
&lt;/hibernate-mapping&gt;


public class CustomMapTuplizerImpl
        extends org.hibernate.tuple.entity.DynamicMapEntityTuplizer {
    // override the buildInstantiator() method to plug in our custom map...
    protected final Instantiator buildInstantiator(
            org.hibernate.mapping.PersistentClass mappingInfo) {
        return new CustomMapInstantiator( mappingInfo );
    }

    private static final class CustomMapInstantiator
            extends org.hibernate.tuple.DynamicMapInstantitor {
        // override the generateMap() method to return our custom map...
            protected final Map generateMap() {
                    return new CustomMap();
            }
    }
}</pre></div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="persistent-classes-dynamicmodels.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="persistent-classes.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="persistent-classes-extensions.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">4.4. &#46041;&#51201;&#51064; &#47784;&#54805;&#46308;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;4.6. Extentsions</td>
            </tr>
         </table>
      </div>
   </body>
</html>