<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>4&#51109;. &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="configuration-j2ee.html" title="3.8. J2EE &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#53685;&#54633;">
      <link rel="next" href="persistent-classes-inheritance.html" title="4.2. &#49345;&#49549; &#44396;&#54788;&#54616;&#44592;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">4&#51109;. &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="configuration-j2ee.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="persistent-classes-inheritance.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="persistent-classes"></a>4&#51109;. &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#51008; &#48708;&#51648;&#45768;&#49828; &#47928;&#51228;&#51032; &#50644;&#54000;&#54000;&#46308;(&#50696;&#47484; &#46308;&#50612; E-Commerce &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#44256;&#44061;&#51060;&#45208; &#51452;&#47928;)&#51012; &#44396;&#54788;&#54616;&#45716; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#45236;&#51032; &#53364;&#47000;&#49828;&#46308;&#51060;&#45796;. &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#51032; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#50689;&#49549; &#49345;&#53468;&#50640; &#51080;&#45716; &#44163;&#51004;&#47196; &#51204;&#54784; &#44036;&#51452;&#46104;&#51648; &#50506;&#45716;&#45796;
            - &#45824;&#49888;&#50640; &#54616;&#45208;&#51032; &#51064;&#49828;&#53556;&#49828;&#45716; transient &#46608;&#45716; detached &#49345;&#53468;&#51068; &#49688; &#51080;&#45796;. 
         </p>
         <p>Hibernate&#45716; &#51060;&#46308; &#53364;&#47000;&#49828;&#46308;&#51060; Plain Old Java Object (POJO) &#54532;&#47196;&#44536;&#47000;&#48141; &#47784;&#54805;&#51004;&#47196;&#49436; &#50508;&#47140;&#51652;, &#47751;&#47751; &#44036;&#45800;&#54620; &#44508;&#52825;&#46308;&#51012; &#46384;&#47484; &#44221;&#50864;&#50640; &#44032;&#51109; &#51096; &#46041;&#51089;&#54620;&#45796;. &#54616;&#51648;&#47564; &#51060;&#46308; &#44508;&#52825;&#46308; &#51473; &#50612;&#46500; &#44163;&#46020; &#50612;&#47140;&#50868; &#49324;&#50577;&#46308;&#51060;
            &#50500;&#45768;&#45796;. &#51652;&#51221; Hibernate3&#45716; &#45817;&#49888;&#51032; &#50689;&#49549; &#44061;&#52404;&#46308;&#51032; &#53945;&#51669;&#50640; &#45824;&#54644; &#47588;&#50864; &#51201;&#51008; &#44163;&#51012; &#44032;&#51221;&#54620;&#45796;. &#45817;&#49888;&#51008; &#45796;&#47480; &#48169;&#48277;&#46308;&#47196; &#46020;&#47700;&#51064; &#47784;&#54805;&#51012; &#54364;&#54788;&#54624; &#49688; &#51080;&#45796; : &#50696;&#47484; &#46308;&#50612; <code class="literal">Map</code> &#51064;&#49828;&#53556;&#49828;&#51032; &#53944;&#47532;&#46308;&#51012; &#49324;&#50857;&#54616;&#44592;. 
         </p>
         <div class="sect1" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="persistent-classes-pojo"></a>4.1. &#44036;&#45800;&#54620; POJO &#50696;&#51228;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#45824;&#48512;&#48516;&#51032; &#51088;&#48148; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#51008; &#44256;&#50577;&#51060;&#44284;&#46308;&#51012; &#54364;&#54788;&#54616;&#45716; &#50689;&#49549; &#53364;&#47000;&#49828;&#47484; &#54596;&#50836;&#47196; &#54620;&#45796;. </p><pre class="programlisting">package eg;
import java.util.Set;
import java.util.Date;

public class Cat {
    private Long id; // identifier

    private Date birthdate;
    private Color color;
    private char sex;
    private float weight;
    private int litterId;

    private Cat mother;
    private Set kittens = new HashSet();

    private void setId(Long id) {
        this.id=id;
    }
    public Long getId() {
        return id;
    }

    void setBirthdate(Date date) {
        birthdate = date;
    }
    public Date getBirthdate() {
        return birthdate;
    }

    void setWeight(float weight) {
        this.weight = weight;
    }
    public float getWeight() {
        return weight;
    }

    public Color getColor() {
        return color;
    }
    void setColor(Color color) {
        this.color = color;
    }

    void setSex(char sex) {
        this.sex=sex;
    }
    public char getSex() {
        return sex;
    }

    void setLitterId(int id) {
        this.litterId = id;
    }
    public int getLitterId() {
        return litterId;
    }

    void setMother(Cat mother) {
        this.mother = mother;
    }
    public Cat getMother() {
        return mother;
    }
    void setKittens(Set kittens) {
        this.kittens = kittens;
    }
    public Set getKittens() {
        return kittens;
    }
    
    // addKitten not needed by Hibernate
    public void addKitten(Cat kitten) {
            kitten.setMother(this);
        kitten.setLitterId( kittens.size() ); 
        kittens.add(kitten);
    }
}</pre><p>&#51456;&#49688;&#54624; &#45348; &#44060;&#51032; &#51452;&#50836; &#44508;&#52825;&#46308;&#51060; &#45796;&#51020;&#50640; &#51080;&#45796;: </p>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="persistent-classes-pojo-constructor"></a>4.1.1. &#50500;&#44508;&#47676;&#53944; &#50630;&#45716; &#49373;&#49457;&#51088;&#47484; &#44396;&#54788;&#54616;&#46972;
                        </h3>
                     </div>
                  </div>
               </div>
               <p><code class="literal">Cat</code>&#51008; &#50500;&#44508;&#47676;&#53944; &#50630;&#45716; &#49373;&#49457;&#51088;&#47484; &#44054;&#45716;&#45796;. &#47784;&#46304; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#51008; Hibernate&#45716; <code class="literal">Constructor.newInstance()</code>&#47484; &#49324;&#50857;&#54616;&#50668; &#44536;&#44163;&#46308;&#51012; &#52488;&#44592;&#54868; &#49884;&#53420; &#49688; &#51080;&#46020;&#47197; &#46356;&#54260;&#53944; &#49373;&#49457;&#51088; (public&#51060; &#50500;&#45776; &#49688; &#51080;&#45796;)&#47484; &#44032;&#51256;&#50556; &#54620;&#45796;. &#50864;&#47532;&#45716; Hibernate &#45236;&#50640;&#49436; &#47088;&#53440;&#51076; &#54532;&#46973;&#49884; &#49373;&#49457;&#51012; &#50948;&#54620; &#52572;&#49548;&#54620;&#51032; <span class="emphasis"><em>&#54056;&#53412;&#51648;</em></span> &#44032;&#49884;&#49457;(visibility)&#47484; &#44032;&#51652; &#46356;&#54260;&#53944; &#49373;&#49457;&#51088;&#47484; &#44032;&#51656; &#44163;&#51012; &#44053;&#47141;&#54616;&#44172; &#44428;&#51109;&#54620;&#45796;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="persistent-classes-pojo-identifier"></a>4.1.2. identifier &#54532;&#47196;&#54140;&#54000;&#47484; &#51228;&#44277;&#54616;&#46972;(&#50741;&#49496;)
                        </h3>
                     </div>
                  </div>
               </div>
               <p><code class="literal">Cat</code>&#51008; <code class="literal">id</code>&#47196; &#47749;&#47749;&#46108; &#54616;&#45208;&#51032; &#54532;&#47196;&#54140;&#54000;&#47484; &#44054;&#45716;&#45796;. &#51060; &#54532;&#47196;&#54140;&#54000;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53580;&#51060;&#48660;&#51032; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412; &#52972;&#47100;&#51004;&#47196; &#47588;&#54609;&#46108;&#45796;. &#51060; &#54532;&#47196;&#54140;&#54000;&#45716; &#50612;&#46500; &#44163;&#51004;&#47196; &#47749;&#47749;&#46112; &#49688;&#46020; &#51080;&#44256;, &#44536;&#44163;&#51032; &#53440;&#51077;&#51008; &#51076;&#51032;&#51032; &#50896;&#49884; &#53440;&#51077;, &#50896;&#49884; "wrapper" &#53440;&#51077;,
                  <code class="literal">java.lang.String</code> &#46608;&#45716; <code class="literal">java.util.Date</code>&#51068; &#49688; &#51080;&#45796;. (&#47564;&#51068; &#45817;&#49888;&#51032; &#47532;&#44144;&#49884; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53580;&#51060;&#48660;&#51060; composite &#53412;&#46308;&#51012; &#44054;&#44256; &#51080;&#45796;&#47732;, &#45817;&#49888;&#51008; &#51060;&#46308; &#53440;&#51077;&#46308;&#51012; &#44032;&#51652; &#49324;&#50857;&#51088; &#51221;&#51032; &#53364;&#47000;&#49828;&#47484; &#49324;&#50857;&#54624; &#49688;&#46020; &#51080;&#45796; - &#45208;&#51473;&#50640; composite &#49885;&#48324;&#51088;&#46308;&#50640; &#45824;&#54620; &#51208;&#51012; &#48372;&#46972;)
                  
               </p>
               <p>identifier &#54532;&#47196;&#54140;&#54000;&#45716; &#50628;&#44201;&#54616;&#44172; &#50741;&#49496;&#51060;&#45796;. &#45817;&#49888;&#51008; &#44536;&#44163;&#51012; &#49373;&#47029;&#54624; &#49688;&#46020; &#51080;&#44256;, Hibernate&#47196; &#54616;&#50668;&#44552; &#45236;&#48512;&#51201;&#51004;&#47196; &#44061;&#52404; &#49885;&#48324;&#51088;&#46308;&#51012; &#52628;&#51201;&#54616;&#46020;&#47197; &#54624; &#49688; &#51080;&#45796;. &#54616;&#51648;&#47564; &#50864;&#47532;&#45716; &#51060;&#44163;&#51012; &#44428;&#51109;&#54616;&#51648; &#50506;&#45716;&#45796;. </p>
               <p>&#49324;&#49892;, &#50612;&#46500; &#44592;&#45733;&#51008; identifier &#54532;&#47196;&#54140;&#54000;&#47484; &#49440;&#50616;&#54616;&#45716; &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54644;&#49436;&#47564; &#51060;&#50857; &#44032;&#45733;&#54616;&#45796;: </p>
               <div class="itemizedlist">
                  <ul type="disc" compact>
                     <li>
                        <p>Transitive reattachment for detached objects (cascade update or cascade merge) - see <a href="objectstate-transitive.html" title="10.11. Transitive persistence(&#51204;&#51060; &#50689;&#49549;)">10.11&#51208;. &#8220;Transitive persistence(&#51204;&#51060; &#50689;&#49549;)&#8221;</a> 
                        </p>
                     </li>
                     <li>
                        <p>
                                                   <code class="literal">Session.saveOrUpdate()</code>
                                               
                        </p>
                     </li>
                     <li>
                        <p>
                                                   <code class="literal">Session.merge()</code>
                                               
                        </p>
                     </li>
                  </ul>
               </div>
               <p>&#50864;&#47532;&#45716; &#45817;&#49888;&#51060; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54644; &#51068;&#44288;&#46104;&#44172; &#47749;&#47749;&#46108; identifier &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#49440;&#50616;&#54624; &#44163;&#51012; &#44428;&#51109;&#54620;&#45796;. &#44172;&#45796;&#44032; &#50864;&#47532;&#45716; &#45817;&#49888;&#51060; nullable &#53440;&#51077;(&#50696;&#47484; &#46308;&#50612; non-primitive)&#51012; &#49324;&#50857;&#54624; &#44163;&#51012; &#44428;&#51109;&#54620;&#45796;. </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="persistent-classes-pojo-final"></a>4.1.3. final&#51060; &#50500;&#45772; &#53364;&#47000;&#49828;&#46308;&#51012; &#49440;&#54840;&#54616;&#46972;(&#50741;&#49496;)
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Hibernate&#51032; &#51473;&#49900; &#53945;&#51669;&#51064;, &#54532;&#46973;&#49884;(<span class="emphasis"><em>proxies</em></span>)&#46308;&#51008; final&#51060; &#50500;&#45772; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308; &#46608;&#45716; &#47784;&#46160; public &#47700;&#49548;&#46300;&#46308;&#47196; &#49440;&#50616;&#46108; &#51064;&#53552;&#54168;&#51060;&#49828;&#51032; &#44396;&#54788;&#51064; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#50640; &#51032;&#51316;&#54620;&#45796;. 
               </p>
               <p>&#45817;&#49888;&#51008; Hibernate&#47196; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54616;&#51648; &#50506;&#51008; <code class="literal">final</code> &#53364;&#47000;&#49828;&#46308;&#51012; &#50689;&#49549;&#54868; &#49884;&#53420; &#49688; &#51080;&#51648;&#47564; &#45817;&#49888;&#51008; lazy &#50672;&#44288; &#54168;&#52845;(lazy association fetching)&#50640; &#45824;&#54644; &#54532;&#46973;&#49884;&#46308;&#51012; &#49324;&#50857;&#54624; &#49688; &#50630;&#51012; &#44163;&#51060;&#45796; -&#44536;&#44163;&#51008; &#54140;&#54252;&#47676;&#49828; &#53916;&#45789;&#51012; &#50948;&#54620; &#45817;&#49888;&#51032; &#50741;&#49496;&#46308;&#51012; &#51228;&#54620;&#49884;&#53420; &#44163;&#51060;&#45796;. 
               </p>
               <p>&#45817;&#49888;&#51008; &#46608;&#54620; non-final &#53364;&#47000;&#49828;&#46308; &#49345;&#50640; <code class="literal">public final</code> &#47700;&#49548;&#46300;&#46308;&#51012; &#49440;&#50616;&#54616;&#45716; &#44163;&#51012; &#54588;&#54644;&#50556; &#54620;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; <code class="literal">public final</code> &#47700;&#49548;&#46300;&#47484; &#44032;&#51652; &#53364;&#47000;&#49828;&#47484; &#49324;&#50857;&#54616;&#44256;&#51088; &#50896;&#54624; &#44221;&#50864;, &#45817;&#49888;&#51008; <code class="literal">lazy="false"</code>&#47484; &#49444;&#51221;&#54632;&#51004;&#47196;&#50024; &#47749;&#49884;&#51201;&#51004;&#47196; &#54532;&#46973;&#49905;&#51012; &#49324;&#50857; &#48520;&#44032;&#45733;&#54616;&#46020;&#47197; &#54644;&#50556; &#54620;&#45796;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="persistent-classes-pojo-accessors"></a>4.1.4. &#50689;&#49549; &#54596;&#46300;&#46308;&#51012; &#50948;&#54620; accessor&#46308;&#44284; mutator&#46308;&#51012; &#49440;&#50616;&#54616;&#46972;(&#50741;&#49496;)
                        </h3>
                     </div>
                  </div>
               </div>
               <p><code class="literal">Cat</code>&#51008; &#44536;&#44163;&#51032; &#47784;&#46304; &#50689;&#49549; &#54596;&#46300;&#46308;&#50640; &#45824;&#54644; accessor &#47700;&#49548;&#46300;&#46308;&#51012; &#49440;&#50616;&#54620;&#45796;. &#47566;&#51008; &#45796;&#47480; ORM &#46020;&#44396;&#46308;&#51008; &#51064;&#49828;&#53556;&#49828; &#48320;&#49688;&#46308;&#51012; &#51649;&#51217; &#50689;&#49549;&#54868; &#49884;&#53416;&#45796;. &#50864;&#47532;&#45716; &#44288;&#44228;&#54805; &#49828;&#53412;&#47560;&#50752; &#53364;&#47000;&#49828;&#51032; &#45236;&#48512;&#51201;&#51064; &#45936;&#51060;&#53552; &#44396;&#51312;&#46308; &#49324;&#51060;&#50640; &#44036;&#51217;&#51201;&#51064; &#49688;&#45800;&#51012;
                  &#51228;&#44277;&#54616;&#45716; &#44163;&#51060; &#45908; &#51339;&#45796;&#44256; &#48127;&#44256; &#51080;&#45796;. &#46356;&#54260;&#53944;&#47196; Hibernate&#45716; &#51088;&#48148;&#48712;&#51592; &#49828;&#53440;&#51068; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#50689;&#49549;&#54868; &#49884;&#53412;&#44256;, <code class="literal">getFoo</code>, <code class="literal">isFoo</code>&#50752; <code class="literal">setFoo</code> &#54805;&#49885;&#51032; &#47700;&#49548;&#46300; &#51060;&#47492;&#46308;&#51012; &#51064;&#51648;&#54620;&#45796;. &#45817;&#49888;&#51008; &#51652;&#51221;&#51004;&#47196; &#53945;&#51221; &#54532;&#47196;&#54140;&#54000;&#50640; &#45824;&#54620; &#51649;&#51217;&#51201;&#51064; &#54596;&#46300; &#51217;&#44540;&#51004;&#47196; &#51204;&#54872;&#54624; &#49688;&#46020; &#51080;&#45796;. 
               </p>
               <p>&#54532;&#47196;&#54140;&#54000;&#46308;&#51008; public&#51004;&#47196; &#49440;&#50616;&#46112; &#54596;&#50836;&#44032; <span class="emphasis"><em>&#50630;&#45796;</em></span> - Hibernate&#45716; &#46356;&#54260;&#53944;&#47196; <code class="literal">protected</code> get/set &#49933; &#46608;&#45716; <code class="literal">private</code> get/set &#49933;&#51012; &#44032;&#51652; &#54532;&#47196;&#54140;&#54000;&#47484; &#50689;&#49549;&#54868; &#49884;&#53420; &#49688; &#51080;&#45796;. 
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="configuration-j2ee.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="persistent-classes-inheritance.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">3.8. J2EE &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#53685;&#54633;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;4.2. &#49345;&#49549; &#44396;&#54788;&#54616;&#44592;</td>
            </tr>
         </table>
      </div>
   </body>
</html>