<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#47672;&#47532;&#47568;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="next" href="tutorial.html" title="1&#51109;. Hibernate &#44060;&#50836;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#47672;&#47532;&#47568;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="index.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="tutorial.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="preface" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="preface"></a>&#47672;&#47532;&#47568;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#44061;&#52404; &#51648;&#54693; &#49548;&#54532;&#53944;&#50920;&#50612;&#50752; &#44288;&#44228;&#54805; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196; &#51089;&#50629;&#54616;&#45716; &#44163;&#51008; &#50724;&#45720;&#45216;&#51032; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; &#54872;&#44221;&#46308;&#50640;&#49436; &#49457;&#44032;&#49884;&#44256; &#49884;&#44036;&#51060; &#49548;&#48708;&#46112; &#49688; &#51080;&#45796;. Hibernate&#45716; &#51088;&#48148; &#54872;&#44221;&#46308;&#51012; &#50948;&#54620; &#44061;&#52404;/&#44288;&#44228;&#54805; &#47588;&#54609; &#46020;&#44396;&#51060;&#45796;. object/relational
            mapping(ORM) &#50857;&#50612;&#45716; &#44061;&#52404; &#47784;&#54805;&#51004;&#47196;&#48512;&#53552; SQL-&#44592;&#48152;&#51032; &#49828;&#53412;&#47560;&#47484; &#44032;&#51652; &#44288;&#44228;&#54805; &#45936;&#51060;&#53552; &#47784;&#54805;&#51004;&#47196;&#51032; &#45936;&#51060;&#53552; &#54364;&#49345;&#51012; &#47588;&#54609;&#54616;&#45716; &#44592;&#49696;&#51012; &#50616;&#44553;&#54620;&#45796;. 
         </p>
         <p>Hibernate&#45716; &#51088;&#48148; &#53364;&#47000;&#49828;&#46308;&#47196;&#48512;&#53552; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196;&#51032; &#47588;&#54609;(&#44536;&#47532;&#44256; &#51088;&#48148; &#45936;&#51060;&#53552; &#53440;&#51077;&#46308;&#47196;&#48512;&#53552; SQL &#45936;&#51060;&#53552; &#53440;&#51077;&#46308;&#47196;&#51032; &#47588;&#54609;)&#51012; &#52376;&#47532;&#54624; &#49104;&#47564; &#50500;&#45768;&#46972;, &#46608;&#54620; &#45936;&#51060;&#53552; &#51656;&#51032;&#50752; &#44160;&#49353; &#54200;&#51032;&#46308;&#51012; &#51228;&#44277;&#54616;&#47728;, SQL&#44284; JDBC&#47196; &#49688;&#51089;&#50629;
            &#45936;&#51060;&#53552; &#54648;&#46308;&#47553;&#50640; &#49548;&#50836;&#46104;&#45716; &#44060;&#48156; &#49884;&#44036;&#51012; &#54788;&#51200;&#54616;&#44172; &#45800;&#52629;&#49884;&#53020;&#51460; &#49688; &#51080;&#45796;. 
         </p>
         <p>Hibernate&#51032; &#47785;&#51201;&#51008; &#44277;&#53685;&#46108; &#45936;&#51060;&#53552; &#50689;&#49549;&#54868; &#44288;&#47144; &#54532;&#47196;&#44536;&#47000;&#48141; &#51089;&#50629;&#46308;&#51032; 95%&#47484; &#45916;&#50612;&#51452;&#45716; &#44163;&#51060;&#45796;. Hibernate&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640;&#49436; &#48708;&#51648;&#45768;&#49828; &#47196;&#51649;&#51012; &#44396;&#54788;&#54616;&#45716;&#45936; &#45236;&#51109; &#54532;&#47196;&#49884;&#51200;&#46308;&#51012; &#51204;&#50857;&#51004;&#47196; &#49324;&#50857;&#54616;&#45716; &#45936;&#51060;&#53552; &#51473;&#49900;&#51201; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;
            &#45824;&#54620; &#52572;&#49345;&#51032; &#49556;&#47336;&#49496;&#51060; &#50500;&#45776; &#49688;&#46020; &#51080;&#51648;&#47564;, &#44536;&#44163;&#51008; &#51088;&#48148; &#44592;&#48152; &#48120;&#46308;-&#54000;&#50612;&#50640;&#49436; &#44061;&#52404; &#51648;&#54693; &#46020;&#47700;&#51064; &#47784;&#54805;&#46308;&#44284; &#48708;&#51648;&#45768;&#49828; &#47196;&#51649;&#50640; &#44032;&#51109; &#50976;&#50857;&#54616;&#45796;. &#54616;&#51648;&#47564; Hibernate&#45716; &#48292;&#45908; &#51648;&#51221;&#51201;&#51064; SQL &#53076;&#46300;&#47484; &#51228;&#44144;&#54616;&#44144;&#45208; &#52897;&#49808;&#54868; &#49884;&#53412;&#45716; &#45817;&#49888;&#51012;
            &#54869;&#49892;&#55176; &#46020;&#50752;&#51460; &#49688; &#51080;&#44256; &#53580;&#51060;&#48660; &#54805;&#49885;&#51032; &#54364;&#54788;&#51004;&#47196;&#48512;&#53552; &#44061;&#52404;&#46308;&#51032; &#44536;&#47000;&#54532;&#47196; &#44208;&#44284; &#49483;&#51012; &#48320;&#54872;&#54616;&#45716; &#44277;&#53685;&#46108; &#53468;&#49828;&#53356;&#47484; &#46020;&#50752;&#51460; &#44163;&#51060;&#45796;. 
         </p>
         <p>&#47564;&#51068; &#45817;&#49888;&#51060; Hibernate&#50752; Object/Relational &#47588;&#54609; &#46608;&#45716; &#49900;&#51648;&#50612; &#51088;&#48148;&#50640; &#52488;&#49900;&#51088;&#46972;&#47732;, &#45796;&#51020; &#45800;&#44228;&#46308;&#51012; &#46384;&#47476;&#44592; &#48148;&#46976;&#45796;: </p>
         <div class="orderedlist">
            <ol type="1">
               <li>
                  <p>&#45908; &#47566;&#51008; &#45800;&#44228;&#51201;&#51064; &#49324;&#50857; &#49444;&#47749;&#49436;&#46308;&#51012; &#44032;&#51652; &#45908; &#44596; &#53916;&#53664;&#47532;&#50620;&#51008; <a href="tutorial.html" title="1&#51109;. Hibernate &#44060;&#50836;">1&#51109;. <i xmlns:xlink="http://www.w3.org/1999/xlink">Hibernate &#44060;&#50836;</i></a> &#51012; &#51069;&#50612;&#46972;. &#53916;&#53664;&#47532;&#50620;&#51012; &#50948;&#54620; &#49548;&#49828; &#53076;&#46300;&#45716; <code class="literal">doc/reference/tutorial/</code> &#46356;&#47113;&#53664;&#47532;&#50640; &#54252;&#54632;&#46104;&#50612; &#51080;&#45796;. 
                  </p>
               </li>
               <li>
                  <p>Hibernate&#44032; &#49324;&#50857;&#46112; &#49688; &#51080;&#45716; &#54872;&#44221;&#51012; &#51060;&#54644;&#47140;&#47732; <a href="architecture.html" title="2&#51109;. &#50500;&#53412;&#53581;&#52376;">2&#51109;. <i xmlns:xlink="http://www.w3.org/1999/xlink">&#50500;&#53412;&#53581;&#52376;</i></a> &#47484; &#51069;&#50612;&#46972;. 
                  </p>
               </li>
               <li>
                  <p>Hibernate &#48176;&#54252;&#48376; &#45236;&#51032; <code class="literal">eg/</code> &#46356;&#47113;&#53664;&#47532;&#47484; &#49332;&#54196; &#48372;&#46972;. &#51060; &#46356;&#47113;&#53664;&#47532;&#45716; &#44036;&#45800;&#54620; &#49828;&#53472;&#46300;&#50620;&#47200; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#54252;&#54632;&#54616;&#44256; &#51080;&#45796;. &#45817;&#49888;&#51032; JDBC &#46300;&#46972;&#51060;&#48260;&#47484; <code class="literal">lib/</code> &#46356;&#47113;&#53664;&#47532;&#50640; &#48373;&#49324;&#54616;&#44256; &#45817;&#49888;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#47582;&#45716; &#51221;&#54869;&#54620; &#44050;&#51012; &#51648;&#51221;&#54616;&#50668; <code class="literal">etc/hibernate.properties</code> &#47484; &#54200;&#51665;&#54616;&#46972;. &#48176;&#48372;&#48376; &#46356;&#47113;&#53664;&#47532;&#50640;&#49436; &#47749;&#47161; &#46972;&#51064; &#54532;&#47212;&#54532;&#53944;&#50640;&#49436; (Ant&#47484; &#49324;&#50857;&#54616;&#50668;) <code class="literal">ant eg</code> &#47484; &#53440;&#51060;&#54609; &#54616;&#44144;&#45208; , Windows &#54616;&#50640;&#49436; <code class="literal">build eg</code> &#47484; &#53440;&#51060;&#54532; &#54616;&#46972;. 
                  </p>
               </li>
               <li>
                  <p>&#45817;&#49888;&#51032; &#51452;&#46108; &#51221;&#48372;&#51032; &#49548;&#49828;&#47196;&#49436; &#51060; &#52280;&#51312; &#47928;&#49436;&#47484; &#49324;&#50857;&#54616;&#46972;. &#47564;&#51068; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49444;&#44228;&#50640; &#45824;&#54644; &#45908; &#47566;&#51008; &#46020;&#50880;&#51012; &#54596;&#50836;&#47196; &#54616;&#44144;&#45208; &#45817;&#49888;&#51060; &#45800;&#44228;&#51201;&#51064; &#53916;&#53664;&#47532;&#50620;&#51012; &#49440;&#54840;&#54620;&#45796;&#47732; <span class="emphasis"><em>Java Persistence with Hibernate</em></span> (http://www.manning.com/bauer2)&#51012; &#51069;&#45716; &#44163;&#51012; &#44256;&#47140;&#54616;&#46972;.&#46608;&#54620; http://caveatemptor.hibernate.org&#50640; &#48169;&#47928;&#54616;&#50668; Java Persistence with Hibernate&#50857; &#50696;&#51228;
                     &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#45796;&#50868;&#47196;&#46300; &#54616;&#46972;. 
                  </p>
               </li>
               <li>
                  <p>FAQ&#46308;&#51008; Hibernate &#50937; &#49324;&#51060;&#53944; &#49345;&#50640; &#45813;&#48320;&#46104;&#50612; &#51080;&#45796;. </p>
               </li>
               <li>
                  <p>&#51228; 3&#51032; &#45936;&#47784;&#46308;, &#50696;&#51228;&#46308;, &#44536;&#47532;&#44256; &#53916;&#53664;&#47532;&#50620;&#46308;&#51008; Hibernate &#50937; &#49324;&#51060;&#53944; &#49345;&#50640; &#47553;&#53356;&#46104;&#50612; &#51080;&#45796;. </p>
               </li>
               <li>
                  <p>Hibernate &#50937;&#49324;&#51060;&#53944; &#49345;&#51032; &#44277;&#46041;&#52404; &#50689;&#50669;&#51008; &#49444;&#44228; &#54056;&#53556;&#44284; &#45796;&#50577;&#54620; &#53685;&#54633; &#49556;&#47336;&#49496;&#46308;(Tomcat, JBoss AS, Struts, EJB &#46321;.)&#50640; &#44288;&#54620; &#51339;&#51008; &#47532;&#49548;&#49828;&#51060;&#45796;. </p>
               </li>
            </ol>
         </div>
         <p>&#51656;&#47928;&#51060; &#51080;&#45796;&#47732;, Hibernate &#49345;&#50640; &#47553;&#53356;&#46104;&#50612; &#51080;&#45716; &#49324;&#50857;&#51088; &#54252;&#47100;&#51012; &#49324;&#50857;&#54616;&#46972;. &#50864;&#47532;&#45716; &#46608;&#54620; &#48260;&#44536; &#48372;&#44256;&#50752; &#53945;&#51669; &#50836;&#52397;&#46308;&#51012; &#50948;&#54620; JIRA &#51137;&#51216; &#52628;&#51201; &#49884;&#49828;&#53596;&#51012; &#51228;&#44277;&#54620;&#45796;. &#45817;&#49888;&#51060; Hibernate&#51032; &#44060;&#48156;&#50640; &#44288;&#49900;&#51060; &#51080;&#45796;&#47732;, &#44060;&#48156;&#51088;
            &#47700;&#51068;&#47553; &#47532;&#49828;&#53944;&#50640; &#52280;&#50668;&#54616;&#46972;. &#47564;&#51068; &#45817;&#49888;&#51060; &#51060; &#47928;&#49436;&#47484; &#45817;&#49888;&#51032; &#50616;&#50612;&#47196; &#48264;&#50669;&#54616;&#45716; &#44163;&#50640; &#44288;&#49900;&#51060; &#51080;&#45796;&#47732;, &#44060;&#48156;&#51088; &#47700;&#51068;&#47553; &#47532;&#49828;&#53944;&#50640; &#51217;&#52489;&#54616;&#46972;. 
         </p>
         <p>Hibernate&#47484; &#50948;&#54620; &#49345;&#50857; &#44060;&#48156; &#51648;&#50896;, &#51228;&#54408; &#51648;&#50896;, &#44536;&#47532;&#44256; &#44368;&#50977;&#51008; JBoss Inc&#47484; &#53685;&#54644; &#51060;&#50857; &#44032;&#45733;&#54616;&#45796; (http://www.hibernate.org/SupportTraining/&#47484; &#48372;&#46972;). Hibernate&#45716; JBoss
            Professional Open Source product &#54532;&#47196;&#51229;&#53944;&#51060;&#44256; &#51228;&#54408;&#46308;&#50640; &#45824;&#54620; JBoss Enterprise Middleware System (JEMS) suite&#51032; &#51473;&#45824;&#54620; &#52980;&#54252;&#45324;&#53944;&#51060;&#45796;. 
         </p>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="index.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="tutorial.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;1&#51109;. Hibernate &#44060;&#50836;</td>
            </tr>
         </table>
      </div>
   </body>
</html>