<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>16&#51109;. Native SQL</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="query-criteria-naturalid.html" title="15.9. natural &#49885;&#48324;&#51088;&#50640; &#51032;&#54620; &#51656;&#51032;&#46308;">
      <link rel="next" href="querysql-namedqueries.html" title="16.2. &#47749;&#47749;&#46108; SQL &#51656;&#51032;&#46308;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">16&#51109;. Native SQL</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="query-criteria-naturalid.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="querysql-namedqueries.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="querysql"></a>16&#51109;. Native SQL
                  </h2>
               </div>
            </div>
         </div>
         <p>&#45817;&#49888;&#51008; &#46608;&#54620; &#45817;&#49888;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; native SQL dialect&#47196; &#51656;&#51032;&#46308;&#51012; &#54364;&#54788;&#54624; &#49688;&#46020; &#51080;&#45796;. &#45817;&#49888;&#51060; &#50724;&#46972;&#53364;&#51032; &#51656;&#51032; &#55180;&#53944;&#46308; &#46608;&#45716; <code class="literal">CONNECT</code> &#53412;&#50892;&#46300;&#50752; &#44057;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51648;&#51221;&#51201;&#51064; &#53945;&#51669;&#46308;&#51012; &#54876;&#50857;&#54616;&#44256;&#51088; &#50896;&#54624; &#44221;&#50864;&#50640; &#51060;&#44163;&#51060; &#50976;&#50857;&#54616;&#45796;. &#44536;&#44163;&#51008; &#46608;&#54620; &#51649;&#51217;&#51201;&#51064; SQL/JDBC &#44592;&#48152;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51004;&#47196;&#48512;&#53552; Hibernate&#47196;&#51032; &#48372;&#45796; &#47749;&#47308;&#54620; &#51060;&#51204; &#44221;&#47196;&#47484; &#51228;&#44277;&#54620;&#45796;.
         </p>
         <p>Hibernate3&#51008; &#46608;&#54620; &#47784;&#46304; create, update, delete, load &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#50640; &#45824;&#54644; (&#45236;&#51109; &#54532;&#47196;&#49884;&#51200;&#46308;&#51012; &#54252;&#54632;&#54616;&#50668;) &#49552;&#51004;&#47196; &#51089;&#49457;&#46108; SQL&#51012; &#51648;&#51221;&#54616;&#45716; &#44163;&#51012; &#45817;&#49888;&#50640;&#44172; &#54728;&#50857;&#54644;&#51456;&#45796;.</p>
         <div class="sect1" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="querysql-creating"></a>16.1. <code class="literal">SQLQuery</code> &#49324;&#50857;&#54616;&#44592;
                     </h2>
                  </div>
               </div>
            </div>
            <p>native SQL &#51656;&#51032;&#46308;&#51032; &#49892;&#54665;&#51008; <code class="literal">SQLQuery</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#53685;&#54644; &#51228;&#50612;&#46104;&#47728;, &#44536;&#44163;&#51008; <code class="literal">Session.createSQLQuery()</code>&#51012; &#54840;&#52636;&#54616;&#50668; &#54925;&#46301;&#46108;&#45796;. &#45796;&#51020;&#51008; &#51060; API&#47484; &#51656;&#51032;&#50640; &#49324;&#50857;&#54616;&#45716; &#48169;&#48277;&#51012; &#49444;&#47749;&#54620;&#45796;.
            </p>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13131"></a>16.1.1. &#49828;&#52860;&#46972; &#51656;&#51032;&#46308;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#44032;&#51109; &#44592;&#48376;&#51201;&#51064; SQL &#51656;&#51032;&#45716; &#49828;&#52860;&#46972;&#46308;(&#44050;&#46308;)&#51032; &#47785;&#47197;&#51012; &#50619;&#45716; &#44163;&#51060;&#45796;.</p><pre class="programlisting">sess.createSQLQuery("SELECT * FROM CATS").list();
sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE FROM CATS").list();
</pre><p>&#51060;&#44163;&#46308;&#51008; &#46168;&#45796; CATS &#53580;&#51060;&#48660; &#45236;&#50640; &#51080;&#45716; &#44033;&#44033;&#51032; &#52972;&#47100;&#50640; &#45824;&#54620; &#49828;&#52860;&#46972; &#44050;&#46308;&#51012; &#44032;&#51652; Object &#48176;&#50676;&#46308;&#51032; List&#47484; &#48152;&#54872;&#54624; &#44163;&#51060;&#45796;. Hibernate&#45716; &#48152;&#54872;&#46104;&#45716; &#49828;&#52860;&#46972; &#44050;&#46308;&#51032; &#49892;&#51228; &#49692;&#49436;&#50752; &#53440;&#51077;&#46308;&#51012; &#46020;&#52636;&#54616;&#45716;&#45936; ResultSetMetadata&#47484;
                  &#49324;&#50857;&#54624; &#44163;&#51060;&#45796;.
               </p>
               <p><code class="literal">ResultSetMetadata</code> &#49324;&#50857;&#51032; &#50724;&#48260;&#54756;&#46300;&#47484; &#54588;&#54616;&#44144;&#45208; &#44036;&#45800;&#54616;&#44172;&#45716; &#48152;&#54872;&#46104;&#45716; &#44163;&#51012; &#48372;&#45796; &#47749;&#49884;&#51201;&#51060;&#44172;&#45140; &#54616;&#44592; &#50948;&#54644; &#50864;&#47532;&#45716; <code class="literal">addScalar()</code>&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;.
               </p><pre class="programlisting">sess.createSQLQuery("SELECT * FROM CATS")
 .addScalar("ID", Hibernate.LONG)
 .addScalar("NAME", Hibernate.STRING)
 .addScalar("BIRTHDATE", Hibernate.DATE)
</pre><p>&#51060; &#51656;&#51032;&#45716; &#45796;&#51020;&#51012; &#51648;&#51221;&#54664;&#45796;:</p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>SQL &#51656;&#51032; &#47928;&#51088;&#50676;</p>
                     </li>
                     <li>
                        <p>&#48152;&#54872;&#54624; &#52972;&#47100;&#46308;&#44284; &#53440;&#51077;&#46308;</p>
                     </li>
                  </ul>
               </div>
               <p>This will still return Object arrays, but now it will not use <code class="literal">ResultSetMetadata</code> but will instead explicitly get the ID, NAME and BIRTHDATE column as respectively a Long, String and a Short from the underlying
                  resultset. This also means that only these three columns will be returned, even though the query is using <code class="literal">*</code> and could return more than the three listed columns.
               </p>
               <p>&#49828;&#52860;&#46972;&#46308; &#51473; &#47751;&#47751; &#46608;&#45716; &#51204;&#48512;&#50640; &#45824;&#54620; &#53440;&#51077; &#51221;&#48372;&#47484; &#45224;&#44200;&#46160;&#45716; &#44163;&#51060; &#44032;&#45733;&#54616;&#45796;.</p><pre class="programlisting">sess.createSQLQuery("SELECT * FROM CATS")
 .addScalar("ID", Hibernate.LONG)
 .addScalar("NAME")
 .addScalar("BIRTHDATE")
</pre><p>&#51060;&#44163;&#51008; &#48376;&#51656;&#51201;&#51004;&#47196; &#50526;&#51032; &#44163;&#44284; &#46041;&#51068;&#54620; &#51656;&#51032;&#51060;&#51648;&#47564;, &#51060;&#51228; <code class="literal">ResultSetMetaData</code>&#45716; ID&#51032; &#53440;&#51077;&#51060; &#47749;&#49884;&#51201;&#51004;&#47196; &#51648;&#51221;&#46104;&#50612; &#51080;&#51004;&#48064;&#47196; NAME&#44284; BIRTHDATE&#51032; &#53440;&#51077;&#51012; &#44208;&#51221;&#54616;&#45716;&#45936; &#49324;&#50857;&#46108;&#45796;.
               </p>
               <p>java.sql.Types returned from ResultSetMetaData&#51060; Hibernate &#53440;&#51077;&#46308;&#47196; &#47588;&#54609;&#46104;&#45716; &#48169;&#48277;&#51008; Dialect&#50640; &#51032;&#54644; &#51228;&#50612;&#46108;&#45796;. &#47564;&#51068; &#53945;&#51221; &#53440;&#51077;&#51060; &#47588;&#54609;&#46104;&#51648; &#50506;&#44144;&#45208; &#50696;&#49345;&#46104;&#45716; &#53440;&#51077;&#51004;&#47196; &#44480;&#44208;&#46104;&#51648;
                  &#50506;&#51012; &#44221;&#50864;&#50640; Dialect &#45236;&#50640; &#51080;&#45716; <code class="literal">registerHibernateType</code>&#50640; &#45824;&#54620; &#54840;&#52636;&#46308;&#51012; &#53685;&#54644; &#44536;&#44163;&#51012; &#47582;&#52644;&#54868; &#49884;&#53412;&#45716; &#44163;&#51060; &#44032;&#45733;&#54616;&#45796;.
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13180"></a>16.1.2. Entity &#51656;&#51032;&#46308;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#50948;&#51032; &#51656;&#51032;&#46308;&#51008; &#49828;&#52860;&#46972; &#44050;&#46308;&#51012; &#48152;&#54872;&#54616;&#45716; &#44163;, &#44208;&#44284;&#49483;&#46308;&#47196;&#48512;&#53552; "&#50896;&#47000;&#51032;" &#44050;&#46308;&#51012; &#44592;&#48376;&#51201;&#51004;&#47196; &#48152;&#54872;&#54616;&#45716; &#44163;&#50640; &#45824;&#54620; &#51204;&#48512;&#50688;&#45796;. &#45796;&#51020;&#51008; <code class="literal">addEntity()</code>&#47484; &#53685;&#54644; native sql &#51656;&#51032;&#47196;&#48512;&#53552; &#50644;&#54000;&#54000; &#44061;&#52404;&#46308;&#51012; &#50619;&#45716; &#48169;&#48277;&#51012; &#48372;&#50668;&#51456;&#45796;.
               </p><pre class="programlisting">sess.createSQLQuery("SELECT * FROM CATS").addEntity(Cat.class);
sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE FROM CATS").addEntity(Cat.class);
</pre><p>&#51060; &#51656;&#51032;&#45716; &#45796;&#51020;&#51012; &#51648;&#51221;&#54664;&#45796;:</p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>SQL &#51656;&#51032; &#47928;&#51088;&#50676;</p>
                     </li>
                     <li>
                        <p>&#44536; &#51656;&#51032;&#50640; &#51032;&#54644; &#48152;&#54872;&#46104;&#45716; &#50644;&#54000;&#54000;</p>
                     </li>
                  </ul>
               </div>
               <p>Cat&#51060; &#52972;&#47100; ID, NAME &#44536;&#47532;&#44256; BIRTHDATE&#47196;&#49436; &#47588;&#54609;&#46108;&#45796;&#44256; &#44032;&#51221;&#54616;&#47732;, &#50948;&#51032; &#51656;&#51032;&#46308;&#51008; &#46168;&#45796; &#44033;&#44033;&#51032; &#50836;&#49548;&#44032; &#54616;&#45208;&#51032; Cat &#50644;&#54000;&#54000;&#51064; &#54616;&#45208;&#51032; List&#47484; &#48152;&#54872;&#54624; &#44163;&#51060;&#45796;.</p>
               <p>&#47564;&#51068; &#44536; &#50644;&#54000;&#54000;&#44032; &#46608; &#45796;&#47480; &#50644;&#54000;&#54000;&#50640; &#45824;&#54644; <code class="literal">many-to-one</code>&#47196; &#47588;&#54609;&#46104;&#50612; &#51080;&#45796;&#47732; &#46608;&#54620; native &#51656;&#51032;&#47484; &#49892;&#54665;&#54624; &#46412; &#51060;&#44163;&#51012; &#48152;&#54872;&#54616;&#45716; &#44163;&#51060; &#54596;&#49688;&#51201;&#44256;, &#44536; &#48150;&#51032; &#44221;&#50864; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51648;&#51221;&#51201;&#51064; "&#52972;&#47100;&#51060; &#48156;&#44204;&#46104;&#51648; &#50506;&#50520;&#49845;&#45768;&#45796;" &#50724;&#47448;&#44032; &#51068;&#50612;&#45216; &#44163;&#51060;&#45796;. &#52628;&#44032;&#51201;&#51064; &#52972;&#47100;&#51008; * &#54364;&#44592;&#47484; &#49324;&#50857;&#54624; &#51088;&#46041;&#51201;&#51004;&#47196;
                  &#48152;&#54872;&#46112; &#44163;&#51060;&#51648;&#47564;, &#50864;&#47532;&#45716; &#45796;&#51020; <code class="literal">Dog</code>&#50640; &#45824;&#54620; <code class="literal">many-to-one</code> &#50696;&#51228;&#50640;&#49436;&#52376;&#47100; &#47749;&#49884;&#51201;&#51064; &#44163;&#51012; &#45908; &#49440;&#54840;&#54620;&#45796;:
               </p><pre class="programlisting">sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE, DOG_ID FROM CATS").addEntity(Cat.class);
</pre><p>&#51060;&#44163;&#51008; cat.getDog()&#51060; &#44256;&#50976;&#54616;&#44172; &#44592;&#45733;&#54616;&#45716; &#44163;&#51012; &#54728;&#50857;&#54620;&#45796;.</p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13216"></a>16.1.3. &#50672;&#44288;&#46308;&#44284; &#53084;&#47113;&#49496;&#46308;&#51012; &#52376;&#47532;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#54532;&#46973;&#49884;&#47484; &#52488;&#44592;&#54868; &#49884;&#53428;&#50640; &#51080;&#50612; &#44032;&#45733;&#54620; &#53945;&#48324;&#54620; &#46972;&#50868;&#46300;&#53944;&#47549;&#51012; &#54588;&#54616;&#44592; &#50948;&#54644;&#49436; <code class="literal">Dog</code>&#50640;&#49436; eagerly join&#49884;&#53412;&#45716; &#44163;&#51060; &#44036;&#51004;&#54616;&#45796;. &#51060;&#44163;&#51008; <code class="literal">addJoin()</code> &#47700;&#49548;&#46300;&#47484; &#53685;&#54644; &#54665;&#54644;&#51648;&#45716;&#45936;, &#44536;&#44163;&#51008; &#50672;&#44288;&#51060;&#45208; &#53084;&#47113;&#49496; &#45236;&#50640;&#49436; &#51312;&#51064;&#49884;&#53412;&#45716; &#44163;&#51012; &#45817;&#49888;&#50640;&#44172; &#54728;&#50857;&#54644;&#51456;&#45796;.
               </p><pre class="programlisting">sess.createSQLQuery("SELECT c.ID, NAME, BIRTHDATE, DOG_ID, D_ID, D_NAME FROM CATS c, DOGS d WHERE c.DOG_ID = d.D_ID")
 .addEntity("cat", Cat.class)
 .addJoin("cat.dog");
</pre><p>&#51060; &#50696;&#51228;&#50640;&#49436; &#48152;&#54872;&#46104;&#45716; <code class="literal">Cat</code>&#46308;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#45824;&#54620; &#51076;&#51032;&#51032; &#53945;&#48324;&#54620; &#46972;&#50868;&#46300;&#53356;&#47549; &#50630;&#51060; &#51204;&#52404;&#51201;&#51004;&#47196; &#52488;&#44592;&#54868;&#46108; &#44536;&#44163;&#46308;&#51032; <code class="literal">dog</code> &#54532;&#47196;&#54140;&#54000;&#47484; &#44054;&#45716;&#45796;. &#50864;&#47532;&#44032; join&#51032; &#45824;&#49345; &#54532;&#47196;&#54140;&#54000; &#44221;&#47196;&#47484; &#51648;&#51221;&#54616;&#45716; &#44163;&#51012; &#44032;&#45733;&#54616;&#46020;&#47197; &#54616;&#44592; &#50948;&#54644; &#54616;&#45208;&#51032; alias &#51060;&#47492;("cat")&#51012; &#52628;&#44032;&#54664;&#51020;&#51012; &#51452;&#51648;&#54616;&#46972;. &#45824;&#49888;&#50640; &#50696;&#47484; &#46308;&#50612; <code class="literal">Cat</code>&#51060; <code class="literal">Dog</code>&#50640; &#45824;&#54644; one-to-many&#47484; &#44032;&#51656; &#44221;&#50864;, &#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54644; &#46041;&#51068;&#54620; eager joining&#51012; &#54665;&#54616;&#45716; &#44163;&#51060; &#44032;&#45733;&#54616;&#45796;.
               </p><pre class="programlisting">sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE, D_ID, D_NAME, CAT_ID FROM CATS c, DOGS d WHERE c.ID = d.CAT_ID")
 .addEntity("cat", Cat.class)
 .addJoin("cat.dogs");
</pre><p>&#51060; &#45800;&#44228;&#50640;&#49436; &#50864;&#47532;&#45716; Hibernate&#50640;&#49436; native &#51656;&#51032;&#46308;&#51012; &#49324;&#50857;&#44032;&#45733;&#54616;&#46020;&#47197; &#47564;&#46308;&#44592; &#50948;&#54644; sql &#51656;&#51032;&#46308;&#51012; &#44053;&#54868;&#49884;&#53412;&#51648;&#45716; &#44163;&#51012; &#49884;&#51089;&#54616;&#51648; &#50506;&#44256;&#49436;&#46020; native &#51656;&#51032;&#46308;&#47196;&#49436; &#44032;&#45733;&#54620; &#44163;&#51032; &#54620;&#44228;&#50640; &#46020;&#45804;&#54616;&#44256; &#51080;&#45796;; &#47928;&#51228;&#51216;&#46308;&#51008; &#46041;&#51068;&#54620;
                  &#53440;&#51077;&#51032; &#50668;&#47084; &#50644;&#54000;&#54000;&#46308;&#51012; &#48152;&#54872;&#54624; &#46412; &#46608;&#45716; &#46356;&#54260;&#53944; alias/column &#51060;&#47492;&#46308;&#51060; &#52649;&#48516;&#54616;&#51648; &#50506;&#51012; &#46412; &#48156;&#49373;&#54616;&#44592; &#49884;&#51089;&#54620;&#45796;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13247"></a>16.1.4. &#50668;&#47084; &#44060;&#51032; &#50644;&#54000;&#54000;&#46308;&#51012; &#48152;&#54872;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#51648;&#44552;&#44620;&#51648; &#44208;&#44284; &#49483; &#52972;&#47100; &#51060;&#47492;&#46308;&#51008; &#47588;&#54609; &#47928;&#49436; &#45236;&#50640; &#51648;&#51221;&#46108; &#52972;&#47100; &#51060;&#47492;&#46308;&#44284; &#46041;&#51068;&#54616;&#45796;&#44256; &#44032;&#51221;&#46104;&#50612; &#51080;&#45796;. &#46041;&#51068;&#54620; &#52972;&#47100;&#51060; &#54616;&#45208; &#51060;&#49345;&#51032; &#53580;&#51060;&#48660; &#45236;&#50640;&#49436; &#45208;&#53440;&#45216; &#49688; &#51080;&#44592; &#46412;&#47928;&#50640;, &#51060;&#44163;&#51008; &#50668;&#47084; &#44060;&#51032; &#53580;&#51060;&#48660;&#46308;&#51012; &#51312;&#51064;&#49884;&#53412;&#45716; SQL &#51656;&#51032;&#46308;&#50640;
                  &#45824;&#54644; &#47928;&#51228;&#44032; &#46112; &#49688; &#51080;&#45796;.
               </p>
               <p>&#52972;&#47100; alias &#51452;&#51077;&#51008; &#45796;&#51020; &#51656;&#51032;(&#50500;&#47560; &#49892;&#54056;&#54624; &#44163;&#51060;&#45796;)&#50640;&#49436; &#54596;&#50836;&#54616;&#45796;:</p><pre class="programlisting">sess.createSQLQuery("SELECT c.*, m.*  FROM CATS c, CATS m WHERE c.MOTHER_ID = c.ID")
 .addEntity("cat", Cat.class)
 .addEntity("mother", Cat.class)
</pre><p>The intention for this query is to return two Cat instances per row, a cat and its mother. This will fail since there is a
                  conflict of names since they are mapped to the same column names and on some databases the returned column aliases will most
                  likely be on the form "c.ID", "c.NAME", etc. which are not equal to the columns specified in the mappings ("ID" and "NAME").
               </p>
               <p>&#45796;&#51020; &#54805;&#49885;&#51008; &#52972;&#47100; &#51060;&#47492; &#51473;&#48373; &#52712;&#50557;&#51216;&#51012; &#44054;&#51648; &#50506;&#45716;&#45796;:</p><pre class="programlisting">sess.createSQLQuery("SELECT {cat.*}, {mother.*}  FROM CATS c, CATS m WHERE c.MOTHER_ID = c.ID")
 .addEntity("cat", Cat.class)
 .addEntity("mother", Cat.class)
</pre><p>&#51060; &#51656;&#51032;&#45716; &#45796;&#51020;&#51012; &#51648;&#51221;&#54664;&#45796;:</p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>&#52972;&#47100; alias&#46308;&#51012; &#51452;&#51077;&#54616;&#44592; &#50948;&#54620; Hibernate&#50857; placeholder&#46308;&#51012; &#44032;&#51652; SQL &#51656;&#51032; &#47928;&#51088;&#50676;</p>
                     </li>
                     <li>
                        <p>&#44536; &#51656;&#51032;&#50640; &#51032;&#54644; &#48152;&#54872;&#46104;&#45716; &#50644;&#54000;&#54000;&#46308;</p>
                     </li>
                  </ul>
               </div>
               <p>The {cat.*} and {mother.*} notation used above is a shorthand for "all properties". Alternatively, you may list the columns
                  explicitly, but even in this case we let Hibernate inject the SQL column aliases for each property. The placeholder for a
                  column alias is just the property name qualified by the table alias. In the following example, we retrieve Cats and their
                  mothers from a different table (cat_log) to the one declared in the mapping metadata. Notice that we may even use the property
                  aliases in the where clause if we like.
               </p><pre class="programlisting">String sql = "SELECT ID as {c.id}, NAME as {c.name}, " + 
         "BIRTHDATE as {c.birthDate}, MOTHER_ID as {c.mother}, {mother.*} " +
         "FROM CAT_LOG c, CAT_LOG m WHERE {c.mother} = c.ID";

List loggedCats = sess.createSQLQuery(sql)
        .addEntity("cat", Cat.class)
        .addEntity("mother", Cat.class).list()
</pre><div class="sect3" lang="ko-KR">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="querysql-aliasreferences"></a>16.1.4.1. alias &#52280;&#51312;&#50752; &#54532;&#47196;&#54140;&#54000; &#52280;&#51312;
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>&#45824;&#48512;&#48516;&#51032; &#44221;&#50864;&#50640; &#50948;&#51032; alias &#51452;&#51077;&#51060; &#54596;&#50836;&#54616;&#51648;&#47564;, composite &#54532;&#47196;&#54140;&#54000;&#46308;, &#49345;&#49549; &#54032;&#48324;&#51088;&#46308; (inheritance discriminators), &#53084;&#47113;&#49496; &#46321;&#44284; &#44057;&#51008; &#48372;&#45796; &#48373;&#51105;&#54620; &#47588;&#54609;&#46308;&#44284; &#44288;&#47144;&#46108; &#51656;&#51032;&#46308;&#51032; &#44221;&#50864;&#50640;&#45716; &#44256;&#50976;&#54620;
                     alias&#46308;&#51012; &#51452;&#51077;&#49884;&#53412;&#45716; &#44163;&#51012; Hibernate&#50640;&#44172; &#54728;&#50857;&#54616;&#45716;&#45936; &#49324;&#50857;&#46112; &#47751;&#47751; &#53945;&#48324;&#54620; alias&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;.
                  </p>
                  <p>&#45796;&#51020; &#53580;&#51060;&#48660;&#51008; alias &#51452;&#51077;&#51012; &#49324;&#50857;&#54616;&#45716; &#45796;&#47480; &#44032;&#45733;&#49457;&#46308;&#51012; &#48372;&#50668;&#51456;&#45796;. &#45432;&#53944;: &#44208;&#44284; &#45236;&#50640; &#51080;&#45716; alias &#51060;&#47492;&#46308;&#51060; &#50696;&#51228;&#51060;&#47728;, &#44033;&#44033;&#51032; alias&#45716; &#49324;&#50857;&#46112; &#46412; &#54616;&#45208;&#51032; &#50976;&#51068;&#54620; &#51060;&#47492;&#44284; &#50500;&#47560; &#45796;&#47480; &#51060;&#47492;&#51012; &#44032;&#51656; &#44163;&#51060;&#45796;.</p>
                  <div class="table"><a name="aliasinjection-summary"></a><p class="title"><b>&#54364; 16.1. alias &#51452;&#51077; &#51060;&#47492;&#46308;</b></p>
                     <div class="table-contents">
                        <table summary="alias &#51452;&#51077; &#51060;&#47492;&#46308;" border="1">
                           <colgroup>
                              <col>
                              <col>
                              <col>
                           </colgroup>
                           <thead>
                              <tr>
                                 <th>&#49444;&#47749;</th>
                                 <th>&#44396;&#47928;</th>
                                 <th>&#50696;&#51228;</th>
                              </tr>
                           </thead>
                           <tbody>
                              <tr>
                                 <td>&#44036;&#45800;&#54620; &#54532;&#47196;&#54140;&#54000;</td>
                                 <td><code class="literal">{[aliasname].[propertyname]</code></td>
                                 <td><code class="literal">A_NAME as {item.name}</code></td>
                              </tr>
                              <tr>
                                 <td>composite &#54532;&#47196;&#54140;&#54000;</td>
                                 <td><code class="literal">{[aliasname].[componentname].[propertyname]}</code></td>
                                 <td><code class="literal">CURRENCY as {item.amount.currency}, VALUE as {item.amount.value}</code></td>
                              </tr>
                              <tr>
                                 <td>&#50644;&#54000;&#54000;&#51032; &#54032;&#48324;&#51088;(Discriminator)</td>
                                 <td><code class="literal">{[aliasname].class}</code></td>
                                 <td><code class="literal">DISC as {item.class}</code></td>
                              </tr>
                              <tr>
                                 <td>&#50644;&#54000;&#54000;&#51032; &#47784;&#46304; &#54532;&#47196;&#54140;&#54000;&#46308;</td>
                                 <td><code class="literal">{[aliasname].*}</code></td>
                                 <td><code class="literal">{item.*}</code></td>
                              </tr>
                              <tr>
                                 <td>&#53084;&#47113;&#49496; &#53412;</td>
                                 <td><code class="literal">{[aliasname].key}</code></td>
                                 <td><code class="literal">ORGID as {coll.key}</code></td>
                              </tr>
                              <tr>
                                 <td>&#53084;&#47113;&#49496;&#51032; id</td>
                                 <td><code class="literal">{[aliasname].id}</code></td>
                                 <td><code class="literal">EMPID as {coll.id}</code></td>
                              </tr>
                              <tr>
                                 <td>&#53084;&#47113;&#49496;&#51032; &#50836;&#49548;</td>
                                 <td><code class="literal">{[aliasname].element}</code></td>
                                 <td><code class="literal">XID as {coll.element}</code></td>
                              </tr>
                              <tr>
                                 <td>&#53084;&#47113;&#49496; &#45236;&#50640; &#51080;&#45716; &#50836;&#49548;&#51032; &#54532;&#47196;&#54140;&#54000;</td>
                                 <td><code class="literal">{[aliasname].element.[propertyname]}</code></td>
                                 <td><code class="literal">NAME as {coll.element.name}</code></td>
                              </tr>
                              <tr>
                                 <td>&#53084;&#47113;&#49496; &#45236;&#50640; &#51080;&#45716; &#50836;&#49548;&#51032; &#47784;&#46304; &#54532;&#47196;&#54140;&#54000;&#46308;</td>
                                 <td><code class="literal">{[aliasname].element.*}</code></td>
                                 <td><code class="literal">{coll.element.*}</code></td>
                              </tr>
                              <tr>
                                 <td>&#53084;&#47113;&#49496;&#51032; &#47784;&#46304; &#54532;&#47196;&#54140;&#54000;&#46308;</td>
                                 <td><code class="literal">{[aliasname].*}</code></td>
                                 <td><code class="literal">{coll.*}</code></td>
                              </tr>
                           </tbody>
                        </table>
                     </div>
                  </div><br class="table-break"></div>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13388"></a>16.1.5. non-managed &#50644;&#54000;&#54000;&#46308;&#51012; &#48152;&#54872;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>native sql &#51656;&#51032;&#50640; ResultTransformer&#47484; &#51201;&#50857;&#54616;&#45716; &#44163;&#51060; &#44032;&#45733;&#54616;&#45796;. &#50696;&#47484; &#46308;&#50612; non-managed &#50644;&#54000;&#54000;&#46308;&#51012; &#48152;&#54872;&#54616;&#44592; &#50948;&#54644; ResultTransformer&#47484; &#54728;&#50857;&#54616;&#45716; &#44163;.</p><pre class="programlisting">sess.createSQLQuery("SELECT NAME, BIRTHDATE FROM CATS")
        .setResultTransformer(Transformers.aliasToBean(CatDTO.class))</pre><p>&#51060; &#51656;&#51032;&#45716; &#45796;&#51020;&#51012; &#51648;&#51221;&#54664;&#45796;:</p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>SQL &#51656;&#51032; &#47928;&#51088;&#50676;</p>
                     </li>
                     <li>
                        <p>&#44208;&#44284; &#48320;&#54872;&#51088;(transformer)</p>
                     </li>
                  </ul>
               </div>
               <p>&#50948;&#51032; &#51656;&#51032;&#45716; &#52488;&#44592;&#54868;&#46104;&#50612; &#51080;&#44256; NAME&#44284; BIRTHNAME&#51032; &#44050;&#46308;&#51012; <code class="literal">CatDTO</code>&#51032; &#45824;&#51025;&#54616;&#45716; &#54532;&#47196;&#54140;&#54000;&#46308;&#44284; &#54596;&#46300;&#46308; &#49549;&#51004;&#47196; &#51452;&#51077;&#49884;&#53416; <code class="literal">CatDTO</code>&#51032; &#47532;&#49828;&#53944;&#47484; &#48152;&#54872;&#54624; &#44163;&#51060;&#45796;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13412"></a>16.1.6. &#49345;&#49549; &#52376;&#47532;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#49345;&#49549;&#51032; &#48512;&#48516;&#51004;&#47196;&#49436; &#47588;&#54609;&#46104;&#45716; &#50644;&#54000;&#54000;&#46308;&#51012; &#51656;&#51032;&#54616;&#45716; native sql &#51656;&#51032;&#46308;&#51008; baseclass&#51032; &#47784;&#46304; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#54252;&#54632;&#54644;&#50556; &#54616;&#44256; &#44536; &#47784;&#46304; &#44163;&#51060; &#49436;&#48652;&#53364;&#47000;&#49828;&#54868; &#46104;&#50612;&#50556; &#54620;&#45796;.</p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="d0e13417"></a>16.1.7. &#54028;&#46972;&#48120;&#53552;&#46308;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Native sql &#51656;&#51032;&#46308;&#51008; &#50948;&#52824; &#54028;&#46972;&#48120;&#53552;&#46308; &#49104;&#47564; &#50500;&#45768;&#46972; &#47749;&#47749;&#46108; &#54028;&#46972;&#48120;&#53552;&#46308;&#51012; &#51648;&#50896;&#54620;&#45796;:</p><pre class="programlisting">Query query = sess.createSQLQuery("SELECT * FROM CATS WHERE NAME like ?").addEntity(Cat.class);
List pusList = query.setString(0, "Pus%").list();
     
query = sess.createSQLQuery("SELECT * FROM CATS WHERE NAME like :name").addEntity(Cat.class);
List pusList = query.setString("name", "Pus%").list();          </pre></div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="query-criteria-naturalid.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="querysql-namedqueries.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">15.9. natural &#49885;&#48324;&#51088;&#50640; &#51032;&#54620; &#51656;&#51032;&#46308;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;16.2. &#47749;&#47749;&#46108; SQL &#51656;&#51032;&#46308;</td>
            </tr>
         </table>
      </div>
   </body>
</html>