<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>14.3. &#50672;&#44288;&#46308;&#44284; &#51312;&#51064;&#46308;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="queryhql.html" title="14&#51109;. HQL: &#54616;&#51060;&#48260;&#45348;&#51060;&#53944; &#51656;&#51032; &#50616;&#50612;(Hibernate Query Language)">
      <link rel="prev" href="queryhql-from.html" title="14.2. from &#51208;">
      <link rel="next" href="queryhql-joins-forms.html" title="14.4. join &#44396;&#47928;&#51032; &#54805;&#49885;&#46308;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">14.3. &#50672;&#44288;&#46308;&#44284; &#51312;&#51064;&#46308;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="queryhql-from.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">14&#51109;. HQL: &#54616;&#51060;&#48260;&#45348;&#51060;&#53944; &#51656;&#51032; &#50616;&#50612;(Hibernate Query Language)</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="queryhql-joins-forms.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="queryhql-joins"></a>14.3. &#50672;&#44288;&#46308;&#44284; &#51312;&#51064;&#46308;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#50864;&#47532;&#45716; &#46608;&#54620; <code class="literal">join</code>&#51012; &#49324;&#50857;&#54616;&#50668; , &#50672;&#44288;&#46108; &#50644;&#54000;&#54000;&#46308;&#50640; &#46608;&#45716; &#44050;&#46308;&#51012; &#44032;&#51652; &#53084;&#47113;&#49496;&#51032; &#50836;&#49548;&#46308;&#50640;&#46020; alias&#46308;&#51012; &#54624;&#45817;&#54624; &#49688;&#46020; &#51080;&#45796;. 
         </p><pre class="programlisting">from Cat as cat
    inner join cat.mate as mate
    left outer join cat.kittens as kitten</pre><pre class="programlisting">from Cat as cat left join cat.mate.kittens as kittens</pre><pre class="programlisting">from Formula form full join form.parameter param</pre><p>&#51648;&#50896;&#46104;&#45716; join &#53440;&#51077;&#46308;&#51008; ANSI SQL&#47196;&#48512;&#53552; &#48716;&#47140;&#50772;&#45796; </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p>
                                         <code class="literal">inner join</code>
                                     
                  </p>
               </li>
               <li>
                  <p>
                                         <code class="literal">left outer join</code>
                                     
                  </p>
               </li>
               <li>
                  <p>
                                         <code class="literal">right outer join</code>
                                     
                  </p>
               </li>
               <li>
                  <p><code class="literal">full join</code> (&#45824;&#44060; &#50976;&#50857;&#54616;&#51648; &#50506;&#51020;) 
                  </p>
               </li>
            </ul>
         </div>
         <p><code class="literal">inner join</code>, <code class="literal">left outer join</code>, &#44536;&#47532;&#44256; <code class="literal">right outer join</code> &#44396;&#51312;&#52404;&#46308;&#51060; &#50557;&#52845;&#46112; &#49688; &#51080;&#45796;. 
         </p><pre class="programlisting">from Cat as cat
    join cat.mate as mate
    left join cat.kittens as kitten</pre><p>&#45817;&#49888;&#51008; HQL <code class="literal">with</code> &#53412;&#50892;&#46300;&#47484; &#49324;&#50857;&#54616;&#50668; &#53945;&#48324;&#54620; &#51312;&#51064; &#51312;&#44148;&#46308;&#51012; &#51228;&#44277;&#54624; &#49688; &#51080;&#45796;. 
         </p><pre class="programlisting">from Cat as cat
    left join cat.kittens as kitten
        with kitten.bodyWeight &gt; 10.0</pre><p>&#44172;&#45796;&#44032;, "fetch" join&#51008; &#44050;&#46308;&#51012; &#44032;&#51652; &#53084;&#47113;&#49496;&#46308;&#51060;&#45208; &#50672;&#44288;&#44288;&#44228;&#46308;&#51060; &#54620; &#44060;&#51032; select&#47484; &#49324;&#50857;&#54616;&#50668;, &#44536;&#44163;&#46308;&#51032; &#48512;&#47784; &#44061;&#52404;&#46308;&#50640; &#46384;&#46972; &#52488;&#44592;&#54868; &#46104;&#45716; &#44163;&#51012; &#54728;&#50857;&#54644;&#51456;&#45796;. &#51060;&#44163;&#51008; &#53084;&#47113;&#49496;&#51032; &#44221;&#50864;&#50640; &#53945;&#55176; &#50976;&#50857;&#54616;&#45796;. &#44536;&#44163;&#51008; &#50672;&#44288;&#44288;&#44228;&#46308;&#44284;
            &#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54620; &#47588;&#54609; &#54028;&#51068;&#51032; outer join&#44284; lazy &#49440;&#50616;&#46308;&#51012; &#54952;&#50984;&#51201;&#51004;&#47196; &#50724;&#48260;&#46972;&#51060;&#46300; &#49884;&#53416;&#45796;. &#52628;&#44032; &#51221;&#48372;&#45716; <a href="performance.html#performance-fetching" title="19.1. &#54168;&#52845; &#48169;&#46020;&#46308;">19.1&#51208;. &#8220;&#54168;&#52845; &#48169;&#46020;&#46308;&#8221;</a>&#51012; &#48372;&#46972;. 
         </p><pre class="programlisting">from Cat as cat
    inner join fetch cat.mate
    left join fetch cat.kittens</pre><p>fetch join&#51008; &#45824;&#44060; alias&#47484; &#54624;&#45817;&#54624; &#54596;&#50836;&#44032; &#50630;&#45796;. &#50780;&#45264;&#54616;&#47732;, &#50672;&#44288;&#46108; &#44061;&#52404;&#46308;&#51060; <code class="literal">where</code> &#51208;(&#46608;&#45716; &#50612;&#46500; &#45796;&#47480; &#51208;) &#49549;&#50640; &#49324;&#50857;&#46104;&#51648; &#50506;&#51012; &#44163;&#51060;&#44592; &#46412;&#47928;&#51060;&#45796;. &#46608;&#54620; &#50672;&#44288;&#46108; &#44061;&#52404;&#46308;&#51008; &#51656;&#51032; &#44208;&#44284;&#46308; &#49549;&#50640; &#51649;&#51217; &#48152;&#54872;&#46104;&#51648; &#50506;&#45716;&#45796;. &#45824;&#49888; &#44536;&#44163;&#46308;&#51008; &#48512;&#47784; &#44061;&#52404;&#47484; &#53685;&#54644; &#51217;&#44540;&#46112; &#49688; &#51080;&#45796;. &#50864;&#47532;&#44032; alias&#47484; &#54596;&#50836;&#47196; &#54624; &#49688; &#51080;&#45716; &#50976;&#51068;&#54620;
            &#51060;&#50976;&#45716; &#45908; &#47566;&#51008; &#53084;&#47113;&#49496;&#46308;&#51012; &#51116;&#44480;&#51201;&#51004;&#47196; &#51312;&#51064; &#54168;&#52845;&#49884;&#53412;&#45716; &#44221;&#50864;&#51060;&#45796;: 
         </p><pre class="programlisting">from Cat as cat
    inner join fetch cat.mate
    left join fetch cat.kittens child
    left join fetch child.kittens</pre><p>(&#48708;&#47197; <code class="literal">scroll()</code>&#51060; &#49324;&#50857;&#46112; &#49688; &#51080;&#51012;&#51648;&#46972;&#46020;) <code class="literal">fetch</code> &#44396;&#51312;&#52404;&#45716; <code class="literal">iterate()</code>&#47484; &#49324;&#50857;&#54616;&#50668; &#54840;&#52636;&#46104;&#45716; &#51656;&#51032;&#46308; &#45236;&#50640; &#49324;&#50857;&#46112; &#49688; &#50630;&#51020;&#51012; &#45432;&#53944;&#54616;&#46972;. &#51060;&#46308; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51060; &#44208;&#44284; &#54665;&#46308;&#50640; &#44592;&#52488;&#54616;&#44256; &#51080;&#44592; &#46412;&#47928;&#50640; <code class="literal">fetch</code>&#45716; <code class="literal">setMaxResults()</code> &#46608;&#45716; <code class="literal">setFirstResult()</code>&#44284; &#54632;&#44760; &#49324;&#50857;&#46104;&#51648; &#47568;&#50500;&#50556; &#54616;&#47728;, &#44536;&#44163;&#46308;(&#44208;&#44284; &#54665;&#46308;)&#51008; &#45824;&#44060; &#44033;&#44033;&#51032; eager &#53084;&#47113;&#49496; &#54168;&#52845;&#50640; &#45824;&#54644; &#51473;&#48373;&#46308;&#51012; &#54252;&#54632;&#54616;&#48064;&#47196; &#47566;&#51008; &#54665;&#46308;&#51060; &#45817;&#49888;&#51060; &#44592;&#45824;&#54616;&#45716; &#44163;&#51060; &#50500;&#45768;&#45796;. <code class="literal">fetch</code>&#45716; &#53945;&#48324;&#54620; &#50857;&#46020;&#51032; <code class="literal">with</code> &#51312;&#44148;&#44284;&#46020; &#54632;&#44760; &#49324;&#50857;&#46112; &#49688; &#50630;&#45796;.&#54620; &#44060;&#51032; &#51656;&#51032; &#45236;&#50640; &#54616;&#45208; &#51060;&#49345;&#51032; &#53084;&#47113;&#49496;&#51012; &#51312;&#51064; &#54168;&#52845;&#49884;&#53020; &#52852;&#54000;&#51260; &#44273;&#51012; &#49373;&#49457;&#49884;&#53412;&#45716; &#44163;&#51060; &#44032;&#45733;&#54620;&#45936;, &#51060; &#44221;&#50864;&#50640; &#51452;&#51032;&#54616;&#46972;. &#45796;&#51473; &#53084;&#47113;&#49496; role&#46308;&#51012; &#51312;&#51064; &#54168;&#52845;&#49884;&#53412;&#45716; &#44163;&#51008; &#46608;&#54620; &#46412;&#46412;&#47196; bag &#47588;&#54609;&#46308;&#50640;
            &#45824;&#54644; &#50696;&#44592;&#52824; &#50506;&#51008; &#44208;&#44284;&#46308;&#51012; &#44032;&#51256;&#45796;&#51452;&#44592; &#46412;&#47928;&#50640;, &#45817;&#49888;&#51060; &#51060; &#44221;&#50864;&#50640; &#45817;&#49888;&#51032; &#51656;&#51032;&#46308;&#51012; &#52376;&#48169;&#54616;&#45716; &#48169;&#48277;&#50640; &#45824;&#54644; &#51452;&#51032;&#54616;&#46972;. &#47560;&#51648;&#47561;&#51004;&#47196; <code class="literal">full join fetch</code>&#50752; <code class="literal">right join fetch</code>&#45716; &#51032;&#48120;&#44032; &#50630;&#45796;. 
         </p>
         <p>&#47564;&#51068; &#45817;&#49888;&#51060; (&#48148;&#51060;&#53944;&#53076;&#46300; &#48169;&#54200;&#51004;&#47196;) property-&#47112;&#48296; lazy &#54168;&#52845;&#51012; &#49324;&#50857;&#54624; &#44221;&#50864;, Hibernate&#47196; &#54616;&#50668;&#44552; <code class="literal">fetch all properties</code>&#47484; &#49324;&#50857;&#54616;&#50668; (&#52395; &#48264;&#51704; &#51656;&#51032;&#50640;&#49436;) lazy &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#51593;&#49884; &#54168;&#52824;&#54616;&#46020;&#47197; &#44053;&#51228;&#49884;&#53412;&#45716; &#44163;&#51060; &#44032;&#45733;&#54616;&#45796;. 
         </p><pre class="programlisting">from Document fetch all properties order by name</pre><pre class="programlisting">from Document doc fetch all properties where lower(doc.name) like '%cats%'</pre></div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="queryhql-from.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="queryhql.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="queryhql-joins-forms.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">14.2. from &#51208;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;14.4. join &#44396;&#47928;&#51032; &#54805;&#49885;&#46308;</td>
            </tr>
         </table>
      </div>
   </body>
</html>