<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>11.5. &#50672;&#44208; &#54644;&#51228; &#47784;&#46300;&#46308;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="transactions.html" title="11&#51109;. &#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;">
      <link rel="prev" href="transactions-locking.html" title="11.4. Pessimistic &#51104;&#44552;">
      <link rel="next" href="events.html" title="12&#51109;. &#51064;&#53552;&#49481;&#53552;&#46308;&#44284; &#51060;&#48292;&#53944;&#46308;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">11.5. &#50672;&#44208; &#54644;&#51228; &#47784;&#46300;&#46308;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="transactions-locking.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">11&#51109;. &#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="events.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="transactions-connection-release"></a>11.5. &#50672;&#44208; &#54644;&#51228; &#47784;&#46300;&#46308;
                  </h2>
               </div>
            </div>
         </div>
         <p>JDBC &#52964;&#45349;&#49496; &#44288;&#47532;&#50640; &#44288;&#54620; Hibernate&#51032; &#47532;&#44144;&#49884;(2.x) &#53945;&#51669;&#51008; &#44536;&#44163;&#51060; &#52376;&#51020;&#51004;&#47196; &#54596;&#50836;&#47196; &#54664;&#51012; &#46412; &#54616;&#45208;&#51032; <code class="literal">Session</code>&#51060; &#54616;&#45208;&#51032; &#52964;&#45349;&#49496;&#51012; &#54925;&#46301;&#54624; &#44163;&#51060;&#44256;, &#44536;&#47088; &#45796;&#51020; &#44536; &#52964;&#45349;&#49496;&#51008; &#44536; &#49464;&#49496;&#51060; &#45803;&#54784;&#51656;&#46412;&#44620;&#51648; &#48372;&#44288;&#46108;&#45796;&#45716; &#44163;&#51060;&#50632;&#45796;. Hibernate 3.x&#45716; &#49464;&#49496;&#50640;&#44172; &#44536;&#44163;&#51032; JDBC &#52964;&#45349;&#49496;&#46308;&#51012; &#52376;&#47532;&#54616;&#45716; &#48169;&#48277;&#51012; &#50508;&#47140;&#51452;&#44592; &#50948;&#54644; &#50672;&#44208; &#54644;&#51228; &#47784;&#46300;&#46308;&#50640; &#44288;&#54620;
            &#44060;&#45392;&#51012; &#46020;&#51077;&#54664;&#45796;. &#45796;&#51020; &#45436;&#51032;&#45716; &#44396;&#49457;&#46108; <code class="literal">ConnectionProvider</code>&#47484; &#53685;&#54644; &#51228;&#44277;&#46104;&#45716; &#52964;&#45349;&#49496;&#46308;&#50640; &#45824;&#54644;&#49436;&#47564; &#51201;&#51208;&#54616;&#45796;&#45716; &#51216;&#51012; &#45432;&#53944;&#54616;&#46972;; &#49324;&#50857;&#51088;&#44032; &#51228;&#44277;&#54616;&#45716; &#52964;&#45349;&#49496;&#46308;&#51008; <code class="literal">org.hibernate.ConnectionReleaseMode</code>&#51032; &#50676;&#44144;&#46108; &#44050;&#46308;&#50640; &#51032;&#54644; &#49885;&#48324;&#46108;&#45796;: 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p><code class="literal">ON_CLOSE</code> - is essentially the legacy behavior described above. The Hibernate session obtains a connection when it first needs to perform
                     some JDBC access and holds unto that connection until the session is closed. 
                  </p>
               </li>
               <li>
                  <p><code class="literal">AFTER_TRANSACTION</code> - &#51008; &#54616;&#45208;&#51032; <code class="literal">org.hibernate.Transaction</code>&#51060; &#50756;&#47308;&#46108; &#54980;&#50640; &#50672;&#44208;&#46308;&#51012; &#54644;&#51228;&#54616;&#46972;&#44256; &#47568;&#54620;&#45796;. 
                  </p>
               </li>
               <li>
                  <p><code class="literal">AFTER_STATEMENT</code> (&#46608;&#54620; &#51201;&#44537;&#51201;&#51064; &#54644;&#51228;&#46972;&#44256; &#50616;&#44553;&#46120;) - &#45716; &#44033;&#44033;&#51032; &#47784;&#46304; &#47928;&#51109; &#49892;&#54665; &#54980;&#50640; &#52964;&#45349;&#49496;&#46308;&#51012; &#54644;&#51228;&#54616;&#46972;&#44256; &#47568;&#54620;&#45796;. &#51060; &#51201;&#44537;&#51201;&#51064; &#54644;&#51228;&#45716; &#44536; &#47928;&#51109;&#51060; &#51452;&#50612;&#51652; &#49464;&#49496;&#44284; &#50672;&#44288;&#46108; &#47532;&#49548;&#49828;&#46308;&#51012; &#50676;&#47140;&#51652;&#52292;&#47196; &#45224;&#44200;&#46168; &#44221;&#50864;&#50640;&#45716; &#44148;&#45320;&#46832;&#44172;(skip) &#46108;&#45796;;
                     &#54788;&#51116; &#51060;&#44163;&#51060; &#51068;&#50612;&#45208;&#45716; &#50976;&#51068;&#54620; &#49345;&#54889;&#51008; <code class="literal">org.hibernate.ScrollableResults</code>&#51032; &#49324;&#50857;&#51012; &#53685;&#54644;&#49436;&#51060;&#45796;. 
                  </p>
               </li>
            </ul>
         </div>
         <p>&#49324;&#50857;&#54624; &#54644;&#51228; &#47784;&#46300;&#47484; &#51648;&#51221;&#54616;&#44592; &#50948;&#54644; &#44396;&#49457; &#54028;&#46972;&#48120;&#53552; <code class="literal">hibernate.connection.release_mode</code>&#44032; &#49324;&#50857;&#46108;&#45796;. &#44032;&#45733;&#54620; &#44050;&#46308;&#51008; &#45796;&#51020;&#44284; &#44057;&#45796;: 
         </p>
         <div class="itemizedlist">
            <ul type="disc" compact>
               <li>
                  <p><code class="literal">auto</code> (&#46356;&#54260;&#53944;) - &#51060; &#49440;&#53469;&#51008; <code class="literal">org.hibernate.transaction.TransactionFactory.getDefaultReleaseMode()</code> &#47700;&#49548;&#46300;&#50640; &#51032;&#54644; &#48152;&#54872;&#46108; &#54644;&#51228; &#47784;&#46300;&#47196; &#50948;&#51076;&#49884;&#53416;&#45796;. JTATransactionFactory&#51064; &#44221;&#50864;, &#51060;&#44163;&#51008; ConnectionReleaseMode.AFTER_STATEMENT&#47484; &#48152;&#54872;&#54620;&#45796;; JDBCTransactionFactory&#51064;
                     &#44221;&#50864;, &#51060;&#44163;&#51008; ConnectionReleaseMode.AFTER_TRANSACTION&#51012; &#48152;&#54872;&#54620;&#45796;. &#51060; &#49444;&#51221;&#51032; &#44050;&#51060; &#49324;&#50857;&#51088; &#53076;&#46300; &#45236;&#51032; &#48260;&#44536;&#46308; &#44536;&#47532;&#44256;/&#46608;&#45716; &#50976;&#54952;&#54616;&#51648; &#50506;&#51008; &#44032;&#51221;&#46308;&#51012; &#44032;&#47532;&#53412;&#45716; &#44221;&#54693;&#51060; &#51080;&#51020;&#51004;&#47196; &#51064;&#54644; &#51060; &#46356;&#54260;&#53944; &#53945;&#51669;&#51012;
                     &#49892;&#54056;&#47196; &#48320;&#44221;&#54616;&#45716; &#44163;&#51008; &#44144;&#51032; &#51339;&#51008; &#49373;&#44033;&#51060; &#50500;&#45768;&#45796;. 
                  </p>
               </li>
               <li>
                  <p><code class="literal">on_close</code> - &#45716; ConnectionReleaseMode.ON_CLOSE&#47484; &#49324;&#50857;&#54616;&#46972;&#44256; &#47568;&#54620;&#45796;. &#51060; &#49444;&#51221;&#51008; &#50669;&#54840;&#54872;&#49457;&#51012; &#50948;&#54644; &#45224;&#44200;&#51276;&#51648;&#47564;, &#44536;&#44163;&#51032; &#49324;&#50857;&#51008; &#47588;&#50864; &#44428;&#51109;&#46104;&#51648; &#50506;&#45716;&#45796;. 
                  </p>
               </li>
               <li>
                  <p><code class="literal">after_transaction</code> - &#51008; ConnectionReleaseMode.AFTER_TRANSACTION&#51012; &#49324;&#50857;&#54616;&#46972;&#44256; &#47568;&#54620;&#45796;. &#51060; &#49444;&#51221;&#51008; JTA &#54872;&#44221;&#46308;&#50640;&#49436; &#49324;&#50857;&#46104;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;. &#46608;&#54620; ConnectionReleaseMode.AFTER_TRANSACTION&#51064;
                     &#44221;&#50864;&#50640; &#47564;&#51068; &#49464;&#49496;&#51060; auto-commit &#47784;&#46300;&#50640; &#51080;&#46020;&#47197; &#44256;&#47140;&#46112; &#44221;&#50864;, &#52964;&#45349;&#49496;&#46308;&#51008; &#47560;&#52824; &#54644;&#51228; &#47784;&#46300;&#44032; AFTER_STATEMENT&#51064; &#44163;&#52376;&#47100; &#54644;&#51228;&#46112; &#44163;&#51076;&#51012; &#46608;&#54620; &#45432;&#53944;&#54616;&#46972;. 
                  </p>
               </li>
               <li>
                  <p><code class="literal">after_statement</code> - &#45716; ConnectionReleaseMode.AFTER_STATEMENT&#47484; &#49324;&#50857;&#54616;&#46972;&#44256; &#47568;&#54620;&#45796;. &#52628;&#44032;&#51201;&#51004;&#47196; &#44396;&#49457;&#46108; <code class="literal">ConnectionProvider</code>&#45716; &#44536;&#44163;&#51060; &#51060; &#49444;&#51221; (<code class="literal">supportsAggressiveRelease()</code>)&#51012; &#51648;&#50896;&#54616;&#45716;&#51648; &#50668;&#48512;&#47484; &#50508;&#44592; &#50948;&#54644; &#52280;&#44256;&#46108;&#45796;. &#47564;&#51068; &#51648;&#50896;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864;, &#54644;&#51228; &#47784;&#46300;&#45716; ConnectionReleaseMode.AFTER_TRANSACTION&#51004;&#47196; &#51116;&#49444;&#51221;&#46108;&#45796;. &#51060; &#49444;&#51221;&#51008; &#50864;&#47532;&#44032; <code class="literal">ConnectionProvider.getConnection()</code>&#51012; &#54840;&#52636;&#54624; &#46412;&#47560;&#45796; &#50864;&#47532;&#44032; &#46041;&#51068;&#54620; &#44592;&#48376; JDBC &#52964;&#45349;&#49496;&#51012; &#45796;&#49884; &#54596;&#50836;&#47196; &#54624; &#49688; &#51080;&#45716; &#54872;&#44221;&#46308;&#50640;&#49436; &#46608;&#45716; &#50864;&#47532;&#44032; &#46041;&#51068;&#54620; &#52964;&#45349;&#49496;&#51012; &#50619;&#45716; &#44163;&#50640; &#49345;&#44288;&#50630;&#45716; auto-commit &#54872;&#44221;&#50640;&#49436; &#50724;&#51649; &#50504;&#51204;&#54616;&#45796;. 
                  </p>
               </li>
            </ul>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="transactions-locking.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="transactions.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="events.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">11.4. Pessimistic &#51104;&#44552;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;12&#51109;. &#51064;&#53552;&#49481;&#53552;&#46308;&#44284; &#51060;&#48292;&#53944;&#46308;</td>
            </tr>
         </table>
      </div>
   </body>
</html>