<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>11.3. Optimistic &#46041;&#49884;&#49457; &#51228;&#50612;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="transactions.html" title="11&#51109;. &#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;">
      <link rel="prev" href="transactions-demarcation.html" title="11.2. &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228; &#49444;&#51221;">
      <link rel="next" href="transactions-locking.html" title="11.4. Pessimistic &#51104;&#44552;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">11.3. Optimistic &#46041;&#49884;&#49457; &#51228;&#50612;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="transactions-demarcation.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">11&#51109;. &#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="transactions-locking.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="transactions-optimistic"></a>11.3. Optimistic &#46041;&#49884;&#49457; &#51228;&#50612;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#44256;&#46020;&#51032; &#46041;&#49884;&#49457;&#44284; &#44256;&#46020;&#51032; &#44032;&#50857;&#49457;&#51012; &#51068;&#52824;&#49884;&#53412;&#45716; &#50976;&#51068;&#54620; &#51217;&#44540;&#48277;&#51008; &#48260;&#51204;&#54868;&#47484; &#44032;&#51652; optimistic&#46041;&#49884;&#49457; &#51228;&#50612;&#51060;&#45796;. &#48260;&#51204; &#52404;&#53433;&#51008; &#50629;&#45936;&#51060;&#53944; &#52649;&#46028;&#51012; &#44160;&#52636;&#54616;&#44592; &#50948;&#54644;(&#44536;&#47532;&#44256; &#50629;&#45936;&#51060;&#53944; &#49552;&#49892;&#51012; &#48169;&#51648;&#54616;&#44592; &#50948;&#54644;) &#48260;&#51204; &#48264;&#54840;&#46308; &#46608;&#45716; timestamp&#46308;&#51012;
            &#49324;&#50857;&#54620;&#45796;. Hibernate&#45716; optimistic &#46041;&#49884;&#49457;&#51012; &#49324;&#50857;&#54616;&#45716; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53076;&#46300; &#51089;&#49457;&#50640; &#49464; &#44032;&#51648; &#44032;&#45733;&#54620; &#51217;&#44540;&#48277;&#46308;&#51012; &#51228;&#44277;&#54620;&#45796;. &#50864;&#47532;&#44032; &#48372;&#50668;&#51452;&#45716; &#50416;&#51076;&#49352;&#46308;&#51008; &#51109;&#49884;&#44036;&#51032; &#45824;&#54868;&#51032; &#49345;&#54889; &#49549;&#50640; &#51080;&#51648;&#47564;, &#48260;&#51204; &#52404;&#53433; &#46608;&#54620; &#45800;&#51068; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;
            &#53944;&#47004;&#51117;&#49496;&#46308;&#50640;&#49436; &#50629;&#45936;&#51060;&#53944; &#49552;&#49892;&#51012; &#48169;&#51648;&#54616;&#45716; &#51060;&#51216;&#51012; &#44054;&#44256; &#51080;&#45796;. 
         </p>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="transactions-optimistic-manual"></a>11.3.1. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#48260;&#51204; &#52404;&#53433;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#54616;&#45208;&#51032; &#44396;&#54788;&#50640;&#49436; Hibernate&#47196;&#48512;&#53552; &#47566;&#51008; &#46020;&#50880;&#51060; &#50630;&#51060;, &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#45824;&#54620; &#44033;&#44033;&#51032; &#49345;&#54840;&#51089;&#50857;&#51008; &#49352;&#47196;&#50868; <code class="literal">Session</code> &#45236;&#50640;&#49436; &#51068;&#50612;&#45208;&#44256;, &#44060;&#48156;&#51088;&#45716; &#50689;&#49549; &#51064;&#49828;&#53556;&#49828;&#46308;&#51012; &#52376;&#47532;&#54616;&#44592; &#51204;&#50640; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196;&#48512;&#53552; &#47784;&#46304; &#50689;&#49549; &#51064;&#49828;&#53556;&#49828;&#46308;&#51012; &#45796;&#49884; &#47196;&#46300;&#49884;&#53420; &#52293;&#51076;&#51060; &#51080;&#45796;. &#51060; &#51217;&#44540;&#48277;&#51008; &#45824;&#54868; &#53944;&#47004;&#51117;&#49496;&#51012; &#54869;&#49892;&#55176; &#44201;&#47532;&#49884;&#53412;&#44592; &#50948;&#54644; &#44536;&#44163; &#51088;&#49888;&#51032; &#48260;&#51204; &#52404;&#53433;&#51012; &#49688;&#54665;&#54616;&#46020;&#47197;
               &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#44172; &#44053;&#51228;&#49884;&#53416;&#45796;. 
            </p><pre class="programlisting">// foo is an instance loaded by a previous Session
session = factory.openSession();
Transaction t = session.beginTransaction();

int oldVersion = foo.getVersion();
session.load( foo, foo.getKey() ); // load the current state
if ( oldVersion != foo.getVersion() ) throw new StaleObjectStateException();
foo.setProperty("bar");

t.commit();
session.close();</pre><p>version &#54532;&#47196;&#54140;&#54000;&#45716; <code class="literal">&lt;version&gt;</code>&#51012; &#49324;&#50857;&#54616;&#50668; &#47588;&#54609;&#46104;&#44256;, Hibernate&#45716; &#47564;&#51068; &#50644;&#54000;&#54000;&#44032; dirty&#51068; &#44221;&#50864; flush &#46041;&#50504;&#50640; &#44536;&#44163;&#51012; &#51088;&#46041;&#51201;&#51004;&#47196; &#51613;&#44032;&#49884;&#53420; &#44163;&#51060;&#45796;. 
            </p>
            <p>&#47932;&#47200;, &#45817;&#49888;&#51060; &#45230;&#51008; &#45936;&#51060;&#53552; &#46041;&#49884;&#49457; &#54872;&#44221;&#50640;&#49436; &#51089;&#50629;&#54616;&#44256; &#51080;&#44256; &#48260;&#51204; &#52404;&#53433;&#51012; &#54596;&#50836;&#47196; &#54616;&#51648; &#50506;&#51012; &#44221;&#50864;&#50640;, &#45817;&#49888;&#51008; &#51060; &#51217;&#44540;&#48277;&#51012; &#49324;&#50857;&#54624; &#49688; &#46020; &#51080;&#44256; &#45800;&#51648; &#48260;&#51204; &#52404;&#53356;&#47484; &#49373;&#47029;&#54624; &#49688;&#46020; &#51080;&#45796;. &#44536; &#44221;&#50864;&#50640;, <span class="emphasis"><em>&#47560;&#51648;&#47561;&#51032; &#52964;&#48139; &#49457;&#44277;</em></span>&#51008; &#45817;&#49888;&#51032; &#51109;&#49884;&#44036;&#51032; &#45824;&#54868;&#50640; &#45824;&#54620; &#46356;&#54260;&#53944; &#48169;&#46020;&#44032; &#46112; &#44163;&#51060;&#45796;. &#51060;&#44163;&#51060; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032; &#49324;&#50857;&#51088;&#46308;&#51012; &#54844;&#46041;&#49884;&#53420; &#49688; &#51080;&#51020;&#51012; &#50684;&#46160;&#50640; &#46160;&#46972;. &#50780;&#45264;&#54616;&#47732; &#49324;&#50857;&#51088;&#46308;&#51008; &#50724;&#47448; &#47700;&#49884;&#51648;&#46308; &#46608;&#45716; &#52649;&#46028; &#48320;&#44221;&#46308;&#51012; &#48337;&#54633;&#49884;&#53420; &#44592;&#54924; &#50630;&#51060; &#50629;&#45936;&#51060;&#53944;&#46308; &#49552;&#49892;&#51012; &#44202;&#51012;
               &#49688;&#46020; &#51080;&#44592; &#46412;&#47928;&#51060;&#45796;. 
            </p>
            <p>Clearly, manual version checking is only feasible in very trivial circumstances and not practical for most applications. Often
               not only single instances, but complete graphs of modified objects have to be checked. Hibernate offers automatic version
               checking with either an extended <code class="literal">Session</code> or detached instances as the design paradigm. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="transactions-optimistic-longsession"></a>11.3.2. &#54869;&#51109;&#46108; &#49464;&#49496;&#44284; &#51088;&#46041;&#51201;&#51064; &#48260;&#51204;&#54868;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#54616;&#45208;&#51032; <code class="literal">Session</code> &#51064;&#49828;&#53556;&#49828;&#50752; &#44536;&#44163;&#51032; &#50689;&#49549; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#51204;&#52404; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53944;&#47004;&#51117;&#49496;&#50640; &#49324;&#50857;&#46108;&#45796;. Hibernate&#45716; flush &#54624; &#46412; &#51064;&#49828;&#53556;&#49828; &#48260;&#51204;&#46308;&#51012; &#52404;&#53356;&#54616;&#44256; &#47564;&#51068; &#46041;&#49884;&#49457; &#48320;&#44221;&#51060; &#44160;&#52636;&#46112; &#44221;&#50864;&#50640; &#50696;&#50808;&#49345;&#54889;&#51012; &#45912;&#51652;&#45796;. &#51060; &#50696;&#50808;&#49345;&#54889;&#51012; &#51105;&#50500;&#45236;&#44256;
               &#52376;&#47532;&#54616;&#45716; &#44163;&#51012; &#44060;&#48156;&#51088;&#51032; &#47787;&#51060;&#45796;(&#44277;&#53685;&#46108; &#50741;&#49496;&#46308;&#51008; &#48320;&#44221;&#46308;&#51012; &#48337;&#54633;&#49884;&#53412;&#44144;&#45208; &#46608;&#45716; &#50424;&#47784;&#44032; &#50630;&#51648; &#50506;&#51008; &#45936;&#51060;&#53552;&#47196; &#48708;&#51648;&#45768;&#49828; &#54532;&#47196;&#49464;&#49828;&#47484; &#45796;&#49884; &#49884;&#51089;&#54616;&#45716; &#44592;&#54924;&#47484; &#49324;&#50857;&#51088;&#50640;&#44172; &#51452;&#45716; &#44163;&#51060;&#45796;). &#54616;&#45208;&#51032; <code class="literal">Session</code> &#51064;&#49828;&#53556;&#49828;&#50752; &#44536;&#44163;&#51032; &#50689;&#49549; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; <span class="emphasis"><em>session-per-conversation</em></span>&#47196; &#50508;&#47140;&#51652; &#51204;&#52404; &#45824;&#54868;&#50640; &#49324;&#50857;&#46108;&#45796;. Hibernate&#45716; flush &#49884;&#51216;&#50640;&#49436; &#51064;&#49828;&#53556;&#49828; &#48260;&#51204;&#46308;&#51012; &#52404;&#53356;&#54616;&#47728;, &#47564;&#51068; &#46041;&#49884;&#51201;&#51064; &#48320;&#44221;&#51060; &#44160;&#52636;&#46112; &#44221;&#50864;&#50640; &#54616;&#45208;&#51032; &#50696;&#50808;&#49345;&#54889;&#51012; &#45912;&#51652;&#45796;. &#51060; &#50696;&#50808;&#49345;&#54889;&#51012; &#54252;&#52265;&#54616;&#44256; &#52376;&#47532;&#54616;&#45716; &#44163;&#51008; &#44060;&#48156;&#51088;&#51032; &#47787;&#51060;&#45796;(&#44277;&#53685;&#46108;
               &#50741;&#49496;&#46308;&#51008; &#49324;&#50857;&#51088;&#44032; &#48320;&#44221;&#46308;&#51012; &#48337;&#54633;&#54616;&#44144;&#45208; &#49552;&#49892;&#46104;&#51648; &#50506;&#51008; &#45936;&#51060;&#53552;&#47484; &#44032;&#51648;&#44256; &#48708;&#51648;&#45768;&#49828; &#45824;&#54868;&#47484; &#51116;&#49884;&#51089;&#54616;&#45716; &#44592;&#54924;&#51060;&#45796;). 
            </p>
            <p><code class="literal">Session</code>&#51008; &#49324;&#50857;&#51088; &#49345;&#54840;&#51089;&#50857;&#51012; &#44592;&#45796;&#47540; &#46412; &#50612;&#46500; &#44592;&#48376; JDBC &#52964;&#45349;&#49496;&#51004;&#47196;&#48512;&#53552; &#50672;&#44208;&#54644;&#51228;&#46108;&#45796;. &#51060; &#51217;&#44540;&#48277;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51217;&#44540;&#51032; &#44288;&#51216;&#50640;&#49436; &#48372;&#47732; &#44032;&#51109; &#54952;&#50984;&#51201;&#51060;&#45796;. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#48260;&#51204; &#52404;&#53433; &#46608;&#45716; detached &#51064;&#49828;&#53556;&#49828;&#46308;&#51012; &#51116;&#52392;&#48512;&#54616;&#45716; &#44163;&#50640;
               &#44536; &#51088;&#52404; &#44288;&#44228;&#54624; &#54596;&#50836;&#44032; &#50630;&#44144;&#45208; &#44536;&#44163;&#51008; &#47784;&#46304; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#50640;&#49436; &#51064;&#49828;&#53556;&#49828;&#46308;&#51012; &#45796;&#49884; &#47196;&#46300;&#49884;&#53420; &#54596;&#50836;&#44032; &#50630;&#45796;. 
            </p><pre class="programlisting">// foo is an instance loaded earlier by the old session
Transaction t = session.beginTransaction(); // Obtain a new JDBC connection, start transaction

foo.setProperty("bar");

session.flush();    // Only for last transaction in conversation
t.commit();         // Also return JDBC connection
session.close();    // Only for last transaction in conversation</pre><p><code class="literal">foo</code> &#44061;&#52404;&#45716; &#44536;&#44163;&#51060; &#47196;&#46300;&#46104;&#50632;&#45912; <code class="literal">Session</code>&#51060; &#50612;&#45712; &#44163;&#51064;&#51648;&#47484; &#50668;&#51204;&#55176; &#50508;&#44256; &#51080;&#45796;. &#51060;&#51204; &#49464;&#49496; &#49345;&#50640;&#49436; &#54616;&#45208;&#51032; &#49352;&#47196;&#50868; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51012; &#49884;&#51089;&#54616;&#45716; &#44163;&#51008; &#54616;&#45208;&#51032; &#49352;&#47196;&#50868; &#52964;&#45349;&#49496;&#51012; &#54925;&#46301;&#54616;&#44256; &#44536; &#49464;&#49496;&#51012; &#49548;&#48708;&#54620;&#45796;. &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51012; &#52964;&#48139;(&#54869;&#50557;)&#49884;&#53412;&#45716; &#44163;&#51008; &#44536; JDBC
               &#52964;&#45349;&#49496;&#51004;&#47196;&#48512;&#53552; &#54616;&#45208;&#51032; &#49464;&#49496;&#51012; &#50672;&#44208;&#54644;&#51228;&#49884;&#53412;&#44256; &#44536; &#52964;&#45349;&#49496;&#51012; &#54400;(pool)&#47196; &#48152;&#54872;&#49884;&#53420; &#44163;&#51060;&#45796;. &#51116;&#50672;&#44208; &#54980;&#50640;, &#45817;&#49888;&#51060; &#50629;&#45936;&#51060;&#53944;&#54616;&#44256; &#51080;&#51648; &#50506;&#51008; &#45936;&#51060;&#53552;&#50640; &#45824;&#54620; &#48260;&#51204; &#52404;&#53356;&#47484; &#44053;&#51228;&#49884;&#53412;&#44592; &#50948;&#54644;&#49436;, &#45817;&#49888;&#51008; &#46608; &#45796;&#47480; &#53944;&#47004;&#51117;&#49496;&#50640; &#51032;&#54644; &#50629;&#45936;&#51060;&#53944;&#46104;&#50632;&#51012;
               &#49688;&#46020; &#51080;&#45716; &#51076;&#51032;&#51032; &#44061;&#52404;&#46308;&#50640; &#45824;&#54644; <code class="literal">LockMode.READ</code>&#47196;&#49436; <code class="literal">Session.lock()</code>&#51012; &#54840;&#52636;&#54624; &#49688;&#46020; &#51080;&#45796;. &#45817;&#49888;&#51008; &#45817;&#49888;&#51060; &#50629;&#45936;&#51060;&#53944; &#51473;&#51064; &#51076;&#51032;&#51032; &#45936;&#51060;&#53552;&#47484; &#51104;&#44552;&#54624; &#54596;&#50836;&#44032; &#50630;&#45796;. &#45824;&#44060; &#45817;&#49888;&#51008; &#47560;&#51648;&#47561; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#51452;&#44592;&#47564;&#51060; &#51060; &#45824;&#54868; &#45236;&#50640;&#49436; &#54665;&#54644;&#51652; &#47784;&#46304; &#48320;&#44221;&#46308;&#51012; &#49892;&#51228;&#47196; &#50689;&#49549;&#54868;&#49884;&#53412;&#45716; &#44163;&#51060; &#54728;&#50857;&#46104;&#46020;&#47197; &#54616;&#44592;
               &#50948;&#54644;, &#54616;&#45208;&#51032; &#54869;&#51109;&#46108; <code class="literal">Session</code>&#50640; &#45824;&#54644; <code class="literal">FlushMode.MANUAL</code>&#47484; &#49444;&#51221;&#54624; &#44163;&#51060;&#45796;. &#44536;&#47084;&#48064;&#47196; &#50724;&#51649; &#51060; &#47560;&#51648;&#47561; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#47564;&#51060; <code class="literal">flush()</code> &#50724;&#54140;&#47112;&#51060;&#49496;&#51012; &#54252;&#54632;&#54624; &#44163;&#51060;&#44256;, &#46608;&#54620; &#45824;&#54868;&#47484; &#51333;&#47308;&#49884;&#53412;&#44592; &#50948;&#54644; &#49464;&#49496;&#51012; <code class="literal">close()</code>&#54624; &#44163;&#51060;&#45796;. 
            </p>
            <p>&#47564;&#51068; &#49324;&#50857;&#51088;&#44032; &#49373;&#44033;&#54616;&#45716;&#49884;&#44036; &#46041;&#50504; <code class="literal">Session</code>&#51060; &#51200;&#51109;&#46104;&#44592;&#50640; &#45320;&#47924; &#53360; &#44221;&#50864; &#51060; &#54056;&#53556;&#51008; &#47928;&#51228;&#49457;&#51060; &#51080;&#45796;. &#50696;&#47484; &#46308;&#50612; <code class="literal">HttpSession</code>&#51008; &#44032;&#45733;&#54620; &#51089;&#51008; &#44163;&#51004;&#47196; &#50976;&#51648;&#46104;&#50612;&#50556; &#54620;&#45796;. &#46608;&#54620; <code class="literal">Session</code>&#51008; (&#54596;&#49688;&#51032;) &#52395; &#48264;&#51704; &#47112;&#48296; &#52880;&#49884;&#51060;&#44256; &#47784;&#46304; &#47196;&#46300;&#46108; &#44061;&#52404;&#46308;&#51012; &#54252;&#54632;&#54616;&#44592; &#46412;&#47928;&#50640;, &#50864;&#47532;&#45716; &#50500;&#47560; &#51201;&#51008; &#50836;&#52397;/&#51025;&#45813; &#51452;&#44592;&#46308;&#50640; &#45824;&#54644;&#49436;&#47564; &#51060; &#48169;&#46020;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. &#45817;&#49888;&#51008; &#54616;&#45208;&#51032; &#45824;&#54868;&#50640; &#45824;&#54644;&#49436;&#47564; &#54616;&#45208;&#51032; <code class="literal">Session</code>&#51012; &#49324;&#50857;&#54644;&#50556; &#54620;&#45796;. &#50780;&#45264;&#54616;&#47732; &#44536;&#44163;&#51008; &#46608;&#54620; &#44263; &#49892;&#50630;&#45716; &#45936;&#51060;&#53552;&#44032; &#46112; &#44163;&#51060;&#44592; &#46412;&#47928;&#51060;&#45796;. 
            </p>
            <p>(&#52488;&#44592;&#51032; Hibernate &#48260;&#51204;&#46308;&#51008; <code class="literal">Session</code>&#50640; &#45824;&#54620; &#47749;&#49884;&#51201;&#51064; &#50672;&#44208;&#54644;&#51228;&#50752; &#51116;&#50672;&#44208;&#51012; &#54596;&#50836;&#47196; &#54664;&#51020;&#51012; &#45432;&#53944;&#54616;&#46972;. &#53944;&#47004;&#51117;&#49496;&#51012; &#49884;&#51089;&#54616;&#44256; &#45149;&#45236;&#45716; &#44163;&#51060; &#46041;&#51068;&#54620; &#54952;&#44284;&#47484; &#44032;&#51648;&#48064;&#47196;, &#51060;&#46308; &#48169;&#48277;&#46308;&#51008; &#51652;&#48512;&#54616;&#44172; &#46104;&#50632;&#45796;.) 
            </p>
            <p>&#46608;&#54620; &#45817;&#49888;&#51008; &#50689;&#49549; &#44228;&#52789;&#50640; &#45824;&#54644; &#50672;&#44208;&#54644;&#51228;&#46108; <code class="literal">Session</code>&#51012; &#45803;&#54784;&#51652;&#52292;&#47196; &#50976;&#51648;&#54644;&#50556;&#54632;&#51012; &#45432;&#53944;&#54616;&#46972;. &#45804; &#47532;&#47568;&#54644;, &#54616;&#45208;&#51032; 3-tier &#54872;&#44221;&#50640;&#49436; <code class="literal">Session</code>&#51012; &#49548;&#50976;&#54616;&#45716;&#45936; EJB stateful session bean&#51012; &#49324;&#50857;&#54616;&#44256;, <code class="literal">HttpSession</code> &#45236;&#50640; &#44536;&#44163;&#51012; &#51200;&#51109;&#54616;&#44592; &#50948;&#54644; &#44536;&#44163;&#51012; &#50937; &#44228;&#52789;&#50640; &#51204;&#49569;&#54616;&#51648; &#47568;&#46972; (&#46608;&#45716; &#44536;&#44163;&#51012; &#48324;&#46020;&#51032; &#54000;&#50612;&#50640; &#51649;&#47148;&#54868; &#49884;&#53412;&#51648;&#46020; &#47568;&#46972;). 
            </p>
            <p>&#54869;&#51109;&#46108; &#49464;&#49496; &#54056;&#53556;, &#46608;&#45716; <span class="emphasis"><em>session-per-conversation</em></span>&#51008; &#51088;&#46041;&#51201;&#51064; &#54788;&#51116; &#49464;&#49496; &#52968;&#53581;&#49828;&#53944; &#44288;&#47532;&#50640; &#45824;&#54644; &#44396;&#54788;&#54616;&#44592;&#44032; &#45908; &#50612;&#47157;&#45796;. &#45817;&#49888;&#51008; &#51060;&#47484; &#50948;&#54644; &#45817;&#49888; &#51088;&#49888;&#51032; <code class="literal">CurrentSessionContext</code> &#44396;&#54788;&#51012; &#44277;&#44553;&#54624; &#54596;&#50836;&#44032; &#51080;&#51004;&#47728;, &#50696;&#51228;&#46308;&#51008; Hibernate Wiki&#47484; &#48372;&#46972;. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="transactions-optimistic-detached"></a>11.3.3. Detached &#44061;&#52404;&#46308;&#44284; &#51088;&#46041;&#51201;&#51064; &#48260;&#51204;&#54868;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#50689;&#49549; &#51200;&#51109;&#49548;&#50640; &#45824;&#54620; &#44033;&#44033;&#51032; &#49345;&#54840;&#51089;&#50857;&#51008; &#49352;&#47196;&#50868; <code class="literal">Session</code>&#50640;&#49436; &#51068;&#50612;&#45212;&#45796;. &#54616;&#51648;&#47564; &#46041;&#51068;&#54620; &#50689;&#49549; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50752;&#51032; &#44033;&#44033;&#51032; &#49345;&#54840;&#51089;&#50857;&#50640; &#51116;&#49324;&#50857;&#46108;&#45796;. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#50896;&#47000; &#47196;&#46300;&#46104;&#50632;&#45912; detached &#51064;&#49828;&#53556;&#49828;&#46308;&#51032; &#49345;&#53468;&#47484; &#46608; &#45796;&#47480; <code class="literal">Session</code> &#45236;&#50640;&#49436; &#52376;&#47532;&#54616;&#44256; &#45208;&#49436; <code class="literal">Session.update()</code>, <code class="literal">Session.saveOrUpdate()</code>, <code class="literal">Session.merge()</code>&#47484; &#49324;&#50857;&#54616;&#50668; &#44536;&#44163;&#46308;&#51012; &#45796;&#49884; &#52392;&#48512;&#49884;&#53416;&#45796;. 
            </p><pre class="programlisting">// foo is an instance loaded by a previous Session
foo.setProperty("bar");
session = factory.openSession();
Transaction t = session.beginTransaction();
session.saveOrUpdate(foo); // Use merge() if "foo" might have been loaded already
t.commit();
session.close();</pre><p>Again, Hibernate will check instance versions during flush, throwing an exception if conflicting updates occurred. </p>
            <p>&#45817;&#49888;&#51008; &#46608;&#54620; <code class="literal">update()</code>&#45824;&#49888;&#50640; <code class="literal">lock()</code>&#51012; &#54840;&#52636;&#54624; &#49688;&#46020; &#51080;&#44256; &#47564;&#51068; &#44536; &#44061;&#52404;&#44032; &#48320;&#44221;&#46104;&#51648; &#50506;&#50520;&#51020;&#51012; &#45817;&#49888;&#51060; &#54869;&#49888;&#54616;&#45716; &#44221;&#50864;&#50640; (&#48260;&#51204; &#52404;&#53433;&#51012; &#49688;&#54665;&#54616;&#44256; &#47784;&#46304; &#52880;&#49884;&#46308;&#51012; &#47924;&#49884;&#54616;&#45716;) <code class="literal">LockMode.READ</code>&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="transactions-optimistic-customizing"></a>11.3.4. &#51088;&#46041;&#51201;&#51064; &#48260;&#51204;&#54868;&#47484; &#47582;&#52644;&#54868; &#49884;&#53412;&#44592;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#45817;&#49888;&#51008; <code class="literal">optimistic-lock</code> &#47588;&#54609; &#49549;&#49457;&#51012; <code class="literal">false</code>&#47196; &#49444;&#51221;&#54632;&#51004;&#47196;&#50024; &#53945;&#51221; &#54532;&#47196;&#54140;&#54000;&#46308;&#44284; &#53084;&#47113;&#49496;&#46308;&#50640; &#45824;&#54620; Hibernate&#51032; &#51088;&#46041;&#51201;&#51064; &#48260;&#51204; &#51613;&#44032;&#47484; &#48520;&#44032;&#45733;&#54616;&#46020;&#47197; &#54624; &#49688;&#46020; &#51080;&#45796;. &#44536;&#46412; Hibernate&#45716; &#44536; &#54532;&#47196;&#54140;&#54000;&#44032; dirty &#51068; &#44221;&#50864;&#50640; &#45908; &#51060;&#49345; &#48260;&#51204;&#51012; &#51613;&#44032;&#49884;&#53412;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;.
               
            </p>
            <p>Legacy database schemas are often static and can't be modified. Or, other applications might also access the same database
               and don't know how to handle version numbers or even timestamps. In both cases, versioning can't rely on a particular column
               in a table. To force a version check without a version or timestamp property mapping, with a comparison of the state of all
               fields in a row, turn on <code class="literal">optimistic-lock="all"</code> in the <code class="literal">&lt;class&gt;</code> mapping. Note that this conceptually only works if Hibernate can compare the old and new state, i.e. if you use a single
               long <code class="literal">Session</code> and not session-per-request-with-detached-objects. 
            </p>
            <p>&#46412;&#46412;&#47196; &#54665;&#54644;&#51276;&#45912; &#48320;&#44221;&#46308;&#51060; &#51473;&#52393;&#46104;&#51648; &#50506;&#45716; &#54620; &#46041;&#49884;&#51201;&#51064; &#48320;&#44221;&#51060; &#54728;&#50857;&#46112; &#49688; &#51080;&#45796;. &#47564;&#51068; <code class="literal">&lt;class&gt;</code>&#47484; &#47588;&#54609;&#54624; &#46412; &#45817;&#49888;&#51060; <code class="literal">optimistic-lock="dirty"</code>&#47484; &#49444;&#51221;&#54616;&#47732;, Hibernate&#45716; flush &#46041;&#50504;&#50640; dirty &#54596;&#46300;&#46308;&#51012; &#48708;&#44368;&#47564; &#54624; &#44163;&#51060;&#45796;. 
            </p>
            <p>In both cases, with dedicated version/timestamp columns or with full/dirty field comparison, Hibernate uses a single <code class="literal">UPDATE</code> statement (with an appropriate <code class="literal">WHERE</code> clause) per entity to execute the version check and update the information. If you use transitive persistence to cascade
               reattachment to associated entities, Hibernate might execute unnecessary updates. This is usually not a problem, but <span class="emphasis"><em>on update</em></span> triggers in the database might be executed even when no changes have been made to detached instances. You can customize this
               behavior by setting <code class="literal">select-before-update="true"</code> in the <code class="literal">&lt;class&gt;</code> mapping, forcing Hibernate to <code class="literal">SELECT</code> the instance to ensure that changes did actually occur, before updating the row. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="transactions-demarcation.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="transactions.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="transactions-locking.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">11.2. &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228; &#49444;&#51221;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;11.4. Pessimistic &#51104;&#44552;</td>
            </tr>
         </table>
      </div>
   </body>
</html>