<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>11&#51109;. &#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="prev" href="objectstate-metadata.html" title="10.12. &#47700;&#53440;&#45936;&#51060;&#53552; &#49324;&#50857;&#54616;&#44592;">
      <link rel="next" href="transactions-demarcation.html" title="11.2. &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228; &#49444;&#51221;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">11&#51109;. &#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="objectstate-metadata.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="transactions-demarcation.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="transactions"></a>11&#51109;. &#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;
                  </h2>
               </div>
            </div>
         </div>
         <p>Hibernate&#50752; &#46041;&#49884;&#49457; &#51228;&#50612;&#50640; &#45824;&#54620; &#44032;&#51109; &#51473;&#50836;&#54620; &#51216;&#51008; &#51060;&#54644;&#54616;&#44592;&#44032; &#47588;&#50864; &#49789;&#45796;&#45716; &#51216;&#51060;&#45796;. Hibernate&#45716; &#50612;&#46500; &#52628;&#44032;&#51201;&#51064; &#51104;&#44552; &#54665;&#50948; &#50630;&#51060; JDBC &#52964;&#45349;&#49496;&#46308;&#44284; JTA &#47532;&#49548;&#49828;&#46308;&#51012; &#51649;&#51217; &#49324;&#50857;&#54620;&#45796;. &#50864;&#47532;&#45716; &#45817;&#49888;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;
            &#44288;&#47532; &#49884;&#49828;&#53596;&#51032; JDBC, ANSI, &#44536;&#47532;&#44256; &#53944;&#47004;&#51117;&#49496; &#44201;&#47532; &#47749;&#49464;&#50640; &#50557;&#44036;&#51032; &#49884;&#44036;&#51012; &#54624;&#50528;&#54624; &#44163;&#51012; &#47588;&#50864; &#44428;&#51109;&#54620;&#45796;. 
         </p>
         <p>Hibernate&#45716; &#47700;&#47784;&#47532; &#45236;&#50640;&#49436; &#44061;&#52404;&#46308;&#51012; &#51104;&#44536;&#51648; &#50506;&#45716;&#45796;. &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#44201;&#47532; &#47112;&#48296;&#50640; &#51032;&#54644; &#51221;&#51032;&#46108; &#45824;&#47196; &#54665;&#50948;&#47484; &#44592;&#45824;&#54624; &#49688; &#51080;&#45796;. &#46608;&#54620; transaction-&#50689;&#50669;&#51032; &#52880;&#49884;&#51064; <code class="literal">Session</code> &#45909;&#48516;&#50640;, Hibernate&#45716; (&#49828;&#52860;&#46972; &#44050;&#46308;&#51012; &#48152;&#54872;&#54616;&#45716; &#51656;&#51032;&#46308;&#51012; &#48372;&#44256;&#54616;&#51648; &#50506;&#45716;) &#49885;&#48324;&#51088;&#50752; &#50644;&#54000;&#54000; &#51656;&#51032;&#46308;&#50640; &#51032;&#54620; &#47337;&#50629;&#51012; &#50948;&#54644; &#48152;&#48373; &#44032;&#45733;&#54620; &#51069;&#44592;&#47484; &#51228;&#44277;&#54620;&#45796;. 
         </p>
         <p>&#51088;&#46041;&#51201;&#51064; optimistic &#46041;&#49884;&#49457; &#51228;&#50612;&#47484; &#50948;&#54620; &#48260;&#51204;&#54868;&#50640; &#45927;&#48537;&#50668;, Hibernate&#45716; &#46608;&#54620; <code class="literal">SELECT FOR UPDATE</code> &#44396;&#47928;&#51012; &#49324;&#50857;&#54616;&#50668; &#54665;&#46308;&#50640; &#45824;&#54620; pessimistic &#51104;&#44552;&#51012; &#50948;&#54620; &#54616;&#45208;&#51032; (&#47560;&#51060;&#45320;)API&#47484; &#51228;&#44277;&#54620;&#45796;. optimistic &#46041;&#49884;&#49457; &#51228;&#50612;&#50752; &#51060; API&#45716; &#51060; &#51109;&#51032; &#46263;&#48512;&#48516;&#50640;&#49436; &#45436;&#51032;&#46108;&#45796;. 
         </p>
         <p>&#50864;&#47532;&#45716; <code class="literal">Configuration</code>, <code class="literal">SessionFactory</code>, <code class="literal">Session</code>, &#50508;&#44081;&#51060;&#47484; &#44032;&#51652; Hibernate&#50640;&#49436;&#51032; &#46041;&#49884;&#49457; &#51228;&#50612; &#49104;&#47564; &#50500;&#45768;&#46972; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#44284; &#51109;&#44592;&#44036;&#50640; &#44152;&#52828; (&#52980;&#54504;&#53552;&#50752;&#51032;)&#45824;&#54868;&#46308;&#50640; &#45824;&#54620; &#45436;&#51032;&#47484; &#49884;&#51089;&#54620;&#45796;. 
         </p>
         <div class="sect1" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="transactions-basics"></a>11.1. &#49464;&#49496; &#50689;&#50669;&#44284; &#53944;&#47004;&#51117;&#49496; &#50689;&#50669;
                     </h2>
                  </div>
               </div>
            </div>
            <p><code class="literal">SessionFactory</code>&#45716; &#47784;&#46304; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#50416;&#47112;&#46300;&#46308;&#50640; &#51032;&#54644; &#44277;&#50976;&#46104;&#46020;&#47197; &#44256;&#50504;&#46108; &#49373;&#49457;&#50640; &#48708;&#50857;&#51060; &#46300;&#45716;, &#50416;&#47112;&#46300;&#50504;&#51204;(threadsafe) &#44061;&#52404;&#51060;&#45796;. &#44536;&#44163;&#51008; &#45824;&#44060; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49884;&#51089; &#49884;&#50640; <code class="literal">Configuration</code> &#51064;&#49828;&#53556;&#49828;&#47196;&#48512;&#53552; &#54620;&#48264; &#49373;&#49457;&#46108;&#45796;. 
            </p>
            <p><code class="literal">Session</code>&#51008; &#54616;&#45208;&#51032; &#50836;&#52397;, &#54616;&#45208;&#51032; &#45824;&#54868; , &#54616;&#45208;&#51032; &#51089;&#50629; &#45800;&#50948;&#47484; &#50948;&#54644; &#54620;&#48264;&#47564; &#49324;&#50857;&#46104;&#44256; &#45208;&#49436; &#54224;&#44592;&#46112; &#50696;&#51221;&#51064;, &#48708;&#50857;&#51060; &#46308;&#51648; &#50506;&#45716;, &#50416;&#47112;&#46300; &#50504;&#51204;&#54616;&#51648; &#50506;&#51008; &#44061;&#52404;&#51060;&#45796;. <code class="literal">Session</code>&#51008; &#52964;&#45349;&#49496;&#51060; &#54596;&#50836;&#54616;&#51648; &#50506;&#51004;&#47732; &#54616;&#45208;&#51032; JDBC <code class="literal">Connection</code>(&#46608;&#45716; <code class="literal">Datasource</code>)&#47484; &#50619;&#51648; &#50506;&#51012; &#44163;&#51060;&#48064;&#47196;, &#49324;&#50857;&#46112; &#46412;&#44620;&#51648; &#47532;&#49548;&#49828;&#46308;&#51012; &#49548;&#48708;&#54616;&#51648; &#50506;&#45716;&#45796;. 
            </p>
            <p>&#51060; &#44536;&#47548;&#51012; &#50756;&#49457;&#54616;&#44592; &#50948;&#54644; &#45817;&#49888;&#51008; &#46608;&#54620; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51116;&#49496;&#46308;&#50640; &#45824;&#54644; &#49373;&#44033;&#54644;&#50556; &#54620;&#45796;. &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640;&#49436; &#51104;&#44552; &#45796;&#53820;&#51012; &#51460;&#51060;&#44592; &#50948;&#54644; &#44032;&#45733;&#54620; &#51687;&#50500;&#50556; &#54620;&#45796;. &#44596; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#46308;&#51008; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060;
               &#44256;&#46020;&#51032; &#46041;&#49884;&#49457; &#47196;&#46300;&#47196;&#51032; &#44032;&#50857;&#49457;&#51012; &#45458;&#51060;&#45716; &#44163;&#51012; &#48169;&#54644;&#54624; &#44163;&#51060;&#45796;. &#44536;&#47084;&#48064;&#47196; &#49324;&#50857;&#51088;&#44032; &#49373;&#44033;&#54616;&#45716; &#49884;&#44036; &#46041;&#50504; &#45800;&#50948; &#51089;&#50629;&#51060; &#50756;&#47308;&#46112; &#46412;&#44620;&#51648; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51012; &#50676;&#47140;&#51652;&#52292;&#47196; &#49548;&#50976;&#54616;&#45716; &#44163;&#51008; &#45824;&#44060; &#44208;&#53076; &#51339;&#51008; &#49444;&#44228;&#45716; &#50500;&#45768;&#45796;. 
            </p>
            <p>&#54616;&#45208;&#51032; &#51089;&#50629; &#45800;&#50948;&#51032; &#50689;&#50669;&#51008; &#47924;&#50631;&#51064;&#44032;? &#54616;&#45208;&#51032; Hibernate <code class="literal">Session</code>&#51008; &#47751;&#47751; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#46308;&#50640; &#44152;&#52832; &#49688; &#51080;&#45716;&#44032; &#46608;&#45716; &#51060;&#44163;&#51008; &#50689;&#50669;&#46308;&#51032; one-to-one &#44288;&#44228;&#51064;&#44032;? &#45817;&#49888;&#51008; &#50616;&#51228; <code class="literal">Session</code>&#51012; &#50676;&#44256; &#45803;&#45716;&#44032; &#44536;&#47532;&#44256; &#45817;&#49888;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228;&#46308;&#51012; &#50612;&#46523;&#44172; &#54620;&#51221;&#54616;&#45716;&#44032;? 
            </p>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-uow"></a>11.1.1. &#51089;&#50629; &#45800;&#50948;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#52395;&#48264;&#51704;&#47196;, <span class="emphasis"><em>session-per-operation</em></span> anti-&#54056;&#53556;&#51012; &#49324;&#50857;&#54616;&#51648; &#47568;&#46972;. &#51593;, &#45800;&#51068; &#50416;&#47112;&#46300; &#45236;&#50640;&#49436; &#47784;&#46304; &#44036;&#45800;&#54620; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#54840;&#52636;&#50640; &#45824;&#54644; <code class="literal">Session</code>&#51012; &#50676;&#44256; &#45803;&#51648; &#47568;&#46972;! &#47932;&#47200; &#44057;&#51008; &#44163;&#51060; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#46308;&#50640; &#45824;&#54644;&#49436;&#46020; &#52280;&#51060;&#45796;. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#45236;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#54840;&#52636;&#46308;&#51008; &#44228;&#54925;&#46108; &#49692;&#49436;&#47484;&#49324;&#50857;&#54616;&#50668; &#54665;&#54644;&#51648;&#47728;, &#44536;&#44163;&#46308;&#51008; &#50896;&#51088; &#51089;&#50629; &#45800;&#50948; &#49549;&#51004;&#47196; &#44536;&#47353;&#51648;&#50892;&#51652;&#45796;. (&#51060;&#44163;&#51008; &#46608;&#54620; &#47784;&#46304;
                  &#54616;&#45208;&#51032; SQL &#47928;&#51109; &#46244;&#51032; auto-commit(&#51088;&#46041;-&#52964;&#48139;)&#51060; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#45236;&#50640;&#49436; &#47924;&#50857;&#51648;&#47932;&#51076;&#51012; &#51032;&#48120;&#54616;&#44256;, &#51060; &#47784;&#46300;&#44032; SQL &#53080;&#49556; &#51089;&#50629;&#51012; &#46037;&#46020;&#47197; &#44256;&#50504;&#46104;&#50632;&#51020;&#51012; &#45432;&#53944;&#54616;&#46972;. Hibernate&#45716; &#51032;&#48120;&#54616;&#44256;, &#51060; &#47784;&#46300;&#45716; Hibernate&#45716;
                  &#51593;&#49884; &#51088;&#46041;-&#52964;&#48139; &#47784;&#46300;&#47484; &#49324;&#50857; &#48520;&#44032;&#45733;&#54616;&#44172; &#54616;&#44144;&#45208;, &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#44032; &#44536;&#47111;&#44172; &#54665;&#54616;&#44256;, &#51593;&#49884; &#51088;&#46041;-&#52964;&#48139;&#49884;&#53412;&#45716; &#44163;&#51012; &#49324;&#50857;&#48520;&#44032;&#45733;&#54616;&#44172; &#54616;&#44144;&#45208; ,&#44536;&#47111;&#44172; &#54665;&#54616;&#45716; &#44163;&#51012; &#44592;&#45824;&#54620;&#45796;.) &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#46308;&#51008; &#44208;&#53076; &#50741;&#49496;&#51060; &#50500;&#45768;&#47728;, &#54616;&#45208;&#51032;
                  &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50752;&#51032; &#47784;&#46304; &#53685;&#49888;&#51008; &#45817;&#49888;&#51060; &#45936;&#51060;&#53552;&#47484; &#51069;&#46304; &#50416;&#45800;&#44036;&#50640; &#49345;&#44288;&#50630;&#51060; &#54616;&#45208;&#51032; &#53944;&#47004;&#51117;&#49496; &#45236;&#50640;&#49436; &#48156;&#49373;&#54644;&#50556; &#54620;&#45796;. &#49444;&#47749;&#54616;&#50688;&#46319;&#51060;, &#45936;&#51060;&#53552; &#51069;&#44592;&#47484; &#50948;&#54620; auto-commit &#53945;&#51669;&#51012; &#54588;&#54644;&#50556; &#54624; &#44163;&#51060;&#47728;, &#47566;&#51008; &#51089;&#51008; &#53944;&#47004;&#51117;&#49496;&#46308;&#51008; &#54616;&#45208;&#51032;
                  &#47749;&#47308;&#54616;&#44172; &#51221;&#51032;&#46108; &#51089;&#50629; &#45800;&#50948;&#48372;&#45796; &#45908; &#51339;&#44172; &#49688;&#54665;&#46112; &#44163; &#44057;&#51648; &#50506;&#45796;. &#54980;&#51088;&#44032; &#46608;&#54620; &#55016;&#50476; &#45908; &#50976;&#51648;&#44032;&#45733;&#54616;&#44256; &#54869;&#51109;&#51201;&#51060;&#45796;. 
               </p>
               <p>The most common pattern in a multi-user client/server application is <span class="emphasis"><em>session-per-request</em></span>. In this model, a request from the client is sent to the server (where the Hibernate persistence layer runs), a new Hibernate
                  <code class="literal">Session</code> is opened, and all database operations are executed in this unit of work. Once the work has been completed (and the response
                  for the client has been prepared), the session is flushed and closed. You would also use a single database transaction to
                  serve the clients request, starting and committing it when you open and close the <code class="literal">Session</code>. The relationship between the two is one-to-one and this model is a perfect fit for many applications. 
               </p>
               <p>The challenge lies in the implementation. Hibernate provides built-in management of the "current session" to simplify this
                  pattern. All you have to do is start a transaction when a server request has to be processed, and end the transaction before
                  the response is sent to the client. You can do this in any way you like, common solutions are <code class="literal">ServletFilter</code>, AOP interceptor with a pointcut on the service methods, or a proxy/interception container. An EJB container is a standardized
                  way to implement cross-cutting aspects such as transaction demarcation on EJB session beans, declaratively with CMT. If you
                  decide to use programmatic transaction demarcation, prefer the Hibernate <code class="literal">Transaction</code> API shown later in this chapter, for ease of use and code portability. 
               </p>
               <p>&#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53076;&#46300;&#45716; &#50612;&#46356;&#49436;&#46304; &#54596;&#50836;&#54624; &#46412; &#51333;&#51333; <code class="literal">sessionFactory.getCurrentSession()</code>&#51012; &#44036;&#45800;&#55176; &#54840;&#52636;&#54632;&#51004;&#47196;&#50024; &#50836;&#52397;&#51012; &#52376;&#47532;&#54624; "&#54788;&#51116; &#49464;&#49496;"&#50640; &#51217;&#44540;&#54624; &#49688; &#51080;&#45796;. &#45817;&#49888;&#51008; &#54788;&#51116; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51004;&#47196; &#50689;&#50669;&#54868;&#46108; &#54616;&#45208;&#51032; <code class="literal">Session</code>&#51012; &#54637;&#49345; &#50619;&#44172; &#46112; &#44163;&#51060;&#45796;. &#51060;&#44163;&#51008; resource-local &#54872;&#44221; &#46608;&#45716; JTA &#54872;&#44221;&#50640; &#45824;&#54644; &#44396;&#49457;&#46104;&#50612;&#50556; &#54616;&#47728;, <a href="architecture-current-session.html" title="2.5. &#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;">2.5&#51208;. &#8220;&#52968;&#53581;&#49828;&#53944; &#49345;&#51032; &#49464;&#49496;&#46308;&#8221;</a>&#51012; &#48372;&#46972;. 
               </p>
               <p>&#46412;&#46412;&#47196; "&#48624;&#44032; &#47116;&#45908;&#47553;&#46112; &#46412;&#44620;&#51648;" &#54616;&#45208;&#51032; <code class="literal">Session</code> &#44284; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51032; &#50689;&#50669;&#51012; &#54869;&#51109;&#49884;&#53412;&#45716; &#44163;&#51060; &#54200;&#47532;&#54616;&#45796;. &#51060;&#44163;&#51008; &#50836;&#52397;&#51060; &#52376;&#47532;&#46108; &#54980;&#50640; &#54616;&#45208;&#51032; &#48324;&#46020;&#51032; &#47116;&#45908;&#47553; &#45800;&#44228;&#47484; &#54876;&#50857;&#54616;&#45716; &#49436;&#48660;&#47551; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;&#50640;&#49436; &#53945;&#55176; &#50976;&#50857;&#54616;&#45796;. &#48624; &#47116;&#45908;&#47553;&#51060; &#50756;&#47308;&#46112; &#46412;&#44620;&#51648; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51012;
                  &#54869;&#51109;&#54616;&#45716; &#44163;&#51008; &#45817;&#49888;&#51060; &#45817;&#49888; &#51088;&#49888;&#51032; &#51064;&#53552;&#49481;&#53552;&#47484; &#44396;&#54788;&#54616;&#45716; &#44221;&#50864;&#50640; &#54665;&#54616;&#44592;&#44032; &#49789;&#45796;. &#54616;&#51648;&#47564; &#47564;&#51068; &#45817;&#49888;&#51060; &#52968;&#53580;&#51060;&#45320;&#50640; &#51032;&#54644; &#44288;&#47532;&#46104;&#45716; &#53944;&#47004;&#51117;&#49496;&#46308;&#51012; &#44032;&#51652; EJB&#46308;&#50640; &#51032;&#51316;&#54624; &#44221;&#50864;&#50640;, &#54616;&#45208;&#51032; EJB &#47700;&#49548;&#46300;&#44032; &#48152;&#54872;&#46112; &#46412; &#51076;&#51032;&#51032; &#48624; &#47116;&#45908;&#47553;&#51060;
                  &#49884;&#51089;&#46112; &#49688; &#51080;&#44592; &#51204;&#50640; &#54616;&#45208;&#51032; &#53944;&#47004;&#51117;&#49496;&#51060; &#50756;&#47308;&#46104;&#44592; &#46412;&#47928;&#50640;, &#54665;&#54616;&#45716; &#44163;&#51060; &#49789;&#51648; &#50506;&#45796;. &#51060; <span class="emphasis"><em>Open Session in View</em></span> &#54056;&#53556;&#51012; &#46168;&#47084;&#49916; &#54017;&#46308;&#44284; &#50696;&#51228;&#46308;&#51008; Hibernate &#50937; &#49324;&#51060;&#53944;&#50752; &#54252;&#47100;&#51012; &#48372;&#46972;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-apptx"></a>11.1.2. &#51109;&#44592;&#44036;&#51032; &#45824;&#54868;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>session-per-request &#54056;&#53556;&#51008; &#45817;&#49888;&#51060; &#51089;&#50629; &#45800;&#50948;&#46308;&#51012; &#49444;&#44228;&#54616;&#45716;&#45936; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#50976;&#51068;&#54620; &#50976;&#50857;&#54620; &#44060;&#45392;&#51060; &#50500;&#45768;&#45796;. &#47566;&#51008; &#48708;&#51648;&#45768;&#49828; &#54532;&#47196;&#49464;&#49828;&#46308;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51217;&#44540;&#46308;&#51012; &#51473;&#51116;&#54616;&#45716; &#49324;&#50857;&#51088; &#49324;&#51060;&#51032; &#51204;&#52404; &#51068;&#47144;&#51032; &#49345;&#54840;&#51089;&#50857;&#46308;&#51012;
                  &#54596;&#50836;&#47196; &#54620;&#45796;. &#50937;&#44284; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#49324;&#50857;&#51088; &#49345;&#54840;&#51089;&#50857;&#50640; &#44152;&#52824;&#45716; &#44163;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#50640; &#54728;&#50857;&#46104;&#51648; &#50506;&#45716;&#45796;. &#45796;&#51020; &#50696;&#51228;&#47484; &#44160;&#53664;&#54616;&#51088;: 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p>&#45824;&#54868;&#49345;&#51088;&#51032; &#52395; &#48264;&#51704; &#54868;&#47732;&#51060; &#50676;&#47532;&#44256;, &#49324;&#50857;&#51088;&#50640;&#44172; &#48372;&#50668;&#51652; &#45936;&#51060;&#53552;&#45716; &#53945;&#51221; <code class="literal">Session</code>&#44284; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#49549;&#50640; &#47196;&#46300;&#46104;&#50632;&#45796;. &#49324;&#50857;&#51088;&#44032; &#44061;&#52404;&#46308;&#51012; &#48320;&#44221;&#49884;&#53412;&#45716; &#44163;&#51060; &#51088;&#50976;&#47213;&#45796;. 
                        </p>
                     </li>
                     <li>
                        <p>&#49324;&#50857;&#51088;&#45716; 5&#48516; &#54980;&#50640; "&#51200;&#51109;"&#51012; &#53364;&#47533;&#54616;&#44256; &#44536;&#51032; &#48320;&#44221;&#46308;&#51060; &#50689;&#49549;&#54868; &#46104;&#44592;&#47484; &#44592;&#45824;&#54620;&#45796;; &#44536;&#45716; &#46608;&#54620; &#44536;&#44032; &#51060; &#51221;&#48372;&#47484; &#54200;&#51665;&#54616;&#45716; &#50976;&#51068;&#54620; &#44060;&#51064;&#51060;&#44256; &#48320;&#44221; &#52649;&#46028;&#51060; &#48156;&#49373;&#54616;&#51648; &#50506;&#44592;&#47484; &#44592;&#45824;&#54620;&#45796;. </p>
                     </li>
                  </ul>
               </div>
               <p>&#50864;&#47532;&#45716; &#49324;&#50857;&#51088;&#51032; &#44288;&#51216;&#50640;&#49436;, &#51060;&#44163;&#51012; &#51089;&#50629; &#45800;&#50948;, &#51109;&#44592;&#44036; &#49892;&#54665;&#46104;&#45716; <span class="emphasis"><em>&#45824;&#54868;</em></span> (&#46608;&#45716; <span class="emphasis"><em>&#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#53944;&#47004;&#51117;&#49496;</em></span>)&#51060;&#46972;&#44256; &#47749;&#47749;&#54620;&#45796;. &#45817;&#49888;&#51060; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#51060;&#44163;&#51012; &#50612;&#46523;&#44172; &#44396;&#54788;&#54624; &#49688; &#51080;&#45716; &#47566;&#51008; &#48169;&#48277;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;. 
               </p>
               <p>&#52395; &#48264;&#51704; naive &#44396;&#54788;&#51008; &#46041;&#49884;&#49457; &#48320;&#44221;&#51012; &#48169;&#51648;&#54616;&#44256;, &#44201;&#47532;&#50752; atomicity(&#50896;&#51088; &#45800;&#50948;&#49457;)&#51012; &#48372;&#51109;&#54616;&#44592; &#50948;&#54644; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#51032;&#54644; &#49548;&#50976;&#46108; &#51104;&#44552;&#51004;&#47196; &#49324;&#50857;&#51088;&#44032; &#49373;&#44033;&#54616;&#45716;&#46041;&#50504; <code class="literal">Session</code>&#44284; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51012; &#50976;&#51648;&#54624; &#49688;&#46020; &#51080;&#45796;. &#51060;&#44163;&#51008; &#47932;&#47200; anti-&#54056;&#53556;&#51060;&#45796;. &#50780;&#45264;&#54616;&#47732; &#51104;&#44552; &#45796;&#53820;&#51008; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#46041;&#49884; &#49324;&#50857;&#51088;&#46308;&#51032; &#44032;&#50857; &#49707;&#51088;&#47484; &#45458;&#51060;&#45716; &#44163;&#51012; &#54728;&#50857;&#54616;&#51648; &#50506;&#51012; &#44163;&#51060;&#44592; &#46412;&#47928;&#51060;&#45796;. 
               </p>
               <p>Clearly, we have to use several database transactions to implement the conversation. In this case, maintaining isolation of
                  business processes becomes the partial responsibility of the application tier. A single conversation usually spans several
                  database transactions. It will be atomic if only one of these database transactions (the last one) stores the updated data,
                  all others simply read data (e.g. in a wizard-style dialog spanning several request/response cycles). This is easier to implement
                  than it might sound, especially if you use Hibernate's features: 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p><span class="emphasis"><em>Automatic Versioning</em></span> - Hibernate can do automatic optimistic concurrency control for you, it can automatically detect if a concurrent modification
                           occurred during user think time. Usually we only check at the end of the conversation. 
                        </p>
                     </li>
                     <li>
                        <p><span class="emphasis"><em>Detached &#44061;&#52404;&#46308;</em></span> - &#47564;&#51068; &#45817;&#49888;&#51060; &#51060;&#48120; &#45436;&#51032;&#46108; <span class="emphasis"><em>session-per-request</em></span> &#54056;&#53556;&#51012; &#49324;&#50857;&#54616;&#44256;&#51088; &#44208;&#51221;&#54616;&#45716; &#44221;&#50864;, &#47784;&#46304; &#47196;&#46300;&#46108; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#49324;&#50857;&#51088;&#44032; &#49373;&#44033;&#54616;&#45716; &#49884;&#44036; &#46041;&#50504; detached &#49345;&#53468;&#50640; &#51080;&#51012; &#44163;&#51060;&#45796;. Hibernate&#45716; &#44536; &#44061;&#52404;&#46308;&#51012; &#51116;&#52392;&#48512;&#49884;&#53412;&#44256; &#48320;&#44221;&#46308;&#51012; &#50689;&#49549;&#54868; &#49884;&#53412;&#45716; &#44163;&#51012; &#54728;&#50857;&#54644;&#51452;&#47728;, &#44536; &#54056;&#53556;&#51008;
                           <span class="emphasis"><em>session-per-request-with-detached-objects(detached-&#44061;&#52404;&#46308;&#51012; &#44032;&#51652; &#50836;&#52397; &#45817; &#49464;&#49496;)</em></span>&#51004;&#47196; &#47749;&#47749;&#46108;&#45796;. &#51088;&#46041;&#51201;&#51064; &#48260;&#51204;&#54868;&#45716; &#46041;&#49884;&#49457; &#48320;&#44221;&#46308;&#51012; &#44201;&#47532;&#49884;&#53412;&#45716;&#45936; &#49324;&#50857;&#46108;&#45796;. 
                        </p>
                     </li>
                     <li>
                        <p><span class="emphasis"><em>Extended (or Long) Session</em></span> - The Hibernate <code class="literal">Session</code> may be disconnected from the underlying JDBC connection after the database transaction has been committed, and reconnected
                           when a new client request occurs. This pattern is known as <span class="emphasis"><em>session-per-conversation</em></span> and makes even reattachment unnecessary. Automatic versioning is used to isolate concurrent modifications and the <code class="literal">Session</code> is usually not allowed to be flushed automatically, but explicitly. 
                        </p>
                     </li>
                  </ul>
               </div>
               <p><span class="emphasis"><em>session-per-request-with-detached-objects</em></span>&#44284; <span class="emphasis"><em>session-per-conversation</em></span> &#50577;&#51088;&#45716; &#51109;&#51216;&#46308;&#44284; &#45800;&#51216;&#46308;&#51012; &#44054;&#45716;&#45936;, &#50864;&#47532;&#45716; &#51060; &#51109;&#51032; &#46263; &#48512;&#48516;&#50640;&#49436; optimistic &#46041;&#49884;&#49457; &#51228;&#50612; &#45800;&#46973;&#50640;&#49436; &#44536;&#44163;&#46308;&#51012; &#45436;&#51032;&#54620;&#45796;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-identity"></a>11.1.3. &#44061;&#52404; identity &#44256;&#47140;&#54616;&#44592;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#46160; &#44060;&#51032; &#45796;&#47480; <code class="literal">Session</code>&#46308; &#45236;&#50640; &#51080;&#45716; &#46041;&#51068;&#54620; &#50689;&#49549; &#49345;&#53468;&#50640; &#46041;&#49884;&#50640; &#51217;&#44540;&#54624; &#49688;&#46020; &#51080;&#45796;. &#54616;&#51648;&#47564; &#50689;&#49549; &#53364;&#47000;&#49828;&#51032; &#51064;&#49828;&#53556;&#49828;&#45716; &#46160; &#44060;&#51032; <code class="literal">Session</code> &#51064;&#49828;&#53556;&#49828;&#46308; &#49324;&#51060;&#50640; &#44208;&#53076; &#44277;&#50976;&#46104;&#51648; &#50506;&#45716;&#45796;. &#44536;&#47084;&#48064;&#47196; identity&#50640; &#45824;&#54620; &#46160; &#44060;&#51032; &#45796;&#47480; &#44060;&#45392;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;: 
               </p>
               <div class="variablelist">
                  <dl>
                     <dt><span class="term">&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; Identity</span></dt>
                     <dd>
                        <p>
                                                       <code class="literal">foo.getId().equals( bar.getId() )</code>
                                                   
                        </p>
                     </dd>
                     <dt><span class="term">JVM Identity</span></dt>
                     <dd>
                        <p>
                                                       <code class="literal">foo==bar</code>
                                                   
                        </p>
                     </dd>
                  </dl>
               </div>
               <p>Then for objects attached to a <span class="emphasis"><em>particular</em></span> <code class="literal">Session</code> (i.e. in the scope of a <code class="literal">Session</code>) the two notions are equivalent, and JVM identity for database identity is guaranteed by Hibernate. However, while the application
                  might concurrently access the "same" (persistent identity) business object in two different sessions, the two instances will
                  actually be "different" (JVM identity). Conflicts are resolved using (automatic versioning) at flush/commit time, using an
                  optimistic approach. 
               </p>
               <p>&#51060; &#51217;&#44540;&#48277;&#51008; Hibernate&#50752; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#44032; &#46041;&#49884;&#49457;&#50640; &#45824;&#54644; &#44145;&#51221;&#54616;&#51648; &#50506;&#46020;&#47197; &#54644;&#51456;&#45796;; &#44536;&#44163;&#51008; &#46608;&#54620; &#52572;&#49345;&#51032; scalability&#47484; &#51228;&#44277;&#54620;&#45796;. &#50780;&#45264;&#54616;&#47732; &#45800;&#51068; &#50416;&#47112;&#46300;-&#51089;&#50629; &#45800;&#50948; &#45236;&#50640;&#49436; identity &#48372;&#51109;&#51008; &#45800;&#51648; &#48708;&#50857;&#51060; &#46300;&#45716;
                  &#51104;&#44552;&#51060;&#45208; &#45796;&#47480; &#46041;&#44592;&#54868; &#49688;&#45800;&#46308;&#51012; &#54596;&#50836;&#47196; &#54616;&#51648; &#50506;&#44592; &#46412;&#47928;&#51060;&#45796;. &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#44536;&#44163;&#51060; <code class="literal">Session</code> &#45817; &#45800;&#51068; &#50416;&#47112;&#46300;&#47484; &#44053;&#51228;&#54616;&#45716; &#54620;, &#50612;&#46500; &#48708;&#51648;&#45768;&#49828; &#44061;&#52404;&#50640; &#45824;&#54644; &#44208;&#53076; &#46041;&#44592;&#54868; &#49884;&#53420; &#54596;&#50836;&#44032; &#50630;&#45796;. &#54616;&#45208;&#51032; <code class="literal">Session</code> &#45236;&#50640;&#49436; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#44061;&#52404;&#46308;&#51012; &#48708;&#44368;&#54616;&#45716;&#45936; <code class="literal">==</code>&#47484; &#50504;&#51204;&#54616;&#44172; &#49324;&#50857;&#54624; &#49688;&#44032; &#51080;&#45796;. 
               </p>
               <p>&#54616;&#51648;&#47564;, &#54616;&#45208;&#51032; <code class="literal">Session</code> &#50808;&#48512;&#50640;&#49436; <code class="literal">==</code>&#47484; &#49324;&#50857;&#54616;&#45716; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#50696;&#44592;&#52824; &#50506;&#51008; &#44208;&#44284;&#46308;&#51012; &#48372;&#44172; &#46112; &#49688;&#46020; &#51080;&#45796;. &#51060;&#44163;&#51008; &#50612;&#46500; &#50696;&#44592;&#52824; &#50506;&#51008; &#51109;&#49548;&#46308;&#50640;&#49436;, &#50696;&#47484; &#46308;&#50612; &#45817;&#49888;&#51060; &#46160; &#44060;&#51032; detached &#51064;&#49828;&#53556;&#49828;&#46308;&#51012; &#46041;&#51068;&#54620; <code class="literal">Set</code> &#45236;&#50640; &#51665;&#50612;&#45347;&#51012; &#44221;&#50864;&#50640; &#48156;&#49373;&#54624; &#49688;&#46020; &#51080;&#45796;. &#46168; &#45796; &#46041;&#51068;&#54620; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; identity&#47484; &#44032;&#51656; &#49688; &#51080;&#51648;&#47564; (&#50696;&#47484; &#46308;&#50612; &#44536;&#44163;&#46308;&#51008; &#46041;&#51068;&#54620; &#54665;&#51012; &#54364;&#54788;&#54620;&#45796;), JVM identity&#45716; &#51221;&#51032; &#49345; detached &#49345;&#53468;&#50640; &#51080;&#45716; &#51064;&#49828;&#53556;&#49828;&#46308;&#51012;
                  &#48372;&#51109;&#54616;&#51648; &#50506;&#45716;&#45796;. &#44060;&#48156;&#51088;&#45716; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#45236;&#50640; <code class="literal">equals()</code> &#47700;&#49548;&#46300;&#50752; <code class="literal">hashCode()</code> &#47700;&#49548;&#46300;&#47484; &#50724;&#48260;&#46972;&#51060;&#46300; &#49884;&#53020;&#50556; &#54616;&#44256; &#44061;&#52404; equality&#50640; &#45824;&#54620; &#44536; &#51088;&#49888;&#51032; &#44060;&#45392;&#51012; &#44396;&#54788;&#54644;&#50556; &#54620;&#45796;. &#54616;&#45208;&#51032; &#44221;&#44256;&#44032; &#51316;&#51116;&#54620;&#45796;: equality&#47484; &#44396;&#54788;&#54616;&#45716;&#45936; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; identifier&#47484; &#44208;&#53076; &#49324;&#50857;&#54616;&#51648; &#47568;&#44256;, &#54616;&#45208;&#51032; &#48708;&#51648;&#45768;&#49828;
                  &#53412;, &#50976;&#51068;&#54620;, &#45824;&#44060; &#48520;&#48320;&#51064; &#49549;&#49457;&#46308;&#51032; &#51312;&#54633;&#51012; &#49324;&#50857;&#54616;&#46972;. &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49885;&#48324;&#51088;&#45716; &#47564;&#51068; transient &#44061;&#52404;&#44032; &#50689;&#49549;&#54868;&#46104;&#45716; &#44221;&#50864;&#50640; &#48320;&#44221;&#46112; &#44163;&#51060;&#45796;. &#47564;&#51068; transient &#51064;&#49828;&#53556;&#49828;&#44032;(&#45824;&#44060; detached &#51064;&#49828;&#53556;&#49828;&#46308;&#44284; &#54632;&#44760;) <code class="literal">Set</code> &#45236;&#50640; &#48372;&#44288;&#46104;&#45716; &#44221;&#50864;&#50640;, hashcode &#48320;&#44221;&#51008; <code class="literal">Set</code>&#51032; &#44228;&#50557;&#51012; &#54028;&#44592;&#49884;&#53416;&#45796;. &#48708;&#51648;&#45768;&#49828; &#53412;&#46308;&#50640; &#45824;&#54620; &#49549;&#49457;&#46308;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412;&#46308; &#47564;&#53372; &#50504;&#51221;&#51201;&#51060;&#50612;&#49436;&#45716; &#50504;&#46104;&#47728;, &#45817;&#49888;&#51008; &#50724;&#51649; &#44061;&#52404;&#46308;&#51060; &#46041;&#51068;&#54620; <code class="literal">Set</code> &#45236;&#50640; &#51080;&#45716; &#54620;&#50640;&#49436; &#50504;&#51221;&#49457;&#51012; &#48372;&#51109;&#54644;&#50556;&#47564; &#54620;&#45796;. &#51060; &#51137;&#51216;&#50640; &#44288;&#54620; &#45436;&#51032;&#50640; &#45824;&#54620; &#45908; &#47566;&#51008; &#44163;&#51012; Hibernate &#50937; &#49324;&#51060;&#53944;&#47484; &#48372;&#46972;. &#46608;&#54620; &#51060;&#44163;&#51060; Hibernate &#51137;&#51216;&#51060; &#50500;&#45768;&#47728;, &#45800;&#51648; &#51088;&#48148; &#44061;&#52404; identity&#50752; equality&#44032;
                  &#44396;&#54788;&#46104;&#50612;&#50556; &#54616;&#45716; &#48169;&#48277;&#51076;&#51012; &#45432;&#53944;&#54616;&#46972;. 
               </p>
            </div>
            <div class="sect2" lang="ko-KR">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="transactions-basics-issues"></a>11.1.4. &#44277;&#53685;&#46108; &#51137;&#51216;&#46308;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#50504;&#54000;-&#54056;&#53556;&#46308; <span class="emphasis"><em>session-per-user-session</em></span> &#46608;&#45716; <span class="emphasis"><em>session-per-application</em></span>&#51012; &#44208;&#53076; &#49324;&#50857;&#54616;&#51648; &#47568;&#46972;(&#47932;&#47200; &#51060; &#44508;&#52825;&#50640; &#45824;&#54620; &#46300;&#47928; &#50696;&#50808;&#49345;&#54889;&#46308;&#51060; &#51316;&#51116;&#54620;&#45796;). &#45796;&#51020; &#51137;&#51216;&#46308; &#51473; &#47751;&#47751;&#51060; &#46608;&#54620; &#44428;&#51109;&#46104;&#45716; &#54056;&#53556;&#46308;&#47196; &#45208;&#53440;&#45216; &#49688; &#51080;&#51020;&#51012; &#45432;&#53944;&#54616;&#44256;, &#45817;&#49888;&#51060; &#49444;&#44228; &#44208;&#51221;&#51012; &#45236;&#47532;&#44592; &#51204;&#50640; &#45236;&#54252;&#46108; &#51032;&#48120;&#46308;&#51012; &#54869;&#49892;&#55176; &#51060;&#54644;&#54616;&#46972;: 
               </p>
               <div class="itemizedlist">
                  <ul type="disc">
                     <li>
                        <p><code class="literal">Session</code>&#51008; &#50416;&#47112;&#46300;-&#50504;&#51204;&#54616;&#51648; &#50506;&#45796;. HTTP &#50836;&#52397;&#46308;, &#49464;&#49496; &#48712;&#51592;, &#46608;&#45716; Swing worker&#46308;&#52376;&#47100; &#46041;&#49884;&#50640; &#51089;&#50629;&#54616;&#45716; &#44163;&#51004;&#47196; &#44032;&#51221;&#46104;&#45716; &#44163;&#46308;&#51008; &#54616;&#45208;&#51032; <code class="literal">Session</code> &#51064;&#49828;&#53556;&#49828;&#44032; &#44277;&#50976;&#46112; &#44221;&#50864;&#50640; &#44221;&#51137; &#51312;&#44148;&#46308;&#51012; &#48156;&#49373;&#49884;&#53420; &#44163;&#51060;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#45817;&#49888;&#51032; <code class="literal">HttpSession</code> &#45236;&#50640; Hibernate <code class="literal">Session</code>&#51012; &#50976;&#51648;&#49884;&#53412;&#45716; &#44221;&#50864;(&#45208;&#51473;&#50640; &#45436;&#51032;&#46120;), &#45817;&#49888;&#51008; &#45817;&#49888;&#51032; Http &#49464;&#49496;&#50640; &#45824;&#54620; &#51217;&#44540;&#51012; &#46041;&#44592;&#54868; &#49884;&#53412;&#45716; &#44163;&#51012; &#44256;&#47140;&#54644;&#50556; &#54620;&#45796;. &#44536; &#48150;&#51032; &#44221;&#50864;, &#52649;&#48516;&#55176; &#48736;&#47476;&#44172; reload&#47484; &#53364;&#47533;&#54616;&#45716; &#49324;&#50857;&#51088;&#45716; &#46160; &#44060;&#51032; &#46041;&#49884;&#51201;&#51004;&#47196; &#49892;&#54665;&#46104;&#45716; &#50416;&#47112;&#46300;&#46308; &#45236;&#50640;&#49436;
                           &#46041;&#51068;&#54620; <code class="literal">Session</code>&#51012; &#49324;&#50857;&#54624; &#49688;&#46020; &#51080;&#45796;. 
                        </p>
                     </li>
                     <li>
                        <p>Hibernate&#50640; &#51032;&#54644; &#45912;&#51256;&#51652; &#50696;&#50808;&#49345;&#54889;&#51008; &#45817;&#49888;&#51060; &#45817;&#49888;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51012; &#47204;&#48177; &#49884;&#53412;&#44256; &#51593;&#49884; <code class="literal">Session</code>&#51012; &#45803;&#50500;&#50556; &#54632;&#51012; &#51032;&#48120;&#54620;&#45796;(&#45208;&#51473;&#50640; &#49345;&#49464;&#55176; &#45436;&#51032;&#46120;). &#47564;&#51068; &#45817;&#49888;&#51032; <code class="literal">Session</code>&#51060; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#48148;&#51064;&#46300; &#46104;&#50612; &#51080;&#45716; &#44221;&#50864;, &#45817;&#49888;&#51008; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#51473;&#51648;&#49884;&#53020;&#50556; &#54620;&#45796;. &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#47204;&#48177;&#51008; &#45817;&#49888;&#51032; &#48708;&#51648;&#45768;&#49828; &#44061;&#52404;&#46308;&#51012; &#44536;&#44163;&#46308;&#51060; &#53944;&#47004;&#51117;&#49496;&#51032; &#49884;&#51089; &#49884;&#50640; &#47672;&#47932;&#47104;&#45912; &#49345;&#53468;&#47196; &#46104;&#46028;&#47532;&#51648;&#45716; &#50506;&#45716;&#45796;. &#51060;&#44163;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;
                           &#49345;&#53468;&#50752; &#48708;&#51648;&#45768;&#49828; &#44061;&#52404;&#46308;&#51060; &#46041;&#44592;&#54868;&#47484; &#48279;&#50612;&#45224;&#51012; &#51032;&#48120;&#54620;&#45796;. &#45824;&#44060; &#51060;&#44163;&#51008; &#47928;&#51228;&#44032; &#50500;&#45768;&#45796;. &#50780;&#45264;&#54616;&#47732; &#50696;&#50808;&#49345;&#54889;&#46308;&#51008; &#54924;&#48373;&#44032;&#45733;&#54620; &#44163;&#51060; &#50500;&#45768;&#44256; &#45817;&#49888;&#51060; &#50612;&#46523;&#44172;&#46304; &#47204;&#48177; &#54980;&#50640; &#49884;&#51089;&#54644;&#50556; &#54616;&#44592; &#46412;&#47928;&#51060;&#45796;. 
                        </p>
                     </li>
                     <li>
                        <p><code class="literal">Session</code>&#51008; (Hibernate&#50640; &#51032;&#54644; dirty &#49345;&#53468;&#47196; &#44288;&#52272;&#46104;&#50632;&#44144;&#45208; &#52404;&#53356;&#46108;) &#50689;&#49549; &#49345;&#53468;&#50640; &#51080;&#45716; &#47784;&#46304; &#44061;&#52404;&#47484; &#52880;&#49884; &#49884;&#53416;&#45796;. &#51060;&#44163;&#51008; &#45817;&#49888;&#51060; &#50724;&#47004; &#49884;&#44036; &#46041;&#50504; <code class="literal">Session</code>&#51012; &#50676;&#50612;&#46164; &#52292;&#47196; &#50976;&#51648;&#54616;&#44144;&#45208; &#45800;&#49692;&#54616;&#44172; &#45320;&#47924; &#47566;&#51008; &#45936;&#51060;&#53552;&#47484; &#47196;&#46300;&#49884;&#53420; &#44221;&#50864;&#50640;, &#45817;&#49888;&#51060; OutOfMemoryException&#51012; &#50619;&#44592; &#51204;&#44620;&#51648;, &#44536;&#44163;&#51060; &#45149;&#50630;&#51060; &#49457;&#51109;&#54620;&#45796;&#45716; &#51216;&#51012; &#51032;&#48120;&#54620;&#45796;. &#51060;&#44163;&#50640; &#45824;&#54620; &#54616;&#45208;&#51032; &#54644;&#44208;&#52293;&#51008; <code class="literal">Session</code> &#52880;&#49884;&#47484; &#44288;&#47532;&#54616;&#44592; &#50948;&#54644; <code class="literal">clear()</code>&#50752; <code class="literal">evict()</code>&#47484; &#54840;&#52636;&#54616;&#45716; &#44163;&#51060;&#51648;&#47564;, &#45817;&#49888;&#51060; &#45824;&#50857;&#47049; &#45936;&#51060;&#53552; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51012; &#54596;&#50836;&#47196; &#54616;&#45716; &#44221;&#50864;&#50640; &#45817;&#49888;&#51008; &#45824;&#44060; &#45236;&#51109; &#54532;&#47196;&#49884;&#51200;&#47484; &#44256;&#47140;&#54644;&#50556; &#54624; &#44163;&#51060;&#45796;. &#47751;&#47751; &#54644;&#44208;&#52293;&#46308;&#51060; <a href="batch.html" title="13&#51109;. Batch &igrave;&sup2;&#152;&euml;&brvbar;&not;">13&#51109;. <i xmlns:xlink="http://www.w3.org/1999/xlink">Batch &igrave;&sup2;&#152;&euml;&brvbar;&not;</i></a>&#50640; &#48372;&#50668;&#51256; &#51080;&#45796;. &#49324;&#50857;&#51088; &#49464;&#49496; &#46041;&#50504;&#50640; <code class="literal">Session</code>&#51012; &#50676;&#47140;&#51652; &#52292;&#47196; &#50976;&#51648;&#54616;&#45716; &#44163;&#51008; &#46608;&#54620; &#49892;&#54952;&#49457;&#51060; &#46504;&#50612;&#51652; &#45936;&#51060;&#53552;&#50640; &#45824;&#54620; &#45458;&#51008; &#54869;&#47456;&#51012; &#51032;&#48120;&#54620;&#45796;. 
                        </p>
                     </li>
                  </ul>
               </div>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="objectstate-metadata.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="transactions-demarcation.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">10.12. &#47700;&#53440;&#45936;&#51060;&#53552; &#49324;&#50857;&#54616;&#44592;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;11.2. &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#44221;&#44228; &#49444;&#51221;</td>
            </tr>
         </table>
      </div>
   </body>
</html>