<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>1.3. &#54028;&#53944; 2 - &#50672;&#44288;&#46308;&#51012; &#47588;&#54609;&#54616;&#44592;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="tutorial.html" title="1&#51109;. Hibernate &#44060;&#50836;">
      <link rel="prev" href="tutorial-firstapp.html" title="1.2. &#54028;&#53944; 1 - &#52395; &#48264;&#51704; Hibernate &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;">
      <link rel="next" href="tutorial-webapp.html" title="1.4. &#54028;&#53944; 3 - EventManager &#50937; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">1.3. &#54028;&#53944; 2 - &#50672;&#44288;&#46308;&#51012; &#47588;&#54609;&#54616;&#44592;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="tutorial-firstapp.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">1&#51109;. Hibernate &#44060;&#50836;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="tutorial-webapp.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="tutorial-associations"></a>1.3. &#54028;&#53944; 2 - &#50672;&#44288;&#46308;&#51012; &#47588;&#54609;&#54616;&#44592;
                  </h2>
               </div>
            </div>
         </div>
         <p>&#50864;&#47532;&#45716; &#54620; &#44060;&#51032; &#50689;&#49549; &#50644;&#54000;&#54000; &#53364;&#47000;&#49828;&#47484; &#54620; &#44060;&#51032; &#53580;&#51060;&#48660;&#47196; &#47588;&#54609;&#54664;&#45796;. &#51060;&#44163; &#50948;&#50640;&#49436; &#48716;&#46300;&#54616;&#44256; &#47751;&#47751; &#53364;&#47000;&#49828; &#50672;&#44288;&#46308;&#51012; &#52628;&#44032;&#49884;&#53412;&#51088;. &#47676;&#51200; &#50864;&#47532;&#45716; &#50864;&#47532;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640; &#49324;&#46988;&#46308;&#51012; &#52628;&#44032;&#54616;&#44256; &#44536;&#46308;&#51060; &#52280;&#50668;&#54616;&#45716; &#51060;&#48292;&#53944;&#46308;&#51032; &#47785;&#47197;&#51012; &#51200;&#51109;&#54624; &#44163;&#51060;&#45796;.
            
         </p>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-mappinguser"></a>1.3.1. Person &#53364;&#47000;&#49828; &#47588;&#54609;&#54616;&#44592;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#53364;&#47000;&#49828;&#51032; &#52395; &#48264;&#51704; &#51109;&#47732;&#51008; &#44036;&#45800;&#54616;&#45796;: </p><pre class="programlisting">package events;

public class Person {

    private Long id;
    private int age;
    private String firstname;
    private String lastname;

    public Person() {}

    // Accessor methods for all properties, private setter for 'id'

}</pre><p><code class="literal">Person.hbm.xml</code>&#47196; &#47749;&#47749;&#46104;&#45716; &#49352;&#47196;&#50868; &#47588;&#54609; &#54028;&#51068;&#51012; &#49373;&#49457;&#49884;&#53020;&#46972; (&#47592;&#50948;&#50640; DTD &#52280;&#51312;&#47484; &#51082;&#51648;&#47568;&#46972;): 
            </p><pre class="programlisting">&lt;hibernate-mapping&gt;

    &lt;class name="events.Person" table="PERSON"&gt;
        &lt;id name="id" column="PERSON_ID"&gt;
            &lt;generator class="native"/&gt;
        &lt;/id&gt;
        &lt;property name="age"/&gt;
        &lt;property name="firstname"/&gt;
        &lt;property name="lastname"/&gt;
    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>&#47560;&#51648;&#47561;&#51004;&#47196; &#49352;&#47196;&#50868; &#47588;&#54609;&#51012; Hibernate&#51032; &#44396;&#49457;&#50640; &#52628;&#44032;&#54616;&#46972;: </p><pre class="programlisting">&lt;mapping resource="events/Event.hbm.xml"/&gt;
&lt;mapping resource="events/Person.hbm.xml"/&gt;</pre><p>&#51060;&#51228; &#50864;&#47532;&#45716; &#51060;&#46308; &#46160; &#44060;&#51032; &#50644;&#54000;&#54000;&#46308; &#49324;&#51060;&#50640; &#54620; &#44060;&#51032; &#50672;&#44288;&#51012; &#49373;&#49457;&#49884;&#53420; &#44163;&#51060;&#45796;. &#47749;&#48177;&#54616;&#44172;, &#44060;&#51064;&#46308;&#51008; &#51060;&#48292;&#53944;&#46308;&#50640; &#52280;&#50668;&#54624; &#49688; &#51080;&#44256;, &#51060;&#48292;&#53944;&#46308;&#51008; &#52280;&#50668;&#51088;&#46308;&#51012; &#44054;&#45716;&#45796;. &#50864;&#47532;&#44032; &#45796;&#47336;&#50612;&#50556; &#54616;&#45716; &#49444;&#44228; &#51656;&#47928;&#46308;&#51008; &#45796;&#51020;&#44284; &#44057;&#45796; : &#48169;&#54693;&#49457;(directionality),
               &#45796;&#51473;&#49457;(multiplicity), &#44536;&#47532;&#44256; &#53084;&#47113;&#49496; &#53945;&#51669;. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-unidirset"></a>1.3.2. &#45800;&#48169;&#54693; Set-&#44592;&#48152;&#51032; &#50672;&#44288;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#50864;&#47532;&#45716; <code class="literal">Person</code> &#53364;&#47000;&#49828;&#50640; &#51060;&#48292;&#53944;&#46308;&#51012; &#44032;&#51652; &#54620; &#44060;&#51032; &#53084;&#47113;&#49496;&#51012; &#52628;&#44032;&#54624; &#44163;&#51060;&#45796;. &#44536; &#48169;&#48277;&#51004;&#47196; &#50864;&#47532;&#45716; &#47749;&#49884;&#51201;&#51064; &#51656;&#51032;-<code class="literal">aPerson.getEvents()</code>&#47484; &#54840;&#52636;&#54632;&#51004;&#47196;&#50024;-&#47484; &#49892;&#54665;&#49884;&#53412;&#51648; &#50506;&#44256;&#49436; &#53945;&#51221; &#44060;&#51064;&#50640; &#45824;&#54620; &#51060;&#48292;&#53944;&#46308;&#51012; &#49789;&#44172; &#45348;&#48708;&#44172;&#51060;&#53944;&#54624; &#49688; &#51080;&#45796;. &#50864;&#47532;&#45716; &#54616;&#45208;&#51032; Java &#53084;&#47113;&#49496;, &#54616;&#45208;&#51032; <code class="literal">Set</code>&#47484; &#49324;&#50857;&#54620;&#45796;. &#50780;&#45264;&#54616;&#47732; &#44536; &#53084;&#47113;&#49496;&#51008; &#51473;&#48373; &#50836;&#49548;&#46308;&#51012; &#54252;&#54632;&#54616;&#44592; &#50506;&#51012; &#44163;&#51060;&#44256; &#44536; &#49692;&#49436;&#44032; &#50864;&#47532;&#50752; &#44288;&#47144;&#46104;&#50612; &#51080;&#51648; &#50506;&#44592; &#46412;&#47928;&#51060;&#45796;. 
            </p>
            <p>&#50864;&#47532;&#45716; &#54616;&#45208;&#51032; <code class="literal">Set</code>&#51004;&#47196; &#44396;&#54788;&#46108;, &#54616;&#45208;&#51032; &#45800;&#48169;&#54693;, &#45796;&#51473;&#44050; &#50672;&#44288;&#46308;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;. Java &#53364;&#47000;&#49828;&#46308; &#45236;&#50640; &#51060;&#47484; &#50948;&#54620; &#53076;&#46300;&#47484; &#51089;&#49457;&#54616;&#44256; &#44536;&#47088; &#45796;&#51020; &#44536;&#44163;&#51012; &#47588;&#54609;&#49884;&#53412;&#51088;: 
            </p><pre class="programlisting">public class Person {

    private Set events = new HashSet();

    public Set getEvents() {
        return events;
    }

    public void setEvents(Set events) {
        this.events = events;
    }
}</pre><p>&#50864;&#47532;&#44032; &#51060; &#50672;&#44288;&#51012; &#47588;&#54609;&#54616;&#44592; &#51204;&#50640;, &#45796;&#47480; &#52769;&#50640; &#45824;&#54644; &#49373;&#44033;&#54616;&#46972;. &#47749;&#48177;&#54616;&#44172; &#50864;&#47532;&#45716; &#51060;&#44163;&#51012; &#45800;&#51648; &#45800;&#48169;&#54693;&#51004;&#47196; &#50976;&#51648;&#49884;&#53420; &#49688; &#51080;&#45796;. &#46608;&#45716; &#50864;&#47532;&#44032; &#44536;&#44163;&#51012; &#50577;&#48169;&#54693;&#51004;&#47196; &#45348;&#48708;&#44172;&#51060;&#53944;&#54616;&#45716; &#44163;-&#50696;&#47484; &#46308;&#50612; <code class="literal">anEvent.getParticipants()</code>-&#51060; &#44032;&#45733;&#54616;&#46020;&#47197; &#50896;&#54624; &#44221;&#50864;&#50640;, <code class="literal">Event</code>&#52769; &#49345;&#50640; &#46608; &#45796;&#47480; &#53084;&#47113;&#49496;&#51012; &#49373;&#49457;&#49884;&#53420; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; &#45817;&#49888;&#50640;&#44172; &#45224;&#44200;&#51652; &#49444;&#44228; &#49440;&#53469;&#51060;&#51648;&#47564;, &#51060; &#45436;&#51032;&#50640;&#49436; &#47749;&#47308;&#54620; &#51216;&#51008; &#50672;&#44288;&#51032; &#45796;&#51473;&#49457;&#51060;&#45796;: &#50577; &#52769; &#49345;&#50640;&#49436; "&#45796;&#51473;" &#44050;&#51012; &#44054;&#45716; &#44221;&#50864;, &#50864;&#47532;&#45716; &#51060;&#44163;&#51012; <span class="emphasis"><em>many-to-many</em></span> &#50672;&#44288;&#51060;&#46972;&#44256; &#47749;&#47749;&#54620;&#45796;. &#44536;&#47084;&#48064;&#47196; &#50864;&#47532;&#45716; Hibernate&#51032; many-to-many &#47588;&#54609;&#51012; &#49324;&#50857;&#54620;&#45796;: 
            </p><pre class="programlisting">&lt;class name="events.Person" table="PERSON"&gt;
    &lt;id name="id" column="PERSON_ID"&gt;
        &lt;generator class="native"/&gt;
    &lt;/id&gt;
    &lt;property name="age"/&gt;
    &lt;property name="firstname"/&gt;
    &lt;property name="lastname"/&gt;

    &lt;set name="events" table="PERSON_EVENT"&gt;
        &lt;key column="PERSON_ID"/&gt;
        &lt;many-to-many column="EVENT_ID" class="events.Event"/&gt;
    &lt;/set&gt;

&lt;/class&gt;</pre><p>Hibernate&#45716; &#47784;&#46304; &#51333;&#47448;&#51032; &#53084;&#47113;&#49496; &#47588;&#54609;&#46308;, &#44032;&#51109; &#44277;&#53685;&#51201;&#51064; <code class="literal">&lt;set&gt;</code>&#51012; &#51648;&#50896;&#54620;&#45796;. many-to-many &#50672;&#44288; (&#46608;&#45716; <span class="emphasis"><em>n:m</em></span> &#50644;&#54000;&#54000; &#44288;&#44228;)&#51032; &#44221;&#50864;, &#54620; &#44060;&#51032; &#50672;&#44288; &#53580;&#51060;&#48660;&#51060; &#54596;&#50836;&#54616;&#45796;. &#51060; &#53580;&#51060;&#48660; &#45236;&#50640; &#51080;&#45716; &#44033;&#44033;&#51032; &#54665;&#51008; &#54620; &#47749;&#51032; &#44060;&#51064;&#44284; &#54620; &#44060;&#51032; &#51060;&#48292;&#53944; &#49324;&#51060;&#51032; &#47553;&#53356;&#47484; &#54364;&#54788;&#54620;&#45796;. &#53580;&#51060;&#48660; &#51060;&#47492;&#51008; <code class="literal">set</code> &#50836;&#49548;&#51032; <code class="literal">table</code> &#49549;&#49457;&#51004;&#47196; &#44396;&#49457;&#46108;&#45796;. &#50672;&#44288; &#45236;&#51032; &#49885;&#48324;&#51088; &#52972;&#47100; &#51060;&#47492;&#51008; &#44060;&#51064; &#52769;&#50640; &#45824;&#54644; <code class="literal">&lt;key&gt;</code> &#50836;&#49548;&#47196; &#51221;&#51032;&#46104;&#44256; &#51060;&#48292;&#53944; &#52769;&#50640; &#45824;&#54620; &#52972;&#47100; &#51060;&#47492;&#51008; <code class="literal">&lt;many-to-many&gt;</code>&#51032; <code class="literal">column</code> &#49549;&#49457;&#51004;&#47196; &#51221;&#51032;&#46108;&#45796;. &#45817;&#49888;&#51008; &#46608;&#54620; &#45817;&#49888;&#51032; &#53084;&#47113;&#49496; &#45236;&#50640; &#51080;&#45716; &#44061;&#52404;&#46308;&#51032; &#53364;&#47000;&#49828;(&#51221;&#54869;&#54616;&#44172; : &#52280;&#51312;&#46308;&#51012; &#44032;&#51652; &#53084;&#47113;&#49496;&#51032; &#45796;&#47480; &#52769; &#49345;&#50640; &#51080;&#45716; &#53364;&#47000;&#49828;)&#47484; Hibernate&#50640;&#44172; &#50508;&#47140;&#51452;&#50612;&#50556; &#54620;&#45796;. 
            </p>
            <p>&#46384;&#46972;&#49436; &#51060; &#47588;&#54609;&#51012; &#50948;&#54620; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49828;&#53412;&#47560;&#45716; &#45796;&#51020;&#44284; &#44057;&#45796;: </p><pre class="programlisting">
    _____________        __________________
   |             |      |                  |       _____________
   |   EVENTS    |      |   PERSON_EVENT   |      |             |
   |_____________|      |__________________|      |    PERSON   |
   |             |      |                  |      |_____________|
   | *EVENT_ID   | &lt;--&gt; | *EVENT_ID        |      |             |
   |  EVENT_DATE |      | *PERSON_ID       | &lt;--&gt; | *PERSON_ID  |
   |  TITLE      |      |__________________|      |  AGE        |
   |_____________|                                |  FIRSTNAME  |
                                                  |  LASTNAME   |
                                                  |_____________|
 </pre></div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-working"></a>1.3.3. &#50672;&#44288;&#46308;&#50640; &#51089;&#50629;&#54616;&#44592;
                     </h3>
                  </div>
               </div>
            </div>
            <p><code class="literal">EventManager</code> &#49549;&#50640; &#51080;&#45716; &#54620; &#44060;&#51032; &#49352;&#47196;&#50868; &#47700;&#49548;&#46300; &#45236;&#50640; &#47751;&#47751; &#49324;&#46988;&#46308;&#44284; &#51060;&#48292;&#53944;&#46308;&#51012; &#54632;&#44760; &#44032;&#51256;&#50724;&#51088;: 
            </p><pre class="programlisting">private void addPersonToEvent(Long personId, Long eventId) {

    Session session = HibernateUtil.getSessionFactory().getCurrentSession();
    session.beginTransaction();

    Person aPerson = (Person) session.load(Person.class, personId);
    Event anEvent = (Event) session.load(Event.class, eventId);

    aPerson.getEvents().add(anEvent);

    session.getTransaction().commit();
}</pre><p><code class="literal">Person</code>&#44284; <code class="literal">Event</code>&#47484; &#47196;&#46300;&#49884;&#53416; &#54980;&#50640;, &#51221;&#44508; &#53084;&#47113;&#49496; &#47700;&#49548;&#46300;&#46308;&#51012; &#49324;&#50857;&#54616;&#50668; &#53084;&#47113;&#49496;&#51012; &#44036;&#45800;&#54616;&#44172; &#48320;&#44221;&#54616;&#46972;. &#45817;&#49888;&#51060; &#50508; &#49688; &#51080;&#46319;&#51060;, <code class="literal">update()</code> &#46608;&#45716; <code class="literal">save()</code>&#50640; &#45824;&#54620; &#47749;&#49884;&#51201;&#51064; &#54840;&#52636;&#51060; &#51316;&#51116;&#54616;&#51648; &#50506;&#44256;, &#48320;&#44221;&#46104;&#50632;&#44256; &#51200;&#51109;&#54624; &#54596;&#50836;&#44032; &#51080;&#45716; &#53084;&#47113;&#49496;&#51012; Hibernate&#44032; &#51088;&#46041;&#51201;&#51004;&#47196; &#44160;&#52636;&#54644;&#45240;&#45796;. &#51060;&#44163;&#51008; <span class="emphasis"><em>&#51088;&#46041;&#51201;&#51064; dirty &#52404;&#53433;</em></span>&#51060;&#46972; &#48520;&#47140;&#51648;&#47728;, &#45817;&#49888;&#51008; &#46608;&#54620; &#45817;&#49888;&#51032; &#51076;&#51032;&#51032; &#44061;&#52404;&#46308;&#50640; &#45824;&#54620; name &#46608;&#45716; date &#54532;&#47196;&#54140;&#54000;&#47484; &#48320;&#44221;&#54632;&#51004;&#47196;&#50024; &#44536;&#44163;&#51012; &#49884;&#46020;&#54624; &#49688; &#51080;&#45796;. &#44536;&#44163;&#46308;&#51060; <span class="emphasis"><em>&#50689;&#49549;(persistent)</em></span> &#49345;&#53468;&#50640; &#51080;&#45716; &#46041;&#50504;, &#51593; &#53945;&#51221; Hibernate <code class="literal">Session</code>&#50640; &#48148;&#51064;&#46300;&#46104;&#50612; &#51080;&#45716; &#46041;&#50504;(&#50696;&#47484; &#46308;&#47732;. &#44536;&#44163;&#46308;&#51008; &#51089;&#50629; &#45800;&#50948; &#49549;&#50640; &#48169;&#44552; &#47196;&#46300;&#46104;&#50632;&#44144;&#45208; &#51200;&#51109;&#46104;&#50632;&#45796;), Hibernate&#45716; &#51076;&#51032;&#51032; &#48320;&#44221;&#46308;&#51012; &#47784;&#45768;&#53552;&#47553;&#54616;&#44256; &#50416;&#44592; &#51060;&#47732;&#51032; &#54805;&#53468;&#47196; SQL&#51012; &#49892;&#54665;&#49884;&#53416;&#45796;. &#47700;&#47784;&#47532; &#49345;&#53468;&#47484; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50752; &#46041;&#44592;&#54868;
               &#49884;&#53412;&#45716; &#44284;&#51221;&#51008; &#45824;&#44060; &#50724;&#51649; &#51089;&#50629; &#45800;&#50948;&#51032; &#45149;&#50640;&#49436;&#51060;&#44256;, <span class="emphasis"><em>flushing</em></span>&#51060;&#46972; &#47749;&#47749;&#46108;&#45796;. &#50864;&#47532;&#51032; &#53076;&#46300;&#50640;&#49436;, &#51089;&#50629; &#45800;&#50948;&#45716; <code class="literal">CurrentSessionContext</code> &#53364;&#47000;&#49828;&#50640; &#45824;&#54620; <code class="literal">thread</code> &#44396;&#49457; &#50741;&#49496;&#50640; &#51032;&#54644; &#51221;&#51032;&#46108; &#45824;&#47196; - &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496;&#51032; &#52964;&#48139;(&#46608;&#45716; &#47204;&#48177;)&#51004;&#47196; &#45149;&#51060;&#45212;&#45796;. 
            </p>
            <p>&#47932;&#47200; &#45817;&#49888;&#51008; &#45796;&#47480; &#51089;&#50629; &#45800;&#50948; &#49549;&#50640; &#44060;&#51064;&#44284; &#51060;&#48292;&#53944;&#47484; &#47196;&#46300;&#49884;&#53420; &#49688; &#46020; &#51080;&#45796;. &#46608;&#45716; &#45817;&#49888;&#51008; &#54616;&#45208;&#51032; &#44061;&#52404;&#44536; &#50689;&#49549; &#49345;&#53468;&#50640; &#51080;&#51648; &#50506;&#51012; &#46412; <code class="literal">Session</code>&#51032; &#50808;&#48512;&#50640;&#49436; &#44061;&#52404;&#47484; &#48320;&#44221;&#49884;&#53420; &#49688;&#46020; &#51080;&#45796;(&#47564;&#51068; &#44061;&#52404;&#44032; &#51060;&#51204;&#50640; &#50689;&#49549;&#54868; &#46104;&#50632;&#45796;&#47732;, &#50864;&#47532;&#45716; &#51060; &#49345;&#53468;&#47484; <span class="emphasis"><em>detached</em></span>&#46972;&#44256; &#48512;&#47480;&#45796;). (&#47588;&#50864; &#49324;&#49892;&#51201;&#51060;&#51648; &#50506;&#51008;) &#53076;&#46300; &#45236;&#50640;&#49436; &#51060;&#44163;&#51008; &#45796;&#51020;&#44284; &#44057;&#51012; &#49688; &#51080;&#45796;: 
            </p><pre class="programlisting">private void addPersonToEvent(Long personId, Long eventId) {

    Session session = HibernateUtil.getSessionFactory().getCurrentSession();
    session.beginTransaction();

    Person aPerson = (Person) session
            .createQuery("select p from Person p left join fetch p.events where p.id = :pid")
            .setParameter("pid", personId)
            .uniqueResult(); // Eager fetch the collection so we can use it detached

    Event anEvent = (Event) session.load(Event.class, eventId);

    session.getTransaction().commit();

    // End of first unit of work

    aPerson.getEvents().add(anEvent); // aPerson (and its collection) is detached

    // Begin second unit of work

    Session session2 = HibernateUtil.getSessionFactory().getCurrentSession();
    session2.beginTransaction();

    session2.update(aPerson); // Reattachment of aPerson

    session2.getTransaction().commit();
}</pre><p><code class="literal">update</code>&#50640; &#45824;&#54620; &#54840;&#52636;&#51008; &#54620; &#44060;&#51032; detached &#44061;&#52404;&#47484; &#45796;&#49884; &#50689;&#49549;&#54868; &#49884;&#53412;&#44256;, &#45817;&#49888;&#51008; &#44536;&#44163;&#51060; &#49352;&#47196;&#50868; &#51089;&#50629; &#45800;&#50948;&#50640; &#48148;&#51064;&#46300;&#46108;&#45796;&#44256; &#47568;&#54624; &#49688; &#51080;&#44256;, &#46384;&#46972;&#49436; detached &#46041;&#50504;&#50640; &#45817;&#49888;&#51060; &#44536;&#44163;&#50640; &#45824;&#54644; &#54665;&#54620; &#51076;&#51032;&#51032; &#48320;&#44221;&#46308;&#51060; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640;
               &#51200;&#51109;&#46112; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; &#45817;&#49888;&#51060; &#44536; &#50644;&#54000;&#54000; &#44061;&#52404;&#51032; &#53084;&#47113;&#49496;&#50640; &#45824;&#54644; &#54665;&#54664;&#45912; &#51076;&#51032;&#51032; &#48320;&#44221;&#46308;(&#52628;&#44032;/&#49325;&#51228;)&#47484; &#54252;&#54632;&#54620;&#45796;. 
            </p>
            <p>&#47932;&#47200;, &#50864;&#47532;&#51032; &#54788;&#51116; &#49345;&#54889;&#50640;&#49436; &#51060;&#44163;&#51008; &#47566;&#51060; &#49324;&#50857;&#46104;&#51648; &#50506;&#51648;&#47564;, &#44536;&#44163;&#51008; &#45817;&#49888;&#51060; &#45817;&#49888; &#51088;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#45236;&#47196; &#49444;&#44228;&#54624; &#49688; &#51080;&#45716; &#51473;&#50836;&#54620; &#44060;&#45392;&#51060;&#45796;. &#51648;&#44552; <code class="literal">EventManager</code>&#51032; main &#47700;&#49548;&#46300;&#50640; &#54620; &#44060;&#51032; &#49352;&#47196;&#50868; &#50529;&#49496;&#51012; &#52628;&#44032;&#54616;&#44256; &#47749;&#47161; &#46972;&#51064;&#50640;&#49436; &#44536;&#44163;&#51012; &#54840;&#52636;&#54616;&#50668; &#51060; &#50672;&#49845;&#51012; &#50756;&#47308;&#54616;&#46972;. &#47564;&#51068; &#45817;&#49888;&#51060; &#54620;&#47749;&#51032; &#44060;&#51064;&#44284; &#54620; &#44060;&#51032; &#51060;&#48292;&#53944;&#50640; &#45824;&#54620; &#49885;&#48324;&#51088;&#46308;&#51012; &#54596;&#50836;&#47196; &#54624; &#44221;&#50864; - <code class="literal">save()</code> &#47700;&#49548;&#46300;&#44032; &#44536;&#44163;&#51012; &#48152;&#54872;&#49884;&#53416;&#45796;(&#45817;&#49888;&#51008; &#44536; &#49885;&#48324;&#51088;&#47484; &#48152;&#54872;&#49884;&#53412;&#45716; &#50526;&#51032; &#47700;&#49548;&#46300;&#46308; &#51473; &#47751;&#47751;&#51012; &#48320;&#44221;&#49884;&#53020;&#50556; &#54624; &#44163;&#51060;&#45796;): 
            </p><pre class="programlisting">else if (args[0].equals("addpersontoevent")) {
    Long eventId = mgr.createAndStoreEvent("My Event", new Date());
    Long personId = mgr.createAndStorePerson("Foo", "Bar");
    mgr.addPersonToEvent(personId, eventId);
    System.out.println("Added person " + personId + " to event " + eventId);
}</pre><p>&#51060;&#44163;&#51008; &#46160; &#44060;&#51032; &#46041;&#46321;&#54616;&#44172; &#51473;&#50836;&#54620; &#53364;&#47000;&#49828;&#46308;, &#46160; &#44060;&#51032; &#50644;&#54000;&#54000;&#46308; &#49324;&#51060;&#50640;&#49436; &#54620; &#44060;&#51032; &#50672;&#44288;&#50640; &#44288;&#54620; &#50696;&#51228;&#50688;&#45796;. &#50526;&#49436; &#50616;&#44553;&#54664;&#46319;&#51060;, &#51204;&#54805;&#51201;&#51064; &#47784;&#54805; &#45236;&#50640;&#45716; &#45796;&#47480; &#53364;&#47000;&#49828;&#46308;&#44284; &#53440;&#51060;&#46308;&#51060; &#51316;&#51116;&#54616;&#45716;&#45936;, &#45824;&#44060; "&#45916; &#51473;&#50836;&#54616;&#45796;". &#45817;&#49888;&#51008; &#51060;&#48120; <code class="literal">int</code> &#46608;&#45716; <code class="literal">String</code>&#44284; &#44057;&#51008; &#50612;&#46500; &#44163;&#51012; &#51060;&#48120; &#48372;&#50520;&#45796;. &#50864;&#47532;&#45716; &#51060;&#46308; &#53364;&#47000;&#49828;&#46308;&#51012; <span class="emphasis"><em>&#44050; &#53440;&#51077;&#46308;(value types)</em></span>&#51060;&#46972; &#47749;&#47749;&#54616;&#44256;, &#44536;&#46308; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#53945;&#51221; &#50644;&#54000;&#54000;&#50640; <span class="emphasis"><em>&#51032;&#51316;&#54620;&#45796;(depend)</em></span>. &#51060;&#46308; &#53440;&#51077;&#46308;&#51012; &#44032;&#51652; &#51064;&#49828;&#53556;&#49828;&#46308;&#51008; &#44536;&#44163;&#46308; &#51088;&#49888;&#51032; &#49885;&#48324;&#49457;(identity)&#47484; &#44054;&#51648; &#50506;&#44144;&#45208;, &#44536;&#44163;&#46308;&#51008; &#50644;&#54000;&#54000;&#46308; &#49324;&#51060;&#50640;&#49436; &#44277;&#50976;&#46104;&#51648;&#46020; &#50506;&#45716;&#45796;(&#46160;&#44060;&#51032; person&#46308;&#51008; &#49900;&#51648;&#50612; &#44536;&#44163;&#46308;&#51060; &#44057;&#51008; &#52395; &#48264;&#51704; &#51060;&#47492;&#51012; &#44054;&#45716; &#44221;&#50864;&#50640;&#46020; &#46041;&#51068;&#54620;
               <code class="literal">firstname</code>&#51012; &#52280;&#51312;&#54616;&#51648; &#50506;&#45716;&#45796; ). &#47932;&#47200; &#44050; &#53440;&#51077;&#46308;&#51008; JDK &#45236;&#50640;&#49436; &#48156;&#44204;&#46112; &#49104;&#47564; &#50500;&#45768;&#46972;(&#49324;&#49892;, Hibernate &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#50640;&#49436; &#47784;&#46304; JDK &#53364;&#47000;&#49828;&#46308;&#51008; &#44050; &#53440;&#51077;&#46308;&#47196; &#44036;&#51452;&#46108;&#45796;), &#45817;&#49888;&#51008; &#46608;&#54620; &#45817;&#49888; &#49828;&#49828;&#47196; &#51333;&#49549; &#53364;&#47000;&#49828;&#46308;, &#50696;&#47484; &#46308;&#47732;
               <code class="literal">Address</code> &#46608;&#45716; <code class="literal">MonetaryAmount</code>&#51012; &#51089;&#49457;&#54624; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#45817;&#49888;&#51008; &#46608;&#54620; &#44050; &#53440;&#51077;&#46308;&#51012; &#49444;&#44228;&#54624; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; &#45796;&#47480; &#50644;&#54000;&#54000;&#46308;&#50640; &#45824;&#54620; &#52280;&#51312;&#46308;&#51012; &#44032;&#51652; &#53084;&#47113;&#49496;&#44284;&#45716; &#44060;&#45392;&#51201;&#51004;&#47196; &#47588;&#50864; &#45796;&#47476;&#51648;&#47564;, Java&#50640;&#49436;&#45716; &#45824;&#44060; &#46041;&#51068;&#54620; &#44163;&#51004;&#47196; &#48372;&#50668;&#51652;&#45796;. </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-valuecollections"></a>1.3.4. &#44050;&#46308;&#51012; &#44032;&#51652; &#53084;&#47113;&#49496;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#50864;&#47532;&#45716; &#44050; &#53440;&#51077;&#51032; &#44061;&#52404;&#46308;&#51012; &#44032;&#51652; &#54620; &#44060;&#51032; &#53084;&#47113;&#49496;&#51012; <code class="literal">Person</code> &#50644;&#54000;&#54000;&#50640; &#52628;&#44032;&#49884;&#53416;&#45796;. &#50864;&#47532;&#45716; email &#51452;&#49548;&#47484; &#51200;&#51109;&#54616;&#44256;&#51088; &#50896;&#54616;&#48064;&#47196;, &#50864;&#47532;&#44032; &#49324;&#50857;&#54616;&#45716; &#53440;&#51077;&#51008; <code class="literal">String</code>&#51060;&#44256;, &#44536; &#53084;&#47113;&#49496;&#51008; &#45796;&#49884; &#54620; &#44060;&#51032; <code class="literal">Set</code>&#51060;&#45796;: 
            </p><pre class="programlisting">private Set emailAddresses = new HashSet();

public Set getEmailAddresses() {
    return emailAddresses;
}

public void setEmailAddresses(Set emailAddresses) {
    this.emailAddresses = emailAddresses;
}</pre><p>&#51060; <code class="literal">Set</code>&#50640; &#45824;&#54620; &#47588;&#54609;&#51008; &#45796;&#51020;&#44284; &#44057;&#45796;: 
            </p><pre class="programlisting">&lt;set name="emailAddresses" table="PERSON_EMAIL_ADDR"&gt;
    &lt;key column="PERSON_ID"/&gt;
    &lt;element type="string" column="EMAIL_ADDR"/&gt;
&lt;/set&gt;</pre><p>&#50526;&#51032; &#47588;&#54609;&#44284; &#48708;&#44368;&#54620; &#52264;&#51060;&#51216;&#51008; <code class="literal">element</code> &#48512;&#48516;&#51064;&#45936;, &#44536;&#44163;&#51008; &#44536; &#53084;&#47113;&#49496;&#51060; &#46608; &#45796;&#47480; &#50644;&#54000;&#54000;&#50640; &#45824;&#54620; &#52280;&#51312;&#46308;&#51012; &#54252;&#54632;&#54616;&#51648; &#50506;&#51012; &#44163;&#51060;&#51648;&#47564; <code class="literal">String</code>(&#49548;&#47928;&#51088; &#51060;&#47492;&#51008; &#44536;&#44163;&#51060; Hibernate &#47588;&#54609; &#53440;&#51077;/&#48320;&#54872;&#51088;&#51076;&#51012; &#45817;&#49888;&#50640;&#44172; &#47568;&#54644;&#51456;&#45796;) &#53440;&#51077;&#51032; &#50836;&#49548;&#46308;&#51012; &#44032;&#51652; &#54620; &#44060;&#51032; &#53084;&#47113;&#49496;&#51012; &#54252;&#54632;&#54624; &#44163;&#51076;&#51012; Hibernate&#50640;&#44172; &#50508;&#47140;&#51456;&#45796;. &#51068;&#45800; &#45796;&#49884; <code class="literal">set</code> &#50836;&#49548;&#51032; <code class="literal">table</code> &#49549;&#49457;&#51008; &#44536; &#53084;&#47113;&#49496;&#50640; &#45824;&#54620; &#53580;&#51060;&#48660; &#51060;&#47492;&#51012; &#44208;&#51221;&#54620;&#45796;. <code class="literal">key</code> &#50836;&#49548;&#45716; &#53084;&#47113;&#49496; &#53580;&#51060;&#48660; &#45236;&#50640;&#49436; foreign-key &#52972;&#47100; &#51060;&#47492;&#51012; &#51221;&#51032;&#54620;&#45796;. <code class="literal">element</code> &#50836;&#49548; &#45236;&#50640; &#51080;&#45716; <code class="literal">column</code> &#49549;&#49457;&#51008; <code class="literal">String</code> &#44050;&#46308;&#51060; &#49892;&#51228;&#47196; &#51200;&#51109;&#46112; &#52972;&#47100; &#51060;&#47492;&#51012; &#51221;&#51032;&#54620;&#45796;. 
            </p>
            <p>&#50629;&#45936;&#51060;&#53944;&#46108; &#49828;&#53412;&#47560;&#47484; &#49332;&#54196;&#48372;&#46972;: </p><pre class="programlisting">
  _____________        __________________
 |             |      |                  |       _____________
 |   EVENTS    |      |   PERSON_EVENT   |      |             |       ___________________
 |_____________|      |__________________|      |    PERSON   |      |                   |
 |             |      |                  |      |_____________|      | PERSON_EMAIL_ADDR |
 | *EVENT_ID   | &lt;--&gt; | *EVENT_ID        |      |             |      |___________________|
 |  EVENT_DATE |      | *PERSON_ID       | &lt;--&gt; | *PERSON_ID  | &lt;--&gt; |  *PERSON_ID       |
 |  TITLE      |      |__________________|      |  AGE        |      |  *EMAIL_ADDR      |
 |_____________|                                |  FIRSTNAME  |      |___________________|
                                                |  LASTNAME   |
                                                |_____________|
 </pre><p>&#45817;&#49888;&#51008; &#53084;&#47113;&#49496; &#53580;&#51060;&#48660;&#51032; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412;&#44032; &#49324;&#49892;&#51008; &#46160; &#52972;&#47100;&#46308;&#51012; &#49324;&#50857;&#54616;&#45716; &#54620; &#44060;&#51032; &#54633;&#49457; &#53412;(composite key)&#51076;&#51012; &#50508; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; &#46608;&#54620; &#44060;&#51064;&#50640; &#45824;&#54644; email &#51452;&#49548;&#44032; &#51473;&#48373;&#46112; &#49688; &#50630;&#51020;&#51012; &#51032;&#48120;&#54616;&#47728;, &#44536;&#44163;&#51008; &#51221;&#54869;&#54616;&#44172;
               &#50864;&#47532;&#44032; Java&#50640;&#49436; set&#51012; &#54596;&#50836;&#47196; &#54616;&#45716; &#51032;&#48120;&#47200;&#51060;&#45796;. 
            </p>
            <p>&#47560;&#52824; &#44060;&#51064;&#46308;&#44284; &#51060;&#48292;&#53944;&#46308;&#51012; &#47553;&#53356;&#49884;&#53020;&#49436; &#51060;&#51204;&#50640; &#50864;&#47532;&#44032; &#54665;&#54664;&#45912; &#44163;&#52376;&#47100; &#51060;&#51228; &#45817;&#49888;&#51008; &#50836;&#49548;&#46308;&#51012; &#49884;&#46020;&#54616;&#44256; &#51060; &#53084;&#47113;&#49496;&#50640; &#52628;&#44032;&#54624; &#49688; &#51080;&#45796;. &#44536;&#44163;&#51008; Java&#50640;&#49436; &#46041;&#51068;&#54620; &#53076;&#46300;&#51060;&#45796;. </p><pre class="programlisting">private void addEmailToPerson(Long personId, String emailAddress) {

    Session session = HibernateUtil.getSessionFactory().getCurrentSession();
    session.beginTransaction();

    Person aPerson = (Person) session.load(Person.class, personId);

    // The getEmailAddresses() might trigger a lazy load of the collection
    aPerson.getEmailAddresses().add(emailAddress);

    session.getTransaction().commit();
}</pre><p>This time we didn't use a <span class="emphasis"><em>fetch</em></span> query to initialize the collection. Hence, the call to its getter method will trigger an additional select to initialize
               it, so we can add an element to it. Monitor the SQL log and try to optimize this with an eager fetch. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-bidirectional"></a>1.3.5. Bi-directional associations
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#45796;&#51020;&#51004;&#47196; &#50864;&#47532;&#45716; &#50577;&#48169;&#54693; &#50672;&#44288;&#51012; &#47588;&#54609;&#49884;&#53420; &#50696;&#51221;&#51060;&#45796;-&#44060;&#51064;&#44284; &#51060;&#48292;&#53944; &#49324;&#51060;&#50640; &#50672;&#44288;&#51012; &#47564;&#46300;&#45716; &#44163;&#51008; Java&#50640;&#49436; &#50577; &#52769;&#46308;&#50640;&#49436; &#46041;&#51089;&#54620;&#45796;. &#47932;&#47200; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49828;&#53412;&#47560;&#45716; &#48320;&#44221;&#46104;&#51648; &#50506;&#44256;, &#50864;&#47532;&#45716; &#50668;&#51204;&#55176; many-to-many &#45796;&#51473;&#49457;&#51012; &#44054;&#45716;&#45796;.
               &#44288;&#44228;&#54805; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#45716; &#45348;&#53944;&#50893; &#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612; &#48372;&#45796; &#55016;&#50476; &#45908; &#50976;&#50672;&#54616;&#50668;&#49436;, &#44536;&#44163;&#51008; &#45348;&#48708;&#44172;&#51060;&#49496; &#48169;&#54693;&#44284; &#44057;&#51008; &#50612;&#46500; &#44163;&#51012; &#54596;&#50836;&#47196; &#54616;&#51648; &#50506;&#45716;&#45796; - &#45936;&#51060;&#53552;&#45716; &#50612;&#46500; &#44032;&#45733;&#54620; &#48148;&#50629;&#12610;&#51004;&#47196; &#48372;&#50668;&#51656; &#49688; &#51080;&#44256; &#44160;&#49353;&#46112; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#47676;&#51200;, &#52280;&#50668;&#51088;&#46308;&#51012; &#44032;&#51652; &#54620; &#44060;&#51032; &#53084;&#47113;&#49496;&#51012; <code class="literal">Event</code> Event &#53364;&#47000;&#49828;&#50640; &#52628;&#44032;&#49884;&#53020;&#46972;: 
            </p><pre class="programlisting">private Set participants = new HashSet();

public Set getParticipants() {
    return participants;
}

public void setParticipants(Set participants) {
    this.participants = participants;
}</pre><p>&#51060;&#51228; <code class="literal">Event.hbm.xml</code> &#45236;&#50640; &#50672;&#44288;&#51032; &#51060; &#51901;&#46020; &#47588;&#54609;&#54616;&#46972;. 
            </p><pre class="programlisting">&lt;set name="participants" table="PERSON_EVENT" inverse="true"&gt;
    &lt;key column="EVENT_ID"/&gt;
    &lt;many-to-many column="PERSON_ID" class="events.Person"/&gt;
&lt;/set&gt;</pre><p>&#45817;&#49888;&#51060; &#48380; &#49688; &#51080;&#46319;&#51060;, &#51060;&#44163;&#46308;&#51008; &#46160; &#47588;&#54609; &#47928;&#49436;&#46308; &#45236;&#50640;&#49436; &#51221;&#44508; <code class="literal">set</code> &#47588;&#54609;&#46308;&#51060;&#45796;. <code class="literal">key</code>&#50752; <code class="literal">many-to-many</code>&#50640;&#49436; &#52972;&#47100; &#51060;&#47492;&#46308;&#51008; &#46160; &#47588;&#54609; &#47928;&#49436;&#46308;&#50640;&#49436; &#48148;&#45068;&#50612;&#51652;&#45796;. &#50668;&#44592;&#49436; &#44032;&#51109; &#51473;&#50836;&#54620; &#48512;&#44032;&#47932;&#51008; <code class="literal">Event</code>&#51032; &#53084;&#47113;&#49496; &#47588;&#54609;&#50640; &#44288;&#54620; <code class="literal">set</code> &#50836;&#49548; &#45236;&#50640; &#51080;&#45716; <code class="literal">inverse="true"</code> &#49549;&#49457;&#51060;&#45796;. 
            </p>
            <p>&#51060;&#44163;&#51060; &#51032;&#48120;&#54616;&#45716; &#48148;&#45716; Hibernate&#44032; &#46168; &#49324;&#51060;&#51032; &#47553;&#53356;&#50640; &#45824;&#54620; &#51221;&#48372;&#47484; &#50508; &#54596;&#50836;&#44032; &#51080;&#51012; &#46412; &#45796;&#47480; &#52769;-<code class="literal">Person</code> &#53364;&#47000;&#49828;-&#47484; &#52712;&#54624; &#44163;&#51060;&#46972;&#45716; &#51216;&#51060;&#45796;. &#51068;&#45800; &#45817;&#49888;&#51060; &#50864;&#47532;&#51032; &#46160; &#50644;&#54000;&#54000;&#46308; &#49324;&#51060;&#50640; &#50577;&#48169;&#54693; &#47553;&#53356;&#44032; &#49373;&#49457;&#46104;&#45716; &#48169;&#48277;&#51012; &#50504;&#45796;&#47732; &#51060;&#44163;&#51008; &#51060;&#54644;&#54616;&#44592;&#44032; &#55016;&#50476; &#45908; &#49772;&#50872; &#44163;&#51060;&#45796;. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-associations-usingbidir"></a>1.3.6. &#50577;&#48169;&#54693; &#47553;&#53356;&#46308;&#50640; &#51089;&#50629;&#54616;&#44592;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#52395; &#48264;&#51704;&#47196; Hibernate&#44032; &#51221;&#44508; Java &#51032;&#48120;&#47200;&#50640; &#50689;&#54693;&#51012; &#51452;&#51648; &#50506;&#51020;&#51012; &#50684;&#46160;&#50640; &#46160;&#46972;. &#50864;&#47532;&#45716; &#45800;&#48169;&#54693; &#50696;&#51228;&#50640;&#49436; <code class="literal">Person</code>&#44284; <code class="literal">Event</code> &#49324;&#51060;&#50640; &#50612;&#46523;&#44172; &#54620; &#44060;&#51032; &#47553;&#53356;&#47484; &#49373;&#49457;&#49884;&#53040;&#45716;&#44032;? &#50864;&#47532;&#45716; <code class="literal">Event</code> &#53440;&#51077;&#51032; &#51064;&#49828;&#53556;&#49828;&#47484; <code class="literal">Person</code> &#53440;&#51077;&#51032; &#51060;&#48292;&#53944; &#52280;&#51312;&#46308;&#51012; &#44032;&#51652; &#53084;&#47113;&#49496;&#50640; &#52628;&#44032;&#49884;&#53040;&#45796;. &#46384;&#46972;&#49436; &#47749;&#48177;&#54616;&#44172; &#50864;&#47532;&#44032; &#51060; &#47553;&#53356;&#47484; &#50577;&#48169;&#54693;&#51004;&#47196; &#46041;&#51089;&#54616;&#46020;&#47197; &#47564;&#46308;&#44256;&#51088; &#50896;&#54620;&#45796;&#47732;, &#50864;&#47532;&#45716; &#45796;&#47480; &#52769; &#49345;&#50640;&#49436; -&#54616;&#45208;&#51032; <code class="literal">Person</code> &#52280;&#51312;&#47484; &#54616;&#45208;&#51032; <code class="literal">Event</code> &#45236;&#50640; &#51080;&#45716; &#53084;&#47113;&#49496;&#50640; &#52628;&#44032;&#49884;&#53428;&#51004;&#47196;&#50024;- &#46041;&#51068;&#54620; &#44163;&#51012; &#54665;&#54644;&#50556; &#54620;&#45796;. &#51060; "&#50577; &#52769; &#49345;&#50640; &#47553;&#53356; &#49444;&#51221;&#54616;&#44592;"&#45716; &#51208;&#45824;&#51201;&#51004;&#47196; &#54596;&#49688;&#51201;&#51060;&#44256; &#45817;&#49888;&#51008; &#44536;&#44163;&#51012; &#54665;&#54616;&#45716; &#44163;&#51012; &#44208;&#53076; &#51082;&#51648; &#47568;&#50500;&#50556; &#54620;&#45796;. 
            </p>
            <p>Many developers program defensively and create link management methods to correctly set both sides, e.g. in <code class="literal">Person</code>: 
            </p><pre class="programlisting">protected Set getEvents() {
    return events;
}

protected void setEvents(Set events) {
    this.events = events;
}

public void addToEvent(Event event) {
    this.getEvents().add(event);
    event.getParticipants().add(this);
}

public void removeFromEvent(Event event) {
    this.getEvents().remove(event);
    event.getParticipants().remove(this);
}</pre><p>&#53084;&#47113;&#49496;&#50640; &#45824;&#54620; get &#48143; set &#47700;&#49548;&#46300;&#46300;&#51008; &#51060;&#51228; protected&#51076;&#51012; &#51064;&#51648;&#54616;&#46972; - &#51060;&#44163;&#51008; &#46041;&#51068;&#54620; &#54056;&#53412;&#51648; &#45236;&#50640; &#51080;&#45716; &#53364;&#47000;&#49828;&#46308;&#44284; &#49436;&#48652;&#53364;&#47000;&#49828;&#46308;&#51060; &#44536; &#47700;&#49548;&#46300;&#46308;&#50640; &#51217;&#44540;&#54616;&#45716; &#44163;&#51012; &#54728;&#50857;&#54644;&#51452;&#51648;&#47564;, &#44536; &#48150;&#51032; &#47784;&#46304; &#44163;&#46308;&#51060; &#44536; &#53084;&#47113;&#49496;&#46308;&#51012;
               (&#47932;&#47200;, &#45824;&#44060;) &#51649;&#51217; &#47564;&#51648;&#45716; &#44163;&#51012; &#44552;&#51648;&#49884;&#53416;&#45796;. &#45817;&#49888;&#51008; &#45796;&#47480; &#52769; &#49345;&#50640; &#51080;&#45716; &#53084;&#47113;&#49496;&#50640; &#45824;&#54644; &#46041;&#51068;&#54620; &#44163;&#51012; &#54665;&#54624; &#44163;&#51060;&#45796;. 
            </p>
            <p><code class="literal">inverse</code> &#47588;&#54609; &#49549;&#49457;&#51008; &#47924;&#50631;&#51064;&#44032;? &#45817;&#49888;&#51032; &#44221;&#50864;, &#44536;&#47532;&#44256; Java&#51032; &#44221;&#50864;, &#54620; &#44060;&#51032; &#50577;&#48169;&#54693; &#47553;&#53356;&#45716; &#45800;&#49692;&#55176; &#50577; &#52769;&#46308;&#50640; &#45824;&#54620; &#52280;&#51312;&#46308;&#51012; &#51221;&#54869;&#54616;&#44172; &#49444;&#51221;&#54616;&#45716; &#47928;&#51228;&#51060;&#45796;. &#54616;&#51648;&#47564; Hibernate&#45716; (&#52968;&#49828;&#53944;&#47112;&#51064;&#53944; &#50948;&#48176;&#47484; &#54588;&#54616;&#44592; &#50948;&#54644;&#49436;) SQL
               <code class="literal">INSERT</code> &#47928;&#51109;&#44284; <code class="literal">UPDATE</code> &#47928;&#51109;&#51012; &#51221;&#54869;&#54616;&#44172; &#47560;&#47144;&#54616;&#44592;&#50640; &#52649;&#48516;&#54620; &#51221;&#48372;&#47484; &#44054;&#44256; &#51080;&#51648; &#50506;&#51004;&#47728;, &#50577;&#48169;&#54693; &#50672;&#44288;&#46308;&#51012; &#50732;&#48148;&#47476;&#44172; &#52376;&#47532;&#54616;&#44592; &#50948;&#54644; &#50612;&#46500; &#46020;&#50880;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;. &#50672;&#44288;&#51032; &#54620; &#52769;&#51012; <code class="literal">inverse</code>&#47196; &#47564;&#46300;&#45716; &#44163;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#44536;&#44163;&#51012; &#47924;&#49884;&#54616;&#44256; &#44536;&#44163;&#51012; &#45796;&#47480; &#52769;&#51032; <span class="emphasis"><em>&#44144;&#50872;(mirror)</em></span>&#47196; &#44036;&#51452;&#54616;&#46020;&#47197; Hibernate&#50640;&#44172; &#50508;&#47140;&#51456;&#45796;. &#44536;&#44163;&#51008; Hibernate&#44032; &#54616;&#45208;&#51032; &#48169;&#54693;&#49457; &#45348;&#48708;&#44172;&#51060;&#49496; &#47784;&#54805;&#51012; &#54620; &#44060;&#51032; SQL &#49828;&#53412;&#47560;&#47196; &#48320;&#54872;&#49884;&#53420; &#46412; &#47784;&#46304; &#51137;&#51216;&#46308;&#51012; &#51096; &#54644;&#44208;&#54616;&#45716;&#45936; &#54596;&#49688;&#51201;&#51064; &#47784;&#46304; &#44163;&#51060;&#45796;. &#45817;&#49888;&#51060; &#50684;&#46160;&#50640; &#46160;&#50612;&#50556; &#54616;&#45716;
               &#44508;&#52825;&#46308;&#51008; &#44036;&#45800;&#54616;&#45796; : &#47784;&#46304; &#50577;&#48169;&#54693; &#50672;&#44288;&#46308;&#51008; &#54620; &#51901;&#51060; <code class="literal">inverse</code>&#51068; &#54596;&#50836;&#44032; &#51080;&#45796;. one-to-many &#50672;&#44288;&#50640;&#49436; &#44536;&#44163;&#51008; many-&#52769;&#51060;&#50612;&#50556; &#54616;&#44256;, many-to-many &#50672;&#44288;&#50640;&#49436; &#45817;&#49888;&#51008; &#50612;&#45712; &#52769;&#51060;&#46304; &#49440;&#53469;&#54624; &#49688; &#51080;&#51004;&#47728; &#52264;&#51060;&#51216;&#51008; &#50630;&#45796;. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="tutorial-firstapp.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="tutorial.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="tutorial-webapp.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">1.2. &#54028;&#53944; 1 - &#52395; &#48264;&#51704; Hibernate &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;1.4. &#54028;&#53944; 3 - EventManager &#50937; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;</td>
            </tr>
         </table>
      </div>
   </body>
</html>