<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>1.2. &#54028;&#53944; 1 - &#52395; &#48264;&#51704; Hibernate &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;</title>
      <link rel="stylesheet" href="css/html.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
      <link rel="start" href="index.html" title="HIBERNATE - &#44060;&#49457;&#51080;&#45716; &#51088;&#48148;&#47484; &#50948;&#54620; &#44288;&#44228; &#50689;&#49549;">
      <link rel="up" href="tutorial.html" title="1&#51109;. Hibernate &#44060;&#50836;">
      <link rel="prev" href="tutorial.html" title="1&#51109;. Hibernate &#44060;&#50836;">
      <link rel="next" href="tutorial-associations.html" title="1.3. &#54028;&#53944; 2 - &#50672;&#44288;&#46308;&#51012; &#47588;&#54609;&#54616;&#44592;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">1.2. &#54028;&#53944; 1 - &#52395; &#48264;&#51704; Hibernate &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="tutorial.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <th width="60%" align="center">1&#51109;. Hibernate &#44060;&#50836;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="tutorial-associations.html">&#45796;&#51020;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="ko-KR">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="tutorial-firstapp"></a>1.2. &#54028;&#53944; 1 - &#52395; &#48264;&#51704; Hibernate &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;
                  </h2>
               </div>
            </div>
         </div>
         <p>Let's assume we need a small database application that can store events we want to attend, and information about the host(s)
            of these events. We will use an in-memory, Java database named HSQLDB to avoid describing installation/setup of any particular
            database servers. Feel free to tweak this tutorial to use whatever database you feel comfortable using. 
         </p>
         <p>The first thing we need to do is set up our development environment, and specifically to setup all the required dependencies
            to Hibernate as well as other libraries. Hibernate is built using Maven which amongst other features provides <code class="literal">dependecy management</code>; moreover it provides <span class="emphasis"><em>transitive</em></span> <code class="literal">dependecy management</code> which simply means that to use Hibernate we can simply define our dependency on Hibernate, Hibernate itself defines the dependencies
            it needs which then become transitive dependencies of our project. 
         </p><pre class="programlisting">.
&lt;project xmlns="http://maven.apache.org/POM/4.0.0"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
         xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd"&gt;

    ...

    &lt;dependencies&gt;
        &lt;dependency&gt;
            &lt;groupId
&gt;${groupId}&lt;/groupId&gt;
            &lt;artifactId
&gt;hibernate-core&lt;/artifactId&gt;
        &lt;/dependency&gt;

        &lt;!-- Because this is a web app, we also have a dependency on the servlet api. --&gt;
        &lt;dependency&gt;
            &lt;groupId
&gt;javax.servlet&lt;/groupId&gt;
            &lt;artifactId
&gt;servlet-api&lt;/artifactId&gt;
        &lt;/dependency&gt;
    &lt;/dependencies&gt;

&lt;/project
&gt;</pre><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;">
            <h3 class="title">&#52280;&#44256;</h3>
            <p>Essentially we are describing here the <code class="filename">/tutorials/web/pom.xml</code> file. See the <a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://maven.org" target="_top">Maven</a> site for more information. 
            </p>
         </div>
         <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;">
            <h3 class="title">&#51089;&#51008; &#51221;&#48372;</h3>
            <p>While not strictly necessary, most IDEs have integration with Maven to read these POM files and automatically set up a project
               for you which can save lots of time and effort. 
            </p>
         </div>
         <p>&#45796;&#51020;&#51004;&#47196; &#50864;&#47532;&#45716; &#50864;&#47532;&#44032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49549;&#50640; &#51200;&#51109;&#49884;&#53412;&#44256;&#51088; &#50896;&#54616;&#45716; &#51060;&#48292;&#53944;&#47484; &#54364;&#54788;&#54616;&#45716; &#54620; &#44060;&#51032; &#53364;&#47000;&#49828;&#47484; &#49373;&#49457;&#49884;&#53416;&#45796;. </p>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-firstclass"></a>1.2.1. &#52395; &#48264;&#51704; &#53364;&#47000;&#49828;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#50864;&#47532;&#51032; &#52395; &#48264;&#51704; &#50689;&#49549; &#53364;&#47000;&#49828;&#45716; &#47751;&#47751; &#54532;&#47196;&#54140;&#54000;&#46308;&#51012; &#44032;&#51652; &#44036;&#45800;&#54620; &#51088;&#48148;&#48712;&#51592; &#53364;&#47000;&#49828;&#51060;&#45796;: </p><pre class="programlisting">package org.hibernate.tutorial.domain;

import java.util.Date;

public class Event {
    private Long id;

    private String title;
    private Date date;

    public Event() {}

    public Long getId() {
        return id;
    }

    private void setId(Long id) {
        this.id = id;
    }

    public Date getDate() {
        return date;
    }

    public void setDate(Date date) {
        this.date = date;
    }

    public String getTitle() {
        return title;
    }

    public void setTitle(String title) {
        this.title = title;
    }
}</pre><p>&#45817;&#49888;&#51008; &#51060; &#53364;&#47000;&#49828;&#44032; &#54532;&#47196;&#54140;&#54000; getter&#50752; setter &#47700;&#49548;&#46300;&#46308;&#50640; &#45824;&#54620; &#54364;&#51456; &#51088;&#48148;&#48712;&#51592; &#47749;&#47749;&#48277;&#46308; &#49104;&#47564; &#50500;&#45768;&#46972; &#54596;&#46300;&#46308;&#50640; &#45824;&#54620; private &#44032;&#49884;&#49457;&#51012; &#49324;&#50857;&#54616;&#44256; &#51080;&#51020;&#51012; &#50508; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; &#44428;&#51109;&#46104;&#45716; &#49444;&#44228;&#51060;&#51648;&#47564;, &#54596;&#49688;&#51201;&#51060;&#51648;&#45716; &#50506;&#45796;.
               Hibernate&#45716; &#46608;&#54620; &#54596;&#46300;&#46308;&#50640; &#51649;&#51217; &#51217;&#44540;&#54624; &#49688; &#51080;&#51004;&#47728;, accessor &#47700;&#49548;&#46300;&#46308;&#51032; &#51060;&#51216;&#51008; &#44053;&#44148;&#54620; &#47532;&#54057;&#53664;&#47553;&#51060;&#45796;. &#50500;&#44508;&#47676;&#53944; &#50630;&#45716; &#49373;&#49457;&#51088;&#45716; reflection&#51012; &#53685;&#54644; &#51060; &#53364;&#47000;&#49828;&#51032; &#44061;&#52404;&#47484; &#52488;&#44592;&#54868; &#49884;&#53420; &#54596;&#50836;&#44032; &#51080;&#45796;. 
            </p>
            <p><code class="literal">id</code> &#54532;&#47196;&#54140;&#54000;&#45716; &#53945;&#48324;&#54620; &#51060;&#48292;&#53944;&#47484; &#50948;&#54620; &#50976;&#51068; &#49885;&#48324;&#51088;&#47484; &#49548;&#50976;&#54620;&#45796;. &#47784;&#46304; &#50689;&#49549; &#50644;&#54000;&#54000; &#53364;&#47000;&#49828;&#46308; (&#48372;&#45796; &#45916; &#51473;&#50836;&#54620; &#51333;&#49549; &#53364;&#47000;&#49828;&#46308;&#46020; &#51316;&#51116;&#54620;&#45796;)&#51008; &#50864;&#47532;&#44032; Hibernate&#51032; &#51204;&#52404; &#53945;&#51669; &#51665;&#54633;&#51012; &#49324;&#50857;&#54616;&#44256;&#51088; &#50896;&#54624; &#44221;&#50864;&#50640; &#44536;&#47088; &#49885;&#48324;&#51088; &#54532;&#47196;&#54140;&#54000;&#47484;
               &#54596;&#50836;&#47196; &#54624; &#44163;&#51060;&#45796;. &#49324;&#49892; &#45824;&#48512;&#48516;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;(&#53945;&#55176; &#50937; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#46308;)&#51008; &#49885;&#48324;&#51088;&#50640; &#51032;&#54644; &#44061;&#52404;&#46308;&#51012; &#44396;&#48516;&#51648;&#51012; &#54596;&#50836;&#44032; &#51080;&#50612;&#49436;, &#45817;&#49888;&#51008; &#51060;&#44163;&#51012; &#50612;&#46500; &#51228;&#50557;&#51216;&#51060;&#46972;&#44592; &#48372;&#45796;&#45716; &#54616;&#45208;&#51032; &#53945;&#51669;&#51004;&#47196; &#44036;&#51452;&#54624; &#44163;&#51060;&#45796;. &#54616;&#51648;&#47564; &#50864;&#47532;&#45716; &#45824;&#44060; &#44061;&#52404;&#51032;
               &#54637;&#46321;(identity)&#47484; &#52376;&#47532;&#54616;&#51648; &#50506;&#51004;&#48064;&#47196;, setter &#47700;&#49548;&#46300;&#45716; private&#51060;&#50612;&#50556; &#54620;&#45796;. &#44061;&#52404;&#44032; &#51200;&#51109;&#46112; &#46412;, Hibernate&#45716; &#45800;&#51648; &#49885;&#48324;&#51088;&#46308;&#51012; &#54624;&#45817;&#54624; &#44163;&#51060;&#45796;. &#45817;&#49888;&#51008; Hibernate&#44032; public, private,
               protected &#51217;&#44540;&#51088; &#47700;&#49548;&#46300;&#46308; &#49104;&#47564; &#50500;&#45768;&#46972; (public, private, protected) &#54596;&#46300;&#46308;&#50640;&#46020; &#51649;&#51217; &#51217;&#44540;&#54624; &#49688; &#51080;&#51020;&#51012; &#50508; &#49688; &#51080;&#45796;. &#49440;&#53469;&#51008; &#45817;&#49888;&#50640;&#44172; &#45804;&#47140; &#51080;&#51004;&#47728;, &#45817;&#49888;&#51008; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49444;&#44228;&#50640; &#51201;&#54633;&#54616;&#46020;&#47197;
               &#44536;&#44163;&#51012; &#48512;&#54633;&#49884;&#53420; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#50500;&#44508;&#47676;&#53944; &#50630;&#45716; &#49373;&#49457;&#51088;&#45716; &#47784;&#46304; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#50640; &#45824;&#54620; &#54596;&#50836;&#51312;&#44148;&#51060;&#45796;; Hibernate&#45716; &#45817;&#49888;&#51012; &#50948;&#54644; Java Reflection&#51012; &#49324;&#50857;&#54616;&#50668; &#44061;&#52404;&#46308;&#51012; &#49373;&#49457;&#49884;&#53020;&#50556; &#54620;&#45796;. &#54616;&#51648;&#47564; &#49373;&#49457;&#51088;&#45716; private &#51068; &#49688; &#51080;&#44256;, &#54056;&#53412;&#51648; &#44032;&#49884;&#49457;&#51008;
               &#47088;&#53440;&#51076; &#54532;&#46973;&#49884; &#49373;&#49457;&#44284; &#48148;&#51060;&#53944;&#53076;&#46300; &#48169;&#54200; &#50630;&#45716; &#54952;&#50984;&#51201;&#51064; &#45936;&#51060;&#53552; &#44160;&#49353;&#50640; &#54596;&#50836;&#54616;&#45796;. 
            </p>
            <p>&#51060; Java &#49548;&#49828; &#54028;&#51068;&#51012; &#44060;&#48156; &#54260;&#45908; &#45236;&#51032; <code class="literal">src</code>&#47196; &#47749;&#47749;&#46108; &#46356;&#47113;&#53664;&#47532; &#49549;&#50640; &#51080;&#45716; &#50948;&#52824;&#51648;&#50892;&#46972;. &#51060;&#51228; &#44536; &#46356;&#47113;&#53664;&#47532;&#45716; &#45796;&#51020;&#44284; &#44057;&#51012; &#44163;&#51060;&#45796;: 
            </p><pre class="programlisting">.
+lib
  &lt;Hibernate and third-party libraries&gt;
+src
  +events
    Event.java</pre><p>&#45796;&#51020; &#45800;&#44228;&#50640;&#49436;, &#50864;&#47532;&#45716; Hiberante&#50640;&#44172; &#51060; &#50689;&#49549; &#53364;&#47000;&#49828;&#50640; &#45824;&#54644; &#50508;&#47140; &#51456;&#45796;. </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-mapping"></a>1.2.2. The mapping file
                     </h3>
                  </div>
               </div>
            </div>
            <p>Hibernate&#45716; &#50689;&#49549; &#53356;&#47000;&#49828;&#46308;&#50640; &#45824;&#54620; &#44061;&#52404;&#46308;&#51012; &#47196;&#46300;&#49884;&#53412;&#44256; &#51200;&#51109;&#49884;&#53412;&#45716; &#48169;&#48277;&#51012; &#50508; &#54596;&#50836;&#44032; &#51080;&#45796;. &#51060;&#44275;&#51008; Hibernate &#47588;&#54609; &#54028;&#51068;&#51060; &#50669;&#54624;&#51012; &#54665;&#54616;&#45716; &#44275;&#51060;&#45796;. &#47588;&#54609; &#54028;&#51068;&#51008; Hibernate&#44032; &#51217;&#44540;&#54644;&#50556; &#54616;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#45236;&#51032;
               &#53580;&#51060;&#48660;&#51060; &#47924;&#50631;&#51064;&#51648;, &#44536;&#47532;&#44256; &#44536;&#44163;&#51060; &#49324;&#50857;&#54644;&#50556; &#54616;&#45716; &#44536; &#53580;&#51060;&#48660; &#45236;&#51032; &#52972;&#47100;&#46308;&#51060; &#47924;&#50631;&#51064;&#51648;&#47484; Hibernate&#50640;&#44172; &#50508;&#47140;&#51456;&#45796;. 
            </p>
            <p>&#47588;&#54609; &#54028;&#51068;&#51032; &#44592;&#48376; &#44396;&#51312;&#45716; &#45796;&#51020;&#44284; &#44057;&#45796;: </p><pre class="programlisting">&lt;?xml version="1.0"?&gt;
&lt;!DOCTYPE hibernate-mapping PUBLIC
        "-//Hibernate/Hibernate Mapping DTD 3.0//EN"
        "http://hibernate.sourceforge.net/hibernate-mapping-3.0.dtd"&gt;

&lt;hibernate-mapping&gt;
[...]
&lt;/hibernate-mapping&gt;</pre><p>Hibernate DTD&#45716; &#47588;&#50864; &#51221;&#44368;&#54616;&#45796;. &#45817;&#49888;&#51008; &#45817;&#49888;&#51032; &#54200;&#51665;&#44592; &#46608;&#45716; IDE &#45236;&#50640;&#49436; XML &#47588;&#54609; &#50836;&#49548;&#46308;&#44284; &#49549;&#49457;&#46308;&#50640; &#45824;&#54620; &#51088;&#46041; &#50756;&#49457; &#44592;&#45733;&#51012; &#50948;&#54644; &#44536;&#44163;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. &#45817;&#49888;&#51008; &#46608;&#54620; &#45817;&#49888;&#51032; &#53581;&#49828;&#53944; &#54200;&#51665;&#44592; &#45236;&#50640; DTD &#54028;&#51068;&#51012;
               &#50676; &#49688; &#51080;&#51012; &#44163;&#51060;&#45796; - &#44536;&#44163;&#51008; &#47784;&#46304; &#50836;&#49548;&#46308;&#44284; &#49549;&#49457;&#46308;&#50640; &#45824;&#54620; &#51204;&#52404;&#49345;&#51012; &#50619;&#44256; &#46356;&#54260;&#53944;&#46308; &#49104;&#47564; &#50500;&#45768;&#46972; &#47751;&#47751; &#51452;&#49437;&#46308;&#51012; &#48372;&#45716; &#44032;&#51109; &#49552;&#49772;&#50868; &#48169;&#48277;&#51060;&#45796;. Hibernate&#45716; &#50937;&#51004;&#47196;&#48512;&#53552; DTD &#54028;&#51068;&#51012; &#47196;&#46300;&#49884;&#53412;&#51648; &#50506;&#51648;&#47564;, &#47676;&#51200; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51032;
               classpath &#44221;&#47196;&#47196;&#48512;&#53552; &#44536;&#44163;&#51012; &#47676;&#51200; &#47337;&#50629;&#54624; &#44163;&#51076;&#51012; &#45432;&#53944;&#54616;&#46972;. DTD &#54028;&#51068;&#51008; <code class="literal">hibernate3.jar</code> &#49549;&#50640; &#54252;&#54632;&#46104;&#50612; &#51080;&#51012; &#49104;&#47564; &#50500;&#45768;&#46972; Hibernate &#48176;&#54252;&#48376;&#51032; <code class="literal">src/</code> &#46356;&#47113;&#53664;&#47532; &#49549;&#50640; &#54252;&#54632;&#46104;&#50612; &#51080;&#45796;. 
            </p>
            <p>&#50864;&#47532;&#45716; &#53076;&#46300;&#47484; &#44036;&#47029;&#54868; &#49884;&#53412;&#44592; &#50948;&#54644; &#51109;&#47000;&#51032; &#50696;&#51228;&#50640;&#49436; DTD &#49440;&#50616;&#51012; &#49373;&#47029;&#54624; &#44163;&#51060;&#45796;. &#44536;&#44163;&#51008; &#47932;&#47200; &#50741;&#49496;&#51060; &#50500;&#45768;&#45796;. </p>
            <p>&#46160; &#44060;&#51032; <code class="literal">hibernate-mapping</code> &#53468;&#44536;&#46308; &#49324;&#51060;&#50640; <code class="literal">class</code> &#50836;&#49548;&#47484; &#54252;&#54632;&#49884;&#53020;&#46972;. &#47784;&#46304; &#50689;&#49549; &#50644;&#54000;&#54000; &#53364;&#47000;&#49828;&#46308;(&#45796;&#49884;&#44552; &#51333;&#49549; &#53364;&#47000;&#49828;&#46308;&#51068; &#49688; &#51080;&#44256;, &#44536;&#44163;&#51008; &#52395;&#48264;&#51704;-&#44553;&#51032; &#50644;&#54000;&#54000;&#46308;&#51060; &#50500;&#45768;&#45796;)&#51008; SQL &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#45236;&#51032; &#53580;&#51060;&#48660;&#50640; &#45824;&#54620; &#44536;&#47088; &#47588;&#54609;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;: 
            </p><pre class="programlisting">&lt;hibernate-mapping&gt;

    &lt;class name="events.Event" table="EVENTS"&gt;

    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>&#51648;&#44552;&#44620;&#51648; &#50864;&#47532;&#45716; &#44536; &#53580;&#51060;&#48660; &#45236;&#50640; &#51080;&#45716; &#54620; &#54665;&#50640; &#51032;&#54644; &#54364;&#54788;&#46108; &#44033;&#44033;&#51032; &#51064;&#49828;&#53556;&#49828;&#51064;, &#53364;&#47000;&#49828;&#51032; &#44061;&#52404;&#47484; &#50689;&#49549;&#54868; &#49884;&#53412;&#44256; &#47196;&#46300;&#49884;&#53412;&#45716; &#48169;&#48277;&#51012; Hibernate&#50640;&#44172; &#50508;&#47140;&#51452;&#50632;&#45796;. &#51060;&#51228; &#50864;&#47536;&#45712; &#53580;&#51060;&#48660; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412;&#50640; &#45824;&#54620; &#50976;&#51068; &#49885;&#48324;&#51088; &#54532;&#47196;&#54140;&#54000;
               &#47588;&#54609;&#51012; &#44228;&#49549; &#54665;&#54620;&#45796;. &#44172;&#45796;&#44032; &#50864;&#47532;&#45716; &#51060; &#49885;&#48324;&#51088;&#47484; &#52376;&#47532;&#54616;&#45716; &#44163;&#50640; &#51452;&#51032;&#47484; &#44592;&#50872;&#51060;&#44256;&#51088; &#50896;&#54616;&#51648; &#50506;&#51004;&#48064;&#47196;, &#50864;&#47532;&#45716; &#45824;&#50857; &#53412; &#54532;&#46972;&#51060;&#47672;&#47532; &#53412; &#52972;&#47100;&#50640; &#45824;&#54620; Hibernate&#51032; &#49885;&#48324;&#51088; &#49373;&#49457; &#48169;&#46020;&#47484; &#44396;&#49457;&#54620;&#45796;: 
            </p><pre class="programlisting">&lt;hibernate-mapping&gt;

    &lt;class name="events.Event" table="EVENTS"&gt;
        &lt;id name="id" column="EVENT_ID"&gt;
            &lt;generator class="native"/&gt;
        &lt;/id&gt;
    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>The <code class="literal">id</code> element is the declaration of the identifier property, <code class="literal">name="id"</code> declares the name of the Java property - Hibernate will use the getter and setter methods to access the property. The column
               attribute tells Hibernate which column of the <code class="literal">EVENTS</code> table we use for this primary key. The nested <code class="literal">generator</code> element specifies the identifier generation strategy, in this case we used <code class="literal">native</code>, which picks the best strategy depending on the configured database (dialect). Hibernate supports database generated, globally
               unique, as well as application assigned identifiers (or any strategy you have written an extension for). 
            </p>
            <p>&#47560;&#51648;&#47561;&#51004;&#47196; &#50864;&#47532;&#45716; &#47588;&#54609; &#54028;&#51068; &#49549;&#50640;&#49436; &#53364;&#47000;&#49828;&#51032; &#50689;&#49549; &#54532;&#47196;&#54140;&#54000;&#46308;&#50640; &#45824;&#54620; &#49440;&#50616;&#46308;&#51012; &#54252;&#54632;&#54620;&#45796;. &#46356;&#54260;&#53944;&#47196;, &#53364;&#47000;&#49828;&#51032; &#54532;&#47196;&#54140;&#54000;&#46308;&#51008; &#50689;&#49549;&#51201;&#51064; &#44163;&#51004;&#47196; &#44036;&#51452;&#46104;&#51648; &#50506;&#45716;&#45796;: </p><pre class="programlisting">
&lt;hibernate-mapping&gt;

    &lt;class name="events.Event" table="EVENTS"&gt;
        &lt;id name="id" column="EVENT_ID"&gt;
            &lt;generator class="native"/&gt;
        &lt;/id&gt;
        &lt;property name="date" type="timestamp" column="EVENT_DATE"/&gt;
        &lt;property name="title"/&gt;
    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p><code class="literal">id</code> &#50836;&#49548;&#51032; &#44221;&#50864;&#52376;&#47100;, <code class="literal">property</code> &#50836;&#49548;&#51032; <code class="literal">name</code> &#49549;&#49457;&#51008; &#49324;&#50857;&#54624; getter &#48143; setter &#47700;&#49548;&#46300;&#46308;&#51060; &#50612;&#45712; &#44163;&#51064;&#51648;&#47484; Hibernate&#50640;&#44172; &#50508;&#47140;&#51456;&#45796;. &#46384;&#46972;&#49436; &#51060; &#44221;&#50864;&#50640; Hibernate&#45716; <code class="literal">getDate()/setDate()</code> &#49104;&#47564; &#50500;&#45768;&#46972; <code class="literal">getTitle()/setTitle()</code>&#51012; &#52286;&#44172; &#46112; &#44163;&#51060;&#45796;. 
            </p>
            <p><code class="literal">date</code> &#54532;&#47196;&#54140;&#54000; &#47588;&#54609;&#51008; <code class="literal">column</code> &#49549;&#49457;&#51012; &#54252;&#54632;&#54616;&#45716;&#45936;, &#50780; <code class="literal">title</code>&#51008; <code class="literal">column</code> &#49549;&#49457;&#51012; &#54252;&#54632;&#54616;&#51648; &#50506;&#45716;&#44032;? <code class="literal">column</code> &#49549;&#49457;&#51060; &#50630;&#51012; &#44221;&#50864; Hibernate&#45716; &#46356;&#54260;&#53944;&#47196; &#52972;&#47100; &#51060;&#47492;&#51004;&#47196;&#49436; &#54532;&#47196;&#54140;&#54000; &#51060;&#47492;&#51012; &#49324;&#50857;&#54620;&#45796;. &#51060;&#44163;&#51008; &#50640; &#45824;&#54644; &#51096; &#46041;&#51089;&#54620;&#45796;. &#54616;&#51648;&#47564; <code class="literal">date</code>&#45716; &#45824;&#48512;&#48516;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640;&#49436; &#50696;&#50557;&#46108; &#53412;&#50892;&#46300;&#51060;&#50612;&#49436;, &#50864;&#47532;&#45716; &#44536;&#44163;&#51012; &#45796;&#47480; &#51060;&#47492;&#51004;&#47196; &#45908; &#51339;&#44172; &#47588;&#54609; &#49884;&#53416;&#45796;. 
            </p>
            <p>&#45796;&#51020; &#55141;&#48120;&#47196;&#50868; &#51216;&#51008; <code class="literal">title</code> &#47588;&#54609; &#46608;&#54620; <code class="literal">type</code> &#49549;&#49457;&#51012; &#44054;&#51648; &#50506;&#45716;&#45796;. &#50864;&#47532;&#44032; &#47588;&#54609;&#54028;&#51068;&#46308; &#49549;&#50640;&#49436; &#49440;&#50616;&#54616;&#44256; &#49324;&#50857;&#54616;&#45716; &#53440;&#51077;&#46308;&#51008; &#45817;&#49888;&#51060; &#50696;&#49345;&#54616;&#45716; Java &#45936;&#51060;&#53552; &#53440;&#51077;&#46308;&#51060; &#50500;&#45768;&#45796;. &#44536;&#44163;&#46308;&#51008; &#46608;&#54620; SQL &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53440;&#51077;&#46308;&#46020; &#50500;&#45768;&#45796;. &#51060;&#46308; &#53440;&#51077;&#46308;&#51008; &#51060;&#47480;&#48148; <span class="emphasis"><em>Hibernate &#47588;&#54609; &#53440;&#51077;&#46308;</em></span>, &#51593; Java &#53440;&#51077;&#46308;&#47196;&#48512;&#53552; SQL &#53440;&#51077;&#46308;&#47196; &#48320;&#54872;&#46112; &#49688; &#51080;&#44256; &#48152;&#45824;&#47196; SQL &#53440;&#51077;&#46308;&#47196;&#48512;&#53552; Java &#53440;&#51077;&#46308;&#47196; &#47588;&#54609;&#46112; &#49688; &#51080;&#45716; &#52968;&#48260;&#53552;&#46308;&#51060;&#45796;. &#45796;&#49884;&#47568;&#54644;, <code class="literal">type</code> &#49549;&#49457;&#51060; &#47588;&#54609; &#49549;&#50640; &#51316;&#51116;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864; Hibernate&#45716; &#51221;&#54869;&#54872; &#48320;&#54872; &#48143; &#47588;&#54609; &#53440;&#51077; &#44536; &#51088;&#52404;&#47484; &#44208;&#51221;&#54616;&#47140;&#44256; &#49884;&#46020;&#54624; &#44163;&#51060;&#45796;. &#47751;&#47751; &#44221;&#50864;&#46308;&#50640;&#49436; (Java &#53364;&#47000;&#49828;&#50640; &#45824;&#54620; Reflection&#51012; &#49324;&#50857;&#54616;&#45716;) &#51060; &#51088;&#46041;&#51201;&#51064; &#44160;&#52636;&#51008; &#45817;&#49888;&#51060;
               &#50696;&#49345;&#54616;&#44144;&#45208; &#54596;&#50836;&#47196; &#54616;&#45716; &#46356;&#54260;&#53944;&#47484; &#44054;&#51648; &#50506;&#51012; &#49688;&#46020; &#51080;&#45796;. &#51060;&#44163;&#51008; <code class="literal">date</code> &#54532;&#47196;&#54140;&#54000;&#47484; &#44032;&#51652; &#44221;&#50864;&#51060;&#45796;. Hibernate&#45716; &#44536; &#54532;&#47196;&#54140;&#54000;&#44032; SQL <code class="literal">date</code> &#52972;&#47100;, <code class="literal">timestamp</code> &#52972;&#47100; &#46608;&#45716; <code class="literal">time</code> &#52972;&#47100; &#51473; &#50612;&#45712; &#44163;&#51004;&#47196; &#47588;&#54609;&#46104;&#50612;&#50556; &#54616;&#45716;&#51648;&#47484; &#50508; &#49688;&#44032; &#50630;&#45796;. &#50864;&#47532;&#45716; <code class="literal">timestamp</code> &#52968;&#48260;&#53552;&#47484; &#44032;&#51652; &#54532;&#47196;&#54140;&#54000;&#47484; &#47588;&#54609;&#54632;&#51004;&#47196;&#50024; &#51204;&#52404; &#45216;&#51676;&#50752; &#49884;&#44036; &#51221;&#48372;&#47484; &#48372;&#51316;&#54616;&#44256; &#49910;&#45796;&#44256; &#49440;&#50616;&#54620;&#45796;. 
            </p>
            <p>&#45796;&#51020; &#47588;&#54609; &#54028;&#51068;&#51008; <code class="literal">Event</code> Java &#53364;&#47000;&#49828; &#49548;&#49828; &#54028;&#51068;&#44284; &#44057;&#51008; &#46356;&#47113;&#53664;&#47532; &#49549;&#50640; <code class="literal">Event.hbm.xml</code>&#47196;&#49436; &#51200;&#51109;&#46112; &#44163;&#51060;&#45796;. &#47588;&#54609; &#54028;&#51068;&#46308;&#50640; &#45824;&#54620; &#45348;&#51060;&#48141;&#51008; &#51076;&#51032;&#51201;&#51068; &#49688; &#51080;&#51648;&#47564;, &#51217;&#48120;&#49324; <code class="literal">hbm.xml</code>&#51008; Hibernate &#44060;&#48156;&#51088; &#44277;&#46041;&#52404; &#45236;&#50640;&#49436; &#52968;&#48292;&#49496;&#51060; &#46104;&#50632;&#45796;. &#46356;&#47113;&#53664;&#47532; &#44396;&#51312;&#45716; &#51060;&#51228; &#45796;&#51020;&#44284; &#44057;&#51012; &#44163;&#51060;&#45796;: 
            </p><pre class="programlisting">.
+lib
  &lt;Hibernate and third-party libraries&gt;
+src
  +events
    Event.java
    Event.hbm.xml</pre><p>&#50864;&#47532;&#45716; Hibernate&#51032; &#47700;&#51064; &#44396;&#49457;&#51012; &#44228;&#49549; &#54665;&#54620;&#45796;. </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-configuration"></a>1.2.3. Hibernate &#44396;&#49457;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#50864;&#47532;&#45716; &#51060;&#51228; &#51201;&#51208;&#54620; &#44275;&#50640; &#54620; &#44060;&#51032; &#50689;&#49549; &#53364;&#47000;&#49828;&#50752; &#44536;&#44163;&#51032; &#47588;&#54609; &#54028;&#51068;&#51012; &#44054;&#44256; &#51080;&#45796;. Hibernate&#47484; &#44396;&#49457;&#54624; &#52264;&#47168;&#51060;&#45796;. &#50864;&#47532;&#44032; &#51060;&#44163;&#51012; &#54665;&#54616;&#44592; &#51204;&#50640;, &#50864;&#47532;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47484; &#54596;&#50836;&#47196; &#54624; &#44163;&#51060;&#45796;. &#51088;&#48148; &#44592;&#48152;&#51032; &#47700;&#47784;&#47532;-&#45236; SQL
               DBMS&#51064; HSQL DB&#45716; HSQL DB &#50937; &#49324;&#51060;&#53944;&#50640;&#49436; &#45236;&#47140;&#48155;&#51012; &#49688; &#51080;&#45796;. &#49892;&#51228;&#47196;, &#45817;&#49888;&#51008; &#51060; &#45796;&#50868;&#47196;&#46300;&#50640;&#49436; &#50724;&#51649; <code class="literal">hsqldb.jar</code> &#47564;&#51012; &#54596;&#50836;&#47196; &#54620;&#45796;. &#44060;&#48156; &#54260;&#45908;&#51032; <code class="literal">lib/</code> &#46356;&#47113;&#53664;&#47532; &#49549;&#50640; &#51060; &#54028;&#51068;&#51012; &#50948;&#52824;&#51648;&#50892;&#46972;. 
            </p>
            <p>&#44060;&#48156; &#46356;&#47113;&#53664;&#47532;&#51032; &#47336;&#53944;&#50640; <code class="literal">data</code>&#47196; &#47749;&#47749;&#46108; &#46356;&#47113;&#53664;&#47532;&#47484; &#49373;&#49457;&#49884;&#53020;&#46972; - &#51060; &#46356;&#47113;&#53664;&#47532;&#45716; HSQL DB&#44032; &#44536;&#44163;&#51032; &#45936;&#51060;&#53552; &#54028;&#51068;&#46308;&#51012; &#51200;&#51109;&#54616;&#44172; &#46112; &#51109;&#49548;&#51060;&#45796;. &#51060;&#51228; &#51060; &#45936;&#51060;&#53552; &#46356;&#47113;&#53664;&#47532;&#50640;&#49436; <code class="literal">java -classpath ../lib/hsqldb.jar org.hsqldb.Server</code>&#47484; &#49892;&#54665;&#49884;&#53020;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47484; &#49884;&#51089;&#49884;&#53020;&#46972;. &#45817;&#49888;&#51008; &#44536;&#44163;&#51060; &#49884;&#51089;&#46104;&#44256; &#51060;&#44163;&#51008; &#50864;&#47532;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060; &#45208;&#51473;&#50640; &#50672;&#44208;&#54616;&#44172; &#46112; &#51109;&#49548;&#51064;, &#54616;&#45208;&#51032; TCP/IP &#49548;&#53011;&#50640; &#48148;&#51064;&#46300; &#46104;&#45716; &#44163;&#51012; &#48380; &#49688; &#51080;&#45796;. &#47564;&#51068; &#51060; &#53916;&#53664;&#47532;&#50620; &#46041;&#50504;&#50640; &#45817;&#49888;&#51060; &#49352; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196;
               &#49884;&#51089;&#54616;&#44256;&#51088; &#50896;&#54624; &#44221;&#50864;, HSQL DB&#47484; &#49511;&#45796;&#50868;&#49884;&#53412;&#44256;(&#50812;&#46020;&#50864;&#50640;&#49436; <code class="literal">CTRL + C</code>&#47484; &#45580;&#47084;&#46972;), <code class="literal">data/</code> &#46356;&#47113;&#53664;&#47532; &#45236;&#50640; &#51080;&#45716; &#47784;&#46304; &#54028;&#51068;&#46308;&#51012; &#49325;&#51228;&#54616;&#44256; &#45796;&#49884; HSQL DB&#47484; &#49884;&#51089;&#54616;&#46972;. 
            </p>
            <p>Hibernate&#45716; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#45236;&#50640;&#49436; &#51060; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#50672;&#44208;&#54616;&#45716; &#44228;&#52789;&#51060;&#44256;, &#46384;&#46972;&#49436; &#44536;&#44163;&#51008; &#52964;&#45349;&#49496; &#51221;&#48372;&#47484; &#54596;&#50836;&#47196; &#54620;&#45796;. &#52964;&#45349;&#49496;&#46308;&#51008; &#47560;&#52268;&#44032;&#51648;&#47196; &#44396;&#49457;&#46104;&#50612;&#50556; &#54616;&#45716; &#54616;&#45208;&#51032; JDBC &#52964;&#45349;&#49496; &#54400;&#51012; &#53685;&#54644; &#54665;&#54644;&#51652;&#45796;. Hibernate
               &#48176;&#54252;&#48376;&#51008; &#47751;&#47751; &#50724;&#54536; &#49548;&#49828; JDBC &#52964;&#45349;&#49496; &#54400;&#47553; &#46020;&#44396;&#46308;&#51012; &#54252;&#54632;&#54616;&#44256; &#51080;&#51648;&#47564;, &#51060; &#53916;&#53664;&#47532;&#50620;&#50640;&#49436;&#45716; Hibernate&#50640; &#51032;&#54644; &#48120;&#47532; &#48716;&#46300;&#46108; &#52964;&#45349;&#49496; &#54400;&#47553;&#51012; &#49324;&#50857;&#54624; &#44163;&#51060;&#45796;. &#45817;&#49888;&#51060; &#54596;&#49688; &#46972;&#51060;&#48652;&#47084;&#47532;&#47484; &#45817;&#49888;&#51032; classpath &#49549;&#50640; &#48373;&#49324;&#54644;&#50556;
               &#54616;&#44256; &#47564;&#51068; &#45817;&#49888;&#51060; &#51228;&#54408;-&#53945;&#51669;&#51032; &#51228;3&#51032; JDBC &#54400;&#47553; &#49548;&#54532;&#53944;&#50920;&#50612;&#47484; &#49324;&#50857;&#54616;&#44256;&#51088; &#50896;&#54624; &#44221;&#50864;&#50640;&#45716; &#45796;&#47480; &#52964;&#45349;&#49496; &#54400;&#47553; &#49444;&#51221;&#46308;&#51012; &#49324;&#50857;&#54644;&#50556; &#54632;&#51012; &#45432;&#53944;&#54616;&#46972;. 
            </p>
            <p>Hibernate&#51032; &#44396;&#49457;&#51012; &#50948;&#54644;, &#50864;&#47532;&#45716; &#54620; &#44060;&#51032; &#44036;&#45800;&#54620; <code class="literal">hibernate.properties</code> &#54028;&#51068;, &#54620; &#44060;&#51032; &#50557;&#44036; &#45908; &#49464;&#47144;&#46108; <code class="literal">hibernate.cfg.xml</code> &#54028;&#51068;, &#46608;&#45716; &#49900;&#51648;&#50612; &#50756;&#51204;&#54620; &#54532;&#47196;&#44536;&#47016; &#49345;&#51032; &#49444;&#51221;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. &#45824;&#48512;&#48516;&#51032; &#49324;&#50857;&#51088;&#46308;&#51008; XMl &#44396;&#49457; &#54028;&#51068;&#51012; &#49440;&#54840;&#54620;&#45796;: 
            </p><pre class="programlisting">&lt;?xml version='1.0' encoding='utf-8'?&gt;
&lt;!DOCTYPE hibernate-configuration PUBLIC
        "-//Hibernate/Hibernate Configuration DTD 3.0//EN"
        "http://hibernate.sourceforge.net/hibernate-configuration-3.0.dtd"&gt;

&lt;hibernate-configuration&gt;

    &lt;session-factory&gt;

        &lt;!-- Database connection settings --&gt;
        &lt;property name="connection.driver_class"&gt;org.hsqldb.jdbcDriver&lt;/property&gt;
        &lt;property name="connection.url"&gt;jdbc:hsqldb:hsql://localhost&lt;/property&gt;
        &lt;property name="connection.username"&gt;sa&lt;/property&gt;
        &lt;property name="connection.password"&gt;&lt;/property&gt;

        &lt;!-- JDBC connection pool (use the built-in) --&gt;
        &lt;property name="connection.pool_size"&gt;1&lt;/property&gt;

        &lt;!-- SQL dialect --&gt;
        &lt;property name="dialect"&gt;org.hibernate.dialect.HSQLDialect&lt;/property&gt;

        &lt;!-- Enable Hibernate's automatic session context management --&gt;
        &lt;property name="current_session_context_class"&gt;thread&lt;/property&gt;

        &lt;!-- Disable the second-level cache  --&gt;
        &lt;property name="cache.provider_class"&gt;org.hibernate.cache.NoCacheProvider&lt;/property&gt;

        &lt;!-- Echo all executed SQL to stdout --&gt;
        &lt;property name="show_sql"&gt;true&lt;/property&gt;

        &lt;!-- Drop and re-create the database schema on startup --&gt;
        &lt;property name="hbm2ddl.auto"&gt;create&lt;/property&gt;

        &lt;mapping resource="events/Event.hbm.xml"/&gt;

    &lt;/session-factory&gt;

&lt;/hibernate-configuration&gt;</pre><p>&#51060; XML &#44396;&#49457;&#51060; &#45796;&#47480; DTD&#47484; &#49324;&#50857;&#54632;&#51012; &#45432;&#53944;&#54616;&#46972;. &#50864;&#47532;&#45716; Hibernate&#51032; <code class="literal">SessionFactory</code> -&#53945;&#51221; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#45824;&#54644; &#52293;&#51076;&#51060; &#51080;&#45716; &#51204;&#50669; &#54057;&#53664;&#47532;-&#47484; &#44396;&#49457;&#54620;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#50668;&#47084; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#46308;&#51012; &#44054;&#44256; &#51080;&#45796;&#47732;, (&#48372;&#45796; &#49772;&#50868; &#49884;&#51089;&#51012; &#50948;&#54644;) &#47751; &#44060;&#51032; &#44396;&#49457; &#54028;&#51068;&#46308; &#49549;&#50640; &#50668;&#47084; &#44060;&#51032; <code class="literal">&lt;session-factory&gt;</code> &#44396;&#49457;&#46308;&#51012; &#49324;&#50857;&#54616;&#46972;. 
            </p>
            <p>&#52376;&#51020; &#45348; &#44060;&#51032; <code class="literal">property</code> &#50836;&#49548;&#46308;&#51008; JDBC &#52964;&#45349;&#49496;&#51012; &#50948;&#54620; &#54596;&#49688; &#44396;&#49457;&#51012; &#54252;&#54632;&#54620;&#45796;. dialect <code class="literal">property</code> &#50836;&#49548;&#45716; Hibernate&#44032; &#48156;&#49373;&#49884;&#53412;&#45716; &#53945;&#48324;&#54620; SQL &#51060;&#54805;(&#30064;&#24418;)&#51012; &#51648;&#51221;&#54620;&#45796;. <code class="literal">hbm2ddl.auto</code> &#50741;&#49496;&#51008; -&#51649;&#51217; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49549;&#51004;&#47196;- &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49828;&#53412;&#47560;&#51032; &#51088;&#46041;&#51201;&#51064; &#49373;&#49457;&#51012; &#54876;&#49457;&#54868; &#49884;&#53416;&#45796;. &#47932;&#47200; &#51060;&#44163;&#51008; (config &#50741;&#49496;&#51012; &#51228;&#44144;&#54632;&#51004;&#47196;&#50024;) &#48708;&#54876;&#49457;&#54868; &#49884;&#53420; &#49688; &#51080;&#44144;&#45208; <code class="literal">SchemaExport</code> Ant &#53468;&#49828;&#53356;&#51032; &#46020;&#50880;&#51004;&#47196; &#54028;&#51068;&#47196; &#47532;&#45796;&#51060;&#47113;&#53944; &#46112; &#49688; &#51080;&#45796;. &#47560;&#51648;&#47561;&#51004;&#47196; &#50864;&#47532;&#45716; &#50689;&#49549; &#53364;&#47000;&#49828;&#46308;&#51012; &#50948;&#54620; &#47588;&#54609; &#54028;&#51068;(&#46308;)&#51012; &#52628;&#44032;&#49884;&#53416;&#45796;. 
            </p>
            <p>&#51060; &#54028;&#51068;&#51012; &#49548;&#49828; &#46356;&#47113;&#53664;&#47532; &#49549;&#51004;&#47196; &#48373;&#49324;&#54616;&#44256;, &#46384;&#46972;&#49436; &#44536;&#44163;&#51008; classpath&#51032; &#47336;&#53944;&#50640;&#49436; &#45149;&#45216; &#44163;&#51060;&#45796;. Hibernate&#45716; &#49884;&#51089; &#49884;&#50640; classpath&#51032; &#47336;&#53944;&#50640;&#49436; <code class="literal">hibernate.cfg.xml</code>&#47196; &#47749;&#47749;&#46108; &#54028;&#51068;&#51012; &#51088;&#46041;&#51201;&#51004;&#47196; &#52286;&#45716;&#45796;. 
            </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-ant"></a>1.2.4. Ant&#47196; &#48716;&#46300;&#54616;&#44592;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#50864;&#47532;&#45716; &#51060;&#51228; Ant&#47196; &#53916;&#53664;&#47532;&#50620;&#51012; &#48716;&#46300;&#54624; &#44163;&#51060;&#45796;. &#45817;&#49888;&#51008; Ant&#47484; &#49444;&#52824;&#54624; &#54596;&#50836;&#44032; &#51080;&#51012; &#44163;&#51060;&#45796; - <a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://ant.apache.org/bindownload.cgi" target="_top">Ant &#45236;&#47140;&#48155;&#44592; &#54168;&#51060;&#51648;</a>&#50640;&#49436; Ant&#47484; &#50619;&#50612;&#46972;. Ant&#47484; &#49444;&#52824;&#54616;&#45716; &#48169;&#48277;&#51008; &#50668;&#44592;&#49436; &#45796;&#47336;&#51648; &#50506;&#51012; &#44163;&#51060;&#45796;. <a xmlns:xlink="http://www.w3.org/1999/xlink" href="http://ant.apache.org/manual/index.html" target="_top">Ant &#47588;&#45684;&#50620;</a>&#51012; &#52280;&#51312;&#54616;&#44600; &#48148;&#46976;&#45796;. &#45817;&#49888;&#51060; Ant&#47484; &#49444;&#52824;&#54620; &#54980;&#50640;, &#50864;&#47532;&#45716; &#48716;&#46300;&#54028;&#51068; &#49373;&#49457;&#51012; &#49884;&#51089;&#54624; &#49688; &#51080;&#45796;. &#44536;&#44163;&#51008; <code class="literal">build.xml</code>&#47196; &#47749;&#47749;&#46104;&#44256; &#44060;&#48156; &#46356;&#47113;&#53664;&#47532; &#49549;&#50640; &#51649;&#51217; &#50948;&#52824;&#46112; &#44163;&#51060;&#45796;. 
            </p>
            <p>&#44592;&#48376; &#48716;&#46300; &#54028;&#51068;&#51008; &#45796;&#51020;&#44284; &#44057;&#45796;: </p><pre class="programlisting">&lt;project name="hibernate-tutorial" default="compile"&gt;

    &lt;property name="sourcedir" value="${basedir}/src"/&gt;
    &lt;property name="targetdir" value="${basedir}/bin"/&gt;
    &lt;property name="librarydir" value="${basedir}/lib"/&gt;

    &lt;path id="libraries"&gt;
        &lt;fileset dir="${librarydir}"&gt;
            &lt;include name="*.jar"/&gt;
        &lt;/fileset&gt;
    &lt;/path&gt;

    &lt;target name="clean"&gt;
        &lt;delete dir="${targetdir}"/&gt;
        &lt;mkdir dir="${targetdir}"/&gt;
    &lt;/target&gt;

    &lt;target name="compile" depends="clean, copy-resources"&gt;
      &lt;javac srcdir="${sourcedir}"
             destdir="${targetdir}"
             classpathref="libraries"/&gt;
    &lt;/target&gt;

    &lt;target name="copy-resources"&gt;
        &lt;copy todir="${targetdir}"&gt;
            &lt;fileset dir="${sourcedir}"&gt;
                &lt;exclude name="**/*.java"/&gt;
            &lt;/fileset&gt;
        &lt;/copy&gt;
    &lt;/target&gt;

&lt;/project&gt;</pre><p>&#51060;&#44163;&#51008; <code class="literal">.jar</code>&#47196; &#45149;&#45208;&#45716; lib &#46356;&#47113;&#53664;&#47532; &#45236;&#50640; &#51080;&#45716; &#47784;&#46304; &#54028;&#51068;&#46308;&#51012; &#52980;&#54028;&#51068;&#50640; &#49324;&#50857;&#46104;&#45716; classpath&#50640; &#52628;&#44032;&#54616;&#46020;&#47197; Ant&#50640;&#44172; &#50508;&#47140;&#51460; &#44163;&#51060;&#45796;. &#44536;&#44163;&#51008; &#46608;&#54620; &#47784;&#46304; &#48708;-Java &#49548;&#49828; &#54028;&#51068;&#46308;&#51012; &#45824;&#49345; &#46356;&#47113;&#53664;&#47532;&#47196; &#48373;&#49324;&#54624; &#44163;&#51060;&#45796;. &#50696;&#47484; &#46308;&#47732;, &#44396;&#49457;
               &#48143; Hibernate &#47588;&#54609; &#54028;&#51068;&#46308;. &#47564;&#51068; &#45817;&#49888;&#51060; Ant&#47484; &#51060;&#51228; &#49892;&#54665;&#54624; &#44221;&#50864;, &#45817;&#49888;&#51008; &#45796;&#51020; &#52636;&#47141;&#51012; &#50619;&#44172; &#46112; &#44163;&#51060;&#45796;: 
            </p><pre class="programlisting">C:\hibernateTutorial\&gt;ant
Buildfile: build.xml

copy-resources:
     [copy] Copying 2 files to C:\hibernateTutorial\bin

compile:
    [javac] Compiling 1 source file to C:\hibernateTutorial\bin

BUILD SUCCESSFUL
Total time: 1 second </pre></div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-helpers"></a>1.2.5. &#49884;&#51089;&#44284; helper&#46308;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#47751;&#47751; <code class="literal">Event</code> &#44061;&#52404;&#46308;&#51012; &#47196;&#46300;&#49884;&#53412;&#44256; &#51200;&#51109;&#54624; &#52264;&#47168;&#51060;&#51648;&#47564;, &#47676;&#51200; &#50864;&#47532;&#45716; &#50612;&#46500; &#51064;&#54532;&#46972;&#49828;&#53944;&#47085;&#52376; &#53076;&#46300;&#47196; &#49444;&#51221;&#51012; &#50756;&#47308;&#54644;&#50556; &#54620;&#45796;. &#50864;&#47532;&#45716; Hibernate&#47484; &#49884;&#51089;&#54644;&#50556; &#54620;&#45796;. &#51060; &#49884;&#51089;&#51008; &#51204;&#50669; <code class="literal">SessionFactory</code> &#44061;&#52404;&#47484; &#48716;&#46300;&#54616;&#44256; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#45236;&#50640;&#49436; &#50857;&#51060;&#54620; &#51217;&#44540;&#51012; &#50948;&#54644; &#44536;&#44163;&#51012; &#50612;&#46500; &#44275;&#50640; &#51200;&#51109;&#54616;&#45716; &#44163;&#51012; &#54252;&#54632;&#54620;&#45796;. <code class="literal">SessionFactory</code>&#45716; &#49352;&#47196;&#50868; <code class="literal">Session</code>&#46308;&#51012; &#50676; &#49688; &#51080;&#45796;. <code class="literal">Session</code>&#51008; &#51089;&#50629;&#51032; &#45800;&#51068;-&#50416;&#47112;&#46300; &#45800;&#50948;&#47484; &#54364;&#54788;&#54616;&#47728;, <code class="literal">SessionFactory</code>&#45716; &#54620;&#48264; &#52488;&#44592;&#54868; &#46104;&#45716; &#54616;&#45208;&#51032; thread-safe &#51204;&#50669; &#44061;&#52404;&#51060;&#45796;. 
            </p>
            <p>&#50864;&#47532;&#45716; &#49884;&#51089;&#51012; &#52376;&#47532;&#54616;&#44256; <code class="literal">Session</code> &#52376;&#47532;&#47484; &#54200;&#47532;&#54616;&#44172; &#54644;&#51452;&#45716; <code class="literal">HibernateUtil</code> helper &#53364;&#47000;&#49828;&#47484; &#49373;&#49457;&#49884;&#53420; &#44163;&#51060;&#45796;. &#51060;&#47480;&#48148; <span class="emphasis"><em>ThreadLocal Session</em></span> &#54056;&#53556;&#51060; &#50668;&#44592;&#49436; &#50976;&#50857;&#54616;&#47728;, &#50864;&#47532;&#45716; &#54788;&#51116;&#51032; &#51089;&#50629; &#45800;&#50948;&#47484; &#54788;&#51116;&#51032; &#50416;&#47112;&#46300;&#50752; &#50672;&#44288;&#51648;&#50892; &#50976;&#51648;&#54620;&#45796;. &#44396;&#54788;&#51012; &#49332;&#54196;&#48372;&#51088;: 
            </p><pre class="programlisting">package util;

import org.hibernate.*;
import org.hibernate.cfg.*;

public class HibernateUtil {

    private static final SessionFactory sessionFactory;

    static {
        try {
            // Create the SessionFactory from hibernate.cfg.xml
            sessionFactory = new Configuration().configure().buildSessionFactory();
        } catch (Throwable ex) {
            // Make sure you log the exception, as it might be swallowed
            System.err.println("Initial SessionFactory creation failed." + ex);
            throw new ExceptionInInitializerError(ex);
        }
    }

    public static SessionFactory getSessionFactory() {
        return sessionFactory;
    }

}</pre><p>&#51060; &#53364;&#47000;&#49828;&#45716; (&#53364;&#47000;&#49828;&#44032; &#47196;&#46300;&#46112; &#46412; JVM&#50640; &#51032;&#54644; &#54620;&#48264; &#54840;&#52636;&#46104;&#45716;) &#44536;&#44163;&#51032; static &#52488;&#44592;&#51088; &#45236;&#50640; &#51204;&#50669; <code class="literal">SessionFactory</code>&#47484; &#49328;&#52636;&#54624; &#49104;&#47564; &#50500;&#45768;&#46972; &#46608;&#54620; &#54788;&#51116; &#50416;&#47112;&#46300;&#50640; &#45824;&#54620; <code class="literal">Session</code>&#51012; &#49548;&#50976;&#54616;&#45716; <code class="literal">ThreadLocal</code> &#48320;&#49688;&#47484; &#44054;&#45716;&#45796;. &#45817;&#49888;&#51060; <code class="literal">HibernateUtil.getCurrentSession()</code>&#51012; &#54840;&#52636;&#54616;&#45716; &#49884;&#51216;&#50640;&#45716; &#47928;&#51228;&#44032; &#50630;&#51004;&#47728;, &#44536;&#44163;&#51008; &#54637;&#49345; &#46041;&#51068; &#50416;&#47112;&#46300; &#45236;&#50640; &#46041;&#51068;&#54620; Hibernate &#51089;&#50629; &#45800;&#50948;&#47484; &#48152;&#54872;&#54624; &#44163;&#51060;&#45796;. <code class="literal">HibernateUtil.closeSession()</code>&#50640; &#45824;&#54620; &#54840;&#52636;&#51008; &#50416;&#47112;&#46300;&#50752; &#54788;&#51116; &#50672;&#44288;&#46104;&#50612; &#51080;&#45716; &#51089;&#50629; &#45800;&#50948;&#47484; &#51333;&#47308;&#49884;&#53416;&#45796;. 
            </p>
            <p>&#45817;&#49888;&#51060; &#51060; helper&#47484; &#49324;&#50857;&#54616;&#44592; &#51204;&#50640; thread-local &#48320;&#49688;&#46308;&#50640; &#45824;&#54620; Java &#44060;&#45392;&#51012; &#54869;&#49892;&#55176; &#51060;&#54644;&#54616;&#46020;&#47197; &#54616;&#46972;. &#48372;&#45796; &#44053;&#47141;&#54620; <code class="literal">HibernateUtil</code> helper&#45716; http://caveatemptor.hibernate.org/&#50640; &#51080;&#45716; <code class="literal">CaveatEmptor</code> &#49104;&#47564; &#50500;&#45768;&#46972; "Java Persistence with Hibernate" &#52293;&#50640;&#49436; &#52286;&#51012; &#49688; &#51080;&#45796;. &#45817;&#49888;&#51060; J2EE &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#45236;&#50640; Hibernate&#47484; &#48176;&#52824;&#54624; &#44221;&#50864;&#50640; &#51060; &#53364;&#47000;&#49828;&#45716; &#54596;&#49688;&#51201;&#51060;&#51648; &#50506;&#45796;: &#54616;&#45208;&#51032; <code class="literal">Session</code>&#51008; &#54788;&#51116;&#51032; JTA &#53944;&#47004;&#51117;&#49496;&#50640; &#51088;&#46041;&#51201;&#51004;&#47196; &#48148;&#51064;&#46300; &#46112; &#44163;&#51060;&#44256; &#45817;&#49888;&#51008; JNDI&#47484; &#53685;&#54644; <code class="literal">SessionFactory</code>&#47484; &#47337;&#50629;&#54624; &#49688; &#51080;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; JBoss AS&#47484; &#49324;&#50857;&#54624; &#44221;&#50864;, Hibernate&#45716; &#44288;&#47532;&#46104;&#45716; &#49884;&#49828;&#53596; &#49436;&#48708;&#49828;&#47196;&#49436; &#48176;&#52824;&#46112; &#49688; &#51080;&#44256; <code class="literal">SessionFactory</code>&#47484; JNDI &#51060;&#47492;&#50640; &#51088;&#46041;&#51201;&#51004;&#47196; &#48148;&#51064;&#46300;&#49884;&#53420; &#49688; &#51080;&#51012; &#44163;&#51060;&#45796;. 
            </p>
            <p>&#44060;&#48156; &#49548;&#49828; &#46356;&#47113;&#53664;&#47532; &#49549;&#50640; <code class="literal">HibernateUtil.java</code> &#47484; &#50948;&#52824;&#51648;&#50864;&#44256;, &#45796;&#51020;&#51004;&#47196; <code class="literal">Event.java</code>&#47484; &#50948;&#52824;&#51648;&#50892;&#46972;: 
            </p><pre class="programlisting">.
+lib
  &lt;Hibernate and third-party libraries&gt;
+src
  +events
    Event.java
    Event.hbm.xml
  +util
    HibernateUtil.java
  hibernate.cfg.xml
+data
build.xml</pre><p>&#51060;&#44163;&#51008; &#47928;&#51228; &#50630;&#51060; &#45796;&#49884; &#52980;&#54028;&#51068; &#46112; &#44163;&#51060;&#45796;. &#50864;&#47532;&#45716; &#47560;&#51648;&#47561;&#51004;&#47196; &#47196;&#44613; &#49884;&#49828;&#53596;&#51012; &#44396;&#49457;&#54624; &#54596;&#50836;&#44032; &#51080;&#45796; - Hibernate&#45716; commons logging&#47484; &#49324;&#50857;&#54616;&#44256; Log4j&#50752; JDK 1.4 &#49324;&#51060;&#51032; &#49440;&#53469;&#51008; &#45817;&#49888;&#51032; &#47787;&#51004;&#47196; &#45224;&#44200;&#46164;&#45796;.
               &#45824;&#48512;&#48516;&#51032; &#44060;&#48156;&#51088;&#46308;&#51008; Log4j&#47484; &#49440;&#54840;&#54620;&#45796;: Hibernate &#48176;&#54252;&#48376;&#50640; &#51080;&#45716; <code class="literal">log4j.properties</code>(&#51060;&#44163;&#51008; &#46356;&#47113;&#53664;&#47532; <code class="literal">etc/</code> &#45236;&#50640; &#51080;&#45796;)&#47484; <code class="literal">src</code> &#46356;&#47113;&#53664;&#47532;&#47196; &#48373;&#49324;&#54616;&#44256;, &#45796;&#51020;&#51004;&#47196; <code class="literal">hibernate.cfg.xml</code>&#51012; &#48373;&#49324;&#54616;&#46972;. &#50696;&#51228; &#44396;&#49457;&#51012; &#49332;&#54196;&#48372;&#44256; &#45817;&#49888;&#51060; &#45908; &#47566;&#51008; verbose &#52636;&#47141;&#51012; &#50896;&#54624; &#44221;&#50864;&#50640; &#49444;&#51221;&#46308;&#51012; &#48320;&#44221;&#54616;&#46972;. &#46356;&#54260;&#53944;&#47196; Hibernate &#49884;&#51089; &#47700;&#49884;&#51648;&#45716; stdout &#49345;&#50640; &#48372;&#50668;&#51652;&#45796;. 
            </p>
            <p>&#53916;&#53664;&#47532;&#50620; &#51064;&#54532;&#46972;&#49828;&#53944;&#47085;&#52376;&#45716; &#50756;&#51204;&#54616;&#45796; - &#44536;&#47532;&#44256; &#50864;&#47532;&#45716; Hibernate&#47196; &#50612;&#46500; &#49892;&#51228; &#51089;&#50629;&#51012; &#54665;&#54624; &#51456;&#48708;&#44032; &#46104;&#50612; &#51080;&#45796;. </p>
         </div>
         <div class="sect2" lang="ko-KR">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a name="tutorial-firstapp-workingpersistence"></a>1.2.6. &#44061;&#52404; &#47196;&#46377;&#44284; &#44061;&#52404; &#51200;&#51109;
                     </h3>
                  </div>
               </div>
            </div>
            <p>&#47560;&#51648;&#47561;&#51004;&#47196; &#50864;&#47532;&#45716; &#44061;&#52404;&#46308;&#51012; &#47196;&#46300;&#49884;&#53412;&#44256; &#51200;&#51109;&#54616;&#45716;&#45936; Hibernate&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45796;. &#50864;&#47532;&#45716; &#54620; &#44060;&#51032; <code class="literal">main()</code> &#47700;&#49548;&#46300;&#47484; &#44032;&#51652; &#54620; &#44060;&#51032; <code class="literal">EventManager</code> &#53364;&#47000;&#49828;&#47484; &#51089;&#49457;&#54620;&#45796;: 
            </p><pre class="programlisting">package events;
import org.hibernate.Session;

import java.util.Date;

import util.HibernateUtil;

public class EventManager {

    public static void main(String[] args) {
        EventManager mgr = new EventManager();

        if (args[0].equals("store")) {
            mgr.createAndStoreEvent("My Event", new Date());
        }

        HibernateUtil.getSessionFactory().close();
    }

    private void createAndStoreEvent(String title, Date theDate) {

        Session session = HibernateUtil.getSessionFactory().getCurrentSession();

        session.beginTransaction();

        Event theEvent = new Event();
        theEvent.setTitle(title);
        theEvent.setDate(theDate);

        session.save(theEvent);

        session.getTransaction().commit();
    }

}</pre><p>&#50864;&#47532;&#45716; &#54620; &#44060;&#51032; &#49352;&#47196;&#50868; <code class="literal">Event</code> &#44061;&#52404;&#47484; &#49373;&#49457;&#49884;&#53412;&#44256;, &#44536;&#44163;&#51012; Hibernate&#50640;&#44172; &#44148;&#45348;&#51456;&#45796;. Hibernate&#45716; &#51060;&#51228; SQL&#51012; &#52376;&#47532;&#54616;&#44256; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49345;&#50640;&#49436; <code class="literal">INSERT</code>&#46308;&#51012; &#49892;&#54665;&#49884;&#53416;&#45796;. -&#50864;&#47532;&#44032; &#51060;&#44163;&#51012; &#49892;&#54665;&#54616;&#44592; &#51204;&#50640; &#53076;&#46300;&#47484; &#52376;&#47532;&#54616;&#45716;- <code class="literal">Session</code>&#44284; <code class="literal">Transaction</code>&#51012; &#49332;&#54196;&#48372;&#51088;. 
            </p>
            <p><code class="literal">Session</code>&#51008; &#54620; &#44060;&#51032; &#51089;&#50629; &#45800;&#50948;&#51060;&#45796;. &#51648;&#44552;&#48512;&#53552; &#50864;&#47532;&#45716; &#45800;&#49704;&#54632;&#51012; &#50976;&#51648;&#54624; &#44163;&#51060;&#44256; Hibernate <code class="literal">Session</code>&#44284; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53944;&#47004;&#51117;&#49496; &#49324;&#51060;&#51032; &#51068;-&#45824;-&#51068; &#44284;&#47549;&#54805;(granularity)&#51012; &#44032;&#51221;&#54624; &#44163;&#51060;&#45796;. &#49892;&#51228; &#44592;&#48152; &#53944;&#47004;&#51117;&#49496; &#49884;&#49828;&#53596;&#51004;&#47196;&#48512;&#53552; &#50864;&#47532;&#51032; &#49548;&#49828;&#47484; &#51008;&#54224;&#49884;&#53412;&#44592; &#50948;&#54644;(&#51060; &#44221;&#50864; &#53685;&#49345;&#51032; JDBC&#51060;&#51648;&#47564;, &#44536;&#44163;&#51008; &#46608;&#54620; JTA&#50640;&#46020; &#49892;&#54665;&#46108;&#45796;)
               &#50864;&#47532;&#45716; Hibernate <code class="literal">Session</code> &#49345;&#50640;&#49436; &#51060;&#50857; &#44032;&#45733;&#54620; <code class="literal">Transaction</code> API&#47484; &#49324;&#50857;&#54620;&#45796;. 
            </p>
            <p><code class="literal">sessionFactory.getCurrentSession()</code>&#51008; &#47924;&#50631;&#51012; &#54665;&#54616;&#45716;&#44032;? &#47676;&#51200; &#45817;&#49888;&#51008; &#45817;&#49888;&#51060; (<code class="literal">HibernateUtil</code> &#45909;&#48516;&#50640; &#49789;&#44172;) <code class="literal">SessionFactory</code>&#51012; &#45817;&#49888;&#51060; &#49548;&#50976;&#54616;&#44256; &#51080;&#45796;&#47732;, &#50896;&#54616;&#45716; &#47564;&#53372; &#50612;&#46356;&#49436;&#46304; &#50668;&#47084;&#48264; &#44536;&#44163;&#51012; &#54840;&#52636;&#54624; &#49688; &#51080;&#45796;. <code class="literal">getCurrentSession()</code> &#47700;&#49548;&#46300;&#45716; &#54637;&#49345; "&#54788;&#51116;&#51032;" &#51089;&#50629; &#45800;&#50948;&#47484; &#48152;&#54872;&#54620;&#45796;. &#50864;&#47532;&#44032; <code class="literal">hibernate.cfg.xml</code> &#45236;&#50640;&#49436; &#51060; &#47588;&#52964;&#45768;&#51608;&#50640; &#45824;&#54620; &#44396;&#49457; &#50741;&#49496;&#51012; "thread"&#47196; &#51204;&#54872;&#49884;&#53040;&#51020;&#51012; &#44592;&#50613;&#54616;&#45716;&#44032;? &#44536;&#47084;&#48064;&#47196; &#51089;&#50629;&#51032; &#54788;&#51116; &#45800;&#50948;&#45716; &#50864;&#47532;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49892;&#54665;&#49884;&#53412;&#45716; &#54788;&#51116; &#51088;&#48148; &#50416;&#47112;&#46300;&#50640; &#47926;&#50668; &#51080;&#45796;. &#54616;&#51648;&#47564; &#51060;&#44163;&#51008; &#51204;&#52404; &#44536;&#47548;&#51060; &#50500;&#45768;&#47728;, &#45817;&#49888;&#51008;
               &#46608;&#54620; scope(&#50689;&#50669;), &#51089;&#50629; &#45800;&#50948;&#44032; &#49884;&#51089;&#46112; &#46412;&#50752; &#51089;&#50629; &#45800;&#50948;&#44032; &#51333;&#47308;&#46112; &#46412;&#47484; &#44256;&#47140;&#54644;&#50556; &#54620;&#45796;. 
            </p>
            <p><code class="literal">Session</code>&#51008; &#44536;&#44163;&#51060; &#52376;&#51020;&#51004;&#47196; &#54596;&#50836;&#47196; &#46104;&#44256; <code class="literal">getCurrentSession()</code>&#50640; &#45824;&#54620; &#52395; &#48264;&#51704; &#54840;&#52636;&#51060; &#51060;&#47336;&#50612;&#51656; &#46412; &#49884;&#51089;&#46108;&#45796;. &#44536;&#46412; &#44536;&#44163;&#51008; Hibernate&#50640; &#51032;&#54644; &#54788;&#51116;&#51032; &#50416;&#47112;&#46300;&#50640; &#48148;&#51064;&#46300; &#46108;&#45796;. &#52964;&#48139;&#46104;&#46304; &#47204;&#48177;&#46104;&#46304; &#44036;&#50640; &#53944;&#47004;&#51117;&#49496;&#51060; &#51333;&#47308;&#46104;&#44256;, Hibernate&#44032; &#51088;&#46041;&#51201;&#51004;&#47196; &#44536; &#50416;&#47112;&#46300;&#47196;&#48512;&#53552; <code class="literal">Session</code>&#51012; &#48148;&#51064;&#46300; &#54644;&#51228;&#49884;&#53412;&#44256; &#45817;&#49888;&#51012; &#50948;&#54644; &#49464;&#49496;&#51012; &#45803;&#45716;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; <code class="literal">getCurrentSession()</code>&#51012; &#45796;&#49884; &#54840;&#52636;&#54620;&#45796;&#47732;, &#45817;&#49888;&#51008; &#49352;&#47196;&#50868; <code class="literal">Session</code>&#51012; &#50619;&#44256; &#49352;&#47196;&#50868; &#51089;&#50629;&#45800;&#50948;&#47484; &#49884;&#51089;&#54624; &#49688; &#51080;&#45796;. &#51060; <span class="emphasis"><em>thread-bound</em></span> &#54532;&#47196;&#44536;&#47000;&#48141; &#47784;&#54805;&#51008; Hibernate&#47484; &#49324;&#50857;&#54616;&#45716; &#44032;&#51109; &#45824;&#51473;&#51201;&#51064; &#48169;&#48277;&#51060;&#45796;. &#50780;&#45264;&#54616;&#47732; &#44536;&#44163;&#51008; &#45817;&#49888;&#51032; &#53076;&#46300;&#47484; &#50976;&#50672;&#54616;&#44172; &#44228;&#52789;&#54868;&#49884;&#53412;&#45716; &#44163;&#51012; &#54728;&#50857;&#54644;&#51452;&#44592; &#46412;&#47928;&#51060;&#45796;(&#53944;&#47004;&#51117;&#49496; &#44221;&#44228; &#48516;&#54624; &#53076;&#46300;&#45716; &#45936;&#51060;&#53944; &#51217;&#44540; &#53076;&#46300;&#50752; &#44396;&#48324;&#51648;&#50892;&#51656; &#49688; &#51080;&#45716;&#45936;,
               &#50864;&#47532;&#45716; &#51060; &#53916;&#53664;&#47532;&#50620;&#51032; &#46263;&#48512;&#48516;&#50640;&#49436; &#51060;&#44163;&#51012; &#45796;&#47344; &#44163;&#51060;&#45796;.). 
            </p>
            <p>&#51089;&#50629; &#50689;&#50669;&#51032; &#45800;&#50948;&#50752; &#44288;&#47144;&#54616;&#50668;, Hibernate <code class="literal">Session</code>&#51008; &#54616;&#45208; &#46608;&#45716; &#50668;&#47084; &#44060;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#50724;&#54140;&#47112;&#51060;&#49496;&#46308;&#51012; &#49892;&#54665;&#49884;&#53412;&#45716;&#45936; &#49324;&#50857;&#46112; &#49688; &#51080;&#45716;&#44032;? &#50948;&#51032; &#50696;&#51228;&#45716; &#54616;&#45208;&#51032; &#50724;&#54140;&#47112;&#51060;&#49496;&#50640; &#54620; &#44060;&#51032; <code class="literal">Session</code>&#51012; &#49324;&#50857;&#54616;&#44256; &#51080;&#45796;. &#51060;&#44163;&#51008; &#49692;&#51652;&#54620; &#51068;&#52824;&#51060;&#47728;, &#50696;&#51228;&#45716; &#50612;&#46500; &#45796;&#47480; &#51217;&#44540;&#48277;&#51012; &#48372;&#50668;&#51452;&#44592;&#50640;&#45716; &#52649;&#48516;&#55176; &#48373;&#51105;&#54616;&#51648; &#50506;&#45796;. Hibernate <code class="literal">Session</code>&#51032; scope(&#50689;&#50669;)&#51008; &#50976;&#50672;&#54616;&#51648;&#47564; &#45817;&#49888;&#51008; &#44208;&#53076; <span class="emphasis"><em>&#47784;&#46304;</em></span> &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#50724;&#54140;&#47112;&#51060;&#49496; &#44033;&#44033;&#50640; &#45824;&#54644; &#49352;&#47196;&#50868; Hibernate <code class="literal">Session</code>&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#45817;&#49888;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#49444;&#44228;&#54624; &#49688; &#50630;&#45796;. &#46384;&#46972;&#49436; &#49900;&#51648;&#50612; &#45817;&#49888;&#51060; &#45796;&#51020;&#51032; (&#47588;&#50864; &#49324;&#49548;&#54620;) &#50696;&#51228;&#46308;&#50640;&#49436; &#50668;&#47084; &#48264; &#44536;&#44163;&#51012; &#48380; &#49688; &#51080;&#51012;&#51648;&#46972;&#46020; <span class="emphasis"><em>session-per-operation</em></span>&#51012; &#54616;&#45208;&#51032; &#50504;&#54000;-&#54056;&#53556;&#51004;&#47196; &#44036;&#51452;&#54616;&#46972;. &#49892;&#51228; (&#50937;) &#50612;&#54540;&#47532;&#52992;&#51060;&#49496;&#51008; &#51060; &#53916;&#53664;&#47532;&#50620;&#51032; &#46263;&#48512;&#48516;&#50640; &#48372;&#50668;&#51652;&#45796;. 
            </p>
            <p>&#53944;&#47004;&#51117;&#49496; &#54648;&#46308;&#47553;&#44284; &#44221;&#44228;&#44396;&#48516;&#50640; &#45824;&#54620; &#52628;&#44032; &#51221;&#48372;&#45716; <a href="transactions.html" title="11&#51109;. &#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;">11&#51109;. <i xmlns:xlink="http://www.w3.org/1999/xlink">&#53944;&#47004;&#51117;&#49496;&#46308;&#44284; &#46041;&#49884;&#49457;</i></a>&#51012; &#49332;&#54196;&#48372;&#46972;. &#50864;&#47532;&#45716; &#46608;&#54620; &#50526;&#51032; &#50696;&#51228;&#50640;&#49436; &#51076;&#51032;&#51032; &#50724;&#47448; &#52376;&#47532;&#50752; &#47204;&#48177;&#51012; &#49373;&#47029;&#54664;&#45796;. 
            </p>
            <p>&#51060; &#52395; &#48264;&#51704; &#47336;&#54004;&#51012; &#49892;&#54665;&#54616;&#44592; &#50948;&#54644;&#49436; &#50864;&#47532;&#45716; &#54840;&#52636; &#44032;&#45733;&#54620; &#45824;&#49345;&#51012; Ant &#48716;&#46300; &#54028;&#51068;&#50640; &#52628;&#44032;&#54644;&#50556; &#54620;&#45796;: </p><pre class="programlisting">&lt;target name="run" depends="compile"&gt;
    &lt;java fork="true" classname="events.EventManager" classpathref="libraries"&gt;
        &lt;classpath path="${targetdir}"/&gt;
        &lt;arg value="${action}"/&gt;
    &lt;/java&gt;
&lt;/target&gt;</pre><p><code class="literal">action</code> &#50500;&#44508;&#47676;&#53944;&#51032; &#44050;&#51008; &#45824;&#49345;&#51012; &#54840;&#52636;&#54624; &#46412; &#47749;&#47161; &#46972;&#51064; &#49345;&#50640;&#49436; &#49444;&#51221;&#46108;&#45796;: 
            </p><pre class="programlisting">C:\hibernateTutorial\&gt;ant run -Daction=store</pre><p>&#52980;&#54028;&#51068;, &#44396;&#49457;&#50640; &#46384;&#47480; Hibernate &#49884;&#51089; &#54980;&#50640;, &#45817;&#49888;&#51008; &#47566;&#51008; &#47196;&#44536; &#52636;&#47141;&#51012; &#48372;&#44172; &#46112; &#44163;&#51060;&#45796;. &#45149;&#50640;&#49436; &#45817;&#49888;&#51008; &#45796;&#51020; &#46972;&#51064;&#51012; &#48156;&#44204;&#54624; &#44163;&#51060;&#45796;: </p><pre class="programlisting">[java] Hibernate: insert into EVENTS (EVENT_DATE, title, EVENT_ID) values (?, ?, ?)</pre><p>&#51060;&#44163;&#51008; Hibernate&#50640; &#51032;&#54644; &#49892;&#54665;&#46108; <code class="literal">INSERT</code>&#51060;&#44256;, &#47932;&#51020;&#54364; &#44592;&#54840;&#45716; JDBC &#48148;&#51064;&#46300; &#54028;&#46972;&#48120;&#53552;&#46308;&#51012; &#45208;&#53440;&#45240;&#45796;. &#50500;&#44508;&#47676;&#53944;&#47196;&#49436; &#48148;&#51064;&#46300; &#46108; &#44050;&#46308;&#51012; &#48372;&#44144;&#45208; &#51109;&#54889;&#54620; &#47196;&#44536;&#47484; &#51460;&#51060;&#47140;&#47732; &#45817;&#49888;&#51032; <code class="literal">log4j.properties</code>&#47484; &#52404;&#53356;&#54616;&#46972;. 
            </p>
            <p>&#51060;&#51228; &#50864;&#47532;&#45716; &#47560;&#52268;&#44032;&#51648;&#47196; &#51200;&#51109;&#46108; &#51060;&#48292;&#53944;&#46308;&#51012; &#50676;&#44144;&#54616;&#44256;&#51088; &#50896;&#54616;&#47728;, &#50864;&#47532;&#45716; main &#47700;&#49548;&#46300;&#50640; &#54620; &#44060;&#51032; &#50741;&#49496;&#51012; &#52628;&#44032;&#54620;&#45796;: </p><pre class="programlisting">if (args[0].equals("store")) {
    mgr.createAndStoreEvent("My Event", new Date());
}
else if (args[0].equals("list")) {
    List events = mgr.listEvents();
    for (int i = 0; i &lt; events.size(); i++) {
        Event theEvent = (Event) events.get(i);
        System.out.println("Event: " + theEvent.getTitle() +
                           " Time: " + theEvent.getDate());
    }
}</pre><p>&#50864;&#47532;&#45716; &#46608;&#54620; &#49352;&#47196;&#50868; <code class="literal">listEvents() method</code> &#47700;&#49548;&#46300;&#47484; &#52628;&#44032; &#49884;&#53416;&#45796;: 
            </p><pre class="programlisting">private List listEvents() {

    Session session = HibernateUtil.getSessionFactory().getCurrentSession();

    session.beginTransaction();

    List result = session.createQuery("from Event").list();

    session.getTransaction().commit();

    return result;
}</pre><p>&#50668;&#44592;&#49436; &#50864;&#47532;&#44032; &#54665;&#54624; &#44163;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196;&#48512;&#53552; &#47784;&#46304; &#51316;&#51116;&#54616;&#45716; <code class="literal">Event</code> &#44061;&#52404;&#46308;&#51012; &#47196;&#46300;&#49884;&#53412;&#44592; &#50948;&#54644; HQL (Hibernate Query Language) &#51656;&#51032;&#47484; &#49324;&#50857;&#54616;&#45716; &#44163;&#51060;&#45796;. Hibernate&#45716; &#51201;&#51208;&#54620; SQL&#51012; &#49373;&#49457;&#49884;&#53420; &#44163;&#51060;&#44256;, &#44536;&#44163;&#51012; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47196; &#51204;&#49569;&#54616;&#44256; &#45936;&#51060;&#53552;&#47484; <code class="literal">Event</code> &#44061;&#52404;&#46308;&#50640; &#44144;&#51452;&#49884;&#53420; &#44163;&#51060;&#45796;. &#45817;&#49888;&#51008; &#47932;&#47200; HQL&#47196;&#49436; &#48372;&#45796; &#48373;&#51105;&#54620; &#51656;&#51032;&#46308;&#51012; &#49373;&#49457;&#49884;&#53420; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#51060;&#51228; &#51060; &#47784;&#46304; &#44163;&#51012; &#49892;&#54665;&#54616;&#44256; &#53580;&#49828;&#53944;&#54616;&#44592; &#50948;&#54644;, &#45796;&#51020; &#45800;&#44228;&#46308;&#51012; &#46384;&#47476;&#46972;: </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49549;&#51004;&#47196; &#50612;&#46500; &#44163;&#51012; &#51200;&#51109;&#54616;&#44256; &#47932;&#47200; &#50526;&#49436; hbm2ddl&#51012; &#53685;&#54644; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49828;&#53412;&#47560;&#47484; &#49328;&#52636;&#49884;&#53412;&#44592; &#50948;&#54644; <code class="literal">ant run -Daction=store</code>&#47484; &#49892;&#54665;&#54616;&#46972;. 
                     </p>
                  </li>
                  <li>
                     <p>Now disable hbm2ddl by commenting out the property in your <code class="literal">hibernate.cfg.xml</code> file. Usually you only leave it turned on in continuous unit testing, but another run of hbm2ddl would <span class="emphasis"><em>drop</em></span> everything you have stored - the <code class="literal">create</code> configuration setting actually translates into "drop all tables from the schema, then re-create all tables, when the SessionFactory
                        is build". 
                     </p>
                  </li>
               </ul>
            </div>
            <p>&#47564;&#51068; &#45817;&#49888;&#51060; &#51648;&#44552; <code class="literal">-Daction=list</code>&#47196; Ant&#47484; &#54840;&#52636;&#54624; &#44221;&#50864;, &#45817;&#49888;&#51008; &#45817;&#49888;&#51060; &#51648;&#44552;&#44620;&#51648; &#51200;&#51109;&#54664;&#45912; &#51060;&#48292;&#53944;&#46308;&#51012; &#48372;&#44172; &#46112; &#44163;&#51060;&#45796;. &#47932;&#47200; &#45817;&#49888;&#51008; &#46608;&#54620; &#50668;&#47084; &#48264; <code class="literal">store</code> &#50529;&#49496;&#51012; &#54840;&#52636;&#54624; &#49688; &#51080;&#45796;. 
            </p>
            <p>&#45432;&#53944; : &#45824;&#48512;&#48516;&#51032; Hibernate &#49324;&#50857;&#51088;&#46308;&#51008; &#51060; &#51648;&#51216;&#50640;&#49436; &#49892;&#54056;&#54616;&#44256; &#50864;&#47532;&#45716; &#51221;&#44592;&#51201;&#51004;&#47196; <span class="emphasis"><em>Table not found</em></span> &#50724;&#47448; &#47700;&#49884;&#51648;&#46308;&#50640; &#44288;&#54620; &#51656;&#47928;&#51012; &#48155;&#45716;&#45796;. &#54616;&#51648;&#47564; &#47564;&#51068; &#45817;&#49888;&#51060; &#50948;&#50640; &#51312;&#47749;&#46108; &#45800;&#44172;&#46308;&#51012; &#46384;&#47484; &#44221;&#50864; &#45817;&#49888;&#51008; &#51060; &#47928;&#51228;&#47484; &#44202;&#51648; &#50506;&#51012; &#44163;&#51060;&#44256;, hbm2ddl&#51060; &#52376;&#51020; &#49892;&#54665; &#49884;&#50640; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49828;&#53412;&#47560;&#47484; &#49373;&#49457;&#49884;&#53412;&#48064;&#47196;, &#52264;&#54980;&#51032; &#50612;&#54540;&#47532;&#52992;&#51060;&#49496; &#51116;&#49884;&#51089;&#51008;
               &#51060; &#49828;&#53412;&#47560;&#47484; &#49324;&#50857;&#54624; &#44163;&#51060;&#45796;. &#47564;&#51068; &#45817;&#49888;&#51060; &#47588;&#54609; &#44536;&#47532;&#44256;/&#46608;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49828;&#53412;&#47560;&#47484; &#48320;&#44221;&#54624; &#44221;&#50864;&#50640;, &#45817;&#49888;&#51008; &#45796;&#49884; &#54620;&#48264; &#45908; hbm2ddl&#51012; &#51060;&#50857; &#44032;&#45733;&#54616;&#46020;&#47197; &#54644;&#50556; &#54620;&#45796;. 
            </p>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="tutorial.html">&#51060;&#51204;</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="tutorial.html">&#50948;&#47196;</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="tutorial-associations.html">&#45796;&#51020;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">1&#51109;. Hibernate &#44060;&#50836;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#52376;&#51020;&#51004;&#47196;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;1.3. &#54028;&#53944; 2 - &#50672;&#44288;&#46308;&#51012; &#47588;&#54609;&#54616;&#44592;</td>
            </tr>
         </table>
      </div>
   </body>
</html>